{
  "Id": "577",
  "Title": "\u0022Activating Azure Credits and Setting Up Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAnotherapproach is to activate Azure credits in a Visual Studio subscription. A Visual Studiosubscription gives you credits every month you can use for paid Azure services.Paid (or billable) search occurs when you choose a billable tier (Basic or above) whencreating the resource on a billable Azure subscription.1. Sign in to the Azure portal.2. Click the plus sign (\u0022\u002B Create Resource\u0022) in the top-left corner.3. Use the search bar to find \u0022Azure AI Search\u0022.If you\u0027ve more than one subscription, choose one for your search service.\r\nIf you\u0027reimplementing customer-managed encryption or if you use other features that dependon managed service identities for external data access, choose the same subscription asSubscribe (free or paid)Find the Azure AI Search offeringChoose a subscriptionthe one used for Azure Key Vault or other services for which managed identities areused.A resource group is a container that holds related resources for your Azure solution.\r\nIt\u0027srequired for the search service. It\u0027s also useful for managing resources all-up, includingcosts. A resource group can consist of one service, or multiple services used together.For example, if you\u0027re using Azure AI Search to index an Azure Cosmos DB database,you could make both services part of the same resource group for managementpurposes. If you aren\u0027t combining resources into a single group, or if existing resource groups arefilled with resources used in unrelated solutions, create a new resource group just foryour Azure AI Search resource.Over time, you can track current and projected costs all-up or you can view charges forindividual resources. The following screenshot shows the kind of cost information youcan expect to see when you combine multiple resources into one group.Set a resource groupIn Instance Details, provide a service name in the URL field. The name is part of the URLendpoint against which API calls are issued: https://your-service-name.search.windows.net.\n"
}