{
  "Id": "1192",
  "Title": "\u0022Advanced Full Text Search Using Azure SDKs: Syntax and Examples\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfQuickstart: Full text search using the Azure SDKs    \u0022filter\u0022: \u0022Rating gt 4\u0022,     \u0022select\u0022: \u0022HotelName, Rating\u0022,     \u0022orderby\u0022: \u0022Rating desc\u0022,     \u0022top\u0022: \u00225\u0022,     \u0022skip\u0022: \u00225\u0022,     \u0022count\u0022: true } \u0022value\u0022: [     {         \u0022@search.score\u0022: 1.0,         \u0022HotelName\u0022: \u0022Pull\u0027r Inn Motel\u0022,         \u0022Rating\u0022: 4.\r\n7     },     {         \u0022@search.score\u0022: 1.0,         \u0022HotelName\u0022: \u0022Sublime Cliff Hotel\u0022,         \u0022Rating\u0022: 4.6     },     {         \u0022@search.score\u0022: 1.0,         \u0022HotelName\u0022: \u0022Antiquity Hotel\u0022,         \u0022Rating\u0022: 4.\r\n5     },     {         \u0022@search.score\u0022: 1.0,         \u0022HotelName\u0022: \u0022Nordick\u0027s Motel\u0022,         \u0022Rating\u0022: 4.5     },     {         \u0022@search.score\u0022: 1.0,         \u0022HotelName\u0022: \u0022Winter Panorama Resort\u0022,         \u0022Rating\u0022: 4.\r\n5     } ] Next stepsMore syntax reference, query architecture, and examples can be found in the followinglinks:Lucene syntax query examples for building advanced queriesHow full text search works in Azure Cognitive SearchSimple query syntaxFull Lucene query syntaxFilter syntaxAdd spell check to queries in Azure AISearchArticle•11/15/2023You can improve recall by spell-correcting words in a query before they reach the searchengine. The speller parameter is supported for all text (non-vector) query types.A search service at the Basic tier or higher, in any region.An existing search index with content in a supported language.A query request that has speller=lexicon and queryLanguage set to a supportedlanguage. Spell check works on strings passed in the search parameter. It\u0027s notsupported for filters, fuzzy search, wildcard search, regular expressions, or vectorqueries.Use a search client that supports preview APIs on the query request.\n"
}