{
  "Id": "1655",
  "Title": "\u0022Advanced Search Techniques and Parameters in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfInserta tilde ~ symbol at the end of a phrase followed by the number of words that create the７ NoteWhen using fielded search expressions, you do not need to use the searchFieldsparameter because each fielded search expression has a field name explicitlyspecified. However, you can still use the searchFields parameter if you want to runa query where some parts are scoped to a specific field, and the rest could apply toseveral fields.\r\nFor example, the query search=genre:jazz NOThistory\u0026searchFields=description would match jazz only to the genre field, whileit would match NOT history with the description field. The field name provided infieldName:searchExpression always takes precedence over the searchFieldsparameter, which is why in this example, we do not need to include genre in thesearchFields parameter.\r\nFuzzy searchProximity searchproximity boundary. For example, \u0022hotel airport\u0022~5 finds the terms hotel and airportwithin five words of each other in a document.Term boosting refers to ranking a document higher if it contains the boosted term,relative to documents that don\u0027t contain the term.\r\nThis differs from scoring profiles inthat scoring profiles boost certain fields, rather than specific terms.The following example helps illustrate the differences. Suppose that there\u0027s a scoringprofile that boosts matches in a certain field, say genre in the musicstoreindex example.Term boosting could be used to further boost certain search terms higher than others.For example, rock^2 electronic boosts documents that contain the search terms in thegenre field higher than other searchable fields in the index. Further, documents thatcontain the search term rock are ranked higher than the other search term electronic asa result of the term boost value (2). To boost a term, use the caret, ^, symbol with a boost factor (a number) at the end ofthe term you\u0027re searching. You can also boost phrases. The higher the boost factor, themore relevant the term is relative to other search terms. By default, the boost factor is 1.Although the boost factor must be positive, it can be less than 1 (for example, 0.20).\n"
}