{
  "Id": "1293",
  "Title": "\u0022Advanced Boosting Functions for Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis function has a\u0022boostingDuration\u0022 attribute so that you can specify a value representing atimespan over which boosting occurs.\u0022magnitude\u0022Boosts based on how high or low a numeric value is. Scenarios that call for thisfunction include boosting by profit margin, highest price, lowest price, or a countof downloads. This function can only be used with Edm.\r\nDouble and Edm.Int fields.For the magnitude function, you can reverse the range, high to low, if you want theinverse pattern (for example, to boost lower-priced items more than higher-priceditems). Given a range of prices from $100 to $1, you would set\u0022boostingRangeStart\u0022 at 100 and \u0022boostingRangeEnd\u0022 at 1 to boost the lower-priced items.\r\n\u0022distance\u0022Boosts by proximity or geographic location. This function can only be used withEdm.GeographyPoint fields.\u0022tag\u0022Boosts by tags that are common to both search documents and query strings. Tagsare provided in a \u0022tagsParameter\u0022. This function can only be used with searchfields of type Edm.String and Collection(Edm.String).Functions can only be applied to fields that are attributed as filterable.Function type (\u0022freshness\u0022, \u0022magnitude\u0022, \u0022distance\u0022, \u0022tag\u0022) must be lower case.Functions can\u0027t include null or empty values.This section shows the syntax and template for scoring profiles. Refer to Propertyreference in the next section for descriptions of the scoring profile attributes.JSONUsing functionsRules for using functionsTemplate\u0022scoringProfiles\u0022: [    {       \u0022name\u0022: \u0022name of scoring profile\u0022,       \u0022text\u0022: (optional, only applies to searchable fields) {         \u0022weights\u0022: {           \u0022searchable_field_name\u0022: relative_weight_value (positive #\u0027s),           ...         }       },       \u0022functions\u0022: (optional) [        {           \u0022type\u0022: \u0022magnitude | freshness | distance | tag\u0022,           \u0022boost\u0022: # (positive number used as multiplier for raw score != 1),           \u0022fieldName\u0022: \u0022(...\n"
}