{
  "Id": "381",
  "Title": "\u0022Advanced Document Search and Proximity Ordering with Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFinds documents where the price is at least $60 and less than $300.2. Executes the query. In this example, the search query consists of phrases andterms: \u0022Spacious, air-condition* \u002B\\\u0022Ocean view\\\u0022\u0022 (users typically don\u0027t enterpunctuation, but including it in the example allows us to explain how analyzershandle it).\r\nFor this query, the search engine scans the description and title fields specified in\u0022searchFields\u0022 for documents that contain \u0022Ocean view\u0022, and additionally on theterm \u0022spacious\u0022, or on terms that start with the prefix \u0022air-condition\u0022. The\u0022searchMode\u0022 parameter is used to match on any term (default) or all of them, forcases where a term isn\u0027t explicitly required (\u002B).\r\n3. Orders the resulting set of hotels by proximity to a given geography location, andthen returns the results to the calling application.Most this article is about processing of the search query: \u0022Spacious, air-condition*\u002B\\\u0022Ocean view\\\u0022\u0022. Filtering and ordering are out of scope.\r\nFor more information, see theSearch API reference documentation.As noted, the query string is the first line of the request:POST /indexes/hotels/docs/search?api-version=2020-06-30{    \u0022search\u0022: \u0022Spacious, air-condition* \u002B\\\u0022Ocean view\\\u0022\u0022,    \u0022searchFields\u0022: \u0022description, title\u0022,    \u0022searchMode\u0022: \u0022any\u0022,    \u0022filter\u0022: \u0022price ge 60 and price lt 300\u0022,    \u0022orderby\u0022: \u0022geo.distance(location, geography\u0027POINT(-159.476235 22. 227659)\u0027)\u0022,     \u0022queryType\u0022: \u0022full\u0022 }Stage 1: Query parsingThe query parser separates operators (such as * and \u002B in the example) from searchterms, and deconstructs the search query into subqueries of a supported type:\n"
}