{
  "Id": "1136",
  "Title": "\u0022Advanced Projection Techniques in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNeither indexers nor a skillset will pass through theoriginal non-normalized image.The destination is always a blob container, with a folder prefix of the base64 encodedvalue of the document ID. File projections can\u0027t share the same container as objectprojections and need to be projected into a different container.The following example projects all normalized images extracted from the documentnode of an enriched document, into a container called myImages.\r\n\u0022name\u0022: \u0022#3\u0022,       \u0022description\u0022: null,       \u0022context\u0022: \u0022/document\u0022,       \u0022inputs\u0022: [         {           \u0022name\u0022: \u0022HotelId\u0022,           \u0022source\u0022: \u0022/document/HotelId\u0022         },         {           \u0022name\u0022: \u0022HotelName\u0022,           \u0022source\u0022: \u0022/document/HotelName\u0022         },         {           \u0022name\u0022: \u0022Category\u0022,           \u0022source\u0022:\r\n\u0022/document/Category\u0022         },         {           \u0022name\u0022: \u0022keyPhrases\u0022,           \u0022source\u0022: \u0022/document/HotelId/keyphrases/*\u0022         },       ],       \u0022outputs\u0022: [         {           \u0022name\u0022: \u0022output\u0022,           \u0022targetName\u0022: \u0022objectprojection\u0022         }       ]     } Projecting an image fileJSONA more complex scenario might require you to project content across projection types.\r\nFor example, projecting key phrases and entities to tables, saving OCR results of textand layout text as objects, and then projecting the images as files.Steps for multiple projection types:1. Create a table with a row for each document.2. Create a table related to the document table with each key phrase identified as arow in this table.3. Create a table related to the document table with each entity identified as a row inthis table.4. Create an object projection with the layout text for each image.5. Create a file projection, projecting each extracted image.6. Create a cross-reference table that contains references to the document table,object projection with the layout text, and the file projection.\nTo get the shapes needed for these projections, start by adding a new Shaper skill thatcreates a shaped object called crossProjection.\n"
}