{
  "Id": "14",
  "Title": "\u0022Advanced Techniques for Language Analysis and Vector Indexing in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBy default, you can use thegeneral-purpose Standard Lucene analyzer, or override the defaultwith a language analyzer, a custom analyzer that you configure, oranother predefined analyzer that produces tokens in the formatyou require.Language analyzers from Lucene or Microsoft are used to７ NoteLooking for preview features? See the preview features list.\r\nIndexing featuresCategory                           Featuresintelligently handle language-specific linguistics including verbtenses, gender, irregular plural nouns (for example, \u0027mouse\u0027 vs.\u0027mice\u0027), word de-compounding, word-breaking (for languages withno spaces), and more.Custom lexical analyzers are used for complex query forms suchas phonetic matching and regular expressions.Category                           FeaturesVector indexingWithin a search index, add vector fields to support vectorsearch scenarios. Vector fields can co-exist with nonvectorfields in the same search document.Vector queriesFormulate single and multiple vector queries.\r\nVector search algorithmsUse Hierarchical Navigable Small World (HNSW) or exhaustiveK-Nearest Neighbors (KNN) to find similar vectors in a searchindex.Vector filtersApply filters before or after query execution for greaterprecision during information retrieval.Hybrid information retrievalSearch for concepts and keywords in a single hybrid queryrequest.Hybrid search consolidates vector and text search, withoptional semantic ranking and relevance tuning for bestresults.Integrated data chunking andvectorization (preview)Native data chunking through Text Split skill and nativevectorization through vectorizers and theAzureOpenAIEmbeddingModel skill. Integrated vectorization (preview) provides an end-to-endindexing pipeline from source files to queries.Import and vectorize data(preview)A new wizard in the Azure portal that creates a full indexingpipeline that includes data chunking and vectorization. Thewizard creates all of the objects and configuration settings.\n"
}