{
  "Id": "1648",
  "Title": "\u0022Advanced Techniques for Special Character Handling in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you need special character representation, you can assign an analyzer that preservesthem:The \u0022whitespace\u0022 analyzer considers any character sequence separated by whitespaces as tokens (so the \u0027❤\u0027 emoji would be considered a token).A language analyzer, such as the Microsoft English analyzer (\u0022en.microsoft\u0022), wouldtake the \u0027$\u0027 or \u0027€\u0027 string as a token.For confirmation, you can test an analyzer to see what tokens are generated for a givenstring. As you might expect, you might not get full tokenization from a single analyzer.\r\nAworkaround is to create multiple fields that contain the same content, but with differentanalyzer assignments (for example,\u0022description_en\u0022, \u0022description_fr\u0022, and so forth forlanguage analyzers).When using Unicode characters, make sure symbols are properly escaped in the queryurl (for instance for \u0027❤\u0027 would use the escape sequence %E2%9D%A4\u002B).\r\nPostman does thistranslation automatically.analyzers, which preserves hyphenated words, or a custom analyzer for morecomplex patterns. For more information, see Partial terms, patterns, and specialcharacters.Encoding unsafe and reserved characters inURLsSpecial charactersYou can use parentheses to create subqueries, including operators within theparenthetical statement. For example, motel\u002B(wifi|luxury) will search for documentscontaining the \u0022motel\u0022 term and either \u0022wifi\u0022 or \u0022luxury\u0022 (or both).If your application generates search queries programmatically, we recommenddesigning it in such a way that it doesn\u0027t generate queries of unbounded size.For GET, the length of the URL can\u0027t exceed 8 KB.For POST (and any other request), where the body of the request includes searchand other parameters such as filter and orderby, the maximum size is 16 MB.Additional limits include:The maximum length of the search clause is 100,000 characters.\n"
}