{
  "Id": "1622",
  "Title": "\u0022Advanced Filtering Techniques in Azure AI Search: Handling Null, NaN, and Spatial Data\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSpecial cases for null and NaNOperatorResult when only thefield or variable is nullResult when onlythe constant is nullResult when both the field orvariable and the constant arenulleqfalsefalsetruenetruetruefalseIn summary, null is equal only to itself, and is not less or greater than any other value.If your index has fields of type Edm.Double and you upload NaN values to those fields,you will need to account for that when writing filters. Azure AI Search implements theIEEE 754 standard for handling NaN values, and comparisons with such values producenon-obvious results, as shown in the following table.\r\nOperatorResult when at least one operand is NaNgtfalseltfalsegefalselefalseeqfalsenetrueIn summary, NaN is not equal to any value, including itself.You can\u0027t directly compare a field of type Edm.GeographyPoint with a constant value, butyou can use the geo.distance function. This function returns a value of type Edm.Double,so you can compare it with a numeric constant to filter based on the distance fromconstant geo-spatial coordinates. See the examples below.Strings can be compared in filters for exact matches using the eq and ne operators.These comparisons are case-sensitive.\r\nComparing geo-spatial dataComparing string dataExamplesMatch documents where the Rating field is between 3 and 5, inclusive:textMatch documents where the Location field is less than 2 kilometers from the givenlatitude and longitude:textMatch documents where the LastRenovationDate field is greater than or equal toJanuary 1st, 2015, midnight UTC:textMatch documents where the Details/Sku field is not null: textMatch documents for hotels where at least one room has type \u0022Deluxe Room\u0022, wherethe string of the Rooms/Type field matches the filter exactly:textFilters in Azure AI SearchOData expression language overview for Azure AI SearchOData expression syntax reference for Azure AI SearchSearch Documents (Azure AI Search REST API)Rating ge 3 and Rating le 5geo.\n"
}