{
  "Id": "1268",
  "Title": "\u0022Advanced Query Syntax and Examples for Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNote the Lucene query parser supports the use of these symbols with a singleterm, and not a phrase.In this query, search for hotel names that contain the prefix \u0027sc\u0027. You can\u0027t use a * or ?symbol as the first character of a search.HTTPResponse for this query should look similar to the following example:JSON７ NoteRegex queries are not analyzed.\r\nThe only transformation performed on partialquery terms is lower casing.Example 6: Wildcard searchPOST /indexes/hotel-samples-index/docs/search?api-version=2020-06-30 {     \u0022search\u0022: \u0022HotelName:sc*\u0022,     \u0022queryType\u0022: \u0022full\u0022,     \u0022select\u0022: \u0022HotelName\u0022,     \u0022count\u0022: true }     \u0022@odata.\r\ncount\u0022: 2,     \u0022value\u0022: [         {             \u0022@search.score\u0022: 1.0,             \u0022HotelName\u0022: \u0022Scarlet Harbor Hotel\u0022         },         {             \u0022@search.score\u0022: 1.0,             \u0022HotelName\u0022: \u0022Scottish Inn\u0022         }     ] ７ NoteWildcard queries are not analyzed. The only transformation performed on partialquery terms is lower casing.Try specifying queries in code. The following link covers how to set up search queriesusing the Azure SDKs.\r\nQuickstart: Full text search using the Azure SDKsMore syntax reference, query architecture, and examples can be found in the followinglinks: Lucene syntax query examples for building advanced queriesHow full text search works in Azure Cognitive SearchSimple query syntaxFull Lucene query syntaxFilter syntaxNext stepsPartial term search and patterns withspecial characters (hyphens, wildcard,regex, patterns)Article•03/23/2023A partial term search refers to queries consisting of term fragments, where instead of awhole term, you might have just the beginning, middle, or end of term (sometimesreferred to as prefix, infix, or suffix queries).\n"
}