{
  "Id": "743",
  "Title": "\u0022Advanced Filtering and Sorting Techniques for Complex Data Structures\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor moreinformation on these rules, see the Create Index API reference.Any sub-field can be marked as facetable unless it is of type Edm.GeographyPoint orCollection(Edm.GeographyPoint).The document counts returned in the facet results are calculated for the parentdocument (a hotel), not the sub-documents in a complex collection (rooms).\r\nForexample, suppose a hotel has 20 rooms of type \u0022suite\u0022. Given this facet parameterfacet=Rooms/Type, the facet count will be one for the hotel, not 20 for the rooms.Sort operations apply to documents (Hotels) and not sub-documents (Rooms). Whenyou have a complex type collection, such as Rooms, it\u0027s important to realize that youcan\u0027t sort on Rooms at all.\r\nIn fact, you can\u0027t sort on any collection.Sort operations work when fields have a single value per document, whether the field isa simple field, or a sub-field in a complex type. For example, Address/City is allowed tobe sortable because there\u0027s only one address per hotel, so $orderby=Address/City willsort hotels by city.\r\nYou can refer to sub-fields of a complex field in a filter expression. Just use the sameOData path syntax that\u0027s used for faceting, sorting, and selecting fields.\r\nFor example, thefollowing filter will return all hotels in Canada:$filter=Address/Country eq \u0027Canada\u0027Filter, facet, and sort complex fieldsFaceting sub-fieldsSorting complex fieldsFiltering on complex fieldsTo filter on a complex collection field, you can use a lambda expression with the anyand all operators. In that case, the range variable of the lambda expression is an objectwith sub-fields. You can refer to those sub-fields with the standard OData path syntax. For example, the following filter will return all hotels with at least one deluxe room andall non-smoking rooms:$filter=Rooms/any(room: room/Type eq \u0027Deluxe Room\u0027) and Rooms/all(room: notroom/SmokingAllowed)As with top-level simple fields, simple sub-fields of complex fields can only be includedin filters if they have the filterable attribute set to true in the index definition.\n"
}