{
  "Id": "378",
  "Title": "\u0022Advanced Azure Search: REST, AI, and Custom Analyzers Tutorials\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTutorialSource code for Tutorial: Use REST and AI to generate searchable contentfrom Azure blobs. This article shows you how to create a skillset that iteratesover Azure blobs to extract information and infer structure.Debug-sessionsSource code for Tutorial: Diagnose, repair, and commit changes to yourskillset. This article shows you how to use a skillset debug session in the Azureportal. REST is used to create the objects used during debug.custom-analyzersSource code for Tutorial: Create a custom analyzer for phone numbers. Thisarticle explains how to use analyzers to preserve patterns and specialcharacters in searchable content.\r\nknowledge-storeSource code for Create a knowledge store using REST and Postman. Thisarticle explains the necessary steps for populating a knowledge store used forknowledge mining workflows.projectionsSource code for Define projections in a knowledge store. This article explainshow to specify the physical data structures in a knowledge store.Doc samplesSamplesArticleindex-encrypted-blobsSource code for How to index encrypted blobs using blob indexers andskillsets. This article shows how to index documents in Azure Blob Storagethat have been previously encrypted using Azure Key Vault.The following samples are also published by the Azure AI Search team, but are notreferenced in documentation. Associated readme files provide usage instructions.SamplesDescriptionQuery-examplesPostman collections demonstrating the various query techniques, includingfuzzy search, RegEx and wildcard search, autocomplete, and so on. TipTry the Samples browser to search for Microsoft code samples in GitHub, filteredby product, service, and language.Other samplesFull text search in Azure CognitiveSearchArticle•10/09/2023Full text search is an approach in information retrieval that matches on plain textcontent stored in an index. For example, given a query string \u0022hotels in San Diego onthe beach\u0022, the search engine looks for content containing those terms.\n"
}