{
  "Id": "107",
  "Title": "\u0022Advanced Azure Search Query Examples and Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfsearch.windows.net/indexes/hotels-quickstart/docs?search=restaurant wifi\u0026$count=true\u0026$select=HotelName,Description,Tags\u0026api-version=2020-06-30# Query example 2 - Apply a filter to the index to find hotels rated 4 or highter# Returns the HotelName and Rating. Two documents matchhttps://{service-name}}.search.windows.\r\nnet/indexes/hotels-quickstart/docs?search=*\u0026$filter=Rating gt 4\u0026$select=HotelName,Rating\u0026api-version=2020-06-30# Query example 3 - Take the top two results, and show only HotelName and Category in the resultshttps://{service-name}}.\r\nsearch.windows.net/indexes/hotels-quickstart/docs?search=boutique\u0026$top=2\u0026$select=HotelName,Category\u0026api-version=2020-06-30# Query example 4 - Sort by a specific field (Address/City) in ascending orderhttps://{service-name}}.\r\nsearch.windows.net/indexes/hotels-quickstart/docs?You can also use Get Statistics to query for document counts and index size:HTTPAdding /stats to your URL returns index information. In Postman, your request shouldlook similar to the following, and the response includes a document count and spaceused in bytes.Notice that the api-version syntax differs. For this request, use ? to append the api-version. The ? separates the URL path from the query string, while \u0026 separates each\u0027name=value\u0027 pair in the query string. For this query, api-version is the first and onlyitem in the query string. When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created. Resources left running cancost you money. You can delete resources individually or delete the resource group todelete the entire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.\n"
}