{
  "Id": "1510",
  "Title": "\u0022Advanced Text Analysis and Multi-Lingual Content Management with Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCreate and manage analyzers for advanced text analysis or multi-lingual content.Optimize results through scoring profiles to factor in business logic or freshness.Source code | Package (Maven) | API reference documentation| Productdocumentation | SamplesGetting startedPlease include the azure-sdk-bom to your project to take dependency on the GeneralAvailability (GA) version of the library. In the following snippet, replace the{bom_version_to_target} placeholder with the version number. To learn more about theBOM, see the AZURE SDK BOM README.XMLand then include the direct dependency in the dependencies section without the versiontag.\r\nXMLIf you want to take dependency on a particular version of the library that is not presentin the BOM, add the direct dependency to your project as follows.XMLInclude the packageInclude the BOM file\u003CdependencyManagement\u003E    \u003Cdependencies\u003E        \u003Cdependency\u003E            \u003CgroupId\u003Ecom.\r\nazure\u003C/groupId\u003E            \u003CartifactId\u003Eazure-sdk-bom\u003C/artifactId\u003E            \u003Cversion\u003E{bom_version_to_target}\u003C/version\u003E            \u003Ctype\u003Epom\u003C/type\u003E            \u003Cscope\u003Eimport\u003C/scope\u003E        \u003C/dependency\u003E    \u003C/dependencies\u003E\u003C/dependencyManagement\u003E\u003Cdependencies\u003E  \u003Cdependency\u003E    \u003CgroupId\u003Ecom.azure\u003C/groupId\u003E    \u003CartifactId\u003Eazure-search-documents\u003C/artifactId\u003E  \u003C/dependency\u003E\u003C/dependencies\u003EInclude direct dependency\u003Cdependency\u003E    \u003CgroupId\u003Ecom. azure\u003C/groupId\u003E    \u003CartifactId\u003Eazure-search-documents\u003C/artifactId\u003EJava Development Kit (JDK) with version 8 or aboveAzure subscriptionAzure Cognitive Search serviceTo create a new search service, you can use the Azure portal, Azure PowerShell, orthe Azure CLI. Here\u0027s an example using the Azure CLI to create a free instance forgetting started:BashSee choosing a pricing tier for more information about available options.\n"
}