{
  "Id": "1201",
  "Title": "\u0022Advanced Filtering Techniques in Azure Search: Best Practices and Examples\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfismatchscoring(\u0027pool\u0027) and Rating ge 4search=pool\u0026$filter=Rating ge 4Field requirements for filtering[IsFilterable, IsSortable, IsFacetable]public double? BaseRate { get; set; }Making an existing field filterableText filters match string fields against literal strings that you provide in the filter:$filter=Category eq \u0027Resort and Spa\u0027Unlike full-text search, there\u0027s no lexical analysis or word-breaking for text filters, socomparisons are for exact matches only.\r\nFor example, assume a field f contains \u0022sunnyday\u0022, $filter=f eq \u0027sunny\u0027 doesn\u0027t match, but $filter=f eq \u0027sunny day\u0027 will.Text strings are case-sensitive, which means text filters are case sensitive by default.\r\nForexample, $filter=f eq \u0027Sunny day\u0027 won\u0027t find \u0022sunny day\u0022. However, you can use anormalizer to make it so filtering isn\u0027t case sensitive.ApproachDescriptionWhen to usesearch.inA function that matches afield against a delimitedlist of strings.Recommended for security filters and for anyfilters where many raw text values need to bematched with a string field.\r\nThe search.in functionis designed for speed and is much faster thanexplicitly comparing the field against each stringusing eq and or.search.ismatchA function that allowsyou to mix full-textsearch operations withstrictly Boolean filteroperations in the samefilter expression.Use search.ismatch (or its scoring equivalent,search. ismatchscoring) when you want multiplesearch-filter combinations in one request. You canalso use it for a contains filter to filter on a partialstring within a larger string.$filter=fieldoperator stringA user-definedexpression composed offields, operators, andvalues.Use this when you want to find exact matchesbetween a string field and a string value.\n"
}