{
  "Id": "96",
  "Title": "\u0022Advanced Search Techniques and Syntax in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfscore\u0022: 1 for alldocuments). By default, 50 documents are returned in a search request.Equivalent syntax for an empty search is * or search=*.HTTPResultsUnspecified querysearch=*Free-form queries, with or without operators, are useful for simulating user-definedqueries sent from a custom app to Azure AI Search.\r\nOnly those fields attributed asSearchable in the index definition are scanned for matches.Notice that when you provide search criteria, such as query terms or expressions, searchrank comes into play. The following example illustrates a free text search. The\u0022@search.score\u0022 is a relevance score computed for the match using the default scoringalgorithm.\r\nHTTPResultsYou can use Ctrl-F to search within results for specific terms of interest.Free text searchSeattle apartment \u0022Lake Washington\u0022 miele OR thermador applianceCount of matching documentsAdd $count=true to get the number of matches found in an index. On an empty search,count is the total number of documents in the index.\r\nOn a qualified search, it\u0027s thenumber of documents matching the query input. Recall that the service returns the top50 matches by default, so the count might indicate more matches in the index thanwhat\u0027s returned in the results.HTTPResultsAdd $select to limit results to the explicitly named fields for more readable output inSearch explorer.\r\nTo keep the previously mentioned parameters in the query, use \u0026 toseparate each parameter.HTTPResults$count=trueLimit fields in search resultssearch=seattle condo\u0026$select=listingId,beds,baths,description,street,city,price\u0026$count=trueAzure AI Search returns the top 50 matches based on the search rank. To get the nextset of matching documents, append $top=100,\u0026$skip=50 to increase the result set to100 documents (default is 50, maximum is 1000), skipping the first 50 documents. Youcan check the document key (listingID) to identify a document.Recall that you need to provide search criteria, such as a query term or expression, toget ranked results.\n"
}