{
  "Id": "1654",
  "Title": "\u0022Advanced Search Techniques and Syntax in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFullallwifi -luxuryReturns only documents in the index that contain the term\u0022wifi\u0022, and then documents that contain the term \u0022luxury\u0022 areremoved from the results.You can define a fielded search operation with the fieldName:searchExpression syntax,where the search expression can be a single word or a phrase, or a more complexexpression in parentheses, optionally with Boolean operators.\r\nSome examples includethe following:genre:jazz NOT historyFielded searchartists:(\u0022Miles Davis\u0022 \u0022John Coltrane\u0022)Be sure to put multiple strings within quotation marks if you want both strings to beevaluated as a single entity, in this case searching for two distinct artists in the artistsfield.\r\nThe field specified in fieldName:searchExpression must be a searchable field. SeeCreate Index for details on how index attributes are used in field definitions.A fuzzy search finds matches in terms that have a similar construction, expanding a termup to the maximum of 50 terms that meet the distance criteria of two or less.\r\nFor moreinformation, see Fuzzy search.To do a fuzzy search, use the tilde ~ symbol at the end of a single word with an optionalparameter, a number between 0 and 2 (default), that specifies the edit distance. Forexample, blue~ or blue~1 would return blue, blues, and glue.\r\nFuzzy search can only be applied to terms, not quotation-enclosed phrases, but you canappend the tilde to each term individually in a multi-part name or phrase. For example,Unviersty~ of~ Wshington~ would match on University of Washington.Proximity searches are used to find terms that are near each other in a document. Inserta tilde ~ symbol at the end of a phrase followed by the number of words that create the７ NoteWhen using fielded search expressions, you do not need to use the searchFieldsparameter because each fielded search expression has a field name explicitlyspecified. However, you can still use the searchFields parameter if you want to runa query where some parts are scoped to a specific field, and the rest could apply toseveral fields.\n"
}