{
  "Id": "819",
  "Title": "\u0022Advanced Field Mapping and Data Processing in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022fieldMappings\u0022 : [   {     \u0022sourceFieldName\u0022 : \u0022SourceKey\u0022,     \u0022targetFieldName\u0022 : \u0022IndexKey\u0022,     \u0022mappingFunction\u0022 : {       \u0022name\u0022 : \u0022urlEncode\u0022     }   }] urlDecode functionExample - decode blob metadata\u0022fieldMappings\u0022 : [  {    \u0022sourceFieldName\u0022 : \u0022UrlEncodedMetadata\u0022,    \u0022targetFieldName\u0022 :\r\n\u0022SearchableMetadata\u0022,    \u0022mappingFunction\u0022 : {      \u0022name\u0022 : \u0022urlDecode\u0022    }  }] fixedLengthEncode functionWhen errors occur that are related to document key length exceeding 1024 characters,this function can be applied to reduce the length of the document key.\r\nJSONSupported data types in Cognitive SearchSQL data type mapExample - map document keys that are too long\u0022fieldMappings\u0022 : [  {    \u0022sourceFieldName\u0022 : \u0022metadata_storage_path\u0022,    \u0022targetFieldName\u0022 : \u0022your key field\u0022,    \u0022mappingFunction\u0022 : {      \u0022name\u0022 : \u0022fixedLengthEncode\u0022    }  }] See alsoContent metadata properties used in AzureCognitive SearchArticle•02/09/2023Several of the indexer-supported data sources, including Azure Blob Storage, Azure Data LakeStorage Gen2, and SharePoint, contain standalone files or embedded objects of various contenttypes.\r\nMany of those content types have metadata properties that can be useful to index.\r\nJustas you can create search fields for standard blob properties like metadata_storage_name, you cancreate fields in a search index for metadata properties that are specific to a document format.\r\nCognitive Search supports blob indexing and SharePoint document indexing for the followingdocument formats:CSV (see Indexing CSV blobs)EMLEPUBGZHTMLJSON (see Indexing JSON blobs)KML (XML for geographic representations)Microsoft Office formats: DOCX/DOC/DOCM, XLSX/XLS/XLSM, PPTX/PPT/PPTM, MSG(Outlook emails), XML (both 2003 and 2006 WORD XML)Open Document formats: ODT, ODS, ODPPDFPlain text files (see also Indexing plain text)RTFXMLZIPThe following table summarizes processing done for each document format, and describes themetadata properties extracted by a blob indexer and the SharePoint indexer.\n"
}