{
  "Id": "742",
  "Title": "\u0022Advanced Techniques for Searching and Selecting Complex Fields in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor example, thisquery attempts to match two terms, \u0022Portland\u0022 and \u0022OR\u0022, against two sub-fields of theAddress field:search=Address/City:Portland AND Address/State:ORQueries like this are uncorrelated for full-text search, unlike filters. In filters, queries oversub-fields of a complex collection are correlated using range variables in any or all. TheLucene query above returns documents containing both \u0022Portland, Maine\u0022 and\u0022Portland, Oregon\u0022, along with other cities in Oregon.\r\nThis happens because each clauseapplies to all values of its field in the entire document, so there\u0027s no concept of a\u0022current sub-document\u0022. For more information on this, see Understanding ODatacollection filters in Azure Cognitive Search.The $select parameter is used to choose which fields are returned in search results.\r\nTouse this parameter to select specific sub-fields of a complex field, include the parentfield and sub-field separated by a slash (/).$select=HotelName, Address/City, Rooms/BaseRateData updatesSearch complex fieldsSelect complex fieldsFields must be marked as Retrievable in the index if you want them in search results.\r\nOnly fields marked as Retrievable can be used in a $select statement.The same OData path syntax used for filtering and fielded searches can also be used forfaceting, sorting, and selecting fields in a search request. For complex types, rules applythat govern which sub-fields can be marked as sortable or facetable. For moreinformation on these rules, see the Create Index API reference.Any sub-field can be marked as facetable unless it is of type Edm.GeographyPoint orCollection(Edm.GeographyPoint).The document counts returned in the facet results are calculated for the parentdocument (a hotel), not the sub-documents in a complex collection (rooms).\n"
}