{
  "Id": "420",
  "Title": "\u0022Advanced Geospatial Search and Document Look-Up with Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAfter indexing is complete, build a query that uses a filter and a geo-spatialfunction.Geospatial search uses kilometers for distance. Coordinates are specified in this format:(longitude, latitude).Here\u0027s an example of a filter for geospatial search. This filter finds other Location fieldsin the search index that have coordinates within a 300-kilometer radius of thegeography point (in this example, Washington D.C.). It returns address information inthe result, and includes an optional facets clause for self-navigation based on location.HTTPFor more information and examples, see Geospatial search example.\r\nIn contrast with the previously described query forms, this one retrieves a single searchdocument by ID, with no corresponding index search or scan. Only the one document isrequested and returned. When a user selects an item in search results, retrieving thedocument and populating a details page with fields is a typical response, and adocument look-up is the operation that supports it.\r\nAn advanced query form depends on the Full Lucene parser and operators that trigger aspecific query behavior.POST https://{{searchServiceName}}.search.windows.net/indexes/hotels-vector-quickstart/docs/search?api-version=2023-07-01-Preview{    \u0022count\u0022: true,    \u0022search\u0022: \u0022*\u0022,    \u0022filter\u0022: \u0022geo. distance(Location, geography\u0027POINT(-77.03241 38.90166)\u0027) le 300\u0022,    \u0022facets\u0022: [ \u0022Address/StateProvince\u0022],    \u0022select\u0022: \u0022HotelId, HotelName, Address/StreetAddress, Address/City, Address/StateProvince\u0022,    \u0022top\u0022: 7}Document look-upAdvanced search: fuzzy, wildcard, proximity,regexQuery typeUsageExamples and more informationFielded searchsearch parameter,queryType=fullBuild a composite query expression targetinga single field.\n"
}