{
  "Id": "8",
  "Title": "\u0022Advanced Azure Search Features and Enhancements in 2023\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfItem                        TypeDescription\u0022Chat with your data\u0022solution acceleratorSampleEnd-to-end RAG pattern that uses Azure AI Search as aretriever. It provides indexing, data chunking, orchestrationand chat based on Azure OpenAI GPT.Exhaustive K-NearestNeighbors (KNN)FeatureExhaustive K-Nearest Neighbors (KNN) is a new scoringalgorithm for similarity search in vector space.\r\nIt performs anexhaustive search for the nearest neighbors, useful forsituations where high recall is more important than queryperformance. Available in the 2023-10-01-Preview REST APIonly.Prefilters in vectorsearchFeatureEvaluates filter criteria before query execution, reducing theamount of content that needs to be searched.\r\nAvailable in the2023-10-01-Preview REST API only, through a newvectorFilterMode property on the query that can be set topreFilter (default) or postFilter, depending on yourrequirements.７ NoteLooking for preview features? Previews are announced here, but we also maintain apreview features list so you can find them in one place.\r\nOctober 2023ﾉExpand tableItem                        TypeDescription2023-10-01-PreviewSearch REST APIAPINew preview version of the Search REST APIs that changes thedefinition for vector fields and vector queries. This API versionintroduces breaking changes from 2023-07-01-Preview,otherwise it\u0027s inclusive of all previous preview features. Werecommend creating new indexes for 2023-10-01-Preview.You might encounter an HTTP 400 on some features on amigrated index, even if you migrated correctly.Item                        TypeDescriptionEnhanced semanticrankingFeatureUpgraded models are rolling out for semantic reranking, andavailability is extended to more regions.\n"
}