{
  "Id": "1048",
  "Title": "\u0022AI Enrichment with Azure Cognitive Search: Image Processing Fundamentals\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf[         \u0022[\\\u0022acrylic\\\u0022,\\\u0022oil\\\u0022,\\\u0022pastel\\\u0022]\u0022,         \u0022[\\\u0022acrylic\\\u0022,\\\u0022pastel\\\u0022,\\\u0022watercolor\\\u0022]\u0022,         \u0022[\\\u0022acrylic\\\u0022,\\\u0022watercolor\\\u0022]\u0022       ]     }   ] } See alsoExtract text and information fromimages in AI enrichmentArticle•08/30/2022Through AI enrichment, Azure Cognitive Search gives you several options for creatingand extracting searchable text from images, including:\r\nOCR for optical character recognition of text and digitsImage Analysis that describes images through visual featuresCustom skills to invoke any external image processing that you want to provideThrough OCR, you can extract text from photos or pictures containing alphanumerictext, such as the word \u0022STOP\u0022 in a stop sign.\r\nThrough image analysis, you can generate atext representation of an image, such as \u0022dandelion\u0022 for a photo of a dandelion, or thecolor \u0022yellow\u0022. You can also extract metadata about the image, such as its size.This article covers the fundamentals of working with images, and also describes severalcommon scenarios, such as working with embedded images, custom skills, andoverlaying visualizations on original images.To work with image content in a skillset, you\u0027ll need:Optionally, you can define projections to accept image-analyzed output into aknowledge store for data mining scenarios.\r\nImage processing is indexer-driven, which means that the raw inputs must be in asupported data source.Image analysis supports JPEG, PNG, GIF, and BMPOCR supports JPEG, PNG, BMP, and TIFImages are either standalone binary files or embedded in documents (PDF, RTF, andMicrosoft application files). A maximum of 1000 images will be extracted from a givenSource files that include images＂A search indexer, configured for image actions＂A skillset with built-in or custom skills that invoke OCR or image analysis＂A search index with fields to receive the analyzed text output, plus output fieldmappings in the indexer that establish association.＂Set up source filesdocument. If there are more than 1000 images in a document, the first 1000 will beextracted and a warning will be generated.\n"
}