{
  "Id": "1333",
  "Title": "\u0022Alerting and Monitoring Best Practices for Azure Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOn a search service, throttling or querylatency that exceeds a given threshold are the most commonly used alerts, but youmight also want to be notified if a search service is deleted.Alert typeConditionDescriptionSearch Latency(metric alert)Whenever the average search latency is greaterthan a user-specified threshold (in seconds)Send an SMS alert whenaverage query responsetime exceeds thethreshold.\r\nThrottled searchqueriespercentage(metric alert)Whenever the total throttled search queriespercentage is greater than or equal to a user-specified thresholdSend an SMS alert whendropped queries beginto exceed the threshold.Delete SearchService (activitylog alert)Whenever the Activity Log has an event withCategory=\u0027Administrative\u0027, Signal name=\u0027DeleteSearch Service (searchServices)\u0027, Level=\u0027critical\u0027Send an email if a searchservice is deleted in thesubscription.Set up alertsIn Azure AI Search, resource logs capture indexing and query operations on the searchservice itself.\r\nResource Logs aren\u0027t collected and stored until you create a diagnostic setting. Adiagnostic setting specifies data collection and storage. You can create multiple settingsif you want to keep metrics and log data separate, or if you want more than one of eachtype of destination.Resource logging is billable (see the Pricing model for details), starting when you createa diagnostic setting. See Diagnostic settings in Azure Monitor for general guidance.1. In the Azure portal, find your search service. From the menu on the left, underMonitoring, select Diagnostic settings.2. Select \u002B Add diagnostic setting.3. Give the diagnostic setting a name. Use granular and descriptive names if you\u0027recreating more than one setting.4. Select the logs and metrics that are in scope for this setting. Selections include\u0022allLogs\u0022, \u0022audit\u0022, \u0022OperationLogs\u0022, \u0022AllMetrics\u0022. You can exclude activity logs byselecting the \u0022OperationLogs\u0022 category.See Microsoft.Search/searchServices (in Supported categories for AzureMonitor resource logs)See Microsoft.Search/searchServices (in Supported metrics)See Azure AI Search monitoring data reference for the extended schema5. Select Send to Log Analytics workspace. Kusto queries and data exploration willtarget the workspace.6. Optionally, select other destinations.\n"
}