{
  "Id": "1337",
  "Title": "\u0022Analyzing Azure AI Search Logs and Metrics with Power BI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfd. Select \u002B Add diagnostic setting.e. Check Archive to a storage account, provide your Storage account information,and check OperationLogs and AllMetrics.Set up the appf. Select Save.2. After logging has been enabled, use your search service to start generating logsand metrics. It takes up to an hour before the containers will appear in Blobstorage with these logs. You will see a insights-logs-operationlogs container forsearch traffic logs and a insights-metrics-pt1m container for metrics.3. Find the Azure AI Search Power BI App in the Power BI Apps marketplace andinstall it into a new workspace or an existing workspace.\r\nThe app is called Azure AISearch: Analyze Logs and Metrics.4. After installing the app, select the app from your list of apps in Power BI.5. Select Connect to connect your data6. Input the name of the storage account that contains your logs and metrics. Bydefault the app will look at the last 10 days of data but this value can be changedwith the Days parameter.\r\n7. Select Key as the authentication method and provide your storage account key.Select Private as the privacy level. Click Sign In and to begin the loading process.8. Wait for the data to refresh. This may take some time depending on how muchdata you have. You can see if the data is still being refreshed based on the belowindicator.9.\r\nOnce the data refresh has completed, select Azure AI Search Report to view thereport.10. Make sure to refresh the page after opening the report so that it opens with yourdata.If you would like to visualize data from a different storage account or change thenumber of days of data to query, follow the below steps to change the Days andStorageAccount parameters. 1. Navigate to your Power BI apps, find your Azure AI Search app and select the Editapp button to view the workspace.2. Select Settings from the Dataset options.Modify app parameters3. While in the Datasets tab, change the parameter values and select Apply. If there isan issue with the connection, update the data source credentials on the samepage.\n"
}