{
  "Id": "1039",
  "Title": "\u0022Annotating and Grouping Data for Custom Skills in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfnet/api/GetLastName\u0022,     \u0022context\u0022 : \u0022/document/people/*\u0022,     \u0022defaultLanguageCode\u0022: \u0022en\u0022,     \u0022inputs\u0022: [       {         \u0022name\u0022: \u0022fullname\u0022,         \u0022source\u0022: \u0022/document/people/*\u0022       }     ],     \u0022outputs\u0022: [       {         \u0022name\u0022: \u0022lastname\u0022,         \u0022targetName\u0022: \u0022last\u0022       } When annotations are arrays or collections of strings, you might want to target specificmembers rather than the array as a whole.\r\nThe above example generates an annotationcalled \u0022last\u0022 under each node represented by the context. If you want to refer to thisfamily of annotations, you could use the syntax \u0022/document/people/*/last\u0022. If you wantto refer to a particular annotation, you could use an explicit index:\u0022/document/people/1/last\u0022 to reference the last name of the first person identified inthe document. Notice that in this syntax arrays are \u00220 indexed\u0022.Sometimes you need to group all annotations of a particular type to pass them to aparticular skill.\r\nConsider a hypothetical custom skill that identifies the most common lastname from all the last names extracted in Example 2. To provide just the last names tothe custom skill, specify the context as \u0022/document\u0022 and the input as\u0022/document/people/*/lastname\u0022.Notice that the cardinality of \u0022/document/people/*/lastname\u0022 is larger than that ofdocument.\r\nThere may be 10 lastname nodes while there\u0027s only one document node forthis document. In that case, the system will automatically create an array of\u0022/document/people/*/lastname\u0022 containing all of the elements in the document.JSON    ]   } Example 3: Reference members within an array  {     \u0022@odata.type\u0022: \u0022#Microsoft. Skills.Custom.WebApiSkill\u0022,     \u0022description\u0022: \u0022Fictitious skill that gets the most common string from an array of strings\u0022,     \u0022uri\u0022: \u0022http://names.azurewebsites.\n"
}