{
  "Id": "1513",
  "Title": "\u0022Authentication and Usage of DefaultAzureCredential in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUsing the DefaultAzureCredential youcan authenticate a service using Managed Identity or a service principal, authenticate asa developer working on an application, and more all without changing code. Please refer    .credential(new AzureKeyCredential(API_KEY))    .buildClient();SearchIndexerAsyncClient searchIndexerAsyncClient = new SearchIndexerClientBuilder()    .\r\nendpoint(ENDPOINT)    .credential(new AzureKeyCredential(API_KEY))    .buildAsyncClient();Create a SearchClientSearchClient searchClient = new SearchClientBuilder()    .endpoint(ENDPOINT)    .credential(new AzureKeyCredential(ADMIN_KEY))    .indexName(INDEX_NAME)    .buildClient();SearchAsyncClient searchAsyncClient = new SearchClientBuilder()    .\r\nendpoint(ENDPOINT)    .credential(new AzureKeyCredential(ADMIN_KEY))    .indexName(INDEX_NAME)    .buildAsyncClient();Create a client using Azure Active Directory authenticationthe documentation for instructions on how to connect to Azure Cognitive Search usingAzure role-based access control (Azure RBAC).Before you can use the DefaultAzureCredential, or any credential type fromAzure.\r\nIdentity, you\u0027ll first need to install the Azure.Identity package.To use DefaultAzureCredential with a client ID and secret, you\u0027ll need to set theAZURE_TENANT_ID, AZURE_CLIENT_ID, and AZURE_CLIENT_SECRET environment variables;alternatively, you can pass those values to the ClientSecretCredential also in azure-identity. Make sure you use the right namespace for DefaultAzureCredential at the top of yoursource file:JavaThen you can create an instance of DefaultAzureCredential and pass it to a newinstance of your client:JavaTo get running with Azure Cognitive Search first create an index following this guide.With an index created you can use the following samples to begin using the SDK.import com.azure.identity.DefaultAzureCredential;import com.azure.identity.DefaultAzureCredentialBuilder;String indexName = \u0022nycjobs\u0022;// Get the service endpoint from the environmentString endpoint = Configuration.getGlobalConfiguration().\n"
}