{
  "Id": "848",
  "Title": "\u0022Automating Data Refresh with Azure Cosmos DB Indexer Connections\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfnet/indexes?api-version=2020-06-30Content-Type: application/jsonapi-key: [admin key]{    \u0022name\u0022 : \u0022my-target-index\u0022,    \u0022fields\u0022: [An indexer connects a data source with a target search index and provides a schedule toautomate the data refresh. Once the index and data source have been created, you\u0027reready to create and run the indexer. If the indexer is successful, the connection syntaxand role assignments are valid.\r\nHere\u0027s a Create Indexer REST API call with an Azure Cosmos DB indexer definition. Theindexer will run when you submit the request.HTTPIf you recently rotated your Azure Cosmos DB account keys, you\u0027ll need to wait up to 15minutes for the managed identity connection string to work.Check to see if the Azure Cosmos DB account has its access restricted to selectnetworks.\r\nYou can rule out any firewall issues by trying the connection withoutrestrictions in place.Indexing via an Azure Cosmos DB for NoSQLIndexing via an Azure Cosmos DB for MongoDB    { \u0022name\u0022: \u0022id\u0022, \u0022type\u0022: \u0022Edm.String\u0022, \u0022key\u0022: true, \u0022searchable\u0022: false },    { \u0022name\u0022: \u0022booktitle\u0022, \u0022type\u0022: \u0022Edm.\r\nString\u0022, \u0022searchable\u0022: true, \u0022filterable\u0022: false, \u0022sortable\u0022: false, \u0022facetable\u0022: false }    ]}Create the indexer    POST https://[service name].search.windows.\r\nnet/indexers?\r\napi-version=2020-06-30    Content-Type: application/json    api-key: [admin key]    {      \u0022name\u0022 : \u0022cosmos-db-indexer\u0022,      \u0022dataSourceName\u0022 : \u0022cosmos-db-datasource\u0022,      \u0022targetIndexName\u0022 : \u0022my-target-index\u0022    }TroubleshootingSee alsoIndexing via an Azure Cosmos DB for Apache GremlinSet up an indexer connection to AzureSQL using a managed identityArticle•09/20/2022This article explains how to set up an indexer connection to Azure SQL Database using amanaged identity instead of providing credentials in the connection string.\n"
}