{
  "Id": "1006",
  "Title": "\u0022Automating Data Refresh and Index Creation in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfInt64\u0022, \u0022key\u0022: false, \u0022searchable\u0022: false, \u0022filterable\u0022: false, \u0022sortable\u0022: false, \u0022facetable\u0022: false },        { \u0022name\u0022: \u0022content\u0022, \u0022type\u0022: \u0022Edm.String\u0022, \u0022searchable\u0022: true, \u0022filterable\u0022: false, \u0022sortable\u0022: false, \u0022facetable\u0022: false }An indexer connects a data source with a target search index and provides a schedule to automate the data refresh.\r\nOnce the index anddata source are created, you can create the indexer.During this step, you’re asked to sign in with organization credentials that have access to the SharePoint site. If possible, we recommendcreating a new organizational user account and giving that new user the exact permissions that you want the indexer to have.\r\nThere are a few steps to creating the indexer:1. Send a Create Indexer (preview) request:HTTP2. When you create the indexer for the first time, the Create Indexer (preview) request waits until you complete the next step. You mustcall Get Indexer Status to get the link and enter your new device code.\r\nHTTPIf you don’t run the Get Indexer Status within 10 minutes, the code expires and you’ll need to recreate the data source.3. Copy the device login code from the Get Indexer Status response. The device login can be found in the \u0022errorMessage\u0022.\r\nHTTP    ]}） ImportantOnly metadata_spo_site_library_item_id may be used as the key field in an index populated by the SharePoint indexer. If a key fielddoesn\u0027t exist in the data source, metadata_spo_site_library_item_id is automatically mapped to the key field.Step 6: Create an indexerPOST https://[service name].search.windows. net/indexers?api-version=2023-10-01-PreviewContent-Type: application/jsonapi-key: [admin key]{    \u0022name\u0022 : \u0022sharepoint-indexer\u0022,    \u0022dataSourceName\u0022 : \u0022sharepoint-datasource\u0022,    \u0022targetIndexName\u0022 : \u0022sharepoint-index\u0022,    \u0022parameters\u0022: {    \u0022batchSize\u0022: null,    \u0022maxFailedItems\u0022: null,    \u0022maxFailedItemsPerBatch\u0022: null,    \u0022base64EncodeKeys\u0022: null,    \u0022configuration\u0022: {        \u0022indexedFileNameExtensions\u0022 : \u0022.\n"
}