{
  "Id": "1537",
  "Title": "\u0022Azure Cognitive Search Service API: Parameters and Definitions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSharedPrivateLinkResourcesListByServiceNextOptionalParamsOptional parameters.SharedPrivateLinkResourcesListByServiceOptionalParamsOptional parameters.SkuDefines the SKU of an Azure Cognitive Search Service, whichdetermines price tier and capacity limits.TrackedResourceThe resource model definition for an Azure Resource Managertracked top level resource which has \u0027tags\u0027 and a \u0027location\u0027UsageBySubscriptionSkuOptionalParamsOptional parameters.\r\nUsagesInterface representing a Usages.UsagesListBySubscriptionNextOptionalParamsOptional parameters.UsagesListBySubscriptionOptionalParamsOptional parameters.AadAuthFailureModeDefines values for AadAuthFailureMode.AdminKeyKindDefines values for AdminKeyKind.\r\nAdminKeysGetResponseContains response data for the get operation.AdminKeysRegenerateResponseContains response data for the regenerate operation.HostingModeDefines values for HostingMode.IdentityTypeDefines values for IdentityType.OperationsListResponseContains response data for the list operation.PrivateEndpointConnectionsDeleteResponseContains response data for the delete operation.Type AliasesPrivateEndpointConnectionsGetResponseContains response data for the get operation.PrivateEndpointConnectionsListByServiceNextResponseContains response data for the listByServiceNext operation.PrivateEndpointConnectionsListByServiceResponseContains response data for the listByService operation.\r\nPrivateEndpointConnectionsUpdateResponseContains response data for the update operation.PrivateLinkResourcesListSupportedResponseContains response data for the listSupported operation.PrivateLinkServiceConnectionProvisioningStateDefines values forPrivateLinkServiceConnectionProvisioningState.KnownPrivateLinkServiceConnectionProvisioningState can beused interchangeably withPrivateLinkServiceConnectionProvisioningState, this enumcontains the known values that the service supports.Known values supported by theserviceUpdating: The private link service connection is in the process ofbeing created along with other resources for it to be fullyfunctional. Deleting: The private link service connection is in the process ofbeing deleted.Failed: The private link service connection has failed to beprovisioned or deleted.Succeeded: The private link service connection has finishedprovisioning and is ready for approval.Incomplete: Provisioning request for the private link serviceconnection resource has been accepted but the process ofcreation has not commenced yet.Canceled: Provisioning request for the private link serviceconnection resource has been canceledPrivateLinkServiceConnectionStatusDefines values for PrivateLinkServiceConnectionStatus.ProvisioningStateDefines values for ProvisioningState.\n"
}