{
  "Id": "1554",
  "Title": "\u0022Azure Cognitive Search Cmdlets: Operations and Resource Management Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCoreGANameDescriptionTypeStatusaz search shared-private-link-resourcewaitWait for async shared private link resource operations.CoreGAAz.SearchReferenceThis topic displays help topics for the Azure Cognitive Search Cmdlets.Get-AzSearchAdminKeyPairGets admin key pair of the Azure Cognitive Search service.Get-AzSearchPrivateEndpointConnectionGets private endpoint connection(s) to the Azure CognitiveSearch service.Get-AzSearchPrivateLinkResourceGets private link resource details for the Azure CognitiveSearch service.Get-AzSearchQueryKeyGets query key(s) of the Azure Cognitive Search service.Get-AzSearchServiceGets an Azure Cognitive Search service.\r\nGet-AzSearchSharedPrivateLinkResourceGets shared private link resources(s) of the Azure CognitiveSearch service.New-AzSearchAdminKeyRegenerates an admin key of the Azure Cognitive Searchservice.New-AzSearchQueryKeyCreate a new query key for the Azure Cognitive Searchservice.New-AzSearchServiceCreates an Azure Cognitive Search service.New-AzSearchSharedPrivateLinkResourceCreates a shared private link resource for the AzureCognitive Search service.Remove-AzSearchPrivateEndpointConnectionRemove the private endpoint connection from the AzureCognitive Search service.Remove-AzSearchQueryKeyRemove the query key from the Azure Cognitive Searchservice.\r\nRemove-AzSearchServiceRemove an Azure Cognitive Search service.Remove-AzSearchSharedPrivateLinkResourceRemove the shared private link resource from the AzureCognitive Search service.Set-AzSearchPrivateEndpointConnectionUpdate the private endpoint connection to the AzureCognitive Search service.Set-AzSearchServiceUpdate an Azure Cognitive Search service.SearchSet-AzSearchSharedPrivateLinkResourceUpdate the shared private link resource for the AzureCognitive Search service.６ Collaborate with us onGitHubThe source for this content canbe found on GitHub, where youcan also create and reviewissues and pull requests. Formore information, see ourcontributor guide.Azure PowerShell feedbackAzure PowerShell is an open sourceproject. Select a link to providefeedback: Open a documentation issue Provide product feedbackMicrosoft.Search searchServicesArticle•06/30/2023The searchServices resource type can be deployed with operations that target:Resource groups - See resource group deployment commandsFor a list of changed properties in each API version, see change log.To create a Microsoft.Search/searchServices resource, add the following Bicep to yourtemplate.BicepBicep resource definitionResource formatresource symbolicname \u0027Microsoft.\n"
}