{
  "Id": "1567",
  "Title": "\u0022Azure Search Operations and Query Types: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCanbe Create, Delete, Get, List.indexes.PrototypeThis is an index created by theImport Data wizard.Indexing.IndexThis operation is a call to Add,Update or Delete Documents.Metadata.GetMetadataA request for search servicesystem data.Query.AutocompleteAn autocomplete queryagainst an index. See Querytypes and composition.Query.\r\nLookupA lookup query against anindex. See Query types andcomposition.Query.SearchA full text search requestagainst an index. See Querytypes and composition.Query.SuggestType ahead query against anindex. See Query types andcomposition.OperationNameDescriptionServiceStatsThis operation is a routine callto Get Service Statistics, eithercalled directly or implicitly topopulate a portal overviewpage when it is loaded orrefreshed.Skillsets.*Applies to a skillset. Can beCreate, Delete, Get, List.See Monitoring Azure AI Search for concepts and instructions.See Monitoring Azure resources with Azure Monitor for details on monitoringAzure resources.\r\nSee alsoSupported data types (Azure AI Search)Article•11/13/2023In Azure AI Search, document fields and values in expressions (for example, in filters) aretyped according to the Entity Data Model, or EDM (see Entity Data Model for details).Specifying EDM data types is necessary when defining fields in an index.\r\nYou can findexamples of JSON representation for fields of various types in Create Index examples.For an example of JSON documents contained typed content in data upload scenarios,see Add, Update or Delete Documents examples.Data typeDescriptionEdm.StringText data.Edm.BooleanContains true/false values.Edm.Int3232-bit integer values.Edm.Int6464-bit integer values. Edm.DoubleDouble-precision IEEE 754 floating-point values.Edm.DateTimeOffsetDate and time values represented in the OData V4 format:yyyy-MM-ddTHH:mm:ss.fffZ or yyyy-MM-ddTHH:mm:ss.fff[\u002B\u0026#124;-]HH:mm. Precision of DateTimeOffsetfields is limited to milliseconds.\n"
}