{
  "Id": "1566",
  "Title": "\u0022Azure AI Search Operations and Resource Log Schema Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOperationNameStringThe name of the operation (see the full list of operations below).An example is Query.SearchOperationVersionStringThe api-version used on the request. For example: 2020-06-30ResultTypeString\u0022Success\u0022. Other possible values: Success or FailureResultSignatureIntAn HTTP result code. For example: 200DurationMSIntDuration of the operation in milliseconds.PropertiesObjectObject containing operation-specific data. See the followingproperties schema table.The properties below are specific to Azure AI Search.NameTypeDescription and exampleDescription_sStringThe operation\u0027s endpoint.\r\nFor example: GET /indexes(\u0027content\u0027)/docsDocuments_dIntNumber of documents processed.IndexName_sStringName of the index associated with the operation.Query_sStringThe query parameters used in the request. For example: ?search=beachaccess\u0026$count=true\u0026api-version=2020-06-30The operations below can appear in a resource log.\r\nProperties schemaOperationName values (logged operations)OperationNameDescriptionDataSources.*Applies to indexer datasources. Can be Create, Delete,Get, List.DebugSessions.*Applies to a debug session.Can be Create, Delete, Get, List,Start, and Status.DebugSessions.DocumentStructureAn enriched document isloaded into a debug session.DebugSessions.\r\nRetrieveIndexerExecutionHistoricalDataA request for indexer executiondetails.DebugSessions.RetrieveProjectedIndexerExecutionHistoricalDataExecution history forenrichments projected to aknowledge store.Indexers.*Applies to an indexer. Can beCreate, Delete, Get, List, andStatus.Indexes.*Applies to a search index. Canbe Create, Delete, Get, List.indexes.PrototypeThis is an index created by theImport Data wizard.Indexing.IndexThis operation is a call to Add,Update or Delete Documents.Metadata.GetMetadataA request for search servicesystem data.Query.AutocompleteAn autocomplete queryagainst an index. See Querytypes and composition.Query.\n"
}