{
  "Id": "1665",
  "Title": "\u0022Azure AI Enrichment Skills Overview and Pricing Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSentimentSkillThis skill uses a pretrained model toassign sentiment labels (such as\u0022negative\u0022, \u0022neutral\u0022 and \u0022positive\u0022)based on the highest confidencescore found by the service at asentence and document-level on arecord by record basis.Azure AIservices(pricing)Microsoft.Skills.Text.TranslationSkillThis skill uses a pretrained model totranslate the input text into variouslanguages for normalization orlocalization use cases.\r\nAzure AIservices(pricing)OData typeDescriptionMeteredbyMicrosoft.Skills.Vision.ImageAnalysisSkillThis skill uses an image detectionalgorithm to identify the content ofan image and generate a textdescription.Azure AIservices(pricing)Microsoft.Skills.Vision.OcrSkillOptical character recognition.\r\nAzure AIservices(pricing)Skills that call models deployed on Azure OpenAI are billed at the pay-as-you-go rate.OData typeDescriptionMetered byMicrosoft.Skills.Text.AzureOpenAIEmbeddingSkillConnects to a deployedembedding model on AzureOpenAI for integratedvectorization.\r\nAzureOpenAI(pricing)Skills that execute only on Azure AI Search, iterate mostly on nodes in the enrichmentcache, and are mostly non-billable.OData typeDescriptionMetered byMicrosoft.Skills.Util.ConditionalSkillAllows filtering, assigning adefault value, and merging databased on a condition.Not applicableMicrosoft.Skills.Util.DocumentExtractionSkillExtracts content from a file withinthe enrichment pipeline. Azure AISearch(pricing) forimageextraction.Microsoft.Skills.Text.MergeSkillConsolidates text from acollection of fields into a singlefield.Not applicableMicrosoft.Skills.Util.ShaperSkillMaps output to a complex type(a multi-part data type, whichNot applicableAzure OpenAI skillsUtility skillsOData typeDescriptionMetered bymight be used for a full name, amulti-line address, or acombination of last name and apersonal identifier.\n"
}