{
  "Id": "1536",
  "Title": "\u0022Azure Cognitive Search Resource Management API Reference Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfResourceCommon fields that are returned in the response for all AzureResource Manager resourcesSearchManagementClientOptionalParamsOptional parameters.SearchManagementRequestOptionsParameter groupSearchServiceDescribes an Azure Cognitive Search service and its current state.SearchServiceListResultResponse containing a list of Azure Cognitive Search services.SearchServiceUpdateThe parameters used to update an Azure Cognitive Searchservice.ServicesInterface representing a Services.ServicesCheckNameAvailabilityOptionalParamsOptional parameters.ServicesCreateOrUpdateOptionalParamsOptional parameters.ServicesDeleteOptionalParamsOptional parameters.\r\nServicesGetOptionalParamsOptional parameters.ServicesListByResourceGroupNextOptionalParamsOptional parameters.ServicesListByResourceGroupOptionalParamsOptional parameters.ServicesListBySubscriptionNextOptionalParamsOptional parameters.ServicesListBySubscriptionOptionalParamsOptional parameters.ServicesUpdateOptionalParamsOptional parameters.ShareablePrivateLinkResourcePropertiesDescribes the properties of a resource type that has beenonboarded to private link service, supported by Azure CognitiveSearch.ShareablePrivateLinkResourceTypeDescribes an resource type that has been onboarded to privatelink service, supported by Azure Cognitive Search.\r\nSharedPrivateLinkResourceDescribes a Shared Private Link Resource managed by the AzureCognitive Search service.SharedPrivateLinkResourceListResultResponse containing a list of Shared Private Link Resources.SharedPrivateLinkResourcePropertiesDescribes the properties of an existing Shared Private LinkResource managed by the Azure Cognitive Search service.SharedPrivateLinkResourcesInterface representing a SharedPrivateLinkResources.SharedPrivateLinkResourcesCreateOrUpdateOptionalParamsOptional parameters.SharedPrivateLinkResourcesDeleteOptionalParamsOptional parameters.SharedPrivateLinkResourcesGetOptionalParamsOptional parameters. SharedPrivateLinkResourcesListByServiceNextOptionalParamsOptional parameters.SharedPrivateLinkResourcesListByServiceOptionalParamsOptional parameters.SkuDefines the SKU of an Azure Cognitive Search Service, whichdetermines price tier and capacity limits.TrackedResourceThe resource model definition for an Azure Resource Managertracked top level resource which has \u0027tags\u0027 and a \u0027location\u0027UsageBySubscriptionSkuOptionalParamsOptional parameters.\n"
}