{
  "Id": "1534",
  "Title": "\u0022Azure Cognitive Search API: Operations and Authentication Options\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAdminKeysGetOptionalParamsOptional parameters.AdminKeysRegenerateOptionalParamsOptional parameters.AsyncOperationResultThe details of a long running asynchronous shared private linkresource operationCheckNameAvailabilityInputInput of check name availability API.CheckNameAvailabilityOutputOutput of check name availability API.CloudErrorContains information about an API error.CloudErrorBodyDescribes a particular API error with an error code and amessage.DataPlaneAadOrApiKeyAuthOptionIndicates that either the API key or an access token from AzureActive Directory can be used for authentication.DataPlaneAuthOptionsDefines the options for how the data plane API of a Searchservice authenticates requests.\r\nThis cannot be set if\u0027disableLocalAuth\u0027 is set to true.EncryptionWithCmkDescribes a policy that determines how resources within thesearch service are to be encrypted with Customer ManagedKeys.IdentityIdentity for the resource.IpRuleThe IP restriction rule of the Azure Cognitive Search service.ClassesInterfacesListQueryKeysResultResponse containing the query API keys for a given AzureCognitive Search service.NetworkRuleSetNetwork specific rules that determine how the Azure CognitiveSearch service may be reached.OperationDescribes a REST API operation.OperationDisplayThe object that describes the operation.\r\nOperationListResultThe result of the request to list REST API operations. It contains alist of operations and a URL to get the next set of results.OperationsInterface representing a Operations.OperationsListOptionalParamsOptional parameters.PrivateEndpointConnectionDescribes an existing Private Endpoint connection to the AzureCognitive Search service.PrivateEndpointConnectionListResultResponse containing a list of Private Endpoint connections.PrivateEndpointConnectionPropertiesDescribes the properties of an existing Private Endpointconnection to the Azure Cognitive Search service.PrivateEndpointConnectionPropertiesPrivateEndpointThe private endpoint resource from Microsoft. Network provider.PrivateEndpointConnectionPropertiesPrivateLinkServiceConnectionStateDescribes the current state of an existing Private Link Serviceconnection to the Azure Private Endpoint.PrivateEndpointConnectionsInterface representing a PrivateEndpointConnections.PrivateEndpointConnectionsDeleteOptionalParamsOptional parameters.PrivateEndpointConnectionsGetOptionalParamsOptional parameters.PrivateEndpointConnectionsListByServiceNextOptionalParamsOptional parameters.PrivateEndpointConnectionsListByServiceOptionalParamsOptional parameters.PrivateEndpointConnectionsUpdateOptionalParamsOptional parameters.\n"
}