{
  "Id": "590",
  "Title": "\u0022Azure Search: Resource Limits and Storage Guidelines Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfResourceFreeBasic S1S2S3S3 HDL1L2Maximum indexes35 or15502002001000 per partitionor 3000 perservice1010Maximum simple fields perindex 1000100100010001000100010001000Maximum complex collectionsper index4040404040404040Maximum elements across allcomplex collections perdocument 30003000300030003000300030003000Maximum\r\ndepth of complexfields1010101010101010Maximum suggesters perindex11111111Storage limits1212Index limits123ResourceFreeBasic S1S2S3S3 HDL1L2Maximum scoring profiles perindex100100100100100100100100Maximum functions perprofile88888888 Basic services created before December 2017 have lower limits (5 instead of 15)\r\non indexes.\r\nBasic tier is the only SKU with a lower limit of 100 fields per index. The upper limit on fields includes both first-level fields and nested subfields in a complexcollection. For example, if an index contains 15 fields and has two complex collections with fivesubfields each, the field count of your index is 25. Indexes with a very large fields collection canbe slow. Limit fields and attributes to just those you need, and run indexing and query test toensure performance is acceptable. An upper limit exists for elements because having a large number of them significantlyincreases the storage required for your index. An element of a complex collection is defined asa member of that collection. For example, assume a Hotel document with a Rooms complexcollection, each room in the Rooms collection is considered an element. During indexing, theindexing engine can safely process a maximum of 3000 elements across the document as awhole. This limit was introduced in api-version=2019-05-06 and applies to complex collectionsonly, and not to string collections or to complex fields.You might find some variation in maximum limits if your service happens to be provisioned ona more powerful cluster. The limits here represent the common denominator.\n"
}