{
  "Id": "1540",
  "Title": "\u0022Azure Cognitive Search: Usage and Function Details Documentation\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUsageBySubscriptionSkuResponseContains response data for the usageBySubscriptionSkuoperation.UsagesListBySubscriptionNextResponseContains response data for the listBySubscriptionNext operation.UsagesListBySubscriptionResponseContains response data for the listBySubscription operation.KnownPrivateLinkServiceConnectionProvisioningStateKnown values of PrivateLinkServiceConnectionProvisioningStatethat the service accepts.KnownSearchSemanticSearchKnown values of SearchSemanticSearch that the service accepts.KnownSharedPrivateLinkResourceAsyncOperationResultKnown values ofSharedPrivateLinkResourceAsyncOperationResult that the serviceaccepts.\r\nKnownUnavailableNameReasonKnown values of UnavailableNameReason that the serviceaccepts.getContinuationToken(unknown)Given the last .value produced by the byPage iterator, returns acontinuation token that can be used to begin paging from thatpoint later.Given the last .\r\nvalue produced by the byPage iterator, returns a continuation tokenthat can be used to begin paging from that point later.TypeScriptEnumsFunctionsFunction DetailsgetContinuationToken(unknown)ParameterspageunknownAn object from accessing value on the IteratorResult from a byPage iterator.Returnsstring | undefinedThe continuation token that can be passed into byPage() during future calls.\r\nfunction getContinuationToken(page: unknown): string | undefinedAzure Cognitive Search client library forPython - version 11.4.0Article•11/14/2023Azure Cognitive Search is a search-as-a-service cloud solution that gives developersAPIs and tools for adding a rich search experience over private, heterogeneous contentin web, mobile, and enterprise applications. The Azure Cognitive Search service is well suited for the following application scenarios:Consolidate varied content types into a single searchable index. To populate anindex, you can push JSON documents that contain your content, or if your data isalready in Azure, create an indexer to pull in data automatically.\n"
}