{
  "Id": "1556",
  "Title": "\u0022Azure Search Service: Tag Names and Property Values Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDictionary of tag namesand values. See Tags intemplatesskuThe SKU of the Search Service, which determines price tierand capacity limits. This property is required whencreating a new Search Service.SkuidentityThe identity of the resource.IdentitypropertiesProperties of the search service.SearchServicePropertiesNameDescriptionValuetypeThe identity type.\u0027None\u0027 \u0027SystemAssigned\u0027 (required)NameDescriptionValueauthOptionsDefines the options for how the data plane APIof a search service authenticates requests. Thiscannot be set if \u0027disableLocalAuth\u0027 is set to true.\r\nDataPlaneAuthOptions        }       ]     }     partitionCount: int    publicNetworkAccess: \u0027string\u0027     replicaCount: int   } } Property valuessearchServicesIdentitySearchServicePropertiesNameDescriptionValuedisableLocalAuthWhen set to true, calls to the search service willnot be permitted to utilize API keys forauthentication. This cannot be set to true if\u0027dataPlaneAuthOptions\u0027 are defined.\r\nboolencryptionWithCmkSpecifies any policy regarding encryption ofresources (such as indexes) using customermanager keys within a search service.EncryptionWithCmkhostingModeApplicable only for the standard3 SKU. You canset this property to enable up to 3 high densitypartitions that allow up to 1000 indexes, whichis much higher than the maximum indexesallowed for any other SKU.\r\nFor the standard3SKU, the value is either \u0027default\u0027 or \u0027highDensity\u0027.For all other SKUs, this value must be \u0027default\u0027.\u0027default\u0027 \u0027highDensity\u0027networkRuleSetNetwork specific rules that determine how theAzure Cognitive Search service may be reached.NetworkRuleSetpartitionCountThe number of partitions in the search service; ifspecified, it can be 1, 2, 3, 4, 6, or 12. Valuesgreater than 1 are only valid for standard SKUs.For \u0027standard3\u0027 services with hostingMode set to\u0027highDensity\u0027, the allowed values are between 1and 3.intpublicNetworkAccessThis value can be set to \u0027enabled\u0027 to avoidbreaking changes on existing customerresources and templates. If set to \u0027disabled\u0027,traffic over public interface is not allowed, andprivate endpoint connections would be theexclusive access method.\n"
}