{
  "Id": "1535",
  "Title": "\u0022Azure Cognitive Search API: Private Link and Query Operations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNetwork provider.PrivateEndpointConnectionPropertiesPrivateLinkServiceConnectionStateDescribes the current state of an existing Private Link Serviceconnection to the Azure Private Endpoint.PrivateEndpointConnectionsInterface representing a PrivateEndpointConnections.PrivateEndpointConnectionsDeleteOptionalParamsOptional parameters.PrivateEndpointConnectionsGetOptionalParamsOptional parameters.PrivateEndpointConnectionsListByServiceNextOptionalParamsOptional parameters.PrivateEndpointConnectionsListByServiceOptionalParamsOptional parameters.PrivateEndpointConnectionsUpdateOptionalParamsOptional parameters.\r\nPrivateLinkResourceDescribes a supported private link resource for the AzureCognitive Search service.PrivateLinkResourcePropertiesDescribes the properties of a supported private link resource forthe Azure Cognitive Search service. For a given API version, thisrepresents the \u0027supported\u0027 groupIds when creating a sharedprivate link resource.PrivateLinkResourcesInterface representing a PrivateLinkResources.PrivateLinkResourcesListSupportedOptionalParamsOptional parameters.PrivateLinkResourcesResultResponse containing a list of supported Private Link Resources.QueryKeyDescribes an API key for a given Azure Cognitive Search servicethat has permissions for query operations only.\r\nQueryKeysInterface representing a QueryKeys.QueryKeysCreateOptionalParamsOptional parameters.QueryKeysDeleteOptionalParamsOptional parameters.QueryKeysListBySearchServiceNextOptionalParamsOptional parameters.QueryKeysListBySearchServiceOptionalParamsOptional parameters.QuotaUsageResultDescribes the quota usage for a particular sku supported byAzure Cognitive Search.QuotaUsageResultNameThe name of the sku supported by Azure Cognitive Search.QuotaUsagesListResultResponse containing the quota usage information for all thesupported skus of Azure Cognitive Search service. ResourceCommon fields that are returned in the response for all AzureResource Manager resourcesSearchManagementClientOptionalParamsOptional parameters.SearchManagementRequestOptionsParameter groupSearchServiceDescribes an Azure Cognitive Search service and its current state.SearchServiceListResultResponse containing a list of Azure Cognitive Search services.SearchServiceUpdateThe parameters used to update an Azure Cognitive Searchservice.ServicesInterface representing a Services.ServicesCheckNameAvailabilityOptionalParamsOptional parameters.ServicesCreateOrUpdateOptionalParamsOptional parameters.ServicesDeleteOptionalParamsOptional parameters.\n"
}