{
  "Id": "816",
  "Title": "\u0022Base64 Encoding and Decoding in .NET Core Framework\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027reusing .NET Core or another framework, we recommend setting those options to falseand calling your framework\u0027s encoding and decoding functions directly.The following table compares different base64 encodings of the string 00\u003E00?00. Todetermine the required processing (if any) for your base64 functions, apply your libraryencode function on the string 00\u003E00?00 and compare the output with the expectedoutput MDA-MDA_MDA.\r\n\u0022name\u0022 : \u0022base64Decode\u0022,        \u0022parameters\u0022 : { \u0022useHttpServerUtilityUrlTokenDecode\u0022 : false }     }   }] base64 encoding options２ WarningIf base64Encode is used to produce key values, useHttpServerUtilityUrlTokenEncodemust be set to true.\r\nOnly URL-safe base64 encoding can be used for key values. SeeNaming rules for the full set of restrictions on characters in key values.\r\nEncodingBase64encodeoutputExtra processing afterlibrary encodingExtra processing beforelibrary decodingEncodingBase64encodeoutputExtra processing afterlibrary encodingExtra processing beforelibrary decodingBase64 withpaddingMDA\u002BMDA/MDA=Use URL-safe charactersand remove paddingUse standard base64characters and add paddingBase64 withoutpaddingMDA\u002BMDA/MDAUse URL-safe charactersUse standard base64charactersURL-safe base64with paddingMDA-MDA_MDA=Remove paddingAdd paddingURL-safe base64without paddingMDA-MDA_MDANoneNoneSplits a string field using the specified delimiter,\r\nand picks the token at the specifiedposition in the resulting split. This function uses the following parameters:delimiter: a string to use as the separator when splitting the input string.position: an integer zero-based position of the token to pick after the input stringis split.For example, if the input is Jane Doe, the delimiter is \u0022 \u0022(space) and the position is 0,the result is Jane; if the position is 1, the result is Doe. If the position refers to a tokenthat doesn\u0027t exist, an error is returned.Your data source contains a PersonName field, and you want to index it as two separateFirstName and LastName fields.\n"
}