{
  "Id": "339",
  "Title": "\u0022Best Practices for Azure Cognitive Search REST API Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBest practice is to specify the access level \u0022private\u0022. Name yourcontainer clinicaltrialdataset.4. In container, click Upload to upload the sample files you downloaded andunzipped in the first step.5. While in the portal, get and save off the connection string for Azure Storage.\r\nYou\u0027llneed it for the REST API calls that index data. You can get the connection stringfrom Settings \u003E Access Keys in the portal.REST calls require the service URL and an access key on every request. A search service iscreated with both, so if you added Azure Cognitive Search to your subscription, followthese steps to get the necessary information:1.\r\nSign in to the Azure portal, and in your search service Overview page, get theURL. An example endpoint might look like https://mydemo.search.windows.net.2. In Settings \u003E Keys, get an admin key for full rights on the service. There are twointerchangeable admin keys, provided for business continuity in case you need toroll one over.\r\nYou can use either the primary or secondary key on requests foradding, modifying, and deleting objects.Set up your dataGet a key and URLAll requests require an api-key on every request sent to your service. Having a valid keyestablishes trust, on a per request basis, between the application sending the requestand the service that handles it.\r\nIn this section, you will import a Postman collection containing a \u0022buggy\u0022 workflow thatyou will fix in this tutorial.1. Start Postman and import the DebugSessions.postman_collection.json collection.If you\u0027re unfamiliar with Postman, see this quickstart.2. Under Files \u003E New, select the collection.3. After the collection is imported, expand the actions list (...).4. Select Edit to set variables used in each request.Current valueDescriptionsearchServiceThe name of your search service (for example, if the endpoint ishttps://mydemo.search.windows.net, then the service name ismydemo).apiKeyThe primary or secondary key obtained from the Keys page ofyour search service.\n"
}