{
  "Id": "1396",
  "Title": "\u0022Best Practices for API Key Management in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA separate term, \u0022document key\u0022, refers to a unique string in your indexedcontent that\u0027s used to uniquely identify documents in a search index.Types of API keys11Use API keys on connectionsAPI keys are used for data plane (content) requests, such as creating or accessing anindex or any other request that\u0027s represented in the Search REST APIs.\r\nUpon servicecreation, an API key is the only authentication mechanism for data plane operations, butyou can replace or supplement key authentication with Azure roles if you can\u0027t use hard-coded keys in your code.API keys are specified on client requests to a search service. Passing a valid API key onthe request is considered proof that the request is from an authorized client. If you\u0027recreating, modifying, or deleting objects, you\u0027ll need an admin API key. Otherwise, querykeys are typically distributed to client applications that issue queries.You can specify API keys in a request header for REST API calls, or in code that calls theazure.\r\nsearch.documents client libraries in the Azure SDKs. If you\u0027re using the Azureportal to perform tasks, your role assignment determines the level of access.Best practices for using hard-coded keys in source files include:During early development and proof-of-concept testing when security is looser,use sample or public data.\r\nFor mature solutions or production scenarios, switch to Azure Active Directory androle-based access to eliminate the need for having hard-coded keys. Or, if youwant to continue using API keys, be sure to always monitor who has access to yourAPI keys and regenerate API keys on a regular cadence.Key authentication is built in so no action is required. By default, the portal uses APIkeys to authenticate the request automatically. However, if you disable API keys andset up role assignments, the portal uses role assignments instead.In Cognitive Search, most tasks can be performed in Azure portal, including objectcreation, indexing through the Import data wizard, and queries through Searchexplorer.Portal７ NoteIt\u0027s considered a poor security practice to pass sensitive data such as an api-key inthe request URI. For this reason, Azure Cognitive Search only accepts a query key asan api-key in the query string. As a general rule, we recommend passing your api-key as a request header.\n"
}