{
  "Id": "997",
  "Title": "\u0022Best Practices for IP Address Management in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe remaining sections provide recommendations forhandling issues related to IP addresses in the ACL.We strongly recommend that you restrict the access to the IP address of your searchservice and the IP address range of AzureCognitiveSearch service tag in the ACL insteadof making your SQL Azure VMs open to all connection requests.You can find out the IP address by pinging the FQDN (for example, \u003Cyour-search-service-name\u003E.search.windows.net) of your search service. Although it\u0027s possible for thesearch service IP address to change, it\u0027s unlikely that it will change. The IP address tendsto be static for the lifetime of the service.\r\nYou can find out the IP address range of AzureCognitiveSearch service tag by eitherusing Downloadable JSON files or via the Service Tag Discovery API. The IP addressrange is updated weekly.If you\u0027re using the Azure portal to create an indexer, you must grant the portal inboundaccess to your SQL Azure virtual machine. An inbound rule in the firewall requires thatyou provide the IP address of the portal.Restrict access to the Azure AI SearchInclude the Azure AI Search portal IP addressesTo get the portal IP address, ping stamp2.ext.search.windows.net, which is the domainof the traffic manager.\r\nThe request will time out, but the IP address will be visible in thestatus message. For example, in the message \u0022Pingingazsyrie.northcentralus.cloudapp.azure.com [52.252.175.48]\u0022, the IP address is\u002252.252.175.48\u0022.Clusters in different regions connect to different traffic managers. Regardless of thedomain name, the IP address returned from the ping is the correct one to use whendefining an inbound firewall rule for the Azure portal in your region.With configuration out of the way, you can now specify a SQL Server on Azure VM asthe data source for an Azure AI Search indexer. For more information, see Index datafrom Azure SQL.\n"
}