{
  "Id": "1398",
  "Title": "\u0022Best Practices for Managing Azure Search API Keys\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAlways use a query key rather than an admin key for any queryoriginating from a client app.1. Sign in to the Azure portal and find your search service.2. Under Settings, select Keys to view API keys.3. Under Manage query keys, use the query key already generated for yourservice, or create new query keys.\r\nThe default query key isn\u0027t named, but othergenerated query keys can be named for manageability.Create query keysPortalTwo admin keys are created for each service so that you can rotate a primary key whileusing the secondary key for business continuity.1. Under Settings, select Keys, then copy the secondary key.2.\r\nFor all applications, update the API key settings to use the secondary key.3. Regenerate the primary key.4. Update all applications to use the new primary key.If you inadvertently regenerate both keys at the same time, all client requests usingthose keys will fail with HTTP 403 Forbidden. However, content isn\u0027t deleted and youaren\u0027t locked out permanently.\r\nYou can still access the service through the portal or programmatically. Managementfunctions are operative through a subscription ID not a service API key, and are thus stillavailable even if your API keys aren\u0027t.After you create new keys via portal or management layer, access is restored to yourcontent (indexes, indexers, data sources, synonym maps) once you provide those keyson requests.\r\nUse role assignments to restrict access to API keys.Note that it\u0027s not possible to use customer-managed key encryption to encrypt APIkeys. Only sensitive data within the search service itself (for example, index content orconnection strings in data source object definitions) can be CMK-encrypted. Regenerate admin keysSecure API keys1. Navigate to your search service page in Azure portal.2. On the left navigation pane, select Access control (IAM), and then select the Roleassignments tab.3. In the Role filter, select the roles that have permission to view or manage keys(Owner, Contributor, Search Service Contributor). The resulting security principalsassigned to those roles have key permissions on your search service.4. As a precaution, also check the Classic administrators tab to determine whetheradministrators and co-administrators have access.\n"
}