{
  "Id": "573",
  "Title": "\u0022Best Practices for Data Encryption and Key Management in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDP-4: Enable data at rest encryption by defaultFeaturesData at Rest Encryption Using Platform KeysDP-5: Use customer-managed key option in data at restencryption when requiredFeaturesData at Rest Encryption Using CMKReference: Configure customer-managed keys for data encryption in Azure CognitiveSearchDescription: The service supports Azure Key Vault integration for any customer keys,secrets, or certificates. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: Use Azure Key Vault to create and control the life cycle of yourencryption keys, including key generation, distribution, and storage.\r\nRotate and revokeyour keys in Azure Key Vault and your service based on a defined schedule or whenthere is a key retirement or compromise. When there is a need to use customer-managed key (CMK) in the workload, service, or application level, ensure you follow thebest practices for key management: Use a key hierarchy to generate a separate dataencryption key (DEK) with your key encryption key (KEK) in your key vault.\r\nEnsure keysare registered with Azure Key Vault and referenced via key IDs from the service orapplication. If you need to bring your own key (BYOK) to the service (such as importingHSM-protected keys from your on-premises HSMs into Azure Key Vault), followrecommended guidelines to perform initial key generation and key transfer. Reference: Configure customer-managed keys for data encryption in Azure CognitiveSearchDescription: The service supports Azure Key Vault integration for any customercertificates. Learn more.DP-6: Use a secure key management processFeaturesKey Management in Azure Key VaultDP-7: Use a secure certificate management processFeaturesCertificate Management in Azure Key VaultSupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.For more information, see the Microsoft cloud security benchmark: Asset management.\n"
}