{
  "Id": "894",
  "Title": "\u0022Blob Indexing and Content Extraction in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUse a Blob indexer for content extractionSupported access tiersSupported content typesCSV (see Indexing CSV blobs)EMLEPUBGZHTMLJSON (see Indexing JSON blobs)KML (XML for geographic representations)Microsoft Office formats: DOCX/DOC/DOCM, XLSX/XLS/XLSM, PPTX/PPT/PPTM,MSG (Outlook emails), XML (both 2003 and 2006 WORD XML)Open Document formats:\r\nODT, ODS, ODPPDFPlain text files (see also Indexing plain text)RTFXMLZIPYou can control which blobs are indexed, and which are skipped, by the blob\u0027s file typeor by setting properties on the blob themselves, causing the indexer to skip over them.\r\nInclude specific file extensions by setting \u0022indexedFileNameExtensions\u0022 to a comma-separated list of file extensions (with a leading dot). Exclude specific file extensions bysetting \u0022excludedFileNameExtensions\u0022 to the extensions that should be skipped.\r\nIf thesame extension is in both lists, it will be excluded from indexing.HTTPThe indexer configuration parameters apply to all blobs in the container or folder.Sometimes, you want to control how individual blobs are indexed.Controlling which blobs are indexedPUT /indexers/[indexer name]?api-version=2020-06-30{    \u0022parameters\u0022 : {         \u0022configuration\u0022 : {             \u0022indexedFileNameExtensions\u0022 : \u0022.\r\npdf, .docx\u0022,            \u0022excludedFileNameExtensions\u0022 : \u0022.png, .jpeg\u0022         }     }}Add \u0022skip\u0022 metadata the blobAdd the following metadata properties and values to blobs in Blob Storage. When theindexer encounters this property, it will skip the blob or its content in the indexing run. Property namePropertyvalueExplanation\u0022AzureSearch_Skip\u0022\u0022true\u0022Instructs the blob indexer to completely skip the blob.Neither metadata nor content extraction is attempted.This is useful when a particular blob fails repeatedlyand interrupts the indexing process.\u0022AzureSearch_SkipContent\u0022\u0022true\u0022This is equivalent to the \u0022dataToExtract\u0022 :\u0022allMetadata\u0022 setting described above scoped to aparticular blob.A common scenario that makes it easy to sort through blobs of any content type is toindex both custom metadata and system properties for each blob. In this way,information for all blobs is indexed regardless of document type, stored in an index inyour search service.\n"
}