{
  "Id": "323",
  "Title": "\u0022Building an AI-Enriched Search System with Azure Services Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOnce the index is populated, you can use the fields in queries, facets, and filters.Visual Studio Code with the Python extension and Python 3.7 or laterAzure StorageAzure AI SearchSet up a development environment＂Define a pipeline that uses OCR, language detection, and entity and key phraserecognition.＂Execute the pipeline to invoke transformations, and to create and load a searchindex.\r\n＂Explore results using full text search and a rich query syntax.＂OverviewPrerequisites７ NoteThe sample data consists of 14 files of mixed content type that you\u0027ll upload to AzureBlob Storage in a later step.1. Open this OneDrive folder and on the top-left corner, select Download to copythe files to your computer.\r\n2. Right-click the zip file and select Extract All. There are 14 files of various types.Optionally, you can also download the source code for this tutorial. Source code can befound at https://github.com/Azure-Samples/azure-search-python-samples/tree/main/Tutorial-AI-Enrichment.\r\nThis tutorial uses Azure AI Search for indexing and queries, Azure AI services on thebackend for AI enrichment, and Azure Blob Storage to provide the data. This tutorialstays under the Azure AI Search free allocation of 20 transactions per indexer per day onAzure AI services, so the only services you need to create are search and storage.\r\nIf possible, create both in the same region and resource group for proximity andmanageability. In practice, your Azure Storage account can be in any region.1. Sign in to the Azure portal and select \u002B Create Resource.2. Search for storage account and select Microsoft\u0027s Storage Account offering.3. In the Basics tab, the following items are required. Accept the defaults foreverything else. You can use the free search service for this tutorial. A free search service limits youto three indexes, three indexers, and three data sources. This tutorial creates one ofeach. Before starting, make sure you have room on your service to accept the newresources.Download files1 - Create servicesStart with Azure StorageResource group.\n"
}