{
  "Id": "360",
  "Title": "\u0022Building Custom Analyzers in Azure Cognitive Search: A Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfsearch.windows.net/indexes/tutorial-basic-index?api-version=2019-05-06  api-key: \u003CYOUR-ADMIN-API-KEY\u003EThis tutorial demonstrated the process for building and testing a custom analyzer. Youcreated an index, indexed data, and then queried against the index to see what searchresults were returned.\r\nFrom there, you used the Analyze Text API to see the lexicalanalysis process in action.While the analyzer defined in this tutorial offers an easy solution for searching againstphone numbers, this same process can be used to build a custom phone analyzer forany scenario you may have.\r\nWhen you\u0027re working in your own subscription, it\u0027s a good idea to remove the resourcesthat you no longer need at the end of a project. Resources left running can cost youmoney. You can delete resources individually or delete the resource group to delete theentire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.\r\nNow that you\u0027re familiar with how to create a custom analyzer, let\u0027s take a look at all ofthe different filters, tokenizers, and analyzers available to you to build a rich searchexperience.TakeawaysClean up resourcesNext stepsCustom Analyzers in Azure AI SearchTutorial: Query a Cognitive Search indexfrom Power AppsArticle•03/08/2023Use the rapid application development environment of Power Apps to create a customapp for your searchable content in Azure Cognitive Search.In this tutorial, you learn how to:If you don\u0027t have an Azure subscription, open a free account before you begin. Power Apps accountHotels-sample index hosted on your search serviceQuery API keyA connector in Power Apps is a data source connection. In this step, create a customconnector to connect to a search index in the cloud.1. Sign in to Power Apps.2. On the left, expand ... More. Find, pin, and then select Custom Connectors.\n"
}