{
  "Id": "191",
  "Title": "\u0022Building a Searchable Book Catalog with Azure and Python\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfqueryKey: [\u0022lookup\u0022, id],     queryFn: async() =\u003E  lookupRequest(),    enabled: id !== undefined,    staleTime: fiveMinutes, // time in milliseconds    cacheTime: fiveMinutes,    //refetchOnMount: false,    //refetchOnWindowFocus: false,    //refetchOnReconnect: false,  });  return (    \u003CContainer sx = {{      padding: 4    }}\u003E      { isLoading ?\r\n\u003CCircularProgress /\u003E : \u003CBookDetailsTab document={document}/\u003E}      { error \u0026\u0026 \u003Cdiv\u003E{error}\u003C/div\u003E }    \u003C/Container\u003E     );}Next steps1 - Overview of adding search to awebsite with PythonArticle•07/20/2023This tutorial builds a website to search through a catalog of books then deploys thewebsite to an Azure Static Web App.\r\nThe application is available:SampleDemo website - aka.ms/azs-good-booksThis sample website provides access to a catalog of 10,000 books. A user can search thecatalog by entering text in the search bar. While the user enters text, the website usesthe search index\u0027s suggest feature to complete the text.\r\nOnce the query finishes, the listof books is displayed with a portion of the details. A user can select a book to see all thedetails, stored in the search index, of the book.The search experience includes:Search – provides search functionality for the application.Suggest – provides suggestions as the user is typing in the search bar. Document Lookup – looks up a document by ID to retrieve all of its contents forthe details page.What does the sample do?The sample includes the following:AppPurposeGitHubRepositoryLocationClientReact app (presentation layer) to display books, withsearch. It calls the Azure Function app./search-website-functions-v4/clientServerAzure Function app (business layer) - calls the AzureCognitive Search API using Python SDK/search-website-functions-v4/apiBulkinsertPython file to create the index and add documents toit./search-website-functions-v4/bulk-uploadInstall the following for your local development environment.Python 3.\n"
}