{
  "Id": "219",
  "Title": "\u0022Building an Azure Search App in ASP.NET Core Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfonClick={() =\u003E setTab(0)}\u003EResult\u003C/button\u003E\u003C/li\u003EIndex Azure SQL data              \u003Cli className=\u0022nav-item\u0022\u003E\u003Cbutton className={rawStyle} onClick={() =\u003E setTab(1)}\u003ERaw Data\u003C/button\u003E\u003C/li\u003E          \u003C/ul\u003E        \u003C/div\u003E        {detailsBody}      \u003C/div\u003E    \u003C/main\u003E  );\r\n}Next stepsCreate a search app in ASP.\r\nNET CoreArticle•11/15/2023In this tutorial, create a basic ASP.NET Core (Model-View-Controller) app that runs inlocalhost and connects to the hotels-sample-index on your search service.\r\nIn thistutorial, you\u0027ll learn to:This tutorial puts the focus on server-side operations called through the Search APIs.Although it\u0027s common to sort and filter in client-side script, knowing how to invokethese operations on the server gives you more options when designing the searchexperience.Sample code for this tutorial can be found in the azure-search-dotnet-samplesrepository on GitHub.\r\nVisual StudioAzure.Search.Documents NuGet packageAzure AI Search Hotel samples index  The search service can be any tier, but it must have public network access for thistutorial. To complete this tutorial, you need to create the hotels-sample-index on your searchservice. Make sure the search index name ishotels-sample-index, or change the indexname in the HomeController.\r\ncs file.1. Start Visual Studio and select Create a new project.2. Select ASP.NET Core Web App (Model-View-Controller), and then select Next.3. Provide a project name, and then select Next.4. On the next page, select .NET 6.0 or .NET 7.0. Create a basic search page＂Filter results＂Sort results＂Prerequisites1212Create the project5. Verify that Do not use top-level statements is unchecked.6. Select Create.1. On Tools, select NuGet Package Manager \u003E Manage NuGet Packages for thesolution.2. Browse for Azure.Search.Documents and install the latest stable version.3.\n"
}