{
  "Id": "162",
  "Title": "\u0022Building a Search-Enabled Book Display with Azure Functions and React\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhile the user enters text, the website usesthe search index\u0027s suggest feature to complete the text. Once the query finishes, the listof books is displayed with a portion of the details. A user can select a book to see all thedetails, stored in the search index, of the book.The search experience includes:What does the sample do?Search – provides search functionality for the application.Suggest – provides suggestions as the user is typing in the search bar.\r\nFacets and filters - provides a faceted navigation structure that filters by author orlanguage.Paginated results - provides paging controls for scrolling through results.Document Lookup – looks up a document by ID to retrieve all of its contents forthe details page.The sample code includes the following components:AppPurposeGitHubRepositoryLocationClientReact app (presentation layer) to display books, withsearch. It calls the Azure Function app./search-website-functions-v4/clientServerAzure Function app (business layer) - calls the Azure AISearch API using JavaScript SDK/search-website-functions-v4/apiBulkinsertJavaScript file to create the index and add documentsto it.\r\n/search-website-functions-v4/bulk-insertInstall the following software in your local development environment.Node.js LTSSelect latest runtime and version from this list of supported language versions.If you have a different version of Node.js installed on your local computer,consider using Node Version Manager (nvm) or a Docker container.GitVisual Studio Code and the following extensionsAzure Static Web AppUse the integrated terminal for command line operations.Optional:This tutorial doesn\u0027t run the Azure Function API locally. If you intend to run itlocally, you need to install azure-functions-core-tools globally with thefollowing bash command:How is the sample organized?Set up your development environmentBashForking the sample repository is critical to be able to deploy the Static Web App. Thestatic web app determines the build actions and deployment content based on yourown GitHub fork location.\n"
}