{
  "Id": "192",
  "Title": "\u0022Building and Deploying Azure Search Sample Application Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDocument Lookup – looks up a document by ID to retrieve all of its contents forthe details page.What does the sample do?The sample includes the following:AppPurposeGitHubRepositoryLocationClientReact app (presentation layer) to display books, withsearch. It calls the Azure Function app./search-website-functions-v4/clientServerAzure Function app (business layer) - calls the AzureCognitive Search API using Python SDK/search-website-functions-v4/apiBulkinsertPython file to create the index and add documents toit./search-website-functions-v4/bulk-uploadInstall the following for your local development environment.Python 3.\r\n9GitVisual Studio Code and the following extensionsAzure Static Web AppUse the integrated terminal for command line operations.Optional:This tutorial doesn\u0027t run the Azure Function API locally but if you intend to run itlocally, you need to install azure-functions-core-tools.Forking the sample repository is critical to be able to deploy the static web app.\r\nTheweb apps determine the build actions and deployment content based on your ownGitHub fork location. Code execution in the Static Web App is remote, with Azure staticweb apps reading from the code in your forked sample.1. On GitHub, fork the sample repository.Complete the fork process in your web browser with your GitHub account.\r\nThistutorial uses your fork as part of the deployment to an Azure Static Web App.2. At a bash terminal, download the sample application to your local computer.How is the sample organized?Set up your development environmentFork and clone the search sample with gitReplace YOUR-GITHUB-ALIAS with your GitHub alias.Bash3. In Visual Studio Code, open your local folder of the cloned repository. Theremaining tasks are accomplished from Visual Studio Code, unless specified.1. In Visual Studio Code, open the Activity bar, and select the Azure icon.2. Sign in to Azure, if you aren\u0027t already signed in.3. In the Resources section, select Add (\u002B), and then select Create Resource Group.\n"
}