{
  "Id": "58",
  "Title": "\u0022Charming Boutique Hotels: Your Perfect Getaway Destinations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfcount\u0022: 7,    \u0022value\u0022: [        {            \u0022@search.score\u0022: 0.857736,            \u0022HotelName\u0022: \u0022Nordick\u0027s Motel\u0022,            \u0022Description\u0022: \u0022Only 90 miles (about 2 hours) from the nation\u0027s capital and nearby most everything the historic valley has to offer.  Hiking? Wine Tasting? Exploring the caverns?  It\u0027s all nearby and we have specially priced packages to help make our B\u0026B your home base for fun while visiting the valley.\r\n\u0022        },        {            \u0022@search.score\u0022: 0.8399129,            \u0022HotelName\u0022: \u0022Old Carrabelle Hotel\u0022,            \u0022Description\u0022: \u0022Spacious rooms, glamorous suites and residences, rooftop pool, walking access to shopping, dining, entertainment and the city center.\r\n\u0022        },        {            \u0022@search.score\u0022: 0.8383954,            \u0022HotelName\u0022: \u0022Historic Lion Resort\u0022,            \u0022Description\u0022: \u0022Unmatched Luxury.  Visit our downtown hotel to indulge in luxury accommodations. Moments from the stadium, we feature the You can add filters, but the filters are applied to the non-vector content in your index.\r\nInthis example, the filter applies to the \u0022Tags\u0022 field, filtering out any hotels that don\u0027tprovide free WIFI.This example sets vectorFilterMode to pre-query filtering, which is the default, so youdon\u0027t need to set it. It\u0027s listed here for awareness because it\u0027s a newer feature.HTTPbest in comfort\u0022        },        {            \u0022@search.score\u0022: 0. 8254346,            \u0022HotelName\u0022: \u0022Sublime Cliff Hotel\u0022,            \u0022Description\u0022: \u0022Sublime Cliff Hotel is located in the heart of the historic center of Sublime in an extremely vibrant and lively area within short walking distance to the sites and landmarks of the city and is surrounded by the extraordinary beauty of churches, buildings, shops and monuments.\n"
}