{
  "Id": "583",
  "Title": "\u0022Choosing the Right Azure AI Search Pricing Tier\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe valuemust not be empty and must between 0 to 100. For example, the maximumnumber of S2 services is 8. If you want 12 services, you would request 4 of S2services.9. When you\u0027re finished, select Save and continue to continue creating your supportrequest.10. Provide the additional information required to file the request, and then selectNext.\r\n11. On Review \u002B create, review the details that you\u0027ll send to support, and then selectCreate.After provisioning a service, you can continue in the portal to create your first index.Want to optimize and save on your cloud spending?Next stepsQuickstart: Create an Azure AI Search index in the portalStart analyzing costs with Cost ManagementChoose a service tier for Azure AI SearchArticle•11/21/2023Part of creating a search service is choosing a pricing tier (or SKU) that\u0027s fixed for the lifetime of theservice. In the portal, tier is specified in the Select Pricing Tier page when you create the service.\r\nIfyou\u0027re provisioning through PowerShell or Azure CLI instead, the tier is specified through the -SkuparameterThe tier you select determines:Maximum number of indexes and other objects allowed on the serviceSize and speed of partitions (physical storage)Billable rate as a fixed monthly cost, but also an incremental cost if you add capacityIn a few instances, the tier you choose determines the availability of premium features.\r\nPricing - or the estimated monthly cost of running the service - are shown in the portal\u0027s Select PricingTier page. You should check service pricing to learn about estimated costs.Tiers include Free, Basic, Standard, and Storage Optimized. Standard and Storage Optimized areavailable with several configurations and capacities. The following screenshot from Azure portal showsthe available tiers, minus pricing (which you can find in the portal and on the pricing page).Free creates a limited search service for smaller projects, like running tutorials and code samples.Internally, system resources are shared among multiple subscribers. You can\u0027t scale a free service or runsignificant workloads. You can only have one free search service per Azure subscription.The most commonly used billable tiers include the following:Basic has just one partition but with the ability to meet SLA with its support for three replicas.\n"
}