{
  "Id": "514",
  "Title": "\u0022Chunked Indexing and Integrated Vectorization in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAssuming a large PDF as a source document, the primaryindex might have basic information (title, date, author, description), and asecondary index has the chunks of content. Vectorization at the data chunk levelmakes it easier to find relevant information (each chunk is searchable) and return arelevant response, especially in a chat-style search app.\r\nChunking is a process of dividing content into smaller manageable parts (chunks) thatcan be processed independently. Chunking is required if source documents are toolarge for the maximum input size of embedding or large language models, but youmight find it gives you a better index structure for RAG patterns and chat-style search.The following diagram shows the components of chunked indexing.\r\nBenefits of integrated vectorizationChunked indexesConfigure a vectorizer in a search indexConfigure index projections in a skillsetNext stepsDebug Sessions in Azure AI SearchArticle•11/15/2023Debug Sessions is a visual editor that works with an existing skillset in the Azure portal,exposing the structure and content of a single enriched document, as it\u0027s produced byan indexer and skillset for the duration of the session.\r\nBecause you\u0027re working with a livedocument, the session is interactive - you can identify errors, modify and invoke skillexecution, and validate the results in real time. If your changes resolve the problem, youcan commit them to a published skillset to apply the fixes globally.When you start a session, the search service creates a copy of the skillset, indexer, and adata source containing a single document used to test the skillset. All session state issaved to a new blob container created by the Azure AI Search service in an AzureStorage account that you provide. The name of the generated container has a prefix of\u0022ms-az-cognitive-search-debugsession\u0022. The prefix is required because it mitigates thechance of accidentally exporting session data to another container in your account.A cached copy of the enriched document and skillset is loaded into the visual editor sothat you can inspect the content and metadata of the enriched document, with theability to check each document node and edit any aspect of the skillset definition. Anychanges made within the session are cached. Those changes will not affect thepublished skillset unless you commit them. Committing changes will overwrite theproduction skillset.\n"
}