{
  "Id": "1616",
  "Title": "\u0022Collection Filtering in Azure AI Search: Lambda Expressions Explained\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe first two iterate over a collection field, applying a predicate given in the formof a lambda expression to each element of the collection.An expression using all returns true if the predicate is true for every elementof the collection.An expression using any returns true if the predicate is true for at least oneelement of the collection.The third form of collection filter uses any without a lambda expression to testwhether a collection field is empty.\r\nIf the collection has any elements, it returnsSyntaxcollection_filter_expression ::=    field_path\u0027/all(\u0027 lambda_expression \u0027)\u0027    | field_path\u0027/any(\u0027 lambda_expression \u0027)\u0027    | field_path\u0027/any()\u0027lambda_expression ::= identifier \u0027:\u0027 boolean_expressionOData syntax diagram for Azure AI Search７ NoteSee OData expression syntax reference for Azure AI Search for the completeEBNF.true.\r\nIf the collection is empty, it returns false.A lambda expression in a collection filter is like the body of a loop in a programminglanguage. It defines a variable, called the range variable, that holds the current elementof the collection during iteration. It also defines another boolean expression that is thefilter criteria to apply to the range variable for each element of the collection.\r\nMatch documents whose tags field contains exactly the string \u0022wifi\u0022:textMatch documents where every element of the ratings field falls between 3 and 5,inclusive:textMatch documents where any of the geo coordinates in the locations field is within thegiven polygon:textMatch documents where the rooms field is empty:textMatch documents where (for all rooms) the rooms/amenities field contains \u0022tv\u0022, androoms/baseRate is less than 100:textExamplestags/any(t: t eq \u0027wifi\u0027)ratings/all(r: r ge 3 and r le 5)locations/any(loc: geo. intersects(loc, geography\u0027POLYGON((-122.031577 47.578581, -122.031577 47.678581, -122.131577 47.678581, -122.031577 47.\n578581))\u0027))not rooms/any()Not every feature of filter expressions is available inside the body of a lambdaexpression. The limitations differ depending on the data type of the collection field thatyou want to filter. The following table summarizes the limitations.Data typeFeatures allowed inlambda expressions withanyFeatures allowed inlambda expressionswith allCollection(Edm.\n"
}