{
  "Id": "664",
  "Title": "\u0022Comparison of Microsoft Azure Search Client Operations and APIs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfClient operationsMicrosoft.Azure.Search (v10)Azure.Search.Documents (v11)Targets the documentscollection of an index(queries and data import)SearchIndexClientSearchClientTargets index-related objects(indexes, analyzers, synonymmapsSearchServiceClientSearchIndexClientTargets indexer-relatedobjects (indexers, datasources, skillsets)SearchServiceClientSearchIndexerClient (new)Besides the client differences (noted previously and thus omitted here), multiple otherAPIs have been renamed and in some cases redesigned.\r\nClass name differences arePackage comparisonClient comparisonＵ CautionNotice that SearchIndexClient exists in both versions, but targets differentoperations.\r\nIn version 10, SearchIndexClient creates indexes and other objects. Inversion 11, SearchIndexClient works with existing indexes, targeting the documentscollection with query and data ingestion APIs. To avoid confusion when updatingcode, be mindful of the order in which client references are updated.\r\nFollowing thesequence in Steps to upgrade should help mitigate any string replacement issues.Naming and other API differencessummarized in the following sections. This list isn\u0027t exhaustive but it does group APIchanges by task, which can be helpful for revisions on specific code blocks. For anitemized list of API updates, see the change log for Azure.Search.Documents onGitHub.\r\nVersion 10Version 11 equivalentSearchCredentialsAzureKeyCredentialEncryptionKey (Undocumented in API reference. Support for thisAPI transitioned to generally available in v10, but was onlyavailable in the preview SDK)SearchResourceEncryptionKeyVersion 10Version 11 equivalentIndexSearchIndexFieldSearchFieldDataTypeSearchFieldDataTypeItemErrorSearchIndexerErrorAnalyzerLexicalAnalyzer (also, AnalyzerName to LexicalAnalyzerName)AnalyzeRequestAnalyzeTextOptionsStandardAnalyzerLuceneStandardAnalyzerStandardTokenizerLuceneStandardTokenizer (also, StandardTokenizerV2 toLuceneStandardTokenizerV2)TokenInfoAnalyzedTokenInfoTokenizerLexicalTokenizer (also, TokenizerName to LexicalTokenizerName)SynonymMap.\n"
}