{
  "Id": "483",
  "Title": "\u0022Comprehensive Indexing Process for Document Retrieval and Search Engine Handoff\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor each document it receives, an indexer implements or coordinates multiple steps,from document retrieval to a final search engine \u0022handoff\u0022 for indexing. Optionally, anindexer also drives skillset execution and outputs, assuming a skillset is defined.Stages of indexingStage 1: Document crackingDocument cracking is the process of opening files and extracting content.\r\nText-basedcontent can be extracted from files on a service, rows in a table, or items in container orcollection. If you add a skillset and image skills, document cracking can also extractimages and queue them for image processing.\r\nDepending on the data source, the indexer will try different operations to extractpotentially indexable content:When the document is a file with embedded images, such as a PDF, the indexerextracts text, images, and metadata. Indexers can open files from Azure BlobStorage, Azure Data Lake Storage Gen2, and SharePoint.When the document is a record in Azure SQL, the indexer will extract non-binarycontent from each field in each record.\r\nWhen the document is a record in Azure Cosmos DB, the indexer will extract non-binary content from fields and subfields from the Azure Cosmos DB document.An indexer extracts text from a source field and sends it to a destination field in an indexor knowledge store. When field names and data types coincide, the path is clear.However, you might want different names or types in the output, in which case youneed to tell the indexer how to map the field.To specify field mappings, enter the source and destination fields in the indexerdefinition.Field mapping occurs after document cracking, but before transformations, when theindexer is reading from the source documents. When you define a field mapping, thevalue of the source field is sent as-is to the destination field with no modifications.Skillset execution is an optional step that invokes built-in or custom AI processing.Skillsets can add optical character recognition (OCR) or other forms of image analysis ifthe content is binary. Skillsets can also add natural language processing. For example,you can add text translation or key phrase extraction.Whatever the transformation, skillset execution is where enrichment occurs. If an indexeris a pipeline, you can think of a skillset as a \u0022pipeline within the pipeline\u0022.\n"
}