{
  "Id": "1516",
  "Title": "\u0022Comprehensive Guide to Vector Search in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis sample provides detailed guidance on indexing vector fields anddemonstrates how to perform vector search.Additionally, for more comprehensive information about Vector Search, including itsconcepts and usage, you can refer to the documentation. The documentation providesin-depth explanations and guidance on leveraging the power of Vector Search in AzureCognitive Search.The following examples all use a simple Hotel data set that you can import into yourown index from the Azure portal. These are just a few of the basics - please check outour Samples for much more.\r\nQueryingUse SearchDocument like a dictionary for search resultsUse Java model for search resultsSearch OptionsCreating an indexAdding documents to your indexRetrieving a specific document from your indexAsync APIsCreate a client that can authenticate in a national cloudThere are two ways to interact with the data returned from a search query.\r\nLet\u0027s explore them with a search for a \u0022luxury\u0022 hotel.ExamplesQueryingSearchDocument is the default type returned from queries when you don\u0027t provide yourown. Here we perform the search, enumerate over the results, and extract data usingSearchDocument\u0027s dictionary indexer.JavaDefine a Hotel class.JavaUse it in place of SearchDocument when querying.\r\nJavaUse SearchDocument like a dictionary for search resultsfor (SearchResult searchResult : SEARCH_CLIENT.search(\u0022luxury\u0022)) {    SearchDocument doc = searchResult.getDocument(SearchDocument.class);    String id = (String) doc.get(\u0022hotelId\u0022);    String name = (String) doc.get(\u0022hotelName\u0022);    System.out.printf(\u0022This is hotelId %s, and this is hotel name %s. %n\u0022, id, name);}Use Java model class for search resultspublic class Hotel {    private String id;    private String name;    public String getId() {        return id;    }    public Hotel setId(String id) {        this.id = id;        return this;    }    public String getName() {        return name;    }    public Hotel setName(String name) {        this.\n"
}