{
  "Id": "566",
  "Title": "\u0022Compliance Standard Mapping for Azure Policy and Security Events\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf6.9 Events tobe loggedResource logs in Searchservices should be enabled5.0.0To review how the available Azure Policy built-ins for all Azure services map to thiscompliance standard, see Azure Policy Regulatory Compliance - RMIT Malaysia. Formore information about this compliance standard, see RMIT Malaysia.\r\n(Azure portal)(GitHub)NZ ISM Restricted v3.5ﾉExpand table(Azure portal)(GitHub)RMIT MalaysiaﾉExpand tableDomainControlIDControl titlePolicyPolicyversionSecurity ofDigitalServices10.66Security ofDigital Services -10.66Deploy Diagnostic Settings forSearch Services to Event Hub2.0.0Security ofDigitalServices10.66Security ofDigital Services -10.\r\n66Deploy Diagnostic Settings forSearch Services to Log Analyticsworkspace1.0.0To review how the available Azure Policy built-ins for all Azure services map to thiscompliance standard, see Azure Policy Regulatory Compliance details for SWIFT CSP-CSCF v2021. For more information about this compliance standard, see SWIFT CSP CSCFv2021.\r\nDomainControlIDControl titlePolicyPolicyversionDetect Anomalous Activityto Systems or TransactionRecords6.4Logging andMonitoringResource logs in Searchservices should beenabled5.0.0To review how the available Azure Policy built-ins for all Azure services map to thiscompliance standard, see Azure Policy Regulatory Compliance details for SWIFT CSP-CSCF v2022.\r\nFor more information about this compliance standard, see SWIFT CSP CSCFv2022.DomainControlIDControl titlePolicyPolicyversion6. Detect AnomalousActivity to Systems6.4Record security events anddetect anomalous actions andResource logs inSearch services5.0. 0(Azure portal)(GitHub)SWIFT CSP-CSCF v2021ﾉExpand table(Azure portal)(GitHub)SWIFT CSP-CSCF v2022ﾉExpand table(Azure portal)(GitHub)DomainControlIDControl titlePolicyPolicyversionor TransactionRecordsoperations within the localSWIFT environment.should beenabledLearn more about Azure Policy Regulatory Compliance.See the built-ins on the Azure Policy GitHub repo.\n"
}