{
  "Id": "753",
  "Title": "\u0022Comparing Lucene and Microsoft Analyzers: Language Analysis in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure Cognitive Search supports 35 language analyzers backed by Lucene, and 50language analyzers backed by proprietary Microsoft natural language processingtechnology used in Office and Bing.Some developers might prefer the more familiar, simple, open-source solution ofLucene. Lucene language analyzers are faster, but the Microsoft analyzers haveadvanced capabilities, such as lemmatization, word decompounding (in languages likeGerman, Danish, Dutch, Swedish, Norwegian, Estonian, Finnish, Hungarian, Slovak) andentity recognition (URLs, emails, dates, numbers).\r\nIf possible, you should runcomparisons of both the Microsoft and Lucene analyzers to decide which one is a betterfit. You can use Analyze API to see the tokens generated from a given text using aspecific analyzer.Indexing with Microsoft analyzers is on average two to three times slower than theirLucene equivalents, depending on the language. Search performance shouldn\u0027t besignificantly affected for average size queries.The default analyzer is Standard Lucene, which works well for English, but perhaps notas well as Lucene\u0027s English analyzer or Microsoft\u0027s English analyzer.Lucene\u0027s English analyzer extends the Standard analyzer.\r\nIt removes possessives(trailing \u0027s) from words, applies stemming as per Porter Stemming algorithm, andremoves English stop words.Microsoft\u0027s English analyzer performs lemmatization instead of stemming. Thismeans it can handle inflected and irregular word forms much better which resultsin more relevant search results. Set the analyzer during index creation before it\u0027s loaded with data.Comparing Lucene and Microsoft AnalyzersEnglish analyzersHow to specify a language analyzer1. In the field definition, make sure the field is attributed as \u0022searchable\u0022 and is oftype Edm.String.2. Set the \u0022analyzer\u0022 property to one of the language analyzers from the supportedanalyzers list.\n"
}