{
  "Id": "1733",
  "Title": "\u0022Configuring Document Extraction: Optional Parameters and Supported Configuration Properties\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf dataToExtract isn\u0027tdefined explicitly, it will be set to contentAndMetadata.Set to allMetadata to extract only the metadataproperties for the content type (for example, metadataunique to just .png files).configurationSee below.A dictionary of optional parameters that adjust how thedocument extraction is performed.\r\nSee the below table fordescriptions of supported configuration properties.ConfigurationParameterAllowed ValuesDescriptionimageActionnonegenerateNormalizedImagesgenerateNormalizedImagePerPageSet to none to ignore embeddedimages or image files in the dataset, or if the source data doesn\u0027tinclude image files. This is thedefault.For OCR and image analysis, setto generateNormalizedImages tohave the skill create an array ofnormalized images as part ofdocument cracking. This actionSkill parametersConfigurationParameterAllowed ValuesDescriptionrequires that parsingMode is set todefault and dataToExtract is setto contentAndMetadata.\r\nAnormalized image refers to extraprocessing resulting in uniformimage output, sized and rotatedto promote consistent renderingwhen you include images in visualsearch results (for example, same-size photographs in a graphcontrol as seen in the JFKdemo). This information isgenerated for each image whenyou use this option.\r\nIf you set togenerateNormalizedImagePerPage,PDF files are treated differently inthat instead of extractingembedded images, each page isrendered as an image andnormalized accordingly. Non-PDFfile types are treated the same asif generateNormalizedImages wasset.normalizedImageMaxWidthAny integer between 50-10000The maximum width (in pixels) fornormalized images generated. The default is 2000.normalizedImageMaxHeightAny integer between 50-10000The maximum height (in pixels)for normalized images generated.The default is 2000.７ NoteThe default of 2000 pixels for the normalized images maximum width and height isbased on the maximum sizes supported by the OCR skill and the image analysisskill.\n"
}