{
  "Id": "850",
  "Title": "\u0022Configuring Azure Cognitive Search Service for SQL Server Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRemoving the role membership anduser can be accomplished by running the following commands:SQLIn this section you\u0027ll, give your Azure Cognitive Search service permission to read datafrom your SQL Server. For detailed steps, see Assign Azure roles using the Azure portal.1. In the Azure portal, navigate to your Azure SQL Server page.2. Select Access control (IAM).\r\n3. Select Add \u003E Add role assignment.4. On the Role tab, select the appropriate Reader role.5. On the Members tab, select Managed identity, and then select Select members.6. Select your Azure subscription.7. If you\u0027re using a system-assigned managed identity, select System-assignedmanaged identity, search for your search service, and then select it.\r\n8. Otherwise, if you\u0027re using a user-assigned managed identity, select User-assignedmanaged identity, search for the name of the user-assigned managed identity,sp_droprolemember \u0027db_datareader\u0027, [insert your search service name or user-assigned managed identity name]; DROP USER IF EXISTS [insert your search service name or user-assigned managed identity name];2 - Add a role assignmentand then select it.\r\n9. On the Review \u002B assign tab, select Review \u002B assign to assign the role.Create the data source and provide either a system-assigned managed identity or auser-assigned managed identity (preview).The REST API, Azure portal, and the .\r\nNET SDK support system-assigned managedidentity.When you\u0027re connecting with a system-assigned managed identity, the only change tothe data source definition is the format of the \u0022credentials\u0022 property. You\u0027ll provide anInitial Catalog or Database name and a ResourceId that has no account key or password. The ResourceId must include the subscription ID of Azure SQL Database, the resourcegroup of SQL Database, and the name of the SQL database.Here\u0027s an example of how to create a data source to index data from a storage accountusing the Create Data Source REST API and a managed identity connection string. Themanaged identity connection string format is the same for the REST API, .\n"
}