{
  "Id": "1442",
  "Title": "\u0022Configuring Private Connections for Azure Cognitive Search and PaaS Resources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfLocate the storage account on the portal and open Networking on the leftnavigation pane.2. In the Firewall and virtual networks tab, choose Selected networks.3. Add the IP addresses obtained previously in the address range and select Save.You should have rules for the search service, Azure portal (optional), plus all of theIP addresses for the \u0022AzureCognitiveSearch\u0022 service tag for your region.}},Add IP addresses to IP firewall rulesIt can take five to ten minutes for the firewall rules to be updated, after which indexersshould be able to access storage account data behind the firewall.\r\nConfigure Azure Storage firewallsConfigure an IP firewall for Azure Cosmos DBConfigure IP firewall for Azure SQL ServerNext StepsMake outbound connections through ashared private linkArticle•07/24/2023This article explains how to configure private, outbound calls from Azure CognitiveSearch to an Azure PaaS resource that runs within a virtual network.\r\nSetting up a private connection allows a search service to connect to a virtual network IPaddress instead of a port that\u0027s open to the internet. The object created for theconnection is called a shared private link. On the connection, Search uses the sharedprivate link internally to reach an Azure PaaS resource inside the network boundary.Shared private link is a premium feature that\u0027s billed by usage.\r\nWhen you set up ashared private link, charges for the private endpoint are added to your Azure invoice. Asyou use the shared private link, data transfer rates for inbound and outbound access arealso invoiced. For details, see Azure Private Link pricing. Cognitive Search makes outbound calls to other Azure PaaS resources in the followingscenarios:Indexer connection requests to supported data sourcesIndexer (skillset) connections to Azure Storage for caching enrichments or writingto a knowledge storeEncryption key requests to Azure Key VaultCustom skill requests to Azure Functions or similar resourceIn service-to-service communications, Search typically sends a request over a publicinternet connection.\n"
}