{
  "Id": "550",
  "Title": "\u0022Configuring Private Endpoint Connections for Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA private endpoint connection will accept requests from the private indexer executionenvironment, but not the multi-tenant environment. You\u0027ll need to disable multi-tenantexecution as described in step 3 to meet this requirement.Working with a private endpointBilling impact of Azure Private LinkStep 1: Create a private endpoint to the secure resourceWhen the (asynchronous) operation that creates a shared private link resourcecompletes, a private endpoint connection will be created in a \u0022Pending\u0022 state.\r\nNo trafficflows over the connection yet.You\u0027ll need to locate and approve this request on your secure resource. Depending onthe resource, you can complete this task using Azure portal. Otherwise, use the PrivateLink Service REST API.\r\nFor private endpoint connections, it\u0027s mandatory to set the executionEnvironment of theindexer to \u0022Private\u0022. This step ensures that all indexer execution is confined to theprivate environment provisioned within the search service.This setting is scoped to an indexer and not the search service. If you want all indexersto connect over private endpoints, each one must have the following configuration:JSONOnce you have an approved private endpoint to a resource, indexers that are set to beprivate attempt to obtain access via the private link that was created and approved forthe Azure resource.Azure Cognitive Search will validate that callers of the private endpoint have appropriateAzure RBAC role permissions.\r\nFor example, if you request a private endpoint connectionto a storage account with read-only permissions, this call will be rejected.If the private endpoint isn\u0027t approved, or if the indexer didn\u0027t use the private endpointconnection, you\u0027ll find a transientFailure error message in indexer execution history. Step 2: Approve the private endpoint connectionStep 3: Force indexers to run in the \u0022private\u0022 environment    {      \u0022name\u0022 : \u0022myindexer\u0022,      ... other indexer properties      \u0022parameters\u0022 : {          ... other parameters          \u0022configuration\u0022 : {            ... other configuration properties            \u0022executionEnvironment\u0022: \u0022Private\u0022          }        }    }A search service stores indexes and synonym lists.\n"
}