{
  "Id": "1734",
  "Title": "\u0022Configuring Maximum Image Height for Azure Search PDF Processing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe default is 2000.normalizedImageMaxHeightAny integer between 50-10000The maximum height (in pixels)for normalized images generated.The default is 2000.７ NoteThe default of 2000 pixels for the normalized images maximum width and height isbased on the maximum sizes supported by the OCR skill and the image analysisskill.\r\nThe OCR skill supports a maximum width and height of 4200 for non-Englishlanguages, and 10000 for English. If you increase the maximum limits, processingcould fail on larger images depending on your skillset definition and the languageof the documents.Input nameDescriptionfile_dataThe file that content should be extracted from.\r\nThe \u0022file_data\u0022 input must be an object defined as:JSONAlternatively, it can be defined as:JSONThe file reference object can be generated one of three ways:Setting the allowSkillsetToReadFileData parameter on your indexer definition to\u0022true\u0022. This creates a path /document/file_data that is an object representing theoriginal file data downloaded from your blob data source.\r\nThis parameter onlyapplies to files in Blob storage.Setting the imageAction parameter on your indexer definition to a value other thannone. This creates an array of images that follows the required convention forinput to this skill if passed individually (that is, /document/normalized_images/*).\r\nHaving a custom skill return a json object defined EXACTLY as above. The $typeparameter must be set to exactly file and the data parameter must be the base64 encoded byte array data of the file content, or the url parameter must be acorrectly formatted URL with access to download the file at that location. Skill inputs{  \u0022$type\u0022: \u0022file\u0022,  \u0022data\u0022: \u0022BASE64 encoded string of the file\u0022}{  \u0022$type\u0022: \u0022file\u0022,  \u0022url\u0022: \u0022URL to download file\u0022,  \u0022sasToken\u0022: \u0022OPTIONAL: SAS token for authentication if the URL provided is for a file in blob storage\u0022}Skill outputsOutput nameDescriptioncontentThe textual content of the document.\n"
}