{
  "Id": "1430",
  "Title": "\u0022Configuring Trusted Service Connection for Azure AI Search and Storage\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf７ NoteIf Azure Storage is behind a firewall and in the same region as Azure AI Search, youwon\u0027t be able to create an inbound rule that admits requests from your searchservice. The solution for this scenario is for search to connect as a trusted service, asdescribed in this article.Prerequisites７ NoteIn Azure AI Search, a trusted service connection is limited to blobs and ADLS Gen2on Azure Storage.\r\nIt\u0027s unsupported for indexer connections to Azure Table Storageand Azure File Storage.A trusted service connection must use a system managed identity. A user-assignedmanaged identity isn\u0027t currently supported for this scenario.Check service identity2. On the Identity page, make sure that a system assigned identity is enabled.Remember that user-assigned managed identities, currently in preview, won\u0027t workfor a trusted service connection.1. Sign in to the Azure portal and find your storage account.2. In the left navigation pane under Security \u002B networking, select Networking.3. On the Firewalls and virtual networks tab, allow access from Selected networks.4.\r\nScroll down to the Exceptions section.Check network settings5. Make sure the checkbox is selected for Allow Azure services on the trustedservices list to access this storage account.This option will only permit the specific search service instance with appropriaterole-based access to the storage account (strong authentication) to access data inthe storage account, even if it\u0027s secured by IP firewall rules.A system managed identity is a Microsoft Entra login. The assignment needs StorageBlob Data Reader at a minimum.1. In the left navigation pane under Access Control, view all role assignments andmake sure that Storage Blob Data Reader is assigned to the search service systemidentity. 2. Add Storage Blob Data Contributor if write access is required.Features that require write access include enrichment caching, debug sessions, andknowledge store.Check permissionsThe easiest way to test the connection is by running the Import data wizard.1. Start the Import data wizard, selecting the Azure Blob Storage or Azure Data LakeStorage Gen2.2. Choose a connection to your storage account, and then select System-assigned.Select Next to invoke a connection. If the index schema is detected, the connectionsucceeded.\n"
}