{
  "Id": "1558",
  "Title": "\u0022Configuring Azure Cognitive Search: IP Rules and Service SKUs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIpRule[]NameDescriptionValuevalueValue corresponding to a single IPv4 address (eg., 123.1.2.3) or an IP range inCIDR format (eg., 123.1.2.3/24) to be allowed.stringDataPlaneAadOrApiKeyAuthOptionEncryptionWithCmkNetworkRuleSetIpRuleSkuNameDescriptionValueNameDescriptionValuenameThe SKU of the search service.\r\nValid values include: \u0027free\u0027: Sharedservice. \u0027basic\u0027: Dedicated service with up to 3 replicas.\u0027standard\u0027: Dedicated service with up to 12 partitions and 12replicas. \u0027standard2\u0027: Similar to standard, but with more capacityper search unit.\r\n\u0027standard3\u0027: The largest Standard offering withup to 12 partitions and 12 replicas (or up to 3 partitions withmore indexes if you also set the hostingMode property to\u0027highDensity\u0027). \u0027storage_optimized_l1\u0027: Supports 1TB perpartition, up to 12 partitions. \u0027storage_optimized_l2\u0027: Supports2TB per partition, up to 12 partitions.\r\n\u0027\u0027basic\u0027 \u0027free\u0027 \u0027standard\u0027 \u0027standard2\u0027 \u0027standard3\u0027 \u0027storage_optimized_l1\u0027 \u0027storage_optimized_l2\u0027The following quickstart templates deploy this resource type.TemplateDescriptionWeb App with a SQL Database, Azure CosmosDB, Azure Search This template provisions a Web App, a SQLDatabase, Azure Cosmos DB, Azure Search andApplication Insights. Azure Cognitive Search service This template creates an Azure CognitiveSearch serviceAzure Cognitive Search service with privateendpoint This template creates an Azure CognitiveSearch service with a private endpoint.Quickstart templatesAzure Policy built-in definitions forAzure Cognitive SearchArticle•12/04/2023This page is an index of Azure Policy built-in policy definitions for Azure CognitiveSearch. For additional Azure Policy built-ins for other services, see Azure Policy built-indefinitions.The name of each built-in policy definition links to the policy definition in th Azureportal.\n"
}