{
  "Id": "91",
  "Title": "\u0022Configuring Azure Blob Storage for Data Extraction and Enrichment\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBecause the data is multiple rows in one CSV file, set the parsing mode to get one searchdocument for each row.1. In Connect to your data, choose Azure Blob Storage.2. For the Name, enter \u0022hotel-reviews-ds\u0022.3. For Data to extract, choose Content and Metadata.4. For Parsing mode, select Delimited text, and then select the First Line ContainsHeader checkbox.\r\nMake sure the Delimiter character is a comma (,).5. In Connection String, choose an existing connection if the storage account is inthe same subscription. Otherwise, paste in a connection string to your AzureStorage account.A connection string can be full access, having the following format:DefaultEndpointsProtocol=https;AccountName=\u003CYOUR-ACCOUNT-NAME\u003E;AccountKey=\u003CYOUR-ACCOUNT-KEY\u003E;EndpointSuffix=core.\r\nwindows.netOr, a connection string can reference a managed identity, assuming it\u0027s configuredand assigned a role in Azure Storage: ResourceId=/subscriptions/{YOUR-SUBSCRIPTION-ID}/resourceGroups/{YOUR-RESOURCE-GROUP-NAME}/providers/Microsoft.Storage/storageAccounts/{YOUR-ACCOUNT-NAME};6. In Containers, enter the name of the blob container holding the data (\u0022hotel-reviews\u0022).Your page should look similar to the following screenshot.Step 1: Create a data source7. Continue to the next page.In this wizard step, add skills for AI enrichment. The source data consists of customerreviews in English and French.\r\nSkills that are relevant for this data set include key phraseextraction, sentiment detection, and text translation. In a later step, these enrichmentsare \u0022projected\u0022 into a knowledge store as Azure tables.1. Expand Attach Cognitive Services. Free (Limited enrichments) is selected bydefault. You can use this resource because the number of records in HotelReviews-Free.csv is 19 and this free resource allows up to 20 transactions a day.2. Expand Add enrichments.3. For Skillset name, enter \u0022hotel-reviews-ss\u0022.4. For Source data field, select reviews_text.5. For Enrichment granularity level, select Pages (5000 characters chunks).6.\n"
}