{
  "Id": "1557",
  "Title": "\u0022Configuring Azure Search Service: Settings and Restrictions Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfValuesgreater than 1 are only valid for standard SKUs.For \u0027standard3\u0027 services with hostingMode set to\u0027highDensity\u0027, the allowed values are between 1and 3.intpublicNetworkAccessThis value can be set to \u0027enabled\u0027 to avoidbreaking changes on existing customerresources and templates. If set to \u0027disabled\u0027,traffic over public interface is not allowed, andprivate endpoint connections would be theexclusive access method.\r\n\u0027disabled\u0027 \u0027enabled\u0027replicaCountThe number of replicas in the search service. Ifspecified, it must be a value between 1 and 12inclusive for standard SKUs or between 1 and 3inclusive for basic SKU.intNameDescriptionValueaadOrApiKeyIndicates that either the API key or an accesstoken from Azure Active Directory can beused for authentication.\r\nDataPlaneAadOrApiKeyAuthOptionDataPlaneAuthOptionsNameDescriptionValueapiKeyOnlyIndicates that only the API key needs to beused for authentication.For Bicep, you can use the any()function.NameDescriptionValueaadAuthFailureModeDescribes what response the data planeAPI of a Search service would send forrequests that failed authentication.\r\n\u0027http401WithBearerChallenge\u0027 \u0027http403\u0027NameDescriptionValueenforcementDescribes how a search service should enforce having one or morenon customer encrypted resources.\u0027Disabled\u0027 \u0027Enabled\u0027 \u0027Unspecified\u0027NameDescriptionValueipRulesA list of IP restriction rules that defines the inbound network(s) with allowingaccess to the search service endpoint.\r\nAt the meantime, all other public IPnetworks are blocked by the firewall. These restriction rules are applied onlywhen the \u0027publicNetworkAccess\u0027 of the search service is \u0027enabled\u0027; otherwise,traffic over public interface is not allowed even with any public IP rules, andprivate endpoint connections would be the exclusive access method. IpRule[]NameDescriptionValuevalueValue corresponding to a single IPv4 address (eg., 123.1.2.3) or an IP range inCIDR format (eg., 123.1.2.3/24) to be allowed.stringDataPlaneAadOrApiKeyAuthOptionEncryptionWithCmkNetworkRuleSetIpRuleSkuNameDescriptionValueNameDescriptionValuenameThe SKU of the search service.\n"
}