{
  "Id": "547",
  "Title": "\u0022Configuring IP Firewall for Azure Cognitive Search Execution Environments\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027re using an IP firewall to control access to Azure resources,knowing about execution environments will help you set up an IP range that is inclusiveof both.For any given indexer run, Azure Cognitive Search determines the best environment inwhich to run the indexer. Depending on the number and types of tasks assigned, theindexer will run in one of two environments:A private execution environment that\u0027s internal to a search service.Indexers running in the private environment share computing resources with otherindexing and query workloads on the same search service. Typically, only indexersthat perform text-based indexing (without skillsets) run in this environment.\r\nA multi-tenant environment that\u0027s managed and secured by Microsoft at no extracost. It isn\u0027t subject to any network provisions under your control.This environment is used to offload computationally intensive processing, leavingservice-specific resources available for routine operations. Examples of resource-intensive indexer jobs include attaching skillsets, processing large documents, orprocessing a high volume of documents.The following section explains the IP configuration for admitting requests from eitherexecution environment.If the Azure resource that provides source data exists behind a firewall, you needinbound rules that admit indexer connections for all of the IPs from which an indexerrequest can originate.\r\nThe IPs include the one used by the search service and the multi-tenant environment.To obtain the IP address of the search service (and the private executionenvironment), use nslookup (or ping) to find the fully qualified domain nameIndexer execution environmentSetting up IP ranges for indexer execution(FQDN) of your search service. The FQDN of a search service in the public cloudwould be \u003Cservice-name\u003E.search.windows.net.To obtain the IP addresses of the multi-tenant environments within which anindexer might run, use the AzureCognitiveSearch service tag.Azure service tags have a published range of IP addresses for each service. You canfind these IPs using the discovery API or a downloadable JSON file.\n"
}