{
  "Id": "142",
  "Title": "\u0022Configuring Azure Search and Static Web App Deployment Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo roll back the changes, in VS Code select the Source Control icon in the Activitybar, then select each changed file in the Changes list and select the Discardchanges icon.5. Follow the prompts to provide the following information:PromptEnterSelect a resource group fornew resources.Use the resource group you created for this tutorial.Enter the name for thenew Static Web App.Create a unique name for your resource.\r\nFor example, you canprepend your name to the repository name such as,joansmith-azure-search-dotnet-samples.Select a SKUSelect the free SKU for this tutorial.Select a location for newresources.For Node.js: Select West US 2 during the Azure Functionprogramming model (PM) v4 preview. For C# and Python,select a region near you.\r\nChoose build preset toconfigure default projectstructure.Select CustomSelect the location of yourapplication codesearch-website-functions-v4/client-v4This is the path, from the root of the repository, to your staticweb app.Select the location of yourAzure Functions codesearch-website-functions-v4/api-v4This is the path, from the root of the repository, to your staticweb app.\r\nEnter the path of yourbuild output...buildThis is the path, from your static web app, to your generatedfiles.If you get an error about an incorrect region, make sure the resource group andStatic web app resource are in one of the supported regions listed in the errorresponse.6. The resource is created and a notification window appears.When the resource is created, it creates a GitHub action file on GitHub.7. Select Open Actions in GitHub from the Notifications. This opens a browserwindow pointed to your forked repo.Wait until the workflow completes before continuing. This may take a minute ortwo to finish.8. Pull the new GitHub action file to your local computer by synchronizing your localfork with your remote fork:Bashorigin refers to your forked repo.main refers to the default branch.9. In Visual Studio file explorer, find and open the workflow file in the./.github/workflows/ directory. The file path and name looks something.\n"
}