{
  "Id": "204",
  "Title": "\u0022Configuring Azure Search and Cognitive Search in Visual Studio Code\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfevent_name == \u0027pull_request\u0027 \u0026\u0026 github.event.action == \u0027closed\u0027    runs-on: ubuntu-latest    name: Close Pull Request Job    steps:      - name: Close Pull Request        id: closepullrequest        uses: Azure/static-web-apps-deploy@v1        with:          azure_static_web_apps_api_token: ${{ secrets.AZURE_STATIC_WEB_APPS_API_TOKEN_RANDOM_WORDS_1234 }}          action: \u0022close\u0022Get Cognitive Search query key in Visual StudioCodeaz search query-key list --resource-group cognitive-search-demo-rg --service-name my-cog-search-demo-svc3.\r\nKeep this query key, you\u0027ll need to use it in the next section. The query key is ableto query your Index.The Azure Function app won\u0027t return Search data until the Search secrets are in settings.1. Select Azure from the Activity Bar.2. Right-click on your Static Web Apps resource then select Open in Portal.3. Select Configuration then select \u002B Add.\r\n4. Add each of the following settings:Add configuration settings in Azure portalSettingYour Search resource valueSearchApiKeyYour Search query keySearchServiceNameYour Search resource nameSearchIndexNamegood-booksSearchFacetsauthors*,language_codeAzure Cognitive Search requires different syntax for filtering collections than itdoes for strings. Add a * after a field name to denote that the field is of typeCollection(Edm.String). This allows the Azure Function to add filters correctly toqueries.5. Select Save to save the settings.6. Return to VS Code.7. Refresh your static web app to see the application settings.1. In Visual Studio Code, open the Activity bar, and select the Azure icon.2. In the Side bar, right-click on your Azure subscription under the Static Web Appsarea and find the static web app you created for this tutorial.3. Right-click the static web app name and select Browse site.\n"
}