{
  "Id": "939",
  "Title": "\u0022Configuring Native Blob Soft Delete in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen blobs are detected in this state, a search indexer uses thisinformation to remove the corresponding document from the index.Blobs must be in an Azure Blob Storage container. The Azure AI Search native blobsoft delete policy isn\u0027t supported for blobs in ADLS Gen2.Enable soft delete for blobs.Document keys for the documents in your index must be mapped to either be ablob property or blob metadata, such as \u0022metadata_storage_path\u0022.You must use the preview REST API (api-version=2020-06-30-Preview), or theindexer Data Source configuration in the Azure portal, to configure support for softdelete.\r\nBlob versioning must not be enabled in the storage account. Otherwise, native softdelete isn\u0027t supported by design.In Blob storage, when enabling soft delete per the requirements, set the retention policyto a value that\u0027s much higher than your indexer interval schedule.\r\nIf there\u0027s an issuerunning the indexer, or if you have a large number of documents to index, there\u0027s plentyof time for the indexer to eventually process the soft deleted blobs. Azure AI Searchindexers will only delete a document from the index if it processes the blob while it\u0027s ina soft deleted state.In Azure AI Search, set a native blob soft deletion detection policy on the data source.\r\nYou can do this either from the Azure portal or by using preview REST API (api-Native blob soft delete (preview)） ImportantSupport for native blob soft delete is in preview under Supplemental Terms ofUse. The REST API version 2020-06-30-Preview provides this feature. There\u0027scurrently no .NET SDK support. Requirements for native soft deleteConfigure native soft deleteversion=2020-06-30-Preview). The following instructions explain how to set the deletedetection policy in Azure portal or through REST APIs.1. Sign in to the Azure portal.2. On the Azure AI Search service Overview page, go to New Data Source, avisual editor for specifying a data source definition.\n"
}