{
  "Id": "1010",
  "Title": "\u0022Configuring SharePoint Indexer for Azure AI Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStringThe ID of the SharePoint site.metadata_spo_library_idEdm.StringThe ID of document library.metadata_spo_item_idEdm.StringThe ID of the (document) item in the library.metadata_spo_item_last_modifiedEdm.DateTimeOffsetThe last modified date/time (UTC) of the item.metadata_spo_item_nameEdm.StringThe name of the item.metadata_spo_item_sizeEdm.\r\nInt64The size (in bytes) of the item.metadata_spo_item_content_typeEdm.StringThe content type of the item.metadata_spo_item_extensionEdm.StringThe extension of the item.metadata_spo_item_weburiEdm.StringThe URI of the item.metadata_spo_item_pathEdm.StringThe combination of the parent path and item name.The SharePoint indexer also supports metadata specific to each document type.\r\nMore information can be found in Content metadataproperties used in Azure AI Search.You can control which files are indexed by setting inclusion and exclusion criteria in the \u0022parameters\u0022 section of the indexer definition.Include specific file extensions by setting \u0022indexedFileNameExtensions\u0022 to a comma-separated list of file extensions (with a leading dot).\r\nExclude specific file extensions by setting \u0022excludedFileNameExtensions\u0022 to the extensions that should be skipped. If the same extension isin both lists, it\u0027s excluded from indexing.HTTPA single SharePoint indexer can index content from one or more document libraries. Use the \u0022container\u0022 parameter on the data sourcedefinition to indicate which sites and document libraries to index from.The data source \u0022container\u0022 section has two properties for this task: \u0022name\u0022 and \u0022query\u0022.Indexing document metadata７ NoteTo index custom metadata, \u0022additionalColumns\u0022 must be specified in the query parameter of the data source. Include or exclude by file typePUT /indexers/[indexer name]?api-version=2020-06-30{    \u0022parameters\u0022 : {         \u0022configuration\u0022 : {             \u0022indexedFileNameExtensions\u0022 : \u0022.pdf, .docx\u0022,            \u0022excludedFileNameExtensions\u0022 : \u0022.png, .\n"
}