{
  "Id": "953",
  "Title": "\u0022Configuring Azure Search with MongoDB API: Best Practices and Limitations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis is the default configuration. Lazy indexing isn\u0027t recommended andmay result in missing data.Read permissions. A \u0022full access\u0022 connection string includes a key that grantsaccess to the content, but if you\u0027re using Azure roles, make sure the search servicemanaged identity has Cosmos DB Account Reader Role permissions.\r\n） ImportantMongoDB API support is currently in public preview under supplemental Terms ofUse. Currently, there is no SDK support.PrerequisitesA REST client, such as Postman, to send REST calls that create the data source,index, and indexer.These are the limitations of this feature:Custom queries aren\u0027t supported for specifying the data set.\r\nThe column name _ts is a reserved word. If you need this field, consideralternative solutions for populating an index.The MongoDB attribute $ref is a reserved word. If you need this in your MongoDBcollection, consider alternative solutions for populating an index.\r\nAs an alternative to this connector, if your scenario has any of those requirements, youcould use the Push API/SDK or consider Azure Data Factory with an Azure CognitiveSearch index as the sink.The data source definition specifies the data to index, credentials, and policies foridentifying changes in the data. A data source is defined as an independent resource sothat it can be used by multiple indexers.\r\nFor this call, specify a preview REST API version (2020-06-30-Preview or 2021-04-30-Preview) to create a data source that connects via the MongoDB API.1. Create or update a data source to set its definition:HTTPLimitationsDefine the data sourcePOST https://[service name].search.windows. net/datasources?api-version=2021-04-30-Preview Content-Type: application/json api-key: [Search service admin key] {   \u0022name\u0022: \u0022[my-cosmosdb-mongodb-ds]\u0022,   \u0022type\u0022: \u0022cosmosdb\u0022,   \u0022credentials\u0022: {     \u0022connectionString\u0022: \u0022AccountEndpoint=https://[cosmos-account-name].documents.azure.com;AccountKey=[cosmos-account-key];Database=[cosmos-database-name];ApiKind=MongoDb;\u0022   },   \u0022container\u0022: {     \u0022name\u0022: \u0022[cosmos-db-collection]\u0022, 2.\n"
}