{
  "Id": "1743",
  "Title": "\u0022Configuring Image Normalization and Text Splitting in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo get normalized-images field, set the imageAction configuration in your indexer definition togenerateNormalizedImages as shown below:JSONBuilt-in skillsHow to define a skillsetCreate Indexer (REST)        },        {          \u0022name\u0022: \u0022itemsToInsert\u0022,           \u0022source\u0022: \u0022/document/normalized_images/*/text\u0022        },        {          \u0022name\u0022:\u0022offsets\u0022,           \u0022source\u0022: \u0022/document/normalized_images/*/contentOffset\u0022         }      ],      \u0022outputs\u0022: [        {          \u0022name\u0022: \u0022mergedText\u0022,           \u0022targetName\u0022 : \u0022merged_text\u0022        }      ]    }  ]}{  //.\r\n..rest of your indexer definition goes here ...  \u0022parameters\u0022:{    \u0022configuration\u0022:{        \u0022dataToExtract\u0022:\u0022contentAndMetadata\u0022,        \u0022imageAction\u0022:\u0022generateNormalizedImages\u0022    }  }}See alsoText split cognitive skillArticle•11/15/2023The Text Split skill breaks text into chunks of text.\r\nYou can specify whether you want tobreak the text into sentences or into pages of a particular length. This skill is especiallyuseful if there are maximum text length requirements in other skills downstream.Microsoft.Skills.Text.SplitSkillParameters are case-sensitive.Parameter nameDescriptiontextSplitModeEither pages or sentences. Pages have a configurable maximum length,but the skill attempts to avoid truncating a sentence so the actual lengthmight be smaller. Sentences are a string that terminates at sentence-ending punctuation, such as a period, question mark, or exclamationpoint, assuming the language has sentence-ending punctuation.\r\nmaximumPageLengthOnly applies if textSplitMode is set to pages. This parameter refers to themaximum page length in characters as measured by String.Length. Theminimum value is 300, the maximum is 50000, and the default value is5000. The algorithm does its best to break the text on sentenceboundaries, so the size of each chunk might be slightly less thanmaximumPageLength.pageOverlapLengthOnly applies if textSplitMode is set to pages. Each page starts with thisnumber of characters from the end of the previous page. If this parameteris set to 0, there\u0027s no overlapping text on successive pages.\n"
}