{
  "Id": "1407",
  "Title": "\u0022Configuring Conditional Access and Microsoft Entra ID for Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUpdate the remaining parameters of the policy. For example, specify which usersand groups this policy applies to.7. Save the policy.Conditional Access） ImportantIf your search service has a managed identity assigned to it, the specific searchservice will show up as a cloud app that can be included or excluded as part of theConditional Access policy.\r\nConditional Access policies can\u0027t be enforced on aspecific search service. Instead make sure you select the general Azure AI Searchcloud app.Authorize access to a search app usingMicrosoft Entra IDArticle•10/11/2023Search applications that are built on Azure Cognitive Search can now use the Microsoftidentity platform for authenticated and authorized access. On Azure, the identityprovider is Microsoft Entra ID. A key benefit of using Microsoft Entra ID is that yourcredentials and API keys no longer need to be stored in your code. Microsoft Entraauthenticates the security principal (a user, group, or service) running the application.\r\nIfauthentication succeeds, Microsoft Entra ID returns the access token to the application,and the application can then use the access token to authorize requests to AzureCognitive Search.This article shows you how to configure your client for Microsoft Entra ID:For authentication, you\u0027ll create a managed identity as the security principle. Youcould also use a different type of service principal object, but this article usesmanaged identities because they eliminate the need to manage credentials.For authorization, you\u0027ll assign an Azure role to the managed identity that grantspermissions to run queries or manage indexing jobs.Update your client code to call TokenCredential(). For example, you can get startedwith new SearchClient(endpoint, new DefaultAzureCredential()) to authenticatevia a Microsoft Entra ID using Azure.Identity.Applies to: Search Index Data Contributor, Search Index Data Reader, Search ServiceContributorIn this step, configure your search service to recognize an authorization header on datarequests that provide an OAuth2 access token.1. Sign in to the Azure portal and open the search service page.2. Select Keys in the left navigation pane.Configure role-based access for data planeAzure portal3. Choose an API access control option. We recommend Both if you wantflexibility or need to migrate apps.\n"
}