{
  "Id": "575",
  "Title": "\u0022Configuring Azure Cognitive Search: Backup and Recovery Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: Enable resource logs for the service to view the AzureCognitive Search operations logs, search metrics, and etc.Reference: Azure Cognitive Search resource logFor more information, see the Microsoft cloud security benchmark: Backup and recovery.Description: The service can be backed up by the Azure Backup service.\r\nLearn more.Microsoft Defender for Service / Product OfferingLT-4: Enable logging for security investigationFeaturesAzure Resource LogsBackup and recoveryBR-1: Ensure regular automated backupsFeaturesAzure BackupSupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.\r\nDescription: Service supports its own native backup capability (if not using AzureBackup). Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableFeature notes: Because Azure Cognitive Search isn\u0027t a primary data storage solution,Microsoft doesn\u0027t provide a formal mechanism for self-service backup and restore.However, you can backup and restore the index using your own code. Refer to: Back upand restore alternativesConfiguration Guidance: This feature is not supported to secure this service.\r\nSee the Microsoft cloud security benchmark overviewLearn more about Azure security baselinesService Native Backup CapabilityNext stepsCreate an Azure AI Search service in theportalArticle•11/15/2023Azure AI Search is an Azure resource used for adding a full text search experience tocustom apps.If you have an Azure subscription, including a trial subscription, you can create asearch service for free. Free services have limitations, but you can complete all of thequickstarts and most tutorials.The easiest way to create search service is using the Azure portal, which is covered inthis article. You can also use Azure PowerShell, Azure CLI, the Management REST API, anAzure Resource Manager service template, or a Bicep file.The following service properties are fixed for the lifetime of the service. Because they\u0027refixed, consider the usage implications as you fill in each property:Service name becomes part of the URL endpoint (review tips for helpful servicenames).\n"
}