{
  "Id": "1751",
  "Title": "\u0022Configuring AML Online Endpoint Authentication and Parameters: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThese HTTP status codes are:503 Service Unavailable429 Too Many RequestsPrerequisites@odata.typeSkill parametersParameters are case-sensitive. Which parameters you choose to use depends on whatauthentication your AML online endpoint requires, if anyParameter nameDescriptionuri(Required for key authentication) The scoring URI of the AML onlineendpoint to which the JSON payload is sent.\r\nOnly the https URI scheme isallowed.key(Required for key authentication) The key for the AML online endpoint.resourceId(Required for token authentication). The Azure Resource Managerresource ID of the AML online endpoint. It should be in the formatsubscriptions/{guid}/resourceGroups/{resource-group-name}/Microsoft.MachineLearningServices/workspaces/{workspace-name}/onlineendpoints/{endpoint_name}.region(Optional for token authentication). The region the AML online endpointis deployed in.timeout(Optional) When specified, indicates the timeout for the http client makingthe API call.\r\nIt must be formatted as an XSD \u0022dayTimeDuration\u0022 value (arestricted subset of an ISO 8601 duration value). For example, PT60S for60 seconds. If not set, a default value of 30 seconds is chosen. The timeoutcan be set to a maximum of 230 seconds and a minimum of 1 second.\r\ndegreeOfParallelism(Optional) When specified, indicates the number of calls the indexermakes in parallel to the endpoint you have provided. You can decreasethis value if your endpoint is failing under too high of a request load. Youcan raise it if your endpoint is able to accept more requests and youwould like an increase in the performance of the indexer. If not set, adefault value of 5 is used. The degreeOfParallelism can be set to amaximum of 10 and a minimum of 1.Which AML skill parameters are required depends on what authentication your AMLonline endpoint uses, if any. AML online endpoints provide two authentication options:Key-Based Authentication. A static key is provided to authenticate scoring requestsfrom AML skillsUse the uri and key parametersToken-Based Authentication.\n"
}