{
  "Id": "1420",
  "Title": "\u0022Configuring Private Endpoints for Azure Search Service: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf youreceive an error that the remote server doesn\u0027t exist, you\u0027ve successfully configureda private endpoint for your search service.When the search service endpoint is private, some portal features are disabled. You canview and manage service level information, but index, indexer, and skillset information ishidden for security reasons.\r\nServer:  UnKnown Address:  168.63.129.16 Non-authoritative answer: Name:    [search service name].privatelink.search.windows.net Address:  10.0.0.5 Aliases:  [search service name].search.windows.net Use the Azure portal to access a private searchserviceTo work around this restriction, connect to Azure portal from a browser on a virtualmachine inside the virtual network.\r\nThe portal uses the private endpoint on theconnection and gives you visibility into content and operations.1. Follow the steps to provision a VM that can access the search service through aprivate endpoint.2. On a virtual machine in your virtual network, open a browser and sign into theAzure portal.\r\nThe portal will use the private endpoint attached to the virtualmachine to connect to your search service.When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created. Resources left running cancost you money.You can delete individual resources or the resource group to delete everything youcreated in this exercise. Select the resource group on any resource\u0027s overview page, andthen select Delete.In this article, you created a VM on a virtual network and a search service with a PrivateEndpoint. You connected to the VM from the internet and securely communicated to thesearch service using Private Link. To learn more about Private Endpoint, see What isAzure Private Endpoint?.Clean up resourcesNext stepsTroubleshoot issues with Shared PrivateLinks in Azure Cognitive SearchArticle•03/14/2023A shared private link allows Azure Cognitive Search to make secure outboundconnections over a private endpoint when accessing customer resources in a virtualnetwork. This article can help you resolve errors that might occur.Creating a shared private link is search service control plane operation. You can create ashared private link using either the portal or a Management REST API.\n"
}