{
  "Id": "1431",
  "Title": "\u0022Configuring Azure Cognitive Search Service for Managed Identity Connectivity\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf2. Add Storage Blob Data Contributor if write access is required.Features that require write access include enrichment caching, debug sessions, andknowledge store.Check permissionsThe easiest way to test the connection is by running the Import data wizard.1. Start the Import data wizard, selecting the Azure Blob Storage or Azure Data LakeStorage Gen2.2. Choose a connection to your storage account, and then select System-assigned.Select Next to invoke a connection. If the index schema is detected, the connectionsucceeded.\r\nSet up and test the connectionSee alsoConnect to other Azure resources using a managed identityAzure Blob indexerAzure Data Lake Storage Gen2 indexerAuthenticate with Microsoft Entra IDAbout managed identities (Microsoft Entra ID)Connect a search service to other Azureresources using a managed identityArticle•12/16/2022You can configure an Azure Cognitive Search service to connect to other Azureresources using a system-assigned or user-assigned managed identity and an Azure roleassignment.\r\nManaged identities and role assignments eliminate the need for passingsecrets and credentials in a connection string or code.A search service at the Basic tier or above.An Azure resource that accepts incoming requests from an Azure Active Directorylogin that has a valid role assignment.\r\nCognitive Search can use a system-assigned or user-assigned managed identity onoutbound connections to Azure resources. A system managed identity is indicated whena connection string is the unique resource ID of an Azure AD-aware service orapplication. A user-assigned managed identity is specified through an \u0022identity\u0022property.A search service uses Azure Storage as an indexer data source and as a data sink fordebug sessions, enrichment caching, and knowledge store. For search features that writeback to storage, the managed identity needs a contributor role assignment as describedin the \u0022Assign a role\u0022 section. ScenarioSystem managedidentityUser-assigned managedidentity (preview)Indexer connections to supported Azuredata sources YesYesAzure Key Vault for customer-managedkeysYesYesDebug sessions (hosted in AzureStorage) YesNoPrerequisitesSupported scenarios11ScenarioSystem managedidentityUser-assigned managedidentity (preview)Enrichment cache (hosted in AzureStorage)  YesYesKnowledge Store (hosted in AzureStorage) YesYesCustom skills (hosted in AzureFunctions or equivalent)YesYes For connectivity between search and storage, your network security configurationimposes constraints on which type of managed identity you can use.\n"
}