{
  "Id": "896",
  "Title": "\u0022Configuring Azure Data Lake Storage Gen2 Indexer for Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUpload, download, and list blobs with the Azure portal (Azure Blob storage)Set up a blob indexer (Azure AI Search)Next stepsIndex data from Azure Data LakeStorage Gen2Article•03/23/2023In this article, learn how to configure an indexer that imports content from Azure DataLake Storage (ADLS) Gen2 and makes it searchable in Azure Cognitive Search.\r\nInputs tothe indexer are your blobs, in a single container. Output is a search index withsearchable content and metadata stored in individual fields.This article supplements Create an indexer with information that\u0027s specific to indexingfrom ADLS Gen2. It uses the REST APIs to demonstrate a three-part workflow commonto all indexers: create a data source, create an index, create an indexer. Data extractionoccurs when you submit the Create Indexer request.For a code sample in C#, see Index Data Lake Gen2 using Azure AD on GitHub.ADLS Gen2 with hierarchical namespace enabled.\r\nADLS Gen2 is available throughAzure Storage. When setting up a storage account, you have the option ofenabling hierarchical namespace, organizing files into a hierarchy of directoriesand nested subdirectories. By enabling a hierarchical namespace, you enable ADLSGen2.Access tiers for ADLS Gen2 include hot, cool, and archive. Only hot and cool can beaccessed by search indexers.Blobs containing text. If you have binary data, you can include AI enrichment forimage analysis. Blob content can\u0027t exceed the indexer limits for your search servicetier.Read permissions on Azure Storage. A \u0022full access\u0022 connection string includes akey that grants access to the content, but if you\u0027re using Azure roles instead, makesure the search service managed identity has Storage Blob Data Readerpermissions.Use a REST client, such as Postman app, if you want to formulate REST callssimilar to the ones shown in this article.\nPrerequisites７ NoteThe ADLS Gen2 indexer can extract text from the following document formats:CSV (see Indexing CSV blobs)EMLEPUBGZHTMLJSON (see Indexing JSON blobs)KML (XML for geographic representations)Microsoft Office formats:\n"
}