{
  "Id": "1437",
  "Title": "\u0022Configuring Azure Search Service for Managed Identity and IP Firewall Rules\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStorage/storageAccounts/storage-account-name};\u0022 } \u0022cache\u0022: {   \u0022enableReprocessing\u0022: true,   \u0022storageConnectionString\u0022: \u0022ResourceId=/subscriptions/{subscription-ID}/resourceGroups/{resource-group-name}/providers/Microsoft.Storage/storageAccounts/{storage-account-name};\u0022 } \u0022ResourceId=/subscriptions/{subscription-ID}/resourceGroups/{resource-group-name}/providers/Microsoft.Storage/storageAccounts/{storage-account-name}/{container-name};\u0022, \u0022authResourceId\u0022 tells the search service to connect using a managed identity, passingthe application ID of the target function or app in the property.\r\nJSONSecurity overviewAI enrichment overviewIndexers overviewAuthenticate with Azure Active DirectoryAbout managed identities (Azure Active Directory){   \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Custom.WebApiSkill\u0022,   \u0022description\u0022: \u0022A custom skill that can identify positions of different phrases in the source text\u0022,   \u0022uri\u0022: \u0022https://contoso.count-things.\r\ncom\u0022,   \u0022authResourceId\u0022: \u0022\u003CAzure-AD-registered-application-ID\u003E\u0022,   \u0022batchSize\u0022: 4,   \u0022context\u0022: \u0022/document\u0022,   \u0022inputs\u0022: [ ... ],   \u0022outputs\u0022: [ ...] } See alsoConfigure IP firewall rules to allowindexer connections from AzureCognitive SearchArticle•07/20/2023On behalf of an indexer, a search service issues outbound calls to an external Azureresource to pull in data during indexing. If your Azure resource uses IP firewall rules tofilter incoming calls, you need to create an inbound rule in your firewall that admitsindexer requests.This article explains how to find the IP address of your search service and configure aninbound IP rule on an Azure Storage account. While specific to Azure Storage, thisapproach also works for other Azure resources that use IP firewall rules for data access,such as Azure Cosmos DB and Azure SQL.1. Get the fully qualified domain name (FQDN) of your search service. This looks like\u003Csearch-service-name\u003E.search.windows.net.\n"
}