{
  "Id": "1438",
  "Title": "\u0022Configuring Inbound IP Rules for Azure Resources: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf your Azure resource uses IP firewall rules tofilter incoming calls, you need to create an inbound rule in your firewall that admitsindexer requests.This article explains how to find the IP address of your search service and configure aninbound IP rule on an Azure Storage account. While specific to Azure Storage, thisapproach also works for other Azure resources that use IP firewall rules for data access,such as Azure Cosmos DB and Azure SQL.1. Get the fully qualified domain name (FQDN) of your search service. This looks like\u003Csearch-service-name\u003E.search.windows.net.\r\nYou can find the FQDN by looking upyour search service on the Azure portal.７ NoteA storage account and your search service must be in different regions if you wantto define IP firewall rules. If your setup doesn\u0027t permit this, try the trusted serviceexception or resource instance rule instead.Get a search service IP address2.\r\nLook up the IP address of the search service by performing a nslookup (or a ping)of the FQDN on a command prompt. Make sure you remove the \u0022https://\u0022 prefixfrom the FQDN.3. Copy the IP address so that you can specify it on an inbound rule in the next step.In the following example, the IP address that you should copy is \u0022150.\r\n0.0.1\u0022.BashClient applications that push indexing and query requests to the search service must berepresented in an IP range. On Azure, you can generally determine the IP address bypinging the FQDN of a service (for example, ping \u003Cyour-search-service-name\u003E.search.windows.net returns the IP address of a search service). Add your client IP address to allow access to the service from the Azure portal on yourcurrent computer. Navigate to the Networking section on the left navigation pane.nslookup contoso.search.windows.netServer:  server.example.orgAddress:  10.50.10.50Non-authoritative answer:Name:    \u003Cname\u003EAddress:  150.0.0.1aliases:  contoso.search.\n"
}