{
  "Id": "466",
  "Title": "\u0022Configuring Data Sources and Skillsets in Azure Search Wizard\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can paste in a connection to a supported data source in a different subscription orregion, but the Choose an existing connection picker is scoped to the activesubscription.Not all preview data sources are guaranteed to be available in the wizard.\r\nBecause eachdata source has the potential for introducing other changes downstream, a preview datasource will only be added to the data sources list if it fully supports all of theexperiences in the wizard, such as skillset definition and index schema inference.You can only import from a single table, database view, or equivalent data structure,however the structure can include hierarchical or nested substructures. For moreinformation, see How to model complex types.Data source configuration in the wizardSkillset configuration in the wizardSkillset configuration occurs after the data source definition because the type of datasource will inform the availability of certain built-in skills.\r\nIn particular, if you\u0027re indexingfiles from Blob Storage, your choice of parsing mode of those files will determinewhether sentiment analysis is available.The wizard will add the skills you choose, but it will also add other skills that arenecessary for achieving a successful outcome.\r\nFor example, if you specify a knowledgestore, the wizard adds a Shaper skill to support projections (or physical data structures).Skillsets are optional and there\u0027s a button at the bottom of the page to skip ahead if youdon\u0027t want AI enrichment.The wizard samples your data source to detect the fields and field type. Depending onthe data source, it might also offer fields for indexing metadata. Because sampling is an imprecise exercise, review the index for the followingconsiderations:1. Is the field list accurate? If your data source contains fields that weren\u0027t picked upin sampling, you can manually add any new fields that sampling missed, andremove any that don\u0027t add value to a search experience or that won\u0027t be used in afilter expression or scoring profile.\n"
}