{
  "Id": "1001",
  "Title": "\u0022Configuring SharePoint Indexer for Azure Search: Permissions and Authentication\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSkip this step if the SharePoint site is in a different tenant.The identity isn\u0027t used for indexing, just tenant detection. You can also skip this step if you want to put the tenant ID in the connectionstring.After selecting Save, you get an Object ID that has been assigned to your search service.Configure the SharePoint indexerhttps://www.youtube-nocookie.com/embed/QmG65Vgl0JIStep 1 (Optional): Enable system assigned managed identityThe SharePoint indexer supports both delegated and application permissions. Choose which permissions you want to use based on yourscenario.We recommend app-based permissions.\r\nSee limitations for known issues related to delegated permissions.Application permissions (recommended), where the indexer runs under the identity of the SharePoint tenant with access to all sitesand files. The indexer requires a client secret. The indexer will also require tenant admin approval before it can index any content.Delegated permissions, where the indexer runs under the identity of the user or app sending the request. Data access is limited to thesites and files to which the caller has access. To support delegated permissions, the indexer requires a device code prompt to sign inon behalf of the user.\r\nIf your Microsoft Entra organization has conditional access enabled and your administrator isn\u0027t able to grant any device access fordelegated permissions, you should consider app-based permissions instead. For more information, see Microsoft Entra Conditional Accesspolicies.The SharePoint indexer uses this Microsoft Entra application for authentication.\r\n1. Sign in to the Azure portal.2. Search for or navigate to Microsoft Entra ID, then select App registrations.3. Select \u002B New registration:a. Provide a name for your app.b. Select Single tenant.c. Skip the URI designation step. No redirect URI required.d. Select Register.4. On the left, select API permissions, then Add a permission, then Microsoft Graph. If the indexer is using application API permissions, then select Application permissions and add the following:Application - Files.Read.AllApplication - Sites.Read.AllUsing application permissions means that the indexer accesses the SharePoint site in a service context. So when you run theindexer it will have access to all content in the SharePoint tenant, which requires tenant admin approval. A client secret is alsorequired for authentication. Setting up the client secret is described later in this article.If the indexer is using delegated API permissions, select Delegated permissions and add the following:Delegated - Files.Read.\n"
}