{
  "Id": "1450",
  "Title": "\u0022Configuring and Troubleshooting Shared Private Links in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSet the connection string to the private Azure PaaS resource. The format of theconnection string doesn\u0027t change for shared private link. The search serviceinvokes the shared private link internally.７ NoteIf you already have existing indexers, you can update them via the PUT API bysetting the executionEnvironment to private or using the JSON editor in the portal.\r\n5 - Test the shared private linkFor indexer workloads, the connection string is in the data source definition. Anexample of a data source might look like this:HTTP4. For indexer workloads, remember to set the execution environment in the indexerdefinition. An example of an indexer definition might look like this:HTTP5.\r\nRun the indexer. If the indexer execution succeeds and the search index ispopulated, the shared private link is working.If your indexer creation fails with \u0022Data source credentials are invalid,\u0022 check theapproval status of the shared private link before debugging the connection. If thestatus is Approved, check the properties.provisioningState property. If it\u0027sIncomplete, there might be a problem with underlying dependencies. In this case,reissue the PUT request to re-create the shared private link. You might also need torepeat the approval step.If indexers fail consistently or intermittently, check the executionEnvironmentproperty on the indexer.\r\nThe value should be set to private. If you didn\u0027t set thisproperty, and indexer runs succeeded in the past, it\u0027s because the search service {   \u0022name\u0022: \u0022my-blob-ds\u0022,   \u0022type\u0022: \u0022azureblob\u0022,   \u0022subtype\u0022: null,   \u0022credentials\u0022: {     \u0022connectionString\u0022: \u0022DefaultEndpointsProtocol=https;AccountName=\u003CYOUR-STORAGE-ACCOUNT\u003E;AccountKey=... \u0022   }\u0022name\u0022: \u0022indexer\u0022,\u0022dataSourceName\u0022: \u0022my-blob-ds\u0022,\u0022targetIndexName\u0022: \u0022my-index\u0022,\u0022parameters\u0022: {   \u0022configuration\u0022: {       \u0022executionEnvironment\u0022: \u0022private\u0022       }   },\u0022fieldMappings\u0022: []}Troubleshootingused a private environment of its own accord. A search service moves processingout of the standard environment if the system is under load.\n"
}