{
  "Id": "862",
  "Title": "\u0022Configuring IP Ranges for Azure Cognitive Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfnet The IP address ranges for the AzureCognitiveSearch service tag can be eitherobtained via the discovery API or the downloadable JSON file.For this walkthrough, assuming the search service is the Azure Public cloud, theAzure Public JSON file should be downloaded.From the JSON file, assuming the search service is in West Central US, the list of IPaddresses for the multi-tenant indexer execution environment are listed below.\r\nJSON5. Back on the Conditional Access page in Azure portal, select Named locations fromthe menu on the left, then select \u002B IP ranges location. Give your new namedlocation a name and add the IP ranges for your search service and indexerexecution environments that you collected in the last two steps.\r\n{       \u0022name\u0022: \u0022AzureCognitiveSearch.WestCentralUS\u0022,       \u0022id\u0022: \u0022AzureCognitiveSearch.WestCentralUS\u0022,       \u0022properties\u0022: {         \u0022changeNumber\u0022: 1,         \u0022region\u0022: \u0022westcentralus\u0022,         \u0022platform\u0022: \u0022Azure\u0022,         \u0022systemService\u0022: \u0022AzureCognitiveSearch\u0022,         \u0022addressPrefixes\u0022: [           \u002252.150.139.\r\n0/26\u0022,           \u002252.253.133.74/32\u0022         ]       }     } For your search service IP address, you may need to add \u0022/32\u0022 to the end ofthe IP address since it only accepts valid IP ranges.Remember that for the indexer execution environment IP ranges, you onlyneed to add the IP ranges for the region that your search service is in.6. Exclude the new Named location from the policy.a. Select Policies on the left menu.b. Select the policy that is blocking the indexer.c. Select Conditions.d. Select Locations.e. Select Exclude then add the new Named location.f. Save the changes.7. Wait a few minutes for the policy to update and enforce the new policy rules.8. Attempt to create the indexer againa.\n"
}