{
  "Id": "927",
  "Title": "\u0022Configuring Azure Search: Adding Standard Metadata Properties and Indexer\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf4. Add fields for standard metadata properties. In file indexing, the standardmetadata properties are the same as blob metadata properties. The file indexerautomatically creates internal field mappings for these properties that convertshyphenated property names to underscored property names.\r\nYou still have to addthe fields you want to use the index definition, but you can omit creating fieldmappings in the data source.metadata_storage_name (Edm.String) - the file name. For example, if youhave a file /my-share/my-folder/subfolder/resume.pdf, the value of this fieldis resume.pdf.metadata_storage_path (Edm.\r\nString) - the full URI of the file, including thestorage account. For example, https://myaccount.file.core.windows.net/my-share/my-folder/subfolder/resume.pdfmetadata_storage_content_type (Edm.String) - content type as specified bythe code you used to upload the file. For example, application/octet-stream.metadata_storage_last_modified (Edm.\r\nDateTimeOffset) - last modifiedtimestamp for the file. Azure Cognitive Search uses this timestamp to identifychanged files, to avoid reindexing everything after the initial indexing.metadata_storage_size (Edm.Int64) - file size in bytes.metadata_storage_content_md5 (Edm.String) - MD5 hash of the file content,if available.metadata_storage_sas_token (Edm.\r\nString) - A temporary SAS token that canbe used by custom skills to get access to the file. This token shouldn\u0027t bestored for later use as it might expire.Once the index and data source have been created, you\u0027re ready to create the indexer.Indexer configuration specifies the inputs, parameters, and properties controlling runtime behaviors. 1. Create or update an indexer by giving it a name and referencing the data sourceand target index:HTTP2. In the optional \u0022configuration\u0022 section, provide any inclusion or exclusion criteria. Ifleft unspecified, all files in the file share are retrieved.If both indexedFileNameExtensions and excludedFileNameExtensions parametersare present, Azure Cognitive Search first looks at indexedFileNameExtensions, thenat excludedFileNameExtensions. If the same file extension is present in both lists, itwill be excluded from indexing.3. Specify field mappings if there are differences in field name or type, or if you needmultiple versions of a source field in the search index.\n"
}