{
  "Id": "1419",
  "Title": "\u0022Configuring Private Network Access and Verifying Search Service Connectivity\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf5. Select OK.6. You may receive a certificate warning during the sign-in process. If you receive acertificate warning, select Yes or Continue.7. Once the VM desktop appears, minimize it to go back to your local desktop.In this section, you\u0027ll verify private network access to the search service and connectprivately to the using the Private Endpoint.\r\n192.168.0.0 - 192.168.255.255 (192.168/16 prefix)Connect to the VM７ NoteYou may need to select More choices \u003E Use a different account, to specifythe credentials you entered when you created the VM.Test connectionsWhen the search service endpoint is private, some portal features are disabled.\r\nYou\u0027ll beable to view and manage service level settings, but portal access to index data andvarious other components in the service, such as the index, indexer, and skillsetdefinitions, is restricted for security reasons.1. In the Remote Desktop of myVM, open PowerShell.2. Enter nslookup [search service name].search.windows.net.\r\nYou\u0027ll receive a message similar to this:3. From the VM, connect to the search service and create an index. You can followthis quickstart to create a new search index in your service using the REST API.Setting up requests from a Web API test tool requires the search service endpoint(https://[search service name].search.windows.\r\nnet) and the admin api-key youcopied in a previous step.4. Completing the quickstart from the VM is your confirmation that the service is fullyoperational.5. Close the remote desktop connection to myVM.6. To verify that your service isn\u0027t accessible on a public endpoint, open Postman onyour local workstation and attempt the first several tasks in the quickstart. If youreceive an error that the remote server doesn\u0027t exist, you\u0027ve successfully configureda private endpoint for your search service.When the search service endpoint is private, some portal features are disabled. You canview and manage service level information, but index, indexer, and skillset information ishidden for security reasons.\n"
}