{
  "Id": "696",
  "Title": "\u0022Configuring Azure Search for Nearest Neighbor Search with Vectors\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe range is 100 to 1,000. It\u0027s the number ofnearest neighbors used during search.\u0022metric\u0022 should be \u0022cosine\u0022 if you\u0027re using Azure OpenAI, otherwise usethe similarity metric associated with the embedding model you\u0027re using.Supported values are cosine, dotProduct, euclidean.The fields collection must include a field for the document key, vector fields, and anyother fields that you need for hybrid search scenarios.Vector fields are of type Collection(Edm.Single) and single-precision floating-pointvalues. A field of this type also has a dimensions property and specifies a vectorconfiguration.\r\n\u0022kind\u0022: \u0022exhaustiveKnn\u0022,             \u0022exhaustiveKnnParameters\u0022: {                 \u0022metric\u0022: \u0022cosine\u0022             }         }     ],     \u0022profiles\u0022: [       {         \u0022name\u0022: \u0022my-default-vector-profile\u0022,         \u0022algorithm\u0022: \u0022my-hnsw-config-2\u0022       }     ] }Add a vector field to the fields collectionUse this version if you want generally available features only.\r\n1. Use the Create or Update Index to create the index.2. Define a vector field with the following attributes. You can store onegenerated embedding per field. For each vector field:type must be Collection(Edm.Single).\r\ndimensions is the number of dimensions generated by the embeddingmodel. For text-embedding-ada-002, it\u0027s 1536.vectorSearchProfile is the name of a profile defined elsewhere in theindex.searchable must be true.retrievable can be true or false. True returns the raw vectors (1536 ofthem) as plain text and consumes storage space. Set to true if you\u0027repassing a vector result to a downstream app.filterable, facetable, sortable must be false.3. Add filterable non-vector fields to the collection, such as \u0022title\u0022 withfilterable set to true, if you want to invoke prefiltering or postfiltering onthe vector query.\n"
}