{
  "Id": "1454",
  "Title": "\u0022Configuring Private Endpoint and Shared Private Link in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfazure.com/subscriptions/{{search-service-subscription-ID}}/resourceGroups/{{search service-resource-group}}/providers/Microsoft.Search/searchServices/{{search-service-name}}/sharedPrivateLinkResources/{{shared-private-link-name}}?api-version=2021-04-01-preview --body @create-pe.jsonProvide a path to the create-pe.\r\njson file if you\u0027ve navigated away from the filelocation. You can type dir at the command line to confirm the file is in the currentdirectory.4. Press Enter to run the command.When you complete these steps, you should have a shared private link that\u0027sprovisioned in a pending state. It takes several minutes to create the link.\r\nOnce it\u0027screated, the resource owner needs to approve the request before it\u0027s operational.On the SQL Managed Instance side, the resource owner must approve the privateconnection request you created.1. In the Azure portal, open the Private endpoint connections tab of the managedinstance.2. Find the section that lists the private endpoint connections.3. Select the connection, and then select Approve. It can take a few minutes for thestatus to be updated in the portal.After the private endpoint is approved, Azure AI Search creates the necessary DNS zonemappings in the DNS zone that\u0027s created for it.\r\nOn the Azure AI Search side, you can confirm request approval by revisiting the SharedPrivate Access tab of the search service Networking page. Connection state should beapproved.4 - Approve the private endpoint connection5 - Check shared private link statusYou can now configure an indexer and its data source to use an outbound privateconnection to your managed instance. You could use the Import data wizard for this step, but the indexer that\u0027s generatedwon\u0027t be valid for this scenario. You\u0027ll need to modify the indexer JSON property asdescribed in this step to make it compliant for this scenario. You\u0027ll then need to resetand rerun the indexer to fully test the pipeline using the updated indexer.\n"
}