{
  "Id": "1275",
  "Title": "\u0022Configuring Built-in and Custom Analyzers in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBuilt-in analyzers can be specified by name on an analyzer property of a field definition,with no extra configuration required in the index. The following example demonstrateshow you would set the whitespace analyzer on a field.For other scenarios and to learn more about other built-in analyzers, see Built-inanalyzers.\r\nJSONIf you\u0027re using a custom analyzer, define it in the index with a user-defined combinationof tokenizer, token filter, with possible configuration settings. Next, reference it on afield definition, just as you would a built-in analyzer.） ImportantBe aware that query parsers often lower-case terms in a search expression whenbuilding the query tree.\r\nIf you are using an analyzer that does not lower-case textinputs during indexing, and you are not getting expected results, this could be thereason. The solution is to add a lower-case token filter, as described in the \u0022Usecustom analyzers\u0022 section below.3 - Configure an analyzerUse built-in analyzers    {       \u0022name\u0022: \u0022phoneNumber\u0022,       \u0022type\u0022: \u0022Edm.\r\nString\u0022,       \u0022key\u0022: false,       \u0022retrievable\u0022: true,       \u0022searchable\u0022: true,       \u0022analyzer\u0022: \u0022whitespace\u0022     } Use custom analyzersWhen the objective is whole-term tokenization, a custom analyzer that consists of akeyword tokenizer and lower-case token filter is recommended.\r\nThe keyword tokenizer creates a single token for the entire contents of a field.The lowercase token filter transforms upper-case letters into lower-case text. Queryparsers typically lowercase any uppercase text inputs. Lower-casing homogenizesthe inputs with the tokenized terms.The following example illustrates a custom analyzer that provides the keyword tokenizerand a lowercase token filter. JSON{ \u0022fields\u0022: [   {   \u0022name\u0022: \u0022accountNumber\u0022,   \u0022analyzer\u0022:\u0022myCustomAnalyzer\u0022,   \u0022type\u0022: \u0022Edm.String\u0022,  \u0022searchable\u0022: true,   \u0022filterable\u0022: true,   \u0022retrievable\u0022: true,   \u0022sortable\u0022: false,   \u0022facetable\u0022: false   } ], \u0022analyzers\u0022: [   {   \u0022@odata.type\u0022:\u0022#Microsoft.Azure.Search.\n"
}