{
  "Id": "904",
  "Title": "\u0022Configuring and Running the ADLS Gen2 Indexer in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe indexer can read custommetadata properties, standard metadata properties, and content-specific metadataproperties.Once the index and data source have been created, you\u0027re ready to create the indexer.Indexer configuration specifies the inputs, parameters, and properties controlling runtime behaviors.\r\nYou can also specify which parts of a blob to index.        { \u0022name\u0022: \u0022metadata_storage_content_type\u0022, \u0022type\u0022: \u0022Edm.String\u0022, \u0022searchable\u0022: false, \u0022filterable\u0022: true, \u0022sortable\u0022: true },             ]   } } Configure and run the ADLS Gen2 indexer1. Create or update an indexer by giving it a name and referencing the data sourceand target index:HTTP2.\r\nSet \u0022batchSize\u0022 if the default (10 documents) is either under utilizing oroverwhelming available resources. Default batch sizes are data source specific.Blob indexing sets batch size at 10 documents in recognition of the larger averagedocument size.3. Under \u0022configuration\u0022, control which blobs are indexed based on file type, or leaveunspecified to retrieve all blobs.For \u0022indexedFileNameExtensions\u0022, provide a comma-separated list of fileextensions (with a leading dot). Do the same for \u0022excludedFileNameExtensions\u0022 toindicate which extensions should be skipped. If the same extension is in both lists,it will be excluded from indexing.4.\r\nUnder \u0022configuration\u0022, set \u0022dataToExtract\u0022 to control which parts of the blobs areindexed:\u0022contentAndMetadata\u0022 specifies that all metadata and textual contentextracted from the blob are indexed. This is the default value.\u0022storageMetadata\u0022 specifies that only the standard blob properties and user-specified metadata are indexed.POST https://[service name].search.windows. net/indexers?api-version=2020-06-30 {   \u0022name\u0022 : \u0022my-adlsgen2-indexer,   \u0022dataSourceName\u0022 : \u0022my-adlsgen2-datasource\u0022,   \u0022targetIndexName\u0022 : \u0022my-search-index\u0022,   \u0022parameters\u0022: {       \u0022batchSize\u0022: null,       \u0022maxFailedItems\u0022: null,       \u0022maxFailedItemsPerBatch\u0022: null,       \u0022base64EncodeKeys\u0022: null,       \u0022configuration:\u0022 {           \u0022indexedFileNameExtensions\u0022 : \u0022.\n"
}