{
  "Id": "1453",
  "Title": "\u0022Configuring Shared Private Link for Azure AI Search Resource\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSql/managedInstances/{{target-resource-name}}\u0022,        \u0022resourceRegion\u0022: \u0022a1b22c333d44\u0022,        \u0022groupId\u0022: \u0022managedInstance\u0022,        \u0022requestMessage\u0022: \u0022please approve\u0022,    }}2. Provide a meaningful name for the shared private link.\r\nThe shared private linkappears alongside other private endpoints. A name like \u0022shared-private-link-for-search\u0022 can remind you how it\u0027s used.3. Paste in the DNS zone name in \u0022resourceRegion\u0022 that you retrieved in an earlierstep.4. Edit the \u0022privateLinkResourceId\u0022 to reflect the private endpoint of your managedinstance.\r\nProvide the subscription ID, resource group name, and object name ofthe managed instance.5. Save the file locally as create-pe.json (or use another name, remembering toupdate the Azure CLI syntax in the next step).6. In the Azure CLI, type dir to note the current location of the file.1. From the command line, sign into Azure using az login.\r\n2. If you have multiple subscriptions, make sure you\u0027re using the one you intend touse: az account show.To set the subscription, use az account set --subscription {{subscription ID}}3. Call the az rest command to use the Management REST API of Azure AI Search.Because shared private link support for SQL managed instances is still in preview,you need a preview version of the REST API.\r\nUse 2021-04-01-preview for this step\u0060.Azure CLIProvide the subscription ID, resource group name, and service name of your AzureAI Search resource.Provide the same shared private link name that you specified in the JSON body.3 - Create a shared private linkaz rest --method put --uri https://management. azure.com/subscriptions/{{search-service-subscription-ID}}/resourceGroups/{{search service-resource-group}}/providers/Microsoft.Search/searchServices/{{search-service-name}}/sharedPrivateLinkResources/{{shared-private-link-name}}?api-version=2021-04-01-preview --body @create-pe.jsonProvide a path to the create-pe.\n"
}