{
  "Id": "688",
  "Title": "\u0022Configuring CORS for Azure Search: Best Practices and Tips\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor security reasons, only query APIssupport CORS.JSONThe following properties can be set for CORS:allowedOrigins (required): This is a list of origins that are allowed access to yourindex. JavaScript code served from these origins is allowed to query your index(assuming the caller provides a valid key or has permissions).\r\nEach origin istypically of the form protocol://\u003Cfully-qualified-domain-name\u003E:\u003Cport\u003E although\u003Cport\u003E is often omitted. For more information, see Cross-origin resource sharing(Wikipedia). TipAfter creating an index in the portal, you can copy the JSON representationand add it to your application code.\r\nSet corsOptions for cross-origin queries\u0022corsOptions\u0022: {  \u0022allowedOrigins\u0022: [    \u0022*\u0022  ],  \u0022maxAgeInSeconds\u0022: 300If you want to allow access to all origins, include * as a single item in theallowedOrigins array. This isn\u0027t a recommended practice for production searchservices but it\u0027s often useful for development and debugging.\r\nmaxAgeInSeconds (optional): Browsers use this value to determine the duration(in seconds) to cache CORS preflight responses. This must be a non-negativeinteger. A longer cache period delivers better performance, but it extends theamount of time a CORS policy needs to take effect. If this value isn\u0027t set, a defaultduration of five minutes is used.\r\nCreate Index creates the physical data structures (files and inverted indices) on yoursearch service. Once the index is created, your ability to effect changes using UpdateIndex is contingent upon whether your modifications invalidate those physicalstructures. Most field attributes can\u0027t be changed once the field is created in your index. Alternatively, you can create an index alias that serves as a stable reference in yourapplication code. Instead of updating your code, you can update an index alias to pointto newer index versions.To minimize churn in the design process, the following table describes which elementsare fixed and flexible in the schema.\n"
}