{
  "Id": "891",
  "Title": "\u0022Configuring Blob Indexer for Azure AI Search: A Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf７ NoteAlready familiar with the workflow and composition? Configure a blob indexer isyour next step.What it means to add full text search to blobdataOnce the index is created and populated, it exists independently of your blob container,but you can rerun indexing operations to refresh your index based on changeddocuments. Timestamp information on individual blobs is used for change detection.You can opt for either scheduled execution or on-demand indexing as the refreshmechanism.You need Azure AI Search, Azure Blob Storage, and a client. Azure AI Search is typicallyone of several components in a solution, where your application code issues query APIrequests and handles the response.\r\nYou might also write application code to handleindexing, although for proof-of-concept testing and impromptu tasks, it\u0027s common touse the Azure portal as the search client.Within Blob Storage, you\u0027ll need a container that provides source content. You can setfile inclusion and exclusion criteria, and specify which parts of a blob are indexed inAzure AI Search.\r\nYou can start directly in your Storage Account portal page.1. In the left navigation page under Data management, select Azure search to selector create a search service.2. Follow the steps in the wizard to extract and optionally create searchable contentfrom your blobs. The workflow is the Import data wizard. Resources used in a blob-search solution3. Use Search explorer in the search portal page to query your content.The wizard is the best place to start, but you\u0027ll discover more flexible options when youconfigure a blob indexer yourself. You can call the REST APIs using a tool like Postman.Tutorial: Index and search semi-structured data (JSON blobs) in Azure AI Search walksyou through the steps of calling the REST API in Postman.By default, most blobs are indexed as a single search document in the index, includingblobs with structured content, such as JSON or CSV, which are indexed as a single chunkof text.\n"
}