{
  "Id": "1455",
  "Title": "\u0022Configuring and Running Private Indexers in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou could use the Import data wizard for this step, but the indexer that\u0027s generatedwon\u0027t be valid for this scenario. You\u0027ll need to modify the indexer JSON property asdescribed in this step to make it compliant for this scenario. You\u0027ll then need to resetand rerun the indexer to fully test the pipeline using the updated indexer.\r\nThis article assumes Postman or equivalent tool, and uses the REST APIs to make iteasier to see all of the properties. Recall that REST API calls for indexers and datasources use the Search REST APIs, not the Management REST APIs used to create theshared private link. The syntax and API versions are different between the two REST APIs.1. Create the data source definition as you would normally for Azure SQL. The formatof the connection string is slightly different for a managed instance, but otherproperties are the same as if you were configuring a data source connection toAzure SQL database.Provide the connection string that you copied earlier.\r\nHTTP6 - Configure the indexer to run in the privateenvironmentPOST https://myservice.search.windows.net/datasources?api-version=2020-06-30 Content-Type: application/json2. Create the indexer definition, setting the indexer execution environment to\u0022private\u0022.\r\nIndexer execution occurs in either a private environment that\u0027s specific to thesearch service, or a multi-tenant environment that\u0027s used internally to offloadexpensive skillset processing for multiple customers. When connecting over aprivate endpoint, indexer execution must be private.HTTP3. Run the indexer. If the indexer execution succeeds and the search index ispopulated, the shared private link is working. api-key: admin-key {     \u0022name\u0022 : \u0022my-sql-datasource\u0022,     \u0022description\u0022 : \u0022A database for testing Azure AI Search indexes.\u0022,     \u0022type\u0022 : \u0022azuresql\u0022,     \u0022credentials\u0022 : {          \u0022connectionString\u0022 : \u0022Server=tcp:contoso.public.0000000000.database.windows.\n"
}