{
  "Id": "1447",
  "Title": "\u0022Configuring Private Endpoint Connections in Azure PaaS Resources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis sectionassumes the portal for this step, but you can also use the REST APIs of the Azure PaaSresource. Private Endpoint Connections (Storage Resource Provider) and PrivateEndpoint Connections (Cosmos DB Resource Provider) are two examples.1. In the Azure portal, open the Networking page of the Azure PaaS resource.2. Find the section that lists the private endpoint connections.\r\nThe following exampleis for a storage account.3. Select the connection, and then select Approve. It can take a few minutes for thestatus to be updated in the portal.2 - Approve the private endpoint connectionAfter the private endpoint is approved, Azure Cognitive Search creates the necessaryDNS zone mappings in the DNS zone that\u0027s created for it.\r\nOn the Azure Cognitive Search side, you can confirm request approval by revisiting theShared Private Access tab of the search service Networking page. Connection stateshould be approved.Alternatively, you can also obtain connection state by using the GET Shared Private LinkAPI..NET CLI3 - Check shared private link statusThis would return a JSON, where the connection state shows up as \u0022status\u0022 under the\u0022properties\u0022 section. Following is an example for a storage account.JSONIf the provisioning state (properties.provisioningState) of the resource is \u0022Succeeded\u0022and connection state(properties. status) is \u0022Approved\u0022, it means that the shared privatelink resource is functional and the indexer can be configured to communicate over theprivate endpoint.Indexer execution occurs in either a private environment that\u0027s specific to the searchservice, or a multi-tenant environment that\u0027s used internally to offload expensive skillsetprocessing for multiple customers.The execution environment is usually transparent, but once you start building firewallrules or establishing private connections, you have to take indexer execution intoaccount. For a private connection, configure indexer execution to always run in theprivate environment.\n"
}