{
  "Id": "928",
  "Title": "\u0022Configuring and Running File Indexer in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf1. Create or update an indexer by giving it a name and referencing the data sourceand target index:HTTP2. In the optional \u0022configuration\u0022 section, provide any inclusion or exclusion criteria. Ifleft unspecified, all files in the file share are retrieved.If both indexedFileNameExtensions and excludedFileNameExtensions parametersare present, Azure Cognitive Search first looks at indexedFileNameExtensions, thenat excludedFileNameExtensions. If the same file extension is present in both lists, itwill be excluded from indexing.3. Specify field mappings if there are differences in field name or type, or if you needmultiple versions of a source field in the search index.\r\nIn file indexing, you can often omit field mappings because the indexer has built-insupport for mapping the \u0022content\u0022 and metadata properties to similarly namedConfigure and run the file indexerPOST https://[service name].search.windows.\r\nnet/indexers?api-version=2020-06-30 {   \u0022name\u0022 : \u0022my-file-indexer\u0022,   \u0022dataSourceName\u0022 : \u0022my-file-datasource\u0022,   \u0022targetIndexName\u0022 : \u0022my-search-index\u0022,   \u0022parameters\u0022: {      \u0022batchSize\u0022: null,      \u0022maxFailedItems\u0022: null,      \u0022maxFailedItemsPerBatch\u0022: null,      \u0022base64EncodeKeys\u0022: null,      \u0022configuration\u0022: {        \u0022indexedFileNameExtensions\u0022 : \u0022.pdf,.docx\u0022,         \u0022excludedFileNameExtensions\u0022 : \u0022.png,. jpeg\u0022      }   },   \u0022schedule\u0022 : { },   \u0022fieldMappings\u0022 : [ ] } and typed fields in an index. For metadata properties, the indexer will automaticallyreplace hyphens - with underscores in the search index.4. See Create an indexer for more information about other properties.An indexer runs automatically when it\u0027s created. You can prevent this by setting\u0022disabled\u0022 to true.\n"
}