{
  "Id": "548",
  "Title": "\u0022Configuring Azure Cognitive Search for Multi-Tenant Environments\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe FQDN of a search service in the public cloudwould be \u003Cservice-name\u003E.search.windows.net.To obtain the IP addresses of the multi-tenant environments within which anindexer might run, use the AzureCognitiveSearch service tag.Azure service tags have a published range of IP addresses for each service. You canfind these IPs using the discovery API or a downloadable JSON file.\r\nIP ranges areallocated by region, so check your search service region before you start.When setting the IP rule for the multi-tenant environment, certain SQL data sourcessupport a simple approach for IP address specification. Instead of enumerating all of theIP addresses in the rule, you can create a Network Security Group rule that specifies theAzureCognitiveSearch service tag.\r\nYou can specify the service tag if your data source is either:SQL Server on Azure virtual machinesSQL Managed InstancesNotice that if you specified the service tag for the multi-tenant environment IP rule,you\u0027ll still need an explicit inbound rule for the private execution environment (meaningthe search service itself), as obtained through nslookup.\r\nWhen integrating Azure Cognitive Search into a solution that runs on a virtual network,consider the following constraints:An indexer can\u0027t make a direct connection to a virtual network service endpoint.Public endpoints with credentials, private endpoints, trusted service, and IPaddressing are the only supported methodologies for indexer connections.A search service always runs in the cloud and can\u0027t be provisioned into a specificvirtual network, running natively on a virtual machine. This functionality won\u0027t beoffered by Azure Cognitive Search. Given the above constrains, your choices for achieving search integration in a virtualnetwork are:Configure an inbound firewall rule on your Azure PaaS resource that admitsindexer requests for data.Choosing a connectivity approachConfigure an outbound connection from Search that makes indexer connectionsusing a private endpoint.For a private endpoint, the search service connection to your protected resource isthrough a shared private link. A shared private link is an Azure Private Link resourcethat\u0027s created, managed, and used from within Cognitive Search.\n"
}