{
  "Id": "1674",
  "Title": "\u0022Configuring Default Values and Custom Entity Lookup in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIfdefaultCaseSensitive value of an entity isn\u0027t specified, thisvalue will become the defaultCaseSensitive value for thatentity.globalDefaultAccentSensitive(Optional) Default accent sensitive value for the skill. IfdefaultAccentSensitive value of an entity isn\u0027t specified, thisvalue will become the defaultAccentSensitive value for thatentity.globalDefaultFuzzyEditDistance(Optional) Default fuzzy edit distance value for the skill. IfdefaultFuzzyEditDistance value of an entity isn\u0027t specified,this value will become the defaultFuzzyEditDistance value forthat entity.Input nameDescriptiontextThe text to analyze.\r\nlanguageCodeOptional. Default is \u0022en\u0022.Skill inputsSkill outputsOutputnameDescriptionOutputnameDescriptionentitiesAn array of complex types that contains the following fields:\u0022name\u0022: The top-level entity; it represents the \u0022normalized\u0022 form.\u0022id\u0022: A unique identifier for the entity as defined in the \u0022Custom EntityDefinition\u0022.\u0022description\u0022: Entity description as defined by the user in the \u0022Custom EntityDefinition Format\u0022.\u0022type\u0022: Entity type as defined by the user in the \u0022Custom Entity DefinitionFormat\u0022.\u0022subtype\u0022: Entity subtype as defined by the user in the \u0022Custom EntityDefinition Format\u0022.\r\n\u0022matches\u0022: An array of complex types that contain:\u0022text\u0022 from the source document\u0022offset\u0022 location where the match was found,\u0022length\u0022 of the text measured in characters\u0022matchDistance\u0022 or the number of characters that differ between thematch and the entity \u0022name\u0022.There are three approaches for providing the list of custom entities to the Custom EntityLookup skill:.CSV file (UTF-8 encoded). JSON file (UTF-8 encoded)Inline within the skill definitionIf the definition file is in a .CSV or .JSON file, provide the full path in the\u0022entitiesDefinitionUri\u0022 parameter. The file is downloaded at the start of each indexer run.It must remain accessible until the indexer stops.If you\u0027re using an inline definition, specify it under the \u0022inlineEntitiesDefinition\u0022 skillparameter.\n"
}