{
  "Id": "979",
  "Title": "\u0022Configuring Azure SQL Indexers for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can now run the indexer, monitor status, or schedule indexer execution. Thefollowing articles apply to indexers that pull content from Azure MySQL:Index large data setsIndexer access to content protected by Azure network security features{     …,     \u0022dataDeletionDetectionPolicy\u0022 : {         \u0022@odata.\r\ntype\u0022 : \u0022#Microsoft.Azure.Search.SoftDeleteColumnDeletionDetectionPolicy\u0022,         \u0022softDeleteColumnName\u0022 : \u0022[a column name]\u0022,         \u0022softDeleteMarkerValue\u0022 : \u0022[the value that indicates that a row is deleted]\u0022     } } Next stepsHow to index data from Azure SQL inAzure AI SearchArticle•11/15/2023In this article, learn how to configure an indexer that imports content from Azure SQLDatabase or an Azure SQL managed instance and makes it searchable in Azure AISearch.This article supplements Create an indexer with information that\u0027s specific to Azure SQL.\r\nIt uses the REST APIs to demonstrate a three-part workflow common to all indexers:create a data source, create an index, create an indexer.This article also provides:A description of the change detection policies supported by the Azure SQL indexerso that you can set up incremental indexing.\r\nA frequently-asked-questions (FAQ) section for answers to questions about featurecompatibility.An Azure SQL database with data in a single table or view, or a SQL ManagedInstance with a public endpoint.Use a table if your data is large or if you need incremental indexing using SQL\u0027snative change detection capabilities.Use a view if you need to consolidate data from multiple tables. Large views aren\u0027tideal for SQL indexer. A workaround is to create a new table just for ingestion intoyour Azure AI Search index. You\u0027ll be able to use SQL integrated change tracking,which is easier to implement than High Water Mark.７ NoteReal-time data synchronization isn\u0027t possible with an indexer. An indexer canreindex your table at most every five minutes.\n"
}