{
  "Id": "1401",
  "Title": "\u0022Configuring Role-Based Access Control for Azure Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearch IndexData ReaderDataRead-only access to all search indexes on the search service. This role isfor apps and users who run queries.Adoption of role-based access control might increase the latency of somerequests. Each unique combination of service resource (index, indexer, etc.) andservice principal used on a request triggers an authorization check.\r\nTheseauthorization checks can add up to 200 milliseconds of latency to a request.In rare cases where requests originate from a high number of different serviceprincipals, all targeting different service resources (indexes, indexers, etc.), it\u0027spossible for the authorization checks to result in throttling. Throttling would only７ NoteIf you disable Azure role-based access, built-in roles for the control plane (Owner,Contributor, Reader) continue to be available. Disabling Azure RBAC removes justthe data-related permissions associated with those roles. In a disabled-RBACscenario, Search Service Contributor is equivalent to control-plane Contributor.\r\nLimitationshappen if hundreds of unique combinations of search service resource and serviceprincipal were used within a second.Applies to: Search Index Data Contributor, Search Index Data Reader, Search ServiceContributorIn this step, configure your search service to recognize an authorization header on datarequests that provide an OAuth2 access token.\r\n1. Sign in to the Azure portal and open the search service page.2. Select Keys in the left navigation pane.3. Choose an API access control option. We recommend Both if you wantflexibility or need to migrate apps.OptionDescriptionAPI Key(default). Requires an admin or query API keys on the requestheader for authorization. No roles are used.Role-basedaccess controlRequires membership in a role assignment to complete the task,described in the next step. It also requires an authorization header.Configure role-based access for data planeAzure portalOptionDescriptionBothRequests are valid using either an API key or role-based accesscontrol.The change is effective immediately, but wait a few seconds before testing.All network calls for search service operations and content respect the option youselect: API keys, bearer token, or either one if you select Both.When you enable role-based access control in the portal, the failure mode is\u0022http401WithBearerChallenge\u0022 if authorization fails.\n"
}