{
  "Id": "1678",
  "Title": "\u0022Configuring Entity Matching Parameters in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe value of this field willappear with every match of its entity in the skill output.id(Optional) This field can be used as a passthrough for custommetadata about the matched text(s). The value of this field willappear with every match of its entity in the skill output.caseSensitive(Optional) Defaults to false.\r\nBoolean value denoting whethercomparisons with the entity name should be sensitive to charactercasing. Sample case insensitive matches of \u0022Microsoft\u0022 could be:microsoft, microSoft, MICROSOFTaccentSensitive(Optional) Defaults to false. Boolean value denoting whetheraccented and unaccented letters such as \u0027é\u0027 and \u0027e\u0027 should beidentical.\r\nfuzzyEditDistance(Optional) Defaults to 0. Maximum value of 5. Denotes theacceptable number of divergent characters that would still constitutea match with the entity name. The smallest possible fuzziness for anygiven match is returned. For instance, if the edit distance is set to 3,\u0022Windows 10\u0022 would still match \u0022Windows\u0022, \u0022Windows10\u0022 and\u0022windows 7\u0022.\r\nWhen case sensitivity is set to false, case differences do NOT counttowards fuzziness tolerance, but otherwise do.defaultCaseSensitive(Optional) Changes the default case sensitivity value for this entity. Itcan be used to change the default value of all aliases caseSensitivevalues.defaultAccentSensitive(Optional) Changes the default accent sensitivity value for this entity.It can be used to change the default value of all aliasesaccentSensitive values.defaultFuzzyEditDistance(Optional) Changes the default fuzzy edit distance value for thisentity. It can be used to change the default value of all aliasesfuzzyEditDistance values. aliases(Optional) An array of complex objects that can be used to specifyalternative spellings or synonyms to the root entity name.Alias propertiesDescriptionAlias propertiesDescriptiontextThe alternative spelling or representation of some target entity name.caseSensitive(Optional) Acts the same as root entity \u0022caseSensitive\u0022 parameter above, butapplies to only this one alias.accentSensitive(Optional) Acts the same as root entity \u0022accentSensitive\u0022 parameter above,but applies to only this one alias.fuzzyEditDistance(Optional) Acts the same as root entity \u0022fuzzyEditDistance\u0022 parameter above,but applies to only this one alias.\n"
}