{
  "Id": "846",
  "Title": "\u0022Configuring Data Sources with User-Assigned Managed Identity in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen you\u0027re connecting with a user-assigned managed identity,there are two changes to the data source definition:First, the format of the \u0022credentials\u0022 property is the database name and aResourceId that has no account key or password. The ResourceId must include thesubscription ID of Azure Cosmos DB, the resource group, and the Azure CosmosDB account name.For SQL collections, the connection string doesn\u0027t require \u0022ApiKind\u0022.For SQL collections add \u0022IdentityAuthType=AccessToken\u0022 if RBAC is enforced asthe only authentication method. It is not applicable for MongoDB and Gremlincollections.\r\nFor MongoDB collections, add \u0022ApiKind=MongoDb\u0022 to the connection stringFor Gremlin graphs, add \u0022ApiKind=Gremlin\u0022 to the connection string.Second, you\u0027ll add an \u0022identity\u0022 property that contains the collection of user-assigned managed identities. Only one user-assigned managed identity should beprovided when creating the data source. Set it to type \u0022userAssignedIdentities\u0022.\r\nPOST https://[service name].search.windows.net/datasources?api-version=2020-06-30Content-Type: application/jsonapi-key: [Search service admin key]{    \u0022name\u0022: \u0022[my-cosmosdb-ds]\u0022,    \u0022type\u0022: \u0022cosmosdb\u0022,    \u0022credentials\u0022: {        \u0022connectionString\u0022: \u0022ResourceId=/subscriptions/[subscription-id]/resourceGroups/[rg-name]/providers/Microsoft. DocumentDB/databaseAccounts/[cosmos-account-name];Database=[cosmos-database];ApiKind=[SQL | Gremlin | MongoDB];IdentityAuthType=[AccessToken | AccountKey]\u0022    },    \u0022container\u0022: { \u0022name\u0022: \u0022[my-cosmos-collection]\u0022, \u0022query\u0022: null },    \u0022dataChangeDetectionPolicy\u0022: null }User-assigned managed identity (preview)Here\u0027s an example of how to create an indexer data source object using the previewCreate or Update Data Source REST API:HTTPThe index specifies the fields in a document, attributes, and other constructs that shapethe search experience.\n"
}