{
  "Id": "1444",
  "Title": "\u0022Configuring Azure Cognitive Search with Private Endpoints: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThese versions include 2020-08-01-preview or2021-04-01-preview.Indexer execution must use the private execution environment that\u0027s specific toyour search service. Private endpoint connections aren\u0027t supported from the multi-tenant environment. The configuration setting for this requirement is covered inthis article.An Azure Cognitive Search at the Basic tier or higher.\r\nIf you\u0027re using AI enrichmentand skillsets, the tier must be Standard 2 (S2) or higher. See Service limits for７ NoteThere are two scenarios for using Azure Private Link and Azure Cognitive Searchtogether. Creating a shared private link is one scenario, relevant when an outboundconnection to Azure PaaS requires a private connection.\r\nThe second scenario isconfigure search for a private inbound connection from clients that run in a virtualnetwork. While both scenarios have a dependency on Azure Private Link, they areindependent. You can create a shared private link without having to configure yourown search service for a private endpoint.LimitationsPrerequisitesdetails.An Azure PaaS resource from the following list of supported resource types,configured to run in a virtual network.You should have a minimum of Contributor permissions on both Azure CognitiveSearch and the Azure PaaS resource for which you\u0027re creating the shared privatelink.\r\nYou can create a shared private link for the following resources.Resource typeSub-resource (or Group ID)Microsoft.Storage/storageAccounts blob, table, dfs, fileMicrosoft.DocumentDB/databaseAccounts SqlMicrosoft.Sql/serverssqlServerMicrosoft.KeyVault/vaultsvaultMicrosoft.DBforMySQL/servers (preview)mysqlServerMicrosoft.Web/sites (preview) sitesMicrosoft.Sql/managedInstances (preview) managedInstance If Azure Storage and Azure Cognitive Search are in the same region, the connection tostorage is made over the Microsoft backbone network, which means a shared privatelink is redundant for this configuration. However, if you already set up a privateendpoint for Azure Storage, you should also set up a shared private link or theconnection is refused on the storage side. Also, if you\u0027re using multiple storage formatsfor various scenarios in search, make sure to create a separate shared private link foreach sub-resource. The Microsoft.\n"
}