{
  "Id": "1391",
  "Title": "\u0022Configuring Azure RBAC and Encryption Policies for Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo use Azure role-based access control (Azure RBAC) for data plane operations, set\u0022authOptions\u0022 to \u0022aadOrApiKey\u0022 and then send the request.If you want to use Azure RBAC exclusively, turn off API key authentication by followingup with a second request, this time setting \u0022disableLocalAuth\u0022 to \u0022true\u0022.\r\nHTTPIf you\u0027re using customer-managed encryption, you can enable \u0022encryptionWithCMK\u0022with \u0022enforcement\u0022 set to \u0022Enabled\u0022 if you want the search service to report itscompliance status.\r\nWhen you enable this policy, any REST calls that create objects containing sensitive data,such as the connection string within a data source, will fail if an encryption key isn\u0027tprovided: \u0022Error creating Data Source: \u0022CannotCreateNonEncryptedResource: Thecreation of non-encrypted DataSources is not allowed when encryption policy isenforced.\u0022HTTPPATCH https://management.azure.com/subscriptions/{{subscriptionId}}/resourcegroups/{{resource-group}}/providers/Microsoft.\r\nSearch/searchServices/{{search-service-name}}?api-version=2022-09-01 {   \u0022properties\u0022: {     \u0022disableLocalAuth\u0022: false,     \u0022authOptions\u0022: {       \u0022aadOrApiKey\u0022: {         \u0022aadAuthFailureMode\u0022: \u0022http401WithBearerChallenge\u0022       }     }   } } (preview) Enforce a customer-managed keypolicyPATCH https://management.azure.com/subscriptions/{{subscriptionId}}/resourcegroups/{{resource-group}}/providers/Microsoft. Search/searchServices/{{search-service-name}}?api-version=2021-04-01-preview { Although semantic search isn\u0027t enabled by default, you could lock down the feature atthe service level.HTTPAzure Cognitive Search writes to external data sources when updating a knowledgestore, saving debug session state, or caching enrichments.\n"
}