{
  "Id": "940",
  "Title": "\u0022Configuring Native Soft Delete in Azure: Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRequirements for native soft deleteConfigure native soft deleteversion=2020-06-30-Preview). The following instructions explain how to set the deletedetection policy in Azure portal or through REST APIs.1. Sign in to the Azure portal.2. On the Azure AI Search service Overview page, go to New Data Source, avisual editor for specifying a data source definition.\r\nThe following screenshot shows where you can find this feature in the portal.3. On the New Data Source form, fill out the required fields, select the Trackdeletions checkbox and choose Native blob soft delete. Then hit Save toenable the feature on Data Source creation.Azure portalIf you restore a soft deleted blob in Blob storage, the indexer won\u0027t always reindex it.\r\nThis is because the indexer uses the blob\u0027s LastModified timestamp to determinewhether indexing is needed. When a soft deleted blob is undeleted, its LastModifiedtimestamp doesn\u0027t get updated, so if the indexer has already processed blobs with morerecent LastModified timestamps, it won\u0027t reindex the undeleted blob.\r\nTo make sure that an undeleted blob is reindexed, you\u0027ll need to update the blob\u0027sLastModified timestamp. One way to do this is by resaving the metadata of that blob.You don\u0027t need to change the metadata, but resaving the metadata will update theblob\u0027s LastModified timestamp so that the indexer knows to pick it up.\r\nThis method uses custom metadata to indicate whether a search document should beremoved from the index. It requires two separate actions: deleting the search documentfrom the index, followed by file deletion in Azure Storage.There are steps to follow in both Azure Storage and Azure AI Search, but there are noother feature dependencies. 1. In Azure Storage, add a custom metadata key-value pair to the file to indicate thefile is flagged for deletion. For example, you could name the property \u0022IsDeleted\u0022,set to false. When you want to delete the file, change it to true.2. In Azure AI Search, edit the data source definition to include a\u0022dataDeletionDetectionPolicy\u0022 property.\n"
}