{
  "Id": "935",
  "Title": "\u0022Configuring Field Mappings and Indexer Execution in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027re using the REST APIs and you want implicit field mappings, create andname the document key field \u0022Key\u0022 in the search index definition as shown in theprevious step ({ \u0022name\u0022: \u0022Key\u0022, \u0022type\u0022: \u0022Edm.String\u0022, \u0022key\u0022: true,\u0022searchable\u0022: false }). The indexer populates the Key field automatically, with nofield mappings required.\r\nIf you don\u0027t want a field named \u0022Key\u0022 in your search index, add an explicit fieldmapping in the indexer definition with the field name you want, setting the sourcefield to \u0022Key\u0022:JSON3. Now add any other entity fields that you want in your index. For example, if anentity looks like the following example, your search index should have fields forHotelName, Description, and Category to receive those values.\r\nUsing the same names and compatible data types minimizes the need for fieldmappings. When names and types are the same, the indexer can determine thedata path automatically. \u0022fieldMappings\u0022 : [    {      \u0022sourceFieldName\u0022 : \u0022Key\u0022,      \u0022targetFieldName\u0022 : \u0022MyDocumentKeyFieldName\u0022    } ] Configure and run the table indexerOnce you have an index and data source, you\u0027re ready to create the indexer.\r\nIndexerconfiguration specifies the inputs, parameters, and properties controlling run timebehaviors.1. Create or update an indexer by giving it a name and referencing the data sourceand target index:HTTP2. Specify field mappings if there are differences in field name or type, or if you needmultiple versions of a source field in the search index. The Target field is the nameof the field in the search index.JSON3. See Create an indexer for more information about other properties.An indexer runs automatically when it\u0027s created. You can prevent this by setting\u0022disabled\u0022 to true. To control indexer execution, run an indexer on demand or put it on aschedule.POST https://[service name].search.windows.\n"
}