{
  "Id": "340",
  "Title": "\u0022Configuring Azure Search: Data Source, Index, and Skillset Creation\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAfter the collection is imported, expand the actions list (...).4. Select Edit to set variables used in each request.Current valueDescriptionsearchServiceThe name of your search service (for example, if the endpoint ishttps://mydemo.search.windows.net, then the service name ismydemo).apiKeyThe primary or secondary key obtained from the Keys page ofyour search service.\r\nstorageConnectionStringThe connection string obtained from the Access Keys page ofyour Azure Storage account.Create data source, skillset, index, and indexerCurrent valueDescriptioncontainerNameThe name of the container you created for the sample data.5. Save your changes. The requests fail unless you save the variables.6.\r\nYou should see four REST calls in the collection.CreateDataSource adds clinical-trials-dsCreateSkillset adds clinical-trials-ssCreateIndex adds clinical-trialsCreateIndexer adds clinical-trials-idxr7. Open each request in turn, and select Send to send each request to the searchservice. The last one will take several minutes to complete.\r\n8. Close Postman and return to the Azure portal.The sample code intentionally creates a buggy index as a consequence of problems thatoccurred during skillset execution. The problem is that the index is missing data.1. In Azure portal, on the search service Overview page, select the Indexes tab.2. Select clinical-trials.3.\r\nEnter this query string: $select=metadata_storage_path, organizations,locations\u0026$count=true to return fields for specific documents (identified by theunique metadata_storage_path field).4. Select Search to run the query. You should see empty values for \u0022organizations\u0022and \u0022locations\u0022. These fields should have been populated through the skillset\u0027s Entity Recognition skill,used to detect organizations and locations anywhere within the blob\u0027s content. In thenext exercise, you\u0027ll debug the skillset to determine what went wrong.Another way to investigate errors and warnings is through the Azure portal.1. Open the Indexers tab and select clinical-trials-idxr.\n"
}