{
  "Id": "1042",
  "Title": "\u0022Configuring Output Field Mappings in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027re populating a knowledge store, use projections for datapath configuration.Output field mappings are applied after skillset execution or after document cracking ifthere\u0027s no associated skillset.Output field mappings are added to the outputFieldMappings array in an indexerdefinition, typically placed after the fieldMappings array. An output field mappingconsists of three parts.JSONPropertyDescriptionsourceFieldNameRequired. Specifies a path to enriched content. An example might be/document/content. See Reference annotations in an Azure Cognitive Searchskillset for path syntax and examples.targetFieldNameOptional.\r\nSpecifies the search field that receives the enriched content. Targetfields must be top-level simple fields or collections. It can\u0027t be a path to asubfield in a complex type. If you want to retrieve specific nodes in a complexstructure, you can flatten individual nodes in memory, and then send theoutput to a string collection in your index.mappingFunctionOptional. Adds extra processing provided by mapping functions supported byindexers. In the case of enrichment nodes, encoding and decoding are themost commonly used functions.You can use the REST API or an Azure SDK to define output field mappings.\r\nDefine an output field mapping\u0022fieldMappings\u0022: [] \u0022outputFieldMappings\u0022: [   {     \u0022sourceFieldName\u0022: \u0022/document/path-to-a-node-in-an-enriched-document\u0022,     \u0022targetFieldName\u0022: \u0022some-search-field-in-an-index\u0022,     \u0022mappingFunction\u0022: null   } ],  TipIndexers created by the Import data wizard include output field mappingsgenerated by the wizard. If you need examples, run the wizard over your dataUse Create Indexer (REST) or Update Indexer (REST), any API version.This example adds entities and sentiment labels extracted from a blob\u0027s contentproperty to fields in a search index.JSONFor each output field mapping, set the location of the data in the enricheddocument tree (sourceFieldName), and the name of the field as referenced in theindex (targetFieldName).\nAssign any mapping functions that you require totransform the content of a field before it\u0027s stored in the index.source to see the rendered definition.REST APIsPUT https://[service name].search.windows.\n"
}