{
  "Id": "1385",
  "Title": "\u0022Configuring Outbound Private Endpoints for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis is because you\u0027re \u0022sharing\u0022 access toa resource, such as a storage account, that has been integrated with the Azure PrivateLink service.If you\u0027re using an indexer to index data in Azure AI Search, and your data source is on aprivate network, you can create an outbound private endpoint connection to reach thedata.\r\nA full list of the Azure Resources for which you can create outbound private endpointsfrom Azure AI Search can be found here along with the related Group ID values.To create the shared private link resource, use az search shared-private-link-resourcecreate. Keep in mind that some configuration may be required for the data sourcebefore running this command.\r\naz search service update \\    --name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --partition-count 6 \\    --replica-count 6Create a shared private link resourceAzure CLITo retrieve the shared private link resources and view their status, use az search shared-private-link-resource list.\r\nAzure CLIYou\u0027ll need to approve the connection with the following command before it can beused. The ID of the private endpoint connection will need to be retrieved from the childresource. In this case, we get the connection ID from az storage.Azure CLITo delete the shared private link resource, use az search shared-private-link-resourcedelete.\r\nAzure CLIFor full details on setting up shared private link resources, see the documentation onmaking indexer connections through a private endpoint.az search shared-private-link-resource create \\    --name \u003Cspl-name\u003E \\    --service-name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --group-id blob \\    --resource-id \u0022/subscriptions/\u003Calphanumeric-subscription-ID\u003E/resourceGroups/\u003Cresource-group-name\u003E/providers/Microsoft. Storage/storageAccounts/myBlobStorage\u0022  \\    --request-message \u0022Please approve\u0022 az search shared-private-link-resource list \\    --service-name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E id = (az storage account show -n myBlobStorage --query \u0022privateEndpointConnections[0].\n"
}