{
  "Id": "1098",
  "Title": "\u0022Configuring Azure Search Postman Collections for Knowledge Store Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDownload the azure-search-postman-samples from GitHub and unzip the file.There are multiple collections in the repo. You use the collection in the knowledge-store folder.2. In Postman, select File \u003E Import to import theKnowledgeStore.postman_collection.json file.3. Select the Collections tab, and then select the ... (ellipsis) button.4. Select Edit.\r\n\u0022knowledgeStore\u0022: {    \u0022storageConnectionString\u0022: \u0022DefaultEndpointsProtocol=https;AccountName=\u003CYOUR-ACCOUNT-NAME\u003E;AccountKey=\u003CYOUR-ACCOUNT-KEY\u003E;EndpointSuffix=core.windows.net;\u0022}\u0022knowledgeStore\u0022: {    \u0022storageConnectionString\u0022: \u0022ResourceId=/subscriptions/{YOUR-SUBSCRIPTION-ID}/resourceGroups/{YOUR-RESOURCE-GROUP-NAME}/providers/Microsoft.\r\nStorage/storageAccounts/{YOUR-ACCOUNT-NAME};\u0022}Configure requests5. In the Edit dialog box, select the Variables tab.On the Variables tab, you can add values that Postman swaps in every time itencounters a specific variable inside double braces. For example, Postman replaces thesymbol {{admin-key}} with the current value that you set for admin-key.\r\nPostman makesthe substitution in URLs, headers, the request body, and so on.Variables are defined for Azure services, service connections, and object names. Replacethe service and connection placeholder values with actual values for your search serviceand storage account. You can find these values in the Azure portal.\r\nTo get the values for search-service-name and search-service-admin-key, go tothe Azure AI Search service in the portal and copy the values from Overview andKeys pages.To get the values for storage-account-name and storage-account-connection-string, check the Access Keys page in the portal, or format a connection stringthat references a managed identity. VariableWhere to get itadmin-keyOn the Keys page of the Azure AI Search service.api-versionLeave as 2020-06-30.datasource-nameLeave as hotel-reviews-ds.indexer-nameLeave as hotel-reviews-ixr.index-nameLeave as hotel-reviews-ix.search-service-nameThe name of the Azure AI Search service. If the URL ishttps://mySearchService.\n"
}