{
  "Id": "504",
  "Title": "\u0022Configuring Enrichment Outputs and Indexer Mappings in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can selectively persist just a subset of the enrichment outputs so that you\u0027re only keeping whatyou intend to use. The output field mappings in your indexer definition will determine what contentactually gets ingested in the search index. Likewise, if you\u0027re creating a knowledge store, you canmap outputs into shapes that are assigned to projections.７ NoteThe enrichment tree format enables the enrichment pipeline to attach metadata to evenprimitive data types. The metadata won\u0027t be a valid JSON object, but can be projected into avalid JSON format in projection definitions in a knowledge store. For more information, seeShaper skill.\r\nAn indexer has properties and parameters used to configure indexer execution. Among thoseproperties are mappings that set the data path to fields in a search index.There are two sets of mappings:\u0022fieldMappings\u0022 map a source field to a search field.\u0022outputFieldMappings\u0022 map a node in an enriched document to a search field.\r\nThe \u0022sourceFieldName\u0022 property specifies either a field in your data source or a node in anenrichment tree. The \u0022targetFieldName\u0022 property specifies the search field in an index that receivesthe content.Using the hotel reviews skillset as a reference point, this example explains how an enrichment treeevolves through skill execution using conceptual diagrams.\r\nThis example also shows:How a skill\u0027s context and inputs work to determine how many times a skill executesWhat the shape of the input is based on the contextIn this example, source fields from a CSV file include customer reviews about hotels (\u0022reviews_text\u0022)and ratings (\u0022reviews_rating\u0022). The indexer adds metadata fields from Blob storage, and skills addtranslated text, sentiment scores, and key phrase detection.In the hotel reviews example, a \u0022document\u0022 within the enrichment process represents a single hotelreview.Indexer definitionEnrichment exampleConceptually, the initial enrichment tree looks as follows:The root node for all enrichments is \u0022/document\u0022.\n"
}