{
  "Id": "1440",
  "Title": "\u0022Configuring Inbound Rules for Azure Cognitive Search IP Addresses\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfnorthcentralus.cloudapp.azure.comAddress:  52.252.175.48Aliases:  stamp2.ext.search.windows.net          azs-ux-prod.trafficmanager.net          azspncuux.management.search.windows.netFor ping, the request times out, but the IP address is visible in the response. Forexample, in the message \u0022Pinging azsyrie.northcentralus.\r\ncloudapp.azure.com[52.252.175.48]\u0022, the IP address is \u002252.252.175.48\u0022.You\u0027ll also need to create an inbound rule that allows requests from the multi-tenantexecution environment. This environment is managed by Microsoft and it\u0027s used tooffload processing intensive jobs that could otherwise overwhelm your search service.\r\nThis section explains how to get the range of IP addresses needed to create thisinbound rule.An IP address range is defined for each region that supports Azure Cognitive Search.Specify the full range to ensure the success of requests originating from the multi-tenant execution environment.You can get this IP address range from the AzureCognitiveSearch service tag.\r\n1. Use either the discovery API or the downloadable JSON file. If the search service isthe Azure Public cloud, download the Azure Public JSON file.2. Open the JSON file and search for \u0022AzureCognitiveSearch\u0022. For a search service inWestUS2, the IP addresses for the multi-tenant indexer execution environment are:JSONGet IP addresses for \u0022AzureCognitiveSearch\u0022service tag{\u0022name\u0022: \u0022AzureCognitiveSearch. WestUS2\u0022,\u0022id\u0022: \u0022AzureCognitiveSearch.WestUS2\u0022,\u0022properties\u0022: {   \u0022changeNumber\u0022: 1,   \u0022region\u0022: \u0022westus2\u0022,   \u0022regionId\u0022: 38,   \u0022platform\u0022: \u0022Azure\u0022,   \u0022systemService\u0022: \u0022AzureCognitiveSearch\u0022,   \u0022addressPrefixes\u0022: [      \u002220.\n"
}