{
  "Id": "549",
  "Title": "\u0022Configuring Private Endpoints for Azure Search Integration: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfGiven the above constrains, your choices for achieving search integration in a virtualnetwork are:Configure an inbound firewall rule on your Azure PaaS resource that admitsindexer requests for data.Choosing a connectivity approachConfigure an outbound connection from Search that makes indexer connectionsusing a private endpoint.For a private endpoint, the search service connection to your protected resource isthrough a shared private link. A shared private link is an Azure Private Link resourcethat\u0027s created, managed, and used from within Cognitive Search.\r\nIf your resourcesare fully locked down (running on a protected virtual network, or otherwise notavailable over a public connection), a private endpoint is your only choice.Connections through a private endpoint must originate from the search service\u0027sprivate execution environment. To meet this requirement, you\u0027ll have to disablemulti-tenant execution. This step is described in Make outbound connectionsthrough a private endpoint.Configuring an IP firewall is free. A private endpoint, which is based on Azure PrivateLink, has a billing impact.This section summarizes the main steps for setting up a private endpoint for outboundindexer connections.\r\nThis summary might help you decide whether a private endpoint isthe best choice for your scenario. Detailed steps are covered in How to make outboundconnections through a private endpoint.A shared private link requires a billable search service, where the minimum tier iseither Basic for text-based indexing or Standard 2 (S2) for skills-based indexing.\r\nSee tier limits on the number of private endpoints for details.Inbound and outbound connections are subject to Azure Private Link pricing.You\u0027ll create a shared private link using either the portal pages of your search service orthrough the Management API.In Azure Cognitive Search, your search service must be at least the Basic tier for text-based indexers, and S2 for indexers with skillsets. A private endpoint connection will accept requests from the private indexer executionenvironment, but not the multi-tenant environment. You\u0027ll need to disable multi-tenantexecution as described in step 3 to meet this requirement.Working with a private endpointBilling impact of Azure Private LinkStep 1: Create a private endpoint to the secure resourceWhen the (asynchronous) operation that creates a shared private link resourcecompletes, a private endpoint connection will be created in a \u0022Pending\u0022 state.\n"
}