{
  "Id": "909",
  "Title": "\u0022Configuring Azure Blob Storage Indexer for Full Text Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor limits on blob size,see service Limits.You can now run the indexer, monitor status, or schedule indexer execution. Thefollowing articles apply to indexers that pull content from Azure Storage:Change detection and deletion detection  } } Next stepsIndex large data setsC# Sample: Index Data Lake Gen2 using Azure ADIndex data from Azure Blob StorageArticle•05/18/2023In this article, learn how to configure an indexer that imports content from Azure BlobStorage and makes it searchable in Azure Cognitive Search.\r\nInputs to the indexer areyour blobs, in a single container. Output is a search index with searchable content andmetadata stored in individual fields.\r\nThis article supplements Create an indexer with information that\u0027s specific to BlobStorage. It uses the REST APIs to demonstrate a three-part workflow common to allindexers: create a data source, create an index, create an indexer. Data extraction occurswhen you submit the Create Indexer request.Blob indexers are frequently used for both AI enrichment and text-based processing.This article focuses on indexers for text-based indexing, where just the textual contentand metadata are ingested for full text search scenarios.Azure Blob Storage, Standard performance (general-purpose v2).\r\nAccess tiers for Blob Storage include Hot, Cool, and Archive. Only Hot and Coolcan be accessed by search indexers.Blobs providing text content and metadata. If blobs contain binary content orunstructured text, consider adding AI enrichment for image and natural languageprocessing. Blob content can’t exceed the indexer limits for your search service tier.A supported network configuration and data access. At a minimum, you\u0027ll needread permissions in Azure Storage. A storage connection string that includes anaccess key will give you read access to storage content. If instead you\u0027re usingAzure AD logins and roles, make sure the search service\u0027s managed identity hasStorage Blob Data Reader permissions.By default, both search and storage accept requests from public IP addresses. Ifnetwork security isn\u0027t an immediate concern, you can index blob data using justthe connection string and read permissions. When you\u0027re ready to add networkprotections, see Indexer access to content protected by Azure network securityfeatures for guidance about data access.Use a REST client, such as Postman app, if you want to formulate REST callssimilar to the ones shown in this article.\n"
}