{
  "Id": "49",
  "Title": "\u0022Configuring Azure Search Service: Variables and Index Schema\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSelect Variables from the list of actions at the top of the page. Into Current value,provide the following values. Required and recommended values are specified.VariableCurrent valueindex-nameindex names are lower-case, no spaces, and can\u0027t start or end withdashessearch-service-namefrom Azure portal, get just the name of the service, not the full URLsearch-api-version2023-11-01search-api-keyprovide an admin keyopenai-api-keyoptional.\r\nSet this value if you want to generate embeddings. Findthis value in Azure portal.openai-service-nameoptional. Set this value if you want to generate embeddings. Findthis value in Azure portal.\r\nopenai-deployment-nametext-embedding-ada-002openai-api-version2023-08-01-preview5. Save your changes.You\u0027re now ready to send the requests to your search service. For each request, selectthe blue Send button. When you see a success message, move on to the next request.Use the Create or Update Index REST API for this request.\r\nThe index schema is organized around hotels content. Sample data consists of thenames, descriptions, and locations of seven fictitious hotels. This schema includes fieldsfor vector and traditional keyword search, with configurations for vector and semanticranking.The following example is a subset of the full index.\r\nWe trimmed the definition so thatyou can focus on field definitions, vector configuration, and optional semanticconfiguration.HTTPCreate an indexPUT https://{{search-service-name}}.search.windows.net/indexes/{{index-name}}?api-version=2023-11-01Content-Type: application/jsonapi-key: {{admin-api-key}}{    \u0022name\u0022: \u0022hotels-vector-quickstart\u0022,    \u0022fields\u0022: [        {            \u0022name\u0022: \u0022HotelId\u0022,             \u0022type\u0022: \u0022Edm. String\u0022,            \u0022searchable\u0022: false,             \u0022filterable\u0022: true,             \u0022retrievable\u0022: true,             \u0022sortable\u0022: false,             \u0022facetable\u0022: false,            \u0022key\u0022: true        },        {            \u0022name\u0022: \u0022HotelName\u0022,             \u0022type\u0022: \u0022Edm.\n"
}