{
  "Id": "955",
  "Title": "\u0022Configuring Azure Cosmos DB Connection Strings and Search Indexes\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfcom;AccountKey=\u003CCosmos DB auth key\u003E;Database=\u003CCosmos DB databaseid\u003E;ApiKind=MongoDb\u0022 }You can get the Cosmos DB auth key from the Azure Cosmos DB account page in the Azure portalby selecting Connection String in the left navigation pane. Make sure to copy Primary Passwordand replace Cosmos DB auth key value with it.\r\nManaged identity connection string    \u0022query\u0022: null   },   \u0022dataChangeDetectionPolicy\u0022: {     \u0022@odata.type\u0022: \u0022#Microsoft.Azure.Search.HighWaterMarkChangeDetectionPolicy\u0022,     \u0022highWaterMarkColumnName\u0022: \u0022_ts\u0022   },   \u0022dataDeletionDetectionPolicy\u0022: null,   \u0022encryptionKey\u0022: null,   \u0022identity\u0022: null } Supported credentials and connection stringsManaged identity connection string{ \u0022connectionString\u0022 : \u0022ResourceId=/subscriptions/\u003Cyour subscriptionID\u003E/resourceGroups/\u003Cyour resource groupname\u003E/providers/Microsoft.\r\nDocumentDB/databaseAccounts/\u003Cyour cosmos db account name\u003E/;(ApiKind=[api-kind];)\u0022 }This connection string doesn\u0027t require an account key, but you must have previously configured asearch service to connect using a managed identity and created a role assignment that grantsCosmos DB Account Reader Role permissions.\r\nSee Setting up an indexer connection to an AzureCosmos DB database using a managed identity for more information.In a search index, add fields to accept the source JSON documents or the output of yourcustom query projection. Ensure that the search index schema is compatible with sourcedata. For content in Azure Cosmos DB, your search index schema should correspond tothe Azure Cosmos DB items in your data source.1. Create or update an index to define search fields that will store data:HTTPAdd search fields to an indexPOST https://[service name]. search.windows.net/indexes?api-version=2020-06-30 Content-Type: application/json api-key: [Search service admin key] {     \u0022name\u0022: \u0022mysearchindex\u0022,     \u0022fields\u0022: [{         \u0022name\u0022: \u0022doc_id\u0022,         \u0022type\u0022: \u0022Edm.String\u0022,         \u0022key\u0022: true,         \u0022retrievable\u0022: true,         \u0022searchable\u0022: false     }, {         \u0022name\u0022: \u0022description\u0022,         \u0022type\u0022: \u0022Edm.\n"
}