{
  "Id": "249",
  "Title": "\u0022Configuring Azure Services: Query Editor, ADO.NET, and Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfReturn to the firewall rules page to add a rule that allows accessfrom your client.10. In Query editor, select Open query and navigate to the location of hotels.sql file onyour local computer.11. Select the file and select Open. The script should look similar to the followingscreenshot:12. Select Run to execute the query.\r\nIn the Results pane, you should see a querysucceeded message, for three rows.13. To return a rowset from this table, you can execute the following query as averification step:SQL14. Copy the ADO.NET connection string for the database. Under Settings \u003EConnection Strings, copy the ADO.NET connection string, similar to the examplebelow.\r\nSQLSELECT * FROM Hotels You\u0027ll need this connection string in the next exercise, setting up your environment.The next component is Azure Cognitive Search, which you can create in the portal. Youcan use the Free tier to complete this walkthrough.API calls require the service URL and an access key.\r\nA search service is created with both,so if you added Azure Cognitive Search to your subscription, follow these steps to getthe necessary information:1. Sign in to the Azure portal, and in your search service Overview page, get theURL. An example endpoint might look like https://mydemo.search.windows.net.2. In Settings \u003E Keys, get an admin key for full rights on the service.\r\nThere are twointerchangeable admin keys, provided for business continuity in case you need toroll one over. You can use either the primary or secondary key on requests foradding, modifying, and deleting objects.Server=tcp:{your_dbname}.database.windows. net,1433;Initial Catalog=hotels-db;Persist Security Info=False;User ID={your_username};Password={your_password};MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30; Azure Cognitive SearchGet an admin api-key and URL for Azure Cognitive Search1. Start Visual Studio and open DotNetHowToIndexers.sln.2. In Solution Explorer, open appsettings.json to provide connection information.\n"
}