{
  "Id": "1402",
  "Title": "\u0022Configuring Role-Based Access Control in Azure Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNo roles are used.Role-basedaccess controlRequires membership in a role assignment to complete the task,described in the next step. It also requires an authorization header.Configure role-based access for data planeAzure portalOptionDescriptionBothRequests are valid using either an API key or role-based accesscontrol.The change is effective immediately, but wait a few seconds before testing.All network calls for search service operations and content respect the option youselect: API keys, bearer token, or either one if you select Both.When you enable role-based access control in the portal, the failure mode is\u0022http401WithBearerChallenge\u0022 if authorization fails.\r\nRole assignments are cumulative and pervasive across all tools and client libraries. Youcan assign roles using any of the supported approaches described in Azure role-basedaccess control documentation.You must be an Owner or have Microsoft.Authorization/roleAssignments/writepermissions to manage role assignments.Role assignments in the portal are service-wide. If you want to grant permissions toa single index, use PowerShell or the Azure CLI instead.1. Sign in to the Azure portal.2. Navigate to your search service.3. Select Access Control (IAM) in the left navigation pane.4. Select \u002B Add \u003E Add role assignment.Assign rolesAzure portal5.\r\nSelect an applicable role:OwnerContributorReaderSearch Service ContributorSearch Index Data ContributorSearch Index Data Reader6. On the Members tab, select the Microsoft Entra user or group identity.7. On the Review \u002B assign tab, select Review \u002B assign to assign the role.Use a client to test role assignments. Remember that roles are cumulative and inheritedroles that are scoped to the subscription or resource group can\u0027t be deleted or deniedat the resource (search service) level.Make sure that you register your client application with Microsoft Entra ID and have roleassignments in place before testing access.1. Sign in to the Azure portal.2. Navigate to your search service.\n"
}