{
  "Id": "1079",
  "Title": "\u0022Configuring Microsoft Entra ID for Azure Search and Web API\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe following points describe the requirements for this approach:The search service, which sends the request on the indexer\u0027s behalf, must beconfigured to use a managed identity (either system or user-assigned) so that thecaller can be authenticated by Microsoft Entra ID.Your function or app must be configured for Microsoft Entra ID.\r\nYour custom skill definition must include an \u0022authResourceId\u0022 property. Thisproperty takes an application (client) ID, in a supported format: api://\u003CappId\u003E.By default, the connection to the endpoint times out if a response isn\u0027t returned within a30-second window. The indexing pipeline is synchronous and indexing will produce atimeout error if a response isn\u0027t received in that time frame.\r\nYou can increase the intervalto a maximum value of 230 seconds by setting the timeout parameter:The Web API must accept an array of records to be processed. Each record must containa property bag that is the input provided to your Web API.Suppose you want to create a basic enricher that identifies the first date mentioned inthe text of a contract.\r\nIn this example, the custom skill accepts a single input\u0022contractText\u0022 as the contract text. The skill also has a single output, which is the date ofthe contract. To make the enricher more interesting, return this \u0022contractDate\u0022 in theshape of a multi-part complex type.Your Web API should be ready to receive a batch of input records.\r\nEach member of the\u0022values\u0022 array represents the input for a particular record. Each record is required tohave the following elements:A \u0022recordId\u0022 member that is the unique identifier for a particular record. Whenyour enricher returns the results, it must provide this \u0022recordId\u0022 in order to allowthe caller to match the record results to their input. \u0022authResourceId\u0022: \u0022[for managed identity connections, your app\u0027s client ID goes here]\u0022,\u0022timeout\u0022: \u0022PT230S\u0022,Format Web API inputsA \u0022data\u0022 member, which is essentially a bag of input fields for each record.The resulting Web API request might look like this:JSONIn practice, your code may get called with hundreds or thousands of records instead ofonly the three shown here.\n"
}