{
  "Id": "993",
  "Title": "\u0022Configuring Azure SQL Managed Instance for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAlternatively, if the managed instance is behind a firewall, create a shared private linkinstead.This article highlights just the steps for an indexer connection in Azure AI Search. If youwant more background, see Configure public endpoint in Azure SQL Managed Instanceinstead.1. For a new SQL Managed Instance, create the resource with the Enable publicendpoint option selected.７ NoteAlways Encrypted columns are not currently supported by Azure AI Searchindexers.Enable a public endpoint2. Alternatively, if the instance already exists, you can enable public endpoint on anexisting SQL Managed Instance under Security \u003E Virtual network \u003E Publicendpoint \u003E Enable.\r\nCheck the Network Security Group has the correct Inbound security rules that allowconnections from Azure services.Verify NSG rulesYou can restrict inbound access to the public endpoint by replacing the current rule(public_endpoint_inbound) with the following two rules:Allowing inbound access from the AzureCognitiveSearch service tag (\u0022SOURCE\u0022 =AzureCognitiveSearch, \u0022NAME\u0022 = cognitive_search_inbound)Allowing inbound access from the IP address of the search service, which can beobtained by pinging its fully qualified domain name (for example, \u003Cyour-search-service-name\u003E.\r\nsearch.windows.net). (\u0022SOURCE\u0022 = IP address, \u0022NAME\u0022 =search_service_inbound)For each rule, set \u0022PORT\u0022 = 3342, \u0022PROTOCOL\u0022 = TCP, \u0022DESTINATION\u0022 = Any, \u0022ACTION\u0022= Allow. Copy the connection string to use in the search indexer\u0027s data source connection. Besure to copy the connection string for the public endpoint (port 3342, not port 1433).Restrict inbound access to the endpointGet public endpoint connection stringNext stepsWith configuration out of the way, you can now specify a SQL managed instance as anindexer data source using the basic instructions for setting up an Azure SQL indexer.\n"
}