{
  "Id": "844",
  "Title": "\u0022Configuring RBAC and Managed Identities for Azure Cosmos DB\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure PowerShellPrerequisites$cosmosdb_acc_name = \u003Ccosmos db account name\u003E$resource_group = \u003Cresource group name\u003E$subsciption = \u003Csubscription id\u003E$system_assigned_principal = \u003Cprincipal id for system assigned identity\u003E$readOnlyRoleDefinitionId = \u002200000000-0000-0000-0000-000000000001\u0022$scope=$(az cosmosdb show --name $cosmosdbname --resource-group $resourcegroup --query id --output tsv)\r\naz cosmosdb sql role assignment create --account-name $cosmosdbname --resource-group $resourcegroup --role-definition-id $readOnlyRoleDefinitionId --principal-id $sys_principal --scope $scopeFor Cosmos DB for NoSQL,\r\nyou can optionally Enforcing RBAC as the onlyauthentication method for data connections by setting disableLocalAuth to truefor your Cosmos DB account.\r\nFor Gremlin and MongoDB Collections: Indexer support is currently in preview. Atthis time, a preview limitation exists that requires Cognitive Search to connectusing keys. You can still set up a managed identity and role assignment, butCognitive Search will only use the role assignment to get keys for the connection.\r\nThis limitation means that you can\u0027t configure an RBAC-only approach if yourindexers are connecting to Gremlin or MongoDB using Search with managedidentities to connect to Azure Cosmos DB.You should be familiar with indexer concepts and configuration.Create the data source and provide either a system-assigned managed identity or auser-assigned managed identity (preview) in the connection string. The REST API, Azure portal, and the .NET SDK support using a system-assignedmanaged identity.When you\u0027re connecting with a system-assigned managed identity, the only change tothe data source definition is the format of the \u0022credentials\u0022 property. You\u0027ll provide thedatabase name and a ResourceId that has no account key or password. The ResourceIdmust include the subscription ID of Azure Cosmos DB, the resource group, and theAzure Cosmos DB account name.For SQL collections, the connection string doesn\u0027t require \u0022ApiKind\u0022.For SQL collections add \u0022IdentityAuthType=AccessToken\u0022 if RBAC is enforced asthe only authentication method.\n"
}