{
  "Id": "205",
  "Title": "\u0022Configuring and Troubleshooting Azure Static Web App Deployment\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAdd a * after a field name to denote that the field is of typeCollection(Edm.String). This allows the Azure Function to add filters correctly toqueries.5. Select Save to save the settings.6. Return to VS Code.7. Refresh your static web app to see the application settings.1. In Visual Studio Code, open the Activity bar, and select the Azure icon.2. In the Side bar, right-click on your Azure subscription under the Static Web Appsarea and find the static web app you created for this tutorial.3. Right-click the static web app name and select Browse site.\r\nUse search in your static web app4. Select Open in the pop-up dialog.5. In the website search bar, enter a search query such as code, so the suggestfeature suggests book titles. Select a suggestion or continue entering your ownquery. Press enter when you\u0027ve completed your search query.6.\r\nReview the results then select one of the books to see more details.If the web app didn\u0027t deploy or work, use the following list to determine and fix theissue:Did the deployment succeed?In order to determine if your deployment succeeded, you need to go to your forkof the sample repo and review the success or failure of the GitHub action.\r\nThereshould be only 1 action and it should have static web app settings for theTroubleshootingapp_location, api_location, and output_location. If the action didn\u0027t deploysuccessfully, dive into the action logs and look for the last failure.Does the client (front-end) application work?You should be able to get to your web app and it should successfully display. If thedeployment succeeded but the website doesn\u0027t display, this may be an issue withhow the static web app is configured for rebuilding the app, once it is on Azure.Does the API (serverless back-end) application work?You should be able to interact with the client app, searching for books andfiltering.\nIf the form doesn\u0027t return any values, open the browser\u0027s developer tools,and determine if the HTTP calls to the API were successful. If the calls weren\u0027tsuccessful, the most likely reason if the static web app configurations for the APIendpoint name and Search query key are incorrect.\n"
}