{
  "Id": "996",
  "Title": "\u0022Configuring Secure Connection for Azure AI Search and SQL Server\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTheeasiest is to backspace over and then retype the first character of the thumbprintto remove the leading character in the key value field in regedit. Alternatively, youcan use a different tool to copy the thumbprint.3. Grant permissions to the service account.Make sure the SQL Server service account is granted appropriate permission onthe private key of the TLS/SSL certificate.\r\nIf you overlook this step, SQL Serverwon\u0027t start. You can use the Certificates snap-in or CertUtils for this task.4. Restart the SQL Server service.After you set up the encrypted connection required by Azure AI Search, you\u0027ll connectto the instance through its public endpoint.\r\nThe following article explains the connectionrequirements and syntax:Connect to SQL Server over the internetIt isn\u0027t unusual to configure the network security group and corresponding Azureendpoint or Access Control List (ACL) to make your Azure VM accessible to otherConnect to SQL ServerConfigure the network security groupparties. Chances are you\u0027ve done this before to allow your own application logic toconnect to your SQL Azure VM.\r\nIt\u0027s no different for an Azure AI Search connection toyour SQL Azure VM.The links below provide instructions on NSG configuration for VM deployments. Usethese instructions to ACL a search service endpoint based on its IP address.1. Obtain the IP address of your search service. See the following section forinstructions.2.\r\nAdd the search IP address to the IP filter list of the security group. Either one offollowing articles explains the steps:Tutorial: Filter network traffic with a network security group using the Azure portalCreate, change, or delete a network security groupIP addressing can pose a few challenges that are easily overcome if you\u0027re aware of theissue and potential workarounds. The remaining sections provide recommendations forhandling issues related to IP addresses in the ACL.We strongly recommend that you restrict the access to the IP address of your searchservice and the IP address range of AzureCognitiveSearch service tag in the ACL insteadof making your SQL Azure VMs open to all connection requests.You can find out the IP address by pinging the FQDN (for example, \u003Cyour-search-service-name\u003E.search.windows.net) of your search service. Although it\u0027s possible for thesearch service IP address to change, it\u0027s unlikely that it will change. The IP address tendsto be static for the lifetime of the service.\n"
}