{
  "Id": "1408",
  "Title": "\u0022Configuring Role-Based Access Control for Azure Cognitive Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor example, you can get startedwith new SearchClient(endpoint, new DefaultAzureCredential()) to authenticatevia a Microsoft Entra ID using Azure.Identity.Applies to: Search Index Data Contributor, Search Index Data Reader, Search ServiceContributorIn this step, configure your search service to recognize an authorization header on datarequests that provide an OAuth2 access token.1. Sign in to the Azure portal and open the search service page.2. Select Keys in the left navigation pane.Configure role-based access for data planeAzure portal3. Choose an API access control option. We recommend Both if you wantflexibility or need to migrate apps.\r\nOptionDescriptionAPI Key(default) Requires an admin or query API keys on the requestheader for authorization. No roles are used.Role-basedaccess controlRequires membership in a role assignment to complete the task,described in the next step. It also requires an authorization header.BothRequests are valid using either an API key or role-based accesscontrol.\r\nThe change is effective immediately, but wait a few seconds before testing.All network calls for search service operations and content will respect the optionyou select: API keys, bearer token, or either one if you select Both.When you enable role-based access control in the portal, the failure mode will be\u0022http401WithBearerChallenge\u0022 if authorization fails.\r\nIn this step, create a managed identity for your client application.1. Sign in to the Azure portal.2. Search for Managed Identities.Create a managed identity3. Select \u002B Create.4. Give your managed identity a name and select a region. Then, select Create.Next, you need to grant your managed identity access to your search service. AzureCognitive Search has various built-in roles. You can also create a custom role.It\u0027s a best practice to grant minimum permissions. If your application only needs tohandle queries, you should assign the Search Index Data Reader role. Alternatively, if itneeds both read and write access on a search index, you should use the Search IndexData Contributor role.\n"
}