{
  "Id": "963",
  "Title": "\u0022Configuring Indexers and Connections for Azure Search in Cosmos DB\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfEdges will be ignored. The query default is g.V(). Alternatively, youcould set the query to only index the edges. To index the edges, set the query tog.E().5. Set \u0022dataChangeDetectionPolicy\u0022 if data is volatile and you want the indexer topick up just the new and updated items on subsequent runs. Incremental progresswill be enabled by default using _ts as the high water mark column.\r\n6. Set \u0022dataDeletionDetectionPolicy\u0022 if you want to remove search documents from asearch index when the source item is deleted.Indexers can connect to a collection using the following connections. For connectionsthat target Azure Cosmos DB for Apache Gremlin, be sure to include \u0022ApiKind\u0022 in theconnection string.\r\nAvoid port numbers in the endpoint URL. If you include the port number, the connectionwill fail.Full access connection string{ \u0022connectionString\u0022 : \u0022AccountEndpoint=https://\u003CCosmos DB accountname\u003E.documents.azure.com;AccountKey=\u003CCosmos DB auth key\u003E;Database=\u003CCosmos DB databaseid\u003E;ApiKind=MongoDb\u0022 }You can get the connection string from the Azure Cosmos DB account page in Azure portal byselecting Keys in the left navigation pane.\r\nMake sure to select a full connection string and not justa key.Managed identity connection string{ \u0022connectionString\u0022 : \u0022ResourceId=/subscriptions/\u003Cyour subscriptionID\u003E/resourceGroups/\u003Cyour resource groupname\u003E/providers/Microsoft. DocumentDB/databaseAccounts/\u003Cyour cosmos db account name\u003E/;(ApiKind=[api-kind];)\u0022 }This connection string doesn\u0027t require an account key, but you must have previously configured asearch service to connect using a managed identity and created a role assignment that grantsSupported credentials and connection stringsManaged identity connection stringCosmos DB Account Reader Role permissions. See Setting up an indexer connection to an AzureCosmos DB database using a managed identity for more information.In a search index, add fields to accept the source JSON documents or the output of yourcustom query projection. Ensure that the search index schema is compatible with yourgraph.\n"
}