{
  "Id": "1334",
  "Title": "\u0022Configuring and Monitoring Azure Search: Best Practices and Tips\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUse granular and descriptive names if you\u0027recreating more than one setting.4. Select the logs and metrics that are in scope for this setting. Selections include\u0022allLogs\u0022, \u0022audit\u0022, \u0022OperationLogs\u0022, \u0022AllMetrics\u0022. You can exclude activity logs byselecting the \u0022OperationLogs\u0022 category.See Microsoft.Search/searchServices (in Supported categories for AzureMonitor resource logs)See Microsoft.Search/searchServices (in Supported metrics)See Azure AI Search monitoring data reference for the extended schema5. Select Send to Log Analytics workspace. Kusto queries and data exploration willtarget the workspace.6. Optionally, select other destinations.\r\n７ NoteCurrently, there are no storage-related alerts (storage consumption data isn\u0027taggregated or logged into the AzureMetrics table). To get storage alerts, you couldbuild a custom solution that emits resource-related notifications, where your codechecks for storage size and handles the response.Enable resource logging7. Select Save.\r\nOnce the workspace contains data, you can run log queries:See Tutorial: Collect and analyze resource logs from an Azure resource for generalguidance on log queries.See Analyze performance in Azure AI Search for examples and guidance specific tosearch services.Kusto is the query language used for Log Analytics. The next section has some queriesto get you started. See the Azure AI Search monitoring data reference for descriptionsof schema elements used in a query. See Analyze performance in Azure AI Search formore examples and guidance specific to search service.Return a list of metrics and the associated aggregation. The query is scoped to thecurrent search service over the time range that you specify.Kusto TipLogs are grouped into Category groups. Category groups are a collection ofdifferent logs to help you achieve different monitoring goals.The audit category group allows you to select the resource logs that are necessaryfor auditing your resource. For more information, see Diagnostic settings in AzureMonitor Resource logs.\n"
}