{
  "Id": "100",
  "Title": "\u0022Configuring Azure AI Search Collection Variables and Request Headers\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCollection variables are used torepresent the search service name and API keys. A typical URI in this quickstart looks likethis:HTTPNotice the HTTPS prefix, the name of the service (variable, the name of an object (in thiscase, the name of an index in the indexes collection), and the api-version. The api-version is a required.\r\nRequest header composition includes two elements: Content-Type and the api-keyused to authenticate to Azure AI Search. The api-key is specified as variable, and it\u0027salso required.For the requests to succeed, you\u0027ll need to provide the service name and api-key ascollection variables.1. Open the Postman app and import the collection.\r\nConnect to Azure AI Searchhttps://{{service-name}}.search.windows.net/indexes/hotels-quickstart?api-version=2020-06-302. Select the collection\u0027s access menu, select Edit, and provide the service name andkey of your search service.In Azure AI Search, you usually create the index before loading it with data.\r\nThe CreateIndex REST API is used for this task.The URL is extended to include the hotels-quickstart index name.1. Set the verb to PUT.2. Copy in this URL https://{{service-name}}.search.windows.net/indexes/hotels-quickstart?api-version=2020-06-30.3. Provide the index definition (copy-ready code is provided next) in the body of therequest.4.\r\nSelect Send.1 - Create an indexIndex definitionThe fields collection defines document structure. Each document must have these fields,and each field must have a data type. String fields are used in full text search. If youneed numeric data to be searchable, you\u0027ll need to cast numeric data as strings.Attributes on the field determine allowed action. The REST APIs allow many actions bydefault. For example, all strings are searchable, retrievable, filterable, and facetable bydefault. Often, you only have to set attributes when you need to turn off a behavior.JSONWhen you submit this request, you should get an HTTP 201 response, indicating theindex was created successfully.\n"
}