{
  "Id": "998",
  "Title": "\u0022Configuring and Indexing SharePoint Document Libraries for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRegardless of thedomain name, the IP address returned from the ping is the correct one to use whendefining an inbound firewall rule for the Azure portal in your region.With configuration out of the way, you can now specify a SQL Server on Azure VM asthe data source for an Azure AI Search indexer. For more information, see Index datafrom Azure SQL.\r\nNext stepsIndex data from SharePoint document librariesArticle•11/21/2023This article explains how to configure a search indexer to index documents stored in SharePoint document libraries for full text search inAzure AI Search. Configuration steps are first, followed by behaviors and scenariosAn indexer in Azure AI Search is a crawler that extracts searchable data and metadata from a data source. The SharePoint indexer connectsto your SharePoint site and indexes documents from one or more document libraries. The indexer provides the following functionality:Index files and metadata from one or more document libraries.Index incrementally, picking up just the new and changed files and metadata.\r\nDeletion detection is built in. Deletion in a document library is picked up on the next indexer run, and the document is removed fromthe index.Text and normalized images are extracted by default from the documents that are indexed. Optionally, you can add a skillset fordeeper AI enrichment, like OCR or text translation.\r\nSharePoint in Microsoft 365 cloud serviceFiles in a document libraryThe SharePoint indexer can extract text from the following document formats:CSV (see Indexing CSV blobs)EMLEPUBGZHTMLJSON (see Indexing JSON blobs)KML (XML for geographic representations)Microsoft Office formats: DOCX/DOC/DOCM, XLSX/XLS/XLSM, PPTX/PPT/PPTM, MSG (Outlook emails), XML (both 2003 and 2006WORD XML)Open Document formats: ODT, ODS, ODPPDFPlain text files (see also Indexing plain text)RTFXMLZIPHere are the limitations of this feature:Indexing SharePoint Lists isn\u0027t supported.\n"
}