{
  "Id": "754",
  "Title": "\u0022Configuring Language Analyzers for Azure Cognitive Search Indexing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSet the analyzer during index creation before it\u0027s loaded with data.Comparing Lucene and Microsoft AnalyzersEnglish analyzersHow to specify a language analyzer1. In the field definition, make sure the field is attributed as \u0022searchable\u0022 and is oftype Edm.String.2. Set the \u0022analyzer\u0022 property to one of the language analyzers from the supportedanalyzers list.\r\nThe \u0022analyzer\u0022 property is the only property that will accept a language analyzer,and it\u0027s used for both indexing and queries. Other analyzer-related properties(\u0022searchAnalyzer\u0022 and \u0022indexAnalyzer\u0022) won\u0027t accept a language analyzer.Language analyzers can\u0027t be customized. If an analyzer isn\u0027t meeting your requirements,create a custom analyzer with the microsoft_language_tokenizer ormicrosoft_language_stemming_tokenizer, and then add filters for pre- and post-tokenization processing.The following example illustrates a language analyzer specification in an index:JSONFor more information about creating an index and setting field properties, see CreateIndex (REST).\r\nFor more information about text analysis, see Analyzers in Azure CognitiveSearch.{  \u0022name\u0022: \u0022hotels-sample-index\u0022,  \u0022fields\u0022: [    {      \u0022name\u0022: \u0022Description\u0022,      \u0022type\u0022: \u0022Edm.String\u0022,      \u0022retrievable\u0022: true,      \u0022searchable\u0022: true,      \u0022analyzer\u0022: \u0022en.microsoft\u0022,      \u0022indexAnalyzer\u0022: null,      \u0022searchAnalyzer\u0022: null    },    {      \u0022name\u0022: \u0022Description_fr\u0022,      \u0022type\u0022: \u0022Edm.\r\nString\u0022,      \u0022retrievable\u0022: true,      \u0022searchable\u0022: true,      \u0022analyzer\u0022: \u0022fr.microsoft\u0022,      \u0022indexAnalyzer\u0022: null,      \u0022searchAnalyzer\u0022: null    },Supported language analyzersBelow is the list of supported languages, with Lucene and Microsoft analyzer names. LanguageMicrosoft Analyzer NameLucene Analyzer NameArabicar.microsoftar.luceneArmenianhy.luceneBanglabn.microsoftBasqueeu.luceneBulgarianbg.microsoftbg.luceneCatalanca.microsoftca.luceneChinese Simplifiedzh-Hans.microsoftzh-Hans.luceneChinese Traditionalzh-Hant.microsoftzh-Hant.luceneCroatianhr.microsoftCzechcs.microsoftcs.\n"
}