{
  "Id": "984",
  "Title": "\u0022Configuring Azure SQL Indexer for Search Service: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfapi-version=2020-06-30Content-Type: application/jsonapi-key: [search service admin key]{    \u0022name\u0022 : \u0022[my-sqldb-indexer]\u0022,    \u0022dataSourceName\u0022 : \u0022[my-sqldb-ds]\u0022,    \u0022targetIndexName\u0022 : \u0022[my-search-index]\u0022,    \u0022disabled\u0022: null,    \u0022schedule\u0022: null,    \u0022parameters\u0022: {        \u0022batchSize\u0022: null,        \u0022maxFailedItems\u0022:\r\n0,        \u0022maxFailedItemsPerBatch\u0022: 0,        \u0022base64EncodeKeys\u0022: false,        \u0022configuration\u0022: {            \u0022queryTimeout\u0022: \u002200:04:00\u0022,            \u0022convertHighWaterMarkToRowVersion\u0022: false,            \u0022disableOrderByHighWaterMarkColumn\u0022: false        }    },    \u0022fieldMappings\u0022: [],    \u0022encryptionKey\u0022: null}2.\r\nUnder parameters, the configuration section has parameters that are specific toAzure SQL:Default query timeout for SQL query execution is 5 minutes, which you canoverride.\u0022convertHighWaterMarkToRowVersion\u0022 optimizes for the High Water Markchange detection policy. Change detection policies are set in the data source.If you\u0027re using the native change detection policy, this parameter has noeffect.\u0022disableOrderByHighWaterMarkColumn\u0022 causes the SQL query used by thehigh water mark policy to omit the ORDER BY clause. If you\u0027re using thenative change detection policy, this parameter has no effect.3. Specify field mappings if there are differences in field name or type, or if you needmultiple versions of a source field in the search index.4. See Create an indexer for more information about other properties.An indexer runs automatically when it\u0027s created. You can prevent this by setting\u0022disabled\u0022 to true. To control indexer execution, run an indexer on demand or put it on aschedule.To monitor the indexer status and execution history, send a Get Indexer Status request:HTTPThe response includes status and the number of items processed.\n"
}