{
  "Id": "1452",
  "Title": "\u0022Configuring Shared Private Link for Azure SQL Managed Instance\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou should have a minimum of Contributor permissions on both Azure AI Searchand SQL Managed Instance.Azure SQL Managed Instance connection string. Managed identity is not currentlysupported with shared private link. Your connection string must include a username and password.７ NoteThis article refers to Azure portal for obtaining properties and confirming steps.However, when creating the shared private link for SQL Managed Instance, makesure you\u0027re using the REST API. Although the Networking tab listsMicrosoft.Sql/managedInstances as an option, the portal doesn\u0027t currently supportthe extended URL format used by SQL Managed Instance.\r\nPrerequisitesRetrieve the FQDN of the managed instance, including the DNS zone. The DNS zone ispart of the domain name of the SQL Managed Instance. For example, if the FQDN of theSQL Managed Instance is my-sql-managed-instance.00000000000.database.windows.net,the DNS zone is 00000000000.1. In Azure portal, find the SQL managed instance object.2.\r\nOn the Overview tab, locate the Host property. Copy the DNS zone portion of theFQDN for the next step.3. On the Connection strings tab, copy the ADO.NET connection string for a laterstep. It\u0027s needed for the data source connection when testing the privateconnection.For more information about connection properties, see Create an Azure SQL ManagedInstance.\r\n1. Using a text editor, create the JSON for the shared private link.JSON７ NoteAzure Private Link is used internally, at no charge, to set up the shared private link.1 - Retrieve connection information2 - Create the body of the request{    \u0022name\u0022: \u0022{{shared-private-link-name}}\u0022,    \u0022properties\u0022: {        \u0022privateLinkResourceId\u0022: \u0022/subscriptions/{{target-resource-subscription-ID}}/resourceGroups/{{target-resource-rg}}/providers/Microsoft. Sql/managedInstances/{{target-resource-name}}\u0022,        \u0022resourceRegion\u0022: \u0022a1b22c333d44\u0022,        \u0022groupId\u0022: \u0022managedInstance\u0022,        \u0022requestMessage\u0022: \u0022please approve\u0022,    }}2. Provide a meaningful name for the shared private link.\nThe shared private linkappears alongside other private endpoints. A name like \u0022shared-private-link-for-search\u0022 can remind you how it\u0027s used.3. Paste in the DNS zone name in \u0022resourceRegion\u0022 that you retrieved in an earlierstep.4. Edit the \u0022privateLinkResourceId\u0022 to reflect the private endpoint of your managedinstance.\n"
}