{
  "Id": "829",
  "Title": "\u0022Configuring Plain Text Indexing in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou might find a full or partial solution through built-in skills, buta more likely solution would be learning model that understands your content,articulated in custom learning model, wrapped in a custom skill.To index plain text blobs, create or update an indexer definition with the parsingModeconfiguration property to text on a Create Indexer request:HTTPSet up plain text indexingBy default, the UTF-8 encoding is assumed. To specify a different encoding, use theencoding configuration property:HTTPParsing modes are specified in the indexer definition.HTTPIndexers in Azure Cognitive SearchHow to configure a blob indexerBlob indexing overviewPUT https://[service name].\r\nsearch.windows.net/indexers/[indexer name]?api-version=2020-06-30 Content-Type: application/json api-key: [admin key] {   ... other parts of indexer definition   \u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022parsingMode\u0022 : \u0022text\u0022 } } } {   ... other parts of indexer definition   \u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022parsingMode\u0022 : \u0022text\u0022, \u0022encoding\u0022 : \u0022windows-1252\u0022 } } } Request examplePOST https://[service name].search.windows.\r\nnet/indexers?\r\napi-version=2020-06-30 Content-Type: application/json api-key: [admin key] {   \u0022name\u0022 : \u0022my-plaintext-indexer\u0022,   \u0022dataSourceName\u0022 : \u0022my-blob-datasource\u0022,   \u0022targetIndexName\u0022 : \u0022my-target-index\u0022,   \u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022parsingMode\u0022 : \u0022delimitedText\u0022, \u0022delimitedTextHeaders\u0022 : \u0022id,datePublished,tags\u0022 } } } Next stepsIndex CSV blobs and files usingdelimitedText parsing modeArticle•10/04/2022Applies to: Blob indexers, File indexersIn Azure Cognitive Search, both blob indexers and file indexers support a delimitedTextparsing mode for CSV files that treats each line in the CSV as a separate searchdocument.\nFor example, given the following comma-delimited text, the delimitedTextparsing mode would result in two documents in the search index:textWithout the delimitedText parsing mode, the entire contents of the CSV file would betreated as one search document.\n"
}