{
  "Id": "478",
  "Title": "\u0022Configuring Language Analyzers in Azure Cognitive Search: Examples and Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfString\u0022,           \u0022searchable\u0022:true,           \u0022indexAnalyzer\u0022:\u0022whitespace\u0022,           \u0022searchAnalyzer\u0022:\u0022simple\u0022        },     ],  }Language analyzer example  {     \u0022name\u0022:\u0022myindex\u0022,     \u0022fields\u0022:[        {           \u0022name\u0022:\u0022id\u0022,If you are using the .NET SDK code samples, you can append these examples to use orconfigure analyzers.\r\nAssign a built-in analyzerConfigure an analyzerAny analyzer that is used as-is, with no configuration, is specified on a field definition.There is no requirement for creating an entry in the [analyzers] section of the index.Language analyzers are used as-is. To use them, call LexicalAnalyzer, specifying theLexicalAnalyzerName type providing a text analyzer supported in Azure CognitiveSearch.\r\nCustom analyzers are similarly specified on the field definition, but for this to work youmust specify the analyzer in the index definition, as described in the next section.C#           \u0022type\u0022:\u0022Edm.String\u0022,           \u0022key\u0022:true,           \u0022searchable\u0022:false        },        {           \u0022name\u0022:\u0022text\u0022,           \u0022type\u0022:\u0022Edm.\r\nString\u0022,           \u0022searchable\u0022:true,           \u0022indexAnalyzer\u0022:\u0022whitespace\u0022,           \u0022searchAnalyzer\u0022:\u0022simple\u0022        },        {           \u0022name\u0022:\u0022text_fr\u0022,           \u0022type\u0022:\u0022Edm.String\u0022,           \u0022searchable\u0022:true,           \u0022analyzer\u0022:\u0022fr.lucene\u0022        }     ],  }C# examplesAssign a language analyzer    public partial class Hotel    {       .\r\n. .         [SearchableField(AnalyzerName = LexicalAnalyzerName.Values.EnLucene)]When customization or configuration is required, add an analyzer construct to an index.Once you define it, you can add it the field definition as demonstrated in the previousexample.Create a CustomAnalyzer object. A custom analyzer is a user-defined combination of aknown tokenizer, zero or more token filter, and zero or more character filter names:CustomAnalyzer.TokenizerCustomAnalyzer.TokenFiltersCustomAnalyzer.CharFiltersThe following example creates a custom analyzer named \u0022url-analyze\u0022 that uses theuax_url_email tokenizer and the Lowercase token filter.\n"
}