{
  "Id": "787",
  "Title": "\u0022Configuring Synonym Rules and Field Usage in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFirst, define and upload synonym rules. Second,configure fields to use them. The process is outlined in UploadSynonyms andEnableSynonymsInHotelsIndex.1. Add a synonym map to your search service. In UploadSynonyms, we define fourrules in our synonym map \u0027desc-synonymmap\u0027 and upload to the service.C#   Console.ReadKey();}\u0022Before\u0022 queriesConsole.\r\nWriteLine(\u0022Search the entire index for the phrase \\\u0022five star\\\u0022:\\n\u0022);results = searchClient.Search\u003CHotel\u003E(\u0022\\\u0022five star\\\u0022\u0022, searchOptions);WriteDocuments(results);Console.WriteLine(\u0022Search the entire index for the term \u0027internet\u0027:\\n\u0022);results = searchClient.Search\u003CHotel\u003E(\u0022internet\u0022, searchOptions);WriteDocuments(results);Console.\r\nWriteLine(\u0022Search the entire index for the terms \u0027economy\u0027 AND \u0027hotel\u0027:\\n\u0022);results = searchClient.Search\u003CHotel\u003E(\u0022economy AND hotel\u0022, searchOptions);WriteDocuments(results);Enable synonymsprivate static void UploadSynonyms(SearchIndexClient indexClient){   var synonymMap = new SynonymMap(\u0022desc-synonymmap\u0022, \u0022hotel, 2.\r\nConfigure searchable fields to use the synonym map in the index definition. InAddSynonymMapsToFields, we enable synonyms on two fields category and tags bysetting the SynonymMapNames property to the name of the newly uploaded synonymmap.C#When you add a synonym map, index rebuilds are not required.\r\nYou can add asynonym map to your service, and then amend existing field definitions in anyindex to use the new synonym map. The addition of new attributes has no impacton index availability. The same applies in disabling synonyms for a field. You cansimply set the SynonymMapNames property to an empty list. C#After the synonym map is uploaded and the index is updated to use the synonym map,the second RunQueriesWithNonExistentTermsInIndex call outputs the following:Bashmotel\\ninternet,wifi\\nfive star=\u003Eluxury\\neconomy,inexpensive=\u003Ebudget\u0022);   indexClient.CreateOrUpdateSynonymMap(synonymMap);}private static SearchIndex AddSynonymMapsToFields(SearchIndex index){   index.Fields.\n"
}