{
  "Id": "776",
  "Title": "\u0022Configuring Token Filters and Stopwords in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOptionsrules (type: string array) -Stemming rules in thefollowing format word =\u003E1token_filter_nametoken_filter_type Description and Optionsstem for example ran =\u003Erun. The default is an emptylist. Required.stopwordsStopwordsTokenFilterRemoves stop words from atoken stream. By default, thefilter uses a predefined stopword list for English.Optionsstopwords (type: stringarray) - A list of stopwords.Can\u0027t be specified if astopwordsList is specified.stopwordsList (type: string) -A predefined list ofstopwords. Can\u0027t bespecified if stopwords isspecified.\r\nAllowed valuesinclude:arabic, armenian,basque, brazilian,bulgarian, catalan, czech,danish, dutch, english,finnish, french, galician,german, greek, hindi,hungarian, indonesian,irish, italian, latvian,norwegian, persian,portuguese, romanian,russian, sorani, spanish,swedish, thai, turkish,default: english. Can\u0027t bespecified if stopwords isspecified.\r\nignoreCase (type: bool) - Iftrue, all words are lowercased first. The default isfalse.removeTrailing (type: bool) -If true, ignore the last searchterm if it\u0027s a stop word. Thedefault is true.1token_filter_nametoken_filter_type Description and OptionssynonymSynonymTokenFilterMatches single or multiword synonyms in a tokenstream.Optionssynonyms (type: string array)- Required. List of synonymsin one of the following twoformats:-incredible, unbelievable,fabulous =\u003E amazing - allterms on the left side of =\u003Esymbol are replaced with allterms on its right side.-incredible, unbelievable,fabulous, amazing - Acomma-separated list ofequivalent words. Set theexpand option to changehow this list is interpreted.ignoreCase (type: bool) -Case-folds input formatching. The default isfalse.expand (type: bool) - If true,all words in the list ofsynonyms (if =\u003E notation isnot used) map to oneanother.\n"
}