{
  "Id": "975",
  "Title": "\u0022Configuring and Running Indexers in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFormore information, see Supported data types (Azure Cognitive Search).MySQL data typesCognitive Search field typesbool, booleanEdm.Boolean, Edm.Stringtinyint, smallint, mediumint, int, integer, yearEdm.Int32, Edm.Int64,Edm.StringbigintEdm.Int64, Edm.Stringfloat, double, realEdm.Double, Edm.Stringdate, datetime, timestampEdm.DateTimeOffset,Edm.\r\nStringchar, varchar, tinytext, mediumtext, text, longtext, enum, set,timeEdm.Stringunsigned numerical data, serial, decimal, dec, bit, blob, binary,geometryN/AOnce the index and data source have been created, you\u0027re ready to create the indexer.Indexer configuration specifies the inputs, parameters, and properties controlling runtime behaviors.\r\n1. Create or update an indexer by giving it a name and referencing the data sourceand target index:HTTPMapping data types７ NoteThe preview does not support geometry types and blobs.Configure and run the MySQL indexerPOST https://[search service name].search.windows.net/indexers?api-version=2020-06-30 2.\r\nSpecify field mappings if there are differences in field name or type, or if you needmultiple versions of a source field in the search index.An indexer runs automatically when it\u0027s created. You can prevent it from running bysetting disabled to true. To control indexer execution, run an indexer on demand orput it on a schedule.\r\nTo monitor the indexer status and execution history, send a Get Indexer Status request:HTTPThe response includes status and the number of items processed. It should look similarto the following example:JSON{     \u0022name\u0022 : \u0022hotels-mysql-idxr\u0022,     \u0022dataSourceName\u0022 : \u0022hotels-mysql-ds\u0022,     \u0022targetIndexName\u0022 : \u0022hotels-mysql-ix\u0022,     \u0022disabled\u0022: null,     \u0022schedule\u0022: null,     \u0022parameters\u0022: {         \u0022batchSize\u0022:\n"
}