{
  "Id": "859",
  "Title": "\u0022Configuring IP Address Range Restrictions for Azure Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDetails for configuring IP address range restrictions for each data source type can befound from the following links:Azure StorageTroubleshoot connections to restrictedresourcesFirewall rulesAzure Cosmos DBAzure SQLLimitation: IP address range restrictions only work if your search service, and yourstorage account are in different regions.Azure functions (that could be used as a Custom Web Api skill) also support IP addressrestrictions.\r\nThe list of IP addresses to configure would be the IP address of your searchservice and the IP address range of AzureCognitiveSearch service tag.For more information about connecting to a virtual machine, see Configure aconnection to SQL Server on an Azure VM.When accessing data in a SQL managed instance, or when an Azure VM is used as theweb service URI for a Custom Web Api skill, customers need not be concerned withspecific IP addresses.\r\nIn such cases, the Azure VM, or the SQL managed instance can be configured to residewithin a virtual network. Then a network security group can be configured to filter thetype of network traffic that can flow in and out of the virtual network subnets andnetwork interfaces.The AzureCognitiveSearch service tag can be directly used in the inbound NSG ruleswithout needing to look up its IP address range.More details for accessing data in a SQL managed instance are outlined here.Usually, network errors are generic.\r\nSome common errors include:A network-related or instance-specific error occurred while establishing aconnection to the serverThe server was not found or was not accessibleVerify that the instance name is correct and that the source is configured toallow remote connectionsWhen you are receiving any of those errors: Make sure your source is accessible by trying to connect to it directly and notthrough the search serviceConfigure network security group (NSG) rulesNetwork errorsCheck your source in the Azure portal for any current errors or outagesCheck for any network outages in Azure StatusCheck you are using public DNS for name resolution and not an Azure Private DNSIf your SQL database is on a serverless compute tier, make sure that the database isrunning (and not paused) when the indexer connects to it.\n"
}