{
  "Id": "1434",
  "Title": "\u0022Configuring Access Permissions for Azure Search Service and Resources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOptionally,you can configure a resource instance rule to admit requests.For all other resources and connections, configure an IP firewall rule that admitsrequests from Search. See Indexer access to content protected by Azure networksecurity features for details.A managed identity must be paired with an Azure role that determines permissions onthe Azure resource.Data reader permissions are needed for indexer data connections and foraccessing a customer-managed key in Azure Key Vault.Contributor (write) permissions are needed for AI enrichment features that useAzure Storage for hosting debug session data, enrichment caching, and long-termcontent storage in a knowledge store.The following steps are for Azure Storage.\r\nIf your resource is Azure Cosmos DB or AzureSQL, the steps are similar.1. Sign in to Azure portal and find your Azure resource to which the searchservice must have access.2. In Azure Storage, select Access control (AIM) on the left navigation pane.3. Select Add role assignment.4.\r\nOn the Role page, select the roles needed for your search service:TaskRole assignmentBlob indexing usingan indexerAdd Storage Blob Data ReaderADLS Gen2 indexingusing an indexerAdd Storage Blob Data ReaderTable indexing usingan indexerAdd Reader and Data AccessAssign a roleTaskRole assignmentFile indexing usingan indexerAdd Reader and Data AccessWrite to aknowledge storeAdd Storage Blob DataContributor for object and file projections,and Reader and Data Access for table projections. Write to anenrichment cacheAdd Storage Blob Data ContributorSave debug sessionstateAdd Storage Blob Data Contributor5. On the Members page, select Managed Identity.6. Select members. In the Select managed identity page, choose your subscriptionand then filter by service type, and then select the service. Only those services thathave a managed identity will be available to select.7. Select Review \u002B assign.Once a managed identity is defined for the search service and given a role assignment,outbound connections can be modified to use the unique resource ID of the otherAzure resource.\n"
}