{
  "Id": "971",
  "Title": "\u0022Configuring Indexers for Azure Database for MySQL in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf.. // rest of indexer definition     \u0022outputFieldMappings\u0022: [        {          \u0022sourceFieldName\u0022: \u0022/document/vertex/pages\u0022,          \u0022targetFieldName\u0022: \u0022totalpages\u0022        }    ]document under the /document node when ingesting the graph data and the indexeralso automatically allows you to reference the value of pages by simple referencingpages instead of having to reference the first object in the array of pages.\r\nTo learn more about Azure Cosmos DB for Apache Gremlin, see the Introduction toAzure Cosmos DB: Azure Cosmos DB for Apache Gremlin.For more information about Azure AI Search scenarios and pricing, see the Searchservice page on azure.microsoft.com.To learn about network configuration for indexers, see the Indexer access tocontent protected by Azure network security features.Next stepsIndex data from Azure Database forMySQLArticle•02/23/2023In this article, learn how to configure an indexer that imports content from AzureDatabase for MySQL and makes it searchable in Azure Cognitive Search.\r\nThis article supplements Creating indexers in Azure Cognitive Search with informationthat\u0027s specific to indexing files in Azure Database for MySQL. It uses the REST APIs todemonstrate a three-part workflow common to all indexers:Create a data sourceCreate an indexCreate an indexerWhen configured to include a high water mark and soft deletion, the indexer takes allchanges, uploads, and deletes for your MySQL database.\r\nIt reflects these changes inyour search index. Data extraction occurs when you submit the Create Indexer request.Register for the preview to provide feedback and get help with any issues youencounter.Azure Database for MySQL flexible server.A table or view that provides the content. A primary key is required. If you\u0027re usinga view, it must have a high water mark column.Read permissions. A full access connection string includes a key that grants accessto the content, but if you\u0027re using Azure roles, make sure the search servicemanaged identity has Reader permissions on MySQL.\n"
}