{
  "Id": "1412",
  "Title": "\u0022Configuring IP Rules for Azure Search Service Access Control\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can set IP rules in the Azure portal, as described in this article, or use theManagement REST API, Azure PowerShell, or Azure CLI.A search service at the Basic tier or higher1. Sign in to Azure portal and go to your Azure AI Search service page.2. Select Networking on the left navigation pane.3. Set Public Network Access to Selected Networks. If your connectivity is set toDisabled, you can only access your search service via a private endpoint.７ NoteTo access a search service protected by an IP firewall through the portal, allowaccess from a specific client and the portal IP address.\r\nPrerequisitesSet IP ranges in Azure portalThe Azure portal provides the ability to specify IP addresses and IP address rangesin the CIDR format. An example of CIDR notation is 8.8.8.0/24, which representsthe IPs that range from 8.8.8.0 to 8.8.8.255.4. Select Add your client IP address under Firewall to create an inbound rule for theIP address of your system.\r\n5. Add other client IP addresses for other machines, devices, and services that willsend requests to a search service.After you enable the IP access control policy for your Azure AI Search service, allrequests to the data plane from machines outside the allowed list of IP address rangesare rejected. When requests originate from IP addresses that aren\u0027t in the allowed list, a generic 403Forbidden response is returned with no other details.When IP rules are configured, some features of the Azure portal are disabled. You\u0027ll beable to view and manage service level information, but portal access to indexes,indexers, and other top-level resources is restricted. You can restore portal access to thefull range of search service operations by allowing access from the portal IP address andyour client IP address.To get the portal\u0027s IP address, perform nslookup (or ping) onstamp2.ext.search.windows.net, which is the domain of the traffic manager.\n"
}