{
  "Id": "1551",
  "Title": "\u0022Contributing to Azure Search: Building, Testing, and Suggestions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfmd for details on building, testing, and contributingto this library.This project welcomes contributions and suggestions. Most contributions require you toagree to a Contributor License Agreement (CLA) declaring that you have the right to,and actually do, grant us the rights to use your contribution. For details, visitcla.microsoft.com.This project has adopted the Microsoft Open Source Code of Conduct. For moreinformation see the Code of Conduct FAQ or contact opencode@microsoft.com withany additional questions or comments.# Configure a console outputhandler = logging.StreamHandler(stream=sys.stdout)logger.\r\naddHandler(handler)# This client will log detailed information about its HTTP sessions, at DEBUG levelclient = SearchClient(\u0022\u003Cservice endpoint\u003E\u0022, \u0022\u003Cindex_name\u003E\u0022, AzureKeyCredential(\u0022\u003Capi key\u003E\u0022), logging_enable=True)result =  client.search(search_text=\u0022spa\u0022, logging_enable=True)Next stepsContributingRelated projectsMicrosoft Azure SDK for Pythonazure-mgmt-search PackageReferencesearchPackagesaz searchReferenceManage Azure Search services, admin keys and query keys.\r\nNameDescriptionTypeStatusaz search admin-keyManage Azure Search admin keys.CoreGAaz search admin-keyrenewRegenerates either the primary or secondary admin APIkey.CoreGAaz search admin-keyshowGets the primary and secondary admin API keys for thespecified Azure Cognitive Search service. CoreGAaz search private-endpoint-connectionManage Azure Search private endpoint connections.CoreGAaz search private-endpoint-connectiondeleteDisconnects the private endpoint connection anddeletes it from the search service.CoreGAaz search private-endpoint-connectionlistGets a list of all private endpoint connections in thegiven service.CoreGAaz search private-endpoint-connectionshowGets the details of the private endpoint connection tothe search service in the given resource group.CoreGAaz search private-endpoint-connectionupdateUpdate an existing private endpoint connection in aSearch service in the given resource group.CoreGAaz search private-link-resourceManage Azure Search private link resources.\n"
}