{
  "Id": "1488",
  "Title": "\u0022Content Enrichment with Azure AI Search: Built-in Skills Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSee the Transparency Notes for each built-in skill linked below forconsiderations when choosing to use a skill:Key Phrase Extraction Skill: Language Service - Key Phrase ExtractionLanguage Detection Skill: Language Service - Language DetectionEntity Linking Skill: Language Service - Entity LinkingEntity Recognition Skill: Language Service - Named Entity Recognition (NER)PII Detection Skill:\r\nLanguage Service - PII DetectionSentiment Skill: Language Service - Sentiment AnalysisImage Analysis Skill: Computer Vision - Image AnalysisOCR Skill: Computer Vision - OCRAI enrichmentCapabilitiesAI enrichmentSystem behaviorPlease see the documentation for each skill to learn more about their respectivecapabilities, limitations, performance, evaluations, and methods for integration andresponsible use.\r\nNote that using these skills in combination may lead tocompounding effects (for example, errors introduced when using OCR will carrythrough when using key phrase extraction).Because Azure AI Search is a full text search solution, the purpose of AI enrichmentis to improve the search utility of unstructured content.\r\nHere are some examples ofcontent enrichment scenarios supported by the built-in skills:Translation and language detection enable multilingual search.Entity recognition extracts people , places , and other entities from largechunks of text.Key phrase extraction identifies and then outputs important terms.OCR recognizes printed and handwritten text in binary files.Image analysis describes image content and outputs the descriptions assearchable text fields. Integrated vectorization is a preview feature that calls the Azure OpenAIembeddings model to vectorize data and store embeddings in Azure Searchfor similarity search.AI enrichment in Azure AI Search uses the indexer and data source features of theservice to call Azure AI Services to perform the content enrichment. Limitations ofthe indexers and data sources used in this process will apply. Review the indexerand data source documentation for more information about these relatedlimitations. The limitations of each Azure AI Service used by the AI enrichmentpipeline in Azure AI Search will also apply. See the transparency notes for eachservice for more information about these limitations.\n"
}