{
  "Id": "1011",
  "Title": "\u0022Controlling Document Indexing: File Type and Inclusion Parameters\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfInclude or exclude by file typePUT /indexers/[indexer name]?api-version=2020-06-30{    \u0022parameters\u0022 : {         \u0022configuration\u0022 : {             \u0022indexedFileNameExtensions\u0022 : \u0022.pdf, .docx\u0022,            \u0022excludedFileNameExtensions\u0022 : \u0022.png, .\r\njpeg\u0022         }     }}Controlling which documents are indexedNameThe \u0022name\u0022 property is required and must be one of three values:ValueDescriptiondefaultSiteLibraryIndex all content from the site\u0027s default document library.allSiteLibrariesIndex all content from all document libraries in a site. Document libraries from a subsite are out of scope/ If you need content fromsubsites, choose \u0022useQuery\u0022 and specify \u0022includeLibrariesInSite\u0022.\r\nuseQueryOnly index the content defined in the \u0022query\u0022.The \u0022query\u0022 parameter of the data source is made up of keyword/value pairs. The below are the keywords that can be used. The values areeither site URLs or document library URLs.KeywordValue description and examplesnullIf null or empty, index either the default document library or all document libraries depending on the container name.\r\nExample:\u0022container\u0022 : { \u0022name\u0022 : \u0022defaultSiteLibrary\u0022, \u0022query\u0022 : null }includeLibrariesInSiteIndex content from all libraries under the specified site in the connection string. The scope includes any subsites of your site. The value should subsite. Example:\u0022container\u0022 : { \u0022name\u0022 : \u0022useQuery\u0022, \u0022query\u0022 : \u0022includeLibrariesInSite=https://mycompany.sharepoint.com/mysite\u0022 }includeLibraryIndex all content from this library. The value is the fully qualified path to the library, which can be copied from your browser:Example 1 (fully qualified path):\u0022container\u0022 : { \u0022name\u0022 : \u0022useQuery\u0022, \u0022query\u0022 : \u0022includeLibrary=https://mycompany.\n"
}