{
  "Id": "1018",
  "Title": "\u0022Cost Estimation for Azure AI Search Enrichment and Extraction\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTextextraction occurs during the document cracking phase and isn\u0027t technically anenrichment, but it occurs during AI enrichment and is thus noted here.During AI enrichment, Azure AI Search calls the Azure AI services APIs for built-in skillsthat are based on Azure AI Vision, Translator, and Azure AI Language.\r\nBillable built-in skills that make backend calls to Azure AI services include Entity Linking,Entity Recognition, Image Analysis, Key Phrase Extraction, Language Detection, OCR,Personally Identifiable Information (PII) Detection, Sentiment, and Text Translation.Image extraction is an Azure AI Search operation that occurs when documents arecracked prior to enrichment.\r\nImage extraction is billable on all tiers, except for 20 freedaily extractions on the free tier. Image extraction costs apply to image files insideblobs, embedded images in other files (PDF and other app files), and for imagesextracted using Document Extraction. For image extraction pricing, see the Azure AISearch pricing page.\r\nTo estimate the costs associated with Azure AI Search indexing, start with an idea ofwhat an average document looks like so you can run some numbers. For example, youmight approximate:1,000 PDFs.Six pages each.One image per page (6,000 images).3,000 characters per page.\r\nBillable enrichments TipTo lower the cost of skillset processing, enable incremental enrichment (preview)to cache and reuse any enrichments that are unaffected by changes made to askillset. Caching requires Azure Storage (see pricing but the cumulative cost ofskillset execution is lower if existing enrichments can be reused, especially forskillsets that use image extraction and analysis. Example: Estimate costsAssume a pipeline that consists of document cracking of each PDF, image and textextraction, optical character recognition (OCR) of images, and entity recognition oforganizations.The prices shown in this article are hypothetical. They\u0027re used to illustrate the estimationprocess. Your costs could be lower.\n"
}