{
  "Id": "1416",
  "Title": "\u0022Creating Azure Cognitive Search Service with Private Endpoint\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfResourcegroupSelect Create new, enter a name, such as \u0022myResourceGroup\u0022, then selectOK.NameEnter a name, such as \u0022MyVirtualNetwork\u0022.RegionSelect a region.3. Accept the defaults for the rest of the settings. Select Review \u002B create and thenCreate.In this section, you\u0027ll create a new Azure Cognitive Search service with a PrivateEndpoint.\r\n1. On the upper-left side of the screen in the Azure portal, select Create a resource \u003EWeb \u003E Azure Cognitive Search.2. In New Search Service - Basics, enter or select the following values:SettingValuePROJECTDETAILSSubscriptionSelect your subscription.ResourcegroupUse the resource group that you created in the previous step.\r\nCreate the virtual networkCreate a search service with a private endpointSettingValueINSTANCEDETAILSURLEnter a unique name.LocationSelect your region.Pricing tierSelect Change Pricing Tier and choose your desired service tier. Privateendpoints aren\u0027t supported on the Free tier. You must select Basic or higher.3. Select Next: Scale.4.\r\nAccept the defaults and select Next: Networking.5. In New Search Service - Networking, select Private for Endpointconnectivity(data).6. Select \u002B Add under Private endpoint.7. In Create Private Endpoint, enter or select values that associate your search servicewith the virtual network you created:SettingValueSubscriptionSelect your subscription.\r\nResource groupUse the resource group that you created in the previousstep.LocationSelect a region.NameEnter a name, such as \u0022myPrivateEndpoint\u0022.Target subresourceAccept the default searchService.NETWORKINGVirtual networkSelect the virtual network you created in the previous step.SubnetSelect the default.PRIVATE DNS INTEGRATIONIntegrate with private DNSzoneAccept the default \u0022Yes\u0022. Private DNS zoneAccept the default (New) privatelink.search.windows.net.8. Select OK.9. Select Review \u002B create. You\u0027re taken to the Review \u002B create page where Azurevalidates your configuration.10. When you see the Validation passed message, select Create.11. Once provisioning of your new service is complete, browse to the resource thatyou created.\n"
}