{
  "Id": "327",
  "Title": "\u0022Creating Azure AI Search Pipeline with Python Script\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfReplacethe placeholder YOUR-BLOB-CONTAINER-NAME with the name of your container. Then,run the script to create a data source named cogsrch-py-datasource.Pythonskillset_name = \u0022cogsrch-py-skillset\u0022index_name = \u0022cogsrch-py-index\u0022indexer_name = \u0022cogsrch-py-indexer\u0022# Setup the endpointendpoint = \u0027https://\u003CYOUR-SEARCH-SERVICE-NAME\u003E.search.windows.\r\nnet/\u0027headers = {\u0027Content-Type\u0027: \u0027application/json\u0027,           \u0027api-key\u0027: \u0027\u003CYOUR-ADMIN-API-KEY\u003E\u0027}params = {    \u0027api-version\u0027: \u00272020-06-30\u0027}3 - Create the pipelineStep 1: Create a data source# Create a data sourcedatasourceConnectionString = \u0022\u003CYOUR-BLOB-RESOURCE-CONNECTION-STRING\u003E\u0022datasource_payload = {    \u0022name\u0022: datasource_name,    \u0022description\u0022: \u0022Demo files to demonstrate Azure AI Search capabilities.\r\n\u0022,    \u0022type\u0022: \u0022azureblob\u0022,    \u0022credentials\u0022: {        \u0022connectionString\u0022: datasourceConnectionString    },    \u0022container\u0022: {The request should return a status code of 201 confirming success.In the Azure portal, on the search service dashboard page, verify that the cogsrch-py-datasource appears in the Data sources list. Select Refresh to update the page.In this step, you\u0027ll define a set of enrichment steps using built-in skills from Microsoft:Entity Recognition for extracting the names of organizations from content in theblob container.Language Detection to identify the content\u0027s language.Text Split to break large content into smaller chunks before calling the key phraseextraction skill. Key phrase extraction accepts inputs of 50,000 characters or less. Afew of the sample files need splitting up to fit within this limit.Key Phrase Extraction to pull out the top key phrases.Run the following script to create a skillset called cogsrch-py-skillset.\n"
}