{
  "Id": "1433",
  "Title": "\u0022Creating and Managing User-Assigned Managed Identities in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf4. Select Save.1,2112Create a system managed identityAzure portalAfter saving, you\u0027ll see an object identifier that\u0027s been assigned to your searchservice.A user-assigned managed identity is a resource on Azure. It\u0027s useful if you need moregranularity in role assignments because you can create separate identities for differentapplications and scenarios.\r\nCreate a user-assigned managed identity(preview)） ImportantThis feature is in public preview under supplemental terms of use. User-assignedmanaged identities aren\u0027t currently supported for connections to a network-1. Sign in to Azure portal2. Select \u002B Create a resource.3.\r\nIn the \u0022Search services and marketplace\u0022 search bar, search for \u0022User AssignedManaged Identity\u0022 and then select Create.4. Select the subscription, resource group, and region. Give the identity adescriptive name.5. Select Create and wait for the resource to finish deploying.In the next several steps, you\u0027ll assign the user-assigned managed identity toyour search service.\r\n6. In your search service page, under Settings, select Identity.7. On the User assigned tab, select Add.8. Choose the subscription and then select the user-assigned managed resourcethat you created in the previous step.protected storage account. The search request currently requires a public IPaddress.Azure portalAllow firewall accessIf your Azure resource is behind a firewall, make sure there\u0027s an inbound rule that admitsrequests from your search service.For same-region connections to Azure Blob Storage or Azure Data Lake StorageGen2, use a system managed identity and the trusted service exception. Optionally,you can configure a resource instance rule to admit requests.For all other resources and connections, configure an IP firewall rule that admitsrequests from Search. See Indexer access to content protected by Azure networksecurity features for details.A managed identity must be paired with an Azure role that determines permissions onthe Azure resource.Data reader permissions are needed for indexer data connections and foraccessing a customer-managed key in Azure Key Vault.Contributor (write) permissions are needed for AI enrichment features that useAzure Storage for hosting debug session data, enrichment caching, and long-termcontent storage in a knowledge store.The following steps are for Azure Storage.\n"
}