{
  "Id": "851",
  "Title": "\u0022Creating Azure SQL Database Data Source with Managed Identity\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe ResourceId must include the subscription ID of Azure SQL Database, the resourcegroup of SQL Database, and the name of the SQL database.Here\u0027s an example of how to create a data source to index data from a storage accountusing the Create Data Source REST API and a managed identity connection string. Themanaged identity connection string format is the same for the REST API, .\r\nNET SDK, andthe Azure portal.HTTP3 - Create the data sourceSystem-assigned managed identityPOST https://[service name].search.windows.net/datasources?api-version=2020-06-30 Content-Type: application/json api-key: [admin key] {     \u0022name\u0022 : \u0022sql-datasource\u0022,     \u0022type\u0022 : \u0022azuresql\u0022,     \u0022credentials\u0022 : {          \u0022connectionString\u0022 : \u0022Database=[SQL database name];ResourceId=/subscriptions/[subscription ID]/resourceGroups/[resource group name]/providers/Microsoft.\r\nSql/servers/[SQL Server name];Connection Timeout=30;\u0022     },     \u0022container\u0022 : {          \u0022name\u0022 : \u0022my-table\u0022      } }  The 2021-04-30-preview REST API supports connections based on a user-assignedmanaged identity.\r\nWhen you\u0027re connecting with a user-assigned managed identity,there are two changes to the data source definition:First, the format of the \u0022credentials\u0022 property is an Initial Catalog or Databasename and a ResourceId that has no account key or password. The ResourceId mustinclude the subscription ID of Azure SQL Database, the resource group of SQLDatabase, and the name of the SQL database. This is the same format as thesystem-assigned managed identity.Second, you\u0027ll add an \u0022identity\u0022 property that contains the collection of user-assigned managed identities. Only one user-assigned managed identity should beprovided when creating the data source.\nSet it to type \u0022userAssignedIdentities\u0022.Here\u0027s an example of how to create an indexer data source object using the previewCreate or Update Data Source REST API:HTTPUser-assigned managed identity (preview)POST https://[service name].search.windows.\n"
}