{
  "Id": "625",
  "Title": "\u0022Creating and Migrating Azure Search Service for High Availability\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCreate a new search service in the same region as the old search service. Thisregion should support availability zones on or after the current date.2. Add at least two replicas to your new search service. Once the search service has atleast two replicas, it automatically takes advantage of availability zone support.3.\r\nMigrate your data from your old search service to your new search service byrebuilding of all your search indexes from your old service.To rebuild all of your search indexes, choose one of the following two options:Move individual indexes from your old search service to your new oneRebuild indexes from an external data source if one is available.1. Redirect traffic from your old search service to your new search service.\r\nThis mayrequire updates to your application that uses the old search service.Migration guidance: Recreate your searchserviceWhen to recreate your search serviceHow to recreate your search service） ImportantThe free and basic tiers do not support availability zones, and so they shouldnot be used. TipServices such as Azure Front Door and Azure Traffic Manager help simplify thisprocess.\r\nNext stepsLearn how to create and deploy ARM templatesARM Quickstart TemplatesLearn about high availability in Azure Cognitive SearchDesign patterns for multitenant SaaSapplications and Azure AI SearchArticle•11/15/2023A multitenant application is one that provides the same services and capabilities to anynumber of tenants who can\u0027t see or share the data of any other tenant. This articlediscusses tenant isolation strategies for multitenant applications built with Azure AISearch.As a search-as-a-service solution, Azure AI Search allows developers to add rich searchexperiences to applications without managing any infrastructure or becoming an expertin information retrieval. Data is uploaded to the service and then stored in the cloud.Using simple requests to the Azure AI Search API, the data can then be modified andsearched.Before discussing design patterns, it\u0027s important to understand a few basic concepts.When using Azure AI Search, one subscribes to a search service.\n"
}