{
  "Id": "840",
  "Title": "\u0022Creating Data Sources with Managed Identity in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPrerequisites TipFor a code example in C#, see Index Data Lake Gen2 using Microsoft Entra IDon GitHub.Create the data sourceCreate the data source and provide either a system-assigned managed identity or auser-assigned managed identity (preview).The REST API, Azure portal, and the .NET SDK support using a system-assignedmanaged identity.When you\u0027re connecting with a system-assigned managed identity, the only change tothe data source definition is the format of the \u0022credentials\u0022 property. You\u0027ll provide aResourceId that has no account key or password.\r\nThe ResourceId must include thesubscription ID of the storage account, the resource group of the storage account, andthe storage account name.Here\u0027s an example of how to create a data source to index data from a storage accountusing the Create Data Source REST API and a managed identity connection string. Themanaged identity connection string format is the same for the REST API, .\r\nNET SDK, andthe Azure portal.HTTPThe 2021-04-30-preview REST API supports connections based on a user-assignedmanaged identity. When you\u0027re connecting with a user-assigned managed identity,there are two changes to the data source definition:System-assigned managed identityPOST https://[service name].search.windows.\r\nnet/datasources?api-version=2020-06-30Content-Type: application/jsonapi-key: [admin key]{    \u0022name\u0022 : \u0022blob-datasource\u0022,    \u0022type\u0022 : \u0022azureblob\u0022,    \u0022credentials\u0022 : {         \u0022connectionString\u0022 : \u0022ResourceId=/subscriptions/[subscription ID]/resourceGroups/[resource group name]/providers/Microsoft. Storage/storageAccounts/[storage account name]/;\u0022     },    \u0022container\u0022 : {         \u0022name\u0022 : \u0022my-container\u0022, \u0022query\u0022 : \u0022\u003Coptional-virtual-directory-name\u003E\u0022     }}   User-assigned managed identity (preview)First, the format of the \u0022credentials\u0022 property is a ResourceId that has no accountkey or password.\n"
}