{
  "Id": "758",
  "Title": "\u0022Creating Custom Analyzers for Azure Search: Best Practices and Guidelines\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAdd the Standard ASCII folding filter to normalize diacritics like ö orê in search terms.To create a custom analyzer, specify it in the analyzers section of an index at designtime, and then reference it on searchable, Edm.String fields using either the analyzerproperty, or the indexAnalyzer and searchAnalyzer pair.An analyzer definition includes a name, type, one or more character filters, a maximumof one tokenizer, and one or more token filters for post-tokenization processing.Character filters are applied before tokenization. Token filters and character filters areapplied from left to right.\r\nNames in a custom analyzer must be unique and can\u0027t be the same as any of thebuilt-in analyzers, tokenizers, token filters, or characters filters. It must only containletters, digits, spaces, dashes or underscores, can only start and end withalphanumeric characters, and is limited to 128 characters.Type must be #Microsoft.Azure.Search.CustomAnalyzer.charFilters can be one or more filters from Character Filters, processed beforetokenization, in the order provided. Some character filters have options, which canbe set in a charFilters section. Character filters are optional.tokenizer is exactly one Tokenizer. A value is required. If you need more than onetokenizer, you can create multiple custom analyzers and assign them on a field-by-field basis in your index schema.tokenFilters can be one or more filters from Token Filters, processed aftertokenization, in the order provided. For token filters that have options, add atokenFilter section to specify the configuration. Token filters are optional.７ NoteCustom analyzers aren\u0027t exposed in the Azure portal. The only way to add a customanalyzer is through code that defines an index.Create a custom analyzerAnalyzers must not produce tokens longer than 300 characters, or indexing will fail.\n"
}