{
  "Id": "361",
  "Title": "\u0022Creating a Custom Connector for Azure Cognitive Search in Power Apps\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPower Apps accountHotels-sample index hosted on your search serviceQuery API keyA connector in Power Apps is a data source connection. In this step, create a customconnector to connect to a search index in the cloud.1. Sign in to Power Apps.2. On the left, expand ... More. Find, pin, and then select Custom Connectors.\r\nConnect to Azure Cognitive Search＂Set up a query request＂Visualize results in a canvas app＂Prerequisites1 - Create a custom connector3. Select \u002B New custom connector, and then select Create from blank.4. Give your custom connector a name (for example, AzureSearchQuery), and thenselect Continue.5.\r\nEnter information in the General Page:Icon background color (for instance, #007ee5)Description (for instance, \u0022A connector to Azure Cognitive Search\u0022)In the Host, enter your search service URL (such as\u003Cyourservicename\u003E.search.windows.net)For Base URL, enter \u0022/\u00226. In the Security Page, set API Key as the Authentication Type, set both theparameter label and parameter name to api-key.\r\nFor Parameter location, selectHeader as shown in the following screenshot.7. In the Definitions Page, select \u002B New Action to create an action that queries theindex. Enter the value \u0022Query\u0022 for the summary and the name of the operation ID.Enter a description like \u0022Queries the search index\u0022.8. Scroll down.\r\nIn Requests, select \u002B Import from sample button to configure a queryrequest to your search service:Select the verb GETFor the URL, enter a sample query for your search index (search=* returns alldocuments, $select= lets you choose fields). The API version is required.Fully specified, a URL might look like this:https://mydemo.search.windows. net/indexes/hotels-sample-index/docs?search=*\u0026$select=HotelName,Description,Address/City\u0026api-version=2020-06-30For Headers, type Content-Type. You\u0027ll set the value to application/json in alater step.Power Apps uses the syntax in the URL to extract parameters from the query:search, select, and api-version parameters become configurable as youprogress through the wizard.\n"
}