{
  "Id": "1141",
  "Title": "\u0022Creating Projections and Connecting to Knowledge Store in Power BI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022/document/projectionShape/keyPhrases\u0022                 }             ],             \u0022objects\u0022: [                              ],             \u0022files\u0022: []         },          {             \u0022tables\u0022: [],             \u0022objects\u0022: [                 {                     \u0022storageContainer\u0022: \u0022unrelatedocrtext\u0022,                     \u0022source\u0022: null,                     \u0022sourceContext\u0022: \u0022/document/normalized_images/*/text\u0022,                     \u0022inputs\u0022:\r\n[                         {                             \u0022name\u0022: \u0022ocrText\u0022,                             \u0022source\u0022: \u0022/document/normalized_images/*/text\u0022                         }                     ]                 },                 {                     \u0022storageContainer\u0022: \u0022unrelatedocrlayout\u0022,                     \u0022source\u0022: null,                     \u0022sourceContext\u0022: \u0022/document/normalized_images/*/layoutText\u0022,                     \u0022inputs\u0022: [                         {                             \u0022name\u0022: \u0022ocrLayoutText\u0022,                             \u0022source\u0022: \u0022/document/normalized_images/*/layoutText\u0022                         }                     ]                 }             ],             \u0022files\u0022: []         }     ] } The example in this article demonstrates common patterns on how to createprojections.\r\nNow that you have a good understanding of the concepts, you\u0027re betterequipped to build projections for your specific scenario.Next stepsConfigure caching for incremental enrichmentConnect a knowledge store with PowerBIArticle•01/31/2023In this article, learn how to connect to and query a knowledge store using Power Queryin the Power BI Desktop app.\r\nYou can get started faster with templates, or build acustom dashboard from scratch.A knowledge store that\u0027s composed of tables in Azure Storage work best in Power BI. Ifthe tables contain projections from the same skillset and projection group, you caneasily \u0022join\u0022 them to build table visualizations that include fields from related tables. Follow the steps in this article using sample data and a knowledge store as created inthis portal quickstart or through Postman and REST APIs.1. Start Power BI Desktop and select Get data.2. In the Get Data window, select Azure, and then select Azure Table Storage.3. Select Connect.4. For Account Name or URL, enter in your Azure Storage account name (the full URLwill be created for you).\n"
}