{
  "Id": "161",
  "Title": "\u0022Creating a Search-Enabled Web App with Azure AI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdforiginal_publication_year { get; set; }        public string original_title { get; set; }        public string title { get; set; }        public string language_code { get; set; }        public double? average_rating { get; set; }        public decimal? ratings_count { get; set; }        public decimal?\r\nwork_ratings_count { get; set; }        public decimal? work_text_reviews_count { get; set; }        public decimal? ratings_1 { get; set; }        public decimal? ratings_2 { get; set; }        public decimal? ratings_3 { get; set; }        public decimal? ratings_4 { get; set; }        public decimal?\r\nratings_5 { get; set; }        public string image_url { get; set; }        public string small_image_url { get; set; }    }}Next steps1 - Overview of adding search to awebsiteArticle•11/17/2023In this Azure AI Search tutorial, create a web app that searches through a catalog ofbooks, and then deploy the website to an Azure Static Web Apps resource.\r\nThis tutorial is for JavaScript developers who want to create a frontend client app thatincludes search interactions like faceted navigation, typeahead, and pagination. It alsodemonstrates the @azure/search-documents library in the Azure SDK for JavaScript forcalls to Azure AI Search for indexing and query workflows on the backend.This sample website provides access to a catalog of 10,000 books. A user can search thecatalog by entering text in the search bar. While the user enters text, the website usesthe search index\u0027s suggest feature to complete the text. Once the query finishes, the listof books is displayed with a portion of the details. A user can select a book to see all thedetails, stored in the search index, of the book.The search experience includes:What does the sample do?Search – provides search functionality for the application.Suggest – provides suggestions as the user is typing in the search bar.\n"
}