{
  "Id": "365",
  "Title": "\u0022Creating a Power App for Azure Cognitive Search Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn Test Operation, select \u002B New Connection.7. Enter a query API key. This is an Azure Cognitive Search query for read-only accessto an index. You can find the key in the Azure portal.8. In Operations, select the Test operation button. If you\u0027re successful you should seea 200 status, and in the body of the response you should see JSON that describesthe search results.\r\n2 - Test the connectionIf the test fails, recheck the inputs. In particular, revisit the sample response and makesure it was created properly. The connector definition should show the expected itemsfor the response.In this step, create a Power App with a search box, a search button, and a display areafor the results.\r\nThe Power App will connect to the recently created custom connector toget the data from Azure Search.1. On the left, expand Apps \u003E \u002B New app \u003E Canvas.3 - Visualize results2. Select the type of application. For this tutorial, create a Blank App with the PhoneLayout. Give the app a name, such as \u0022Hotel Finder\u0022. Select Create. The PowerApps Studio appears.3.\r\nIn the studio, select the Data Sources tab, select \u002B Add data, and then find thenew Connector you have just created. In this tutorial, it\u0027s called AzureSearchQuery.Select Add a connection.Enter the query API key.Now AzureSearchQuery is a data source that is available to be used from yourapplication.4. On the Insert tab, add a few controls to the canvas. 5. Insert the following elements:A Text Label with the value \u0022Query:\u0022A Text Input element (call it txtQuery, default value: \u0022*\u0022)A button with the text \u0022Search\u0022A Vertical Gallery called (call it galleryResults)The canvas should look something like this:6. To make the Search button issue a query, paste the following action into OnSelect:The following screenshot shows the formula bar for the OnSelect action.\n"
}