{
  "Id": "85",
  "Title": "\u0022Creating Searchable Content with Azure Blob Storage and AI Enrichment\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFind your search service and on the Overview page, select Import data on thecommand bar to create searchable content in four steps.1. In Connect to your data, choose Azure Blob Storage.Run the Import data wizardStep 1: Create a data source2. Choose an existing connection to the storage account and select the container youcreated.\r\nGive the data source a name, and use default values for the rest.Continue to the next page.If you get \u0022Error detecting index schema from data source\u0022, the indexer that\u0027s poweringthe wizard can\u0027t connect to your data source. Most likely, the data source has securityprotections. Try the following solutions and then rerun the wizard.\r\nSecurity featureSolutionResource requires Azure roles or its accesskeys are disabledConnect as a trusted service or connect using amanaged identityResource is behind an IP firewallCreate an inbound rule for Search and for AzureportalResource requires a private endpointconnectionConnect over a private endpointﾉExpand tableNext, configure AI enrichment to invoke OCR, image analysis, and natural languageprocessing.\r\n1. For this quickstart, we\u0027re using the Free Azure AI services resource. The sampledata consists of 14 files, so the free allotment of 20 transaction on Azure AIservices is sufficient for this quickstart.2. Expand Add enrichments and make six selections. Enable OCR to add image analysis skills to wizard page.Choose entity recognition (people, organizations, locations) and image analysisskills (tags, captions).Step 2: Add cognitive skillsContinue to the next page.An index contains your searchable content and the Import data wizard can usuallycreate the schema by sampling the data source. In this step, review the generatedschema and potentially revise any settings.For this quickstart, the wizard does a good job setting reasonable defaults:Default fields are based on metadata properties of existing blobs, plus the newfields for the enrichment output (for example, people, organizations, locations).\n"
}