{
  "Id": "79",
  "Title": "\u0022Creating and Using Azure AI Search Demo App\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRun the wizardCheck resultsYou should see 84 documents, where each document is a chunk of the original PDF. Thetitle field shows which PDF the chunk comes from.The index definition isn\u0027t configurable so you can\u0027t filter by \u0022title\u0022. To work around thislimitation, you could define an index manually, making \u0022title\u0022 filterable to get all of thechunks for a single document.\r\nAzure AI Search is a billable resource. If it\u0027s no longer needed, delete it from yoursubscription to avoid charges.This quickstart introduced you to the Import and vectorize data wizard that creates allof the objects necessary for integrated vectorization. If you want to explore each step indetail, try an integrated vectorization sample.Clean upNext stepsQuickstart: Create a demo app in theAzure portalArticle•10/13/2022In this Azure Cognitive Search quickstart, you\u0027ll use the Azure portal\u0027s Create demo appwizard to generate a downloadable, \u0022localhost\u0022-style web app that runs in a browser.\r\nDepending on its configuration, the generated app is operational on first use, with a liveread-only connection to an index on your search service. A default app can include asearch bar, results area, sidebar filters, and typeahead support.A demo app can help you visualize how an index will function in a client app, but it isn\u0027tintended for production scenarios.\r\nProduction apps should include security, errorhandling, and hosting logic that the demo app doesn\u0027t provide.Before you begin, have the following prerequisites in place:An Azure account with an active subscription. Create an account for free.An Azure Cognitive Search service. Create a service or find an existing serviceunder your current subscription. You can use a free service for this quickstart.Microsoft Edge (latest version) or Google Chrome.A search index to use as the basis of your generated application.This quickstart uses the built-in Real Estate sample data and index because it hasthumbnail images (the wizard supports adding images to the results page).\n"
}