{
  "Id": "137",
  "Title": "\u0022Creating and Managing Azure Search Resources with Command Line Tools\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCreate a new search resource from the command line using either the Azure CLI orAzure PowerShell. You also retrieve a query key used for read-access to the index, andget the built-in admin key used for adding objects.You must have Azure CLI or Azure PowerShell installed on your device. If you aren\u0027t alocal admin on your device, choose Azure PowerShell and use the Scope parameter torun as the current user.\r\n1. In Visual Studio Code, under Terminal, select New Terminal.2. Connect to Azure:Azure CLI3. Before creating a new search service, list the existing services for yoursubscription:Create an Azure AI Search resource７ NoteThis task doesn\u0027t require the Visual Studio Code extensions for Azure CLI and AzurePowerShell.\r\nVisual Studio Code recognizes the command line tools without theextensions.Azure CLIaz loginAzure CLIIf you have a service that you want to use, note the name, and then skip aheadto the next section.4. Create a new search service. Use the following command as a template,substituting valid values for the resource group, service name, tier, region,partitions, and replicas.\r\nThe following statement uses the \u0022cognitive-search-demo-rg\u0022 resource group created in a previous step and specifies the \u0022free\u0022tier. If your Azure subscription already has a free search service, specify abillable tier such as \u0022basic\u0022 instead. Azure CLI5. Get a query key that grants read access to a search service. A search service isprovisioned with two admin keys and one query key. Substitute valid namesfor the resource group and search service. Copy the query key to Notepad sothat you can paste it into the client code in a later step:Azure CLI6. Get a search service admin API key. An admin API key provides write access tothe search service. Copy either one of the admin keys to Notepad so that youcan use it in the bulk import step that creates and loads an index:Azure CLIaz resource list --resource-type Microsoft.\n"
}