{
  "Id": "687",
  "Title": "\u0022Creating and Managing Indexes in Azure Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen you\u0027re ready to create the index, use a search client that can send the request.You can use the Azure portal or REST APIs for early development and proof-of-concepttesting.During development, plan on frequent rebuilds. Because physical structures are createdin the service, dropping and re-creating indexes is necessary for many modifications.You might consider working with a subset of your data to make rebuilds go faster.Index design through the portal enforces requirements and schema rules forspecific data types, such as disallowing full text search capabilities on numericfields.1. Sign in to the Azure portal.2.\r\nIn the search service Overview page, choose either option for creating asearch index:Add index, an embedded editor for specifying an index schemaImport data wizardThe wizard is an end-to-end workflow that creates an indexer, a data source,and a finished index. It also loads the data. If this is more than what you want,use Add index instead.\r\nThe following screenshot highlights where Add index and Import data appear onthe command bar. After an index is created, you can find it again in the Indexes tab.７ NoteFull text search is conducted over terms that are tokenized during indexing. If yourqueries fail to return the results you expect, test for tokenization to verify thestring actually exists.\r\nYou can try different analyzers on strings to see how tokensare produced for various analyzers.Create an indexAzure portalIndex schemas include a section for setting corsOptions. By default, client-sideJavaScript can\u0027t call any APIs because browsers prevent all cross-origin requests. Toallow cross-origin queries through to your index, enable CORS (Cross-Origin ResourceSharing) by setting the corsOptions attribute. For security reasons, only query APIssupport CORS.JSONThe following properties can be set for CORS:allowedOrigins (required): This is a list of origins that are allowed access to yourindex. JavaScript code served from these origins is allowed to query your index(assuming the caller provides a valid key or has permissions).\n"
}