{
  "Id": "1143",
  "Title": "\u0022Creating Power BI Reports for Azure Knowledge Store Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOpen hotelReviewsSsPages and repeat column deletion steps, expanding Contentto select columns from the records. There are no data type modifications for thistable.7. Open hotelReviewsSsKeyPhrases and repeat column deletion steps, expandingContent to select columns from the records. There are no data type modificationsfor this table.8. On the command bar, click Close and Apply.\r\n1. Click on the Model tile on the left navigation pane and validate that Power BIshows relationships between all three tables.2. Double-click each relationship and make sure that the Cross-filter direction is setto Both. This enables your visuals to refresh when a filter is applied.1. Click on the Report tile on the left navigation pane to explore data throughvisualizations.\r\nFor text fields, tables and cards are useful visualizations.2. Choose fields from each of the three tables to fill in the table or card.Check table relationshipsBuild a reportWhen creating a knowledge store using the Azure portal, you have the option ofdownloading a Power BI template on the second page of the Import data wizard.\r\nThistemplate gives you several visualizations, such as WordCloud and Network Navigator,for text-based content.Click Get Power BI Template on the Add cognitive skills page to retrieve and downloadthe template from its public GitHub location. The wizard modifies the template toaccommodate the shape of your data, as captured in the knowledge store projectionsspecified in the wizard.\r\nFor this reason, the template you download will vary each timeyou run the wizard, assuming different data inputs and skill selections.Sample Power BI template - Azure portal only７ NoteThe template is downloaded while the wizard is in mid-flight. You\u0027ll have to waituntil the knowledge store is actually created in Azure Table Storage before you canuse it. For a demonstration of using Power BI with a knowledge store, watch the followingvideo.Video introductionhttps://www.youtube-nocookie.com/embed/XWzLBP8iWqg?version=3Next stepsTables in Power BI reports and dashboardsCreate a full-text query in Azure AISearchArticle•11/16/2023If you\u0027re building a query for full text search, this article provides steps for setting up therequest.\n"
}