{
  "Id": "315",
  "Title": "\u0022Creating Index Schema for Azure AI Search: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCall Create Index to provide the schema used to create inverted indexes and otherconstructs in Azure AI Search. The largest component of an index is the fields collection,where data type and attributes determine content and behavior in Azure AI Search.1. Select the \u0022Create an index\u0022 request.2. The body of the request defines the schema of the search index.\r\nA fields collectionrequires one field to be designated as the key. For blob content, this field is oftenthe \u0022metadata_storage_path\u0022 that uniquely identifies each blob in the container.In this schema, the \u0022text\u0022 field receives OCR output, \u0022content\u0022 receives mergedoutput, \u0022language\u0022 receives language detection output. Key phrases, entities, andseveral fields lifted from blob storage comprise the remaining entries.\r\n}      ],      \u0022outputs\u0022: [        {          \u0022name\u0022: \u0022persons\u0022,          \u0022targetName\u0022: \u0022persons\u0022        }      ]    }  ]}７ NoteOutputs can be mapped to an index, used as input to a downstream skill, or bothas is the case with language code. In the index, a language code is useful forfiltering. For more information about skillset fundamentals, see How to define askillset.\r\nStep 3: Create an indexJSON{  \u0022fields\u0022: [    {      \u0022name\u0022: \u0022text\u0022,      \u0022type\u0022: \u0022Collection(Edm.String)\u0022,      \u0022searchable\u0022: true,      \u0022sortable\u0022: false,      \u0022filterable\u0022: true,      \u0022facetable\u0022: false    },    {      \u0022name\u0022: \u0022content\u0022,      \u0022type\u0022: \u0022Edm.String\u0022,      \u0022searchable\u0022: true,      \u0022sortable\u0022: false,      \u0022filterable\u0022: false,      \u0022facetable\u0022: false    },    {      \u0022name\u0022: \u0022language\u0022,      \u0022type\u0022: \u0022Edm. String\u0022,      \u0022searchable\u0022: false,      \u0022sortable\u0022: true,      \u0022filterable\u0022: true,      \u0022facetable\u0022: false    },    {      \u0022name\u0022: \u0022keyPhrases\u0022,      \u0022type\u0022: \u0022Collection(Edm.String)\u0022,      \u0022searchable\u0022: true,      \u0022sortable\u0022: false,      \u0022filterable\u0022: true,      \u0022facetable\u0022: true    },    {      \u0022name\u0022: \u0022organizations\u0022,      \u0022type\u0022: \u0022Collection(Edm.\n"
}