{
  "Id": "1446",
  "Title": "\u0022Creating Private Endpoint Connections in Azure: A Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf4. Select either Connect to an Azure resource in my directory or Connect to anAzure resource by resource ID or alias.5. If you select the first option (recommended), the portal helps you pick theappropriate Azure resource and fills in other properties, such as the group IDof the resource and the resource type.\r\n41 - Create a shared private linkAzure portal6. If you select the second option, enter the Azure resource ID manually andchoose the appropriate group ID from the list at the beginning of this article.7. Confirm the provisioning status is \u0022Updating\u0022.8. Once the resource is successfully created, the provisioning state of theresource changes to \u0022Succeeded\u0022.A 202 Accepted response is returned on success. The process of creating an outboundprivate endpoint is a long-running (asynchronous) operation. It involves deploying thefollowing resources:A private endpoint, allocated with a private IP address in a \u0022Pending\u0022 state.\r\nTheprivate IP address is obtained from the address space that\u0027s allocated to the virtualnetwork of the execution environment for the search service-specific privateindexer. Upon approval of the private endpoint, any communication from AzureShared private link creation workflowCognitive Search to the Azure resource originates from the private IP address anda secure private link channel.A private DNS zone for the type of resource, based on the group ID. By deployingthis resource, you ensure that any DNS lookup to the private resource utilizes theIP address that\u0027s associated with the private endpoint.The resource owner must approve the connection request you created. This sectionassumes the portal for this step, but you can also use the REST APIs of the Azure PaaSresource. Private Endpoint Connections (Storage Resource Provider) and PrivateEndpoint Connections (Cosmos DB Resource Provider) are two examples.1. In the Azure portal, open the Networking page of the Azure PaaS resource.2. Find the section that lists the private endpoint connections.\n"
}