{
  "Id": "220",
  "Title": "\u0022Creating a Basic Search Page with Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCreate a basic search page＂Filter results＂Sort results＂Prerequisites1212Create the project5. Verify that Do not use top-level statements is unchecked.6. Select Create.1. On Tools, select NuGet Package Manager \u003E Manage NuGet Packages for thesolution.2. Browse for Azure.Search.Documents and install the latest stable version.3.\r\nBrowse for and install the Microsoft.Spatial package. The sample index includes aGeographyPoint data type. Installing this package avoids run time errors.Alternatively, remove the \u0022Location\u0022 field from the Hotels class if you don\u0027t want toinstall the package. It\u0027s not used in this tutorial.For the connection, the app presents a query API key to your fully qualified search URL.Both are specified in the appsettings.json file.Modify appsettings.json to specify your search service and query API key.JSONYou can get the service URL and API key from the portal.\r\nBecause this code is queryingan index and not creating one, you can use a query key instead of an admin key.Make sure to specify the search service that has the hotels-sample-index.In this step, create models that represent the schema of the hotels-sample-index.1.\r\nIn Solution explorer, right-select Models and add a new class named \u0022Hotel\u0022 forthe following code:C#Add NuGet packagesAdd service information{    \u0022SearchServiceUri\u0022: \u0022\u003CYOUR-SEARCH-SERVICE-URL\u003E\u0022,    \u0022SearchServiceQueryApiKey\u0022: \u0022\u003CYOUR-SEARCH-SERVICE-QUERY-API-KEY\u003E\u0022}Add models2. Add a class named \u0022Address\u0022 and replace it with the following code: using Azure. Search.Documents.Indexes.Models; using Azure.Search.Documents.Indexes; using Microsoft.Spatial; using System.Text.Json.Serialization; namespace HotelDemoApp.Models {     public partial class Hotel     {         [SimpleField(IsFilterable = true, IsKey = true)]         public string HotelId { get; set; }         [SearchableField(IsSortable = true)]         public string HotelName { get; set; }         [SearchableField(AnalyzerName = LexicalAnalyzerName.Values.EnLucene)]         public string Description { get; set; }         [SearchableField(AnalyzerName = LexicalAnalyzerName.Values.\n"
}