{
  "Id": "1417",
  "Title": "\u0022Creating and Configuring Azure Virtual Machine and Private DNS Zone\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPrivate DNS zoneAccept the default (New) privatelink.search.windows.net.8. Select OK.9. Select Review \u002B create. You\u0027re taken to the Review \u002B create page where Azurevalidates your configuration.10. When you see the Validation passed message, select Create.11. Once provisioning of your new service is complete, browse to the resource thatyou created.\r\n12. Select Keys from the left content menu.13. Copy the Primary admin key for later, when connecting to the service.1. On the upper-left side of the screen in the Azure portal, select Create a resource \u003ECompute \u003E Virtual machine.2. In Create a virtual machine - Basics, enter or select the following values:SettingValuePROJECTDETAILSSubscriptionSelect your subscription.\r\nResource groupUse the resource group that you created in the previous section.INSTANCEDETAILSVirtual machinenameEnter a name, such as \u0022my-vm\u0022.RegionSelect your region.AvailabilityoptionsYou can choose No infrastructure redundancy required, or selectanother option if you need the functionality.\r\nImageSelect Windows Server 2022 Datacenter: Azure Edition - Gen2.VM architectureAccept the default x64.SizeAccept the default Standard D2S v3.ADMINISTRATORACCOUNTCreate a virtual machineSettingValueUsernameEnter the user name of the administrator. Use an account that\u0027s validfor your Azure subscription.\r\nYou\u0027ll want to sign into Azure portal fromthe VM so that you can manage your search service.PasswordEnter the account password. The password must be at least 12characters long and meet the defined complexity requirements.ConfirmPasswordReenter password.INBOUND PORTRULESPublic inboundportsAccept the default Allow selected ports.Select inboundportsAccept the default RDP (3389). 3. Select Next: Disks.4. In Create a virtual machine - Disks, accept the defaults and select Next:Networking.5. In Create a virtual machine - Networking, provide the following values:SettingValueVirtual networkSelect the virtual network you created in a previous step.SubnetAccept the default (10.1.0.0/24).\n"
}