{
  "Id": "1096",
  "Title": "\u0022Creating and Exploring Knowledge Store with Azure AI Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou create the knowledge store using an indexer andskillset, and specify Azure Storage to store the output. After the knowledge store ispopulated, use tools like Storage Explorer or Power BI to explore the content.In this article, you use the REST API to ingest, enrich, and explore a set of customerreviews of hotel stays in a knowledge store.\r\nThe knowledge store contains original textcontent pulled from the source, plus AI-generated content that includes a sentimentscore, key phrase extraction, language detection, and text translation of non-Englishcustomer comments.To make the initial data set available, the hotel reviews are first imported into Azure BlobStorage. Post-processing, the results are saved as a knowledge store in Azure TableStorage.Postman appAn Azure account with an active subscription. Create an account for free.Azure AI Search. Create a service or find an existing one. You can use the freeservice for this exercise.Azure Storage. Create an account or find an existing one.\r\nThe account type mustbe StorageV2 (general purpose V2).Sample data loaded into Blob Storage (instructions provided in the next section).７ NoteThis article provides detailed explanations of each step. For a faster approach, seeCreate a knowledge store in Azure portal instead.\r\nPrerequisitesLoad dataThis step uses Azure AI Search, Azure Blob Storage, and Azure AI services for the AI.Because the workload is so small, Azure AI services is tapped behind the scenes toprovide free processing for up to 20 transactions daily. A small workload means that youcan skip creating or attaching an Azure AI multi-service resource.1. Download HotelReviews_Free.csv. This CSV contains 19 pieces of customerfeedback about a single hotel (originates from Kaggle.com). The file is in a repowith other sample data. If you don\u0027t want the whole repo, copy the raw contentand paste it into a spreadsheet app on your device.2. In Azure portal, on the Azure Storage resource page, use Storage Browser tocreate a blob container named hotel-reviews.\n"
}