{
  "Id": "316",
  "Title": "\u0022Creating and Configuring an Azure Search Pipeline: A Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfString\u0022,      \u0022searchable\u0022: false,      \u0022sortable\u0022: true,      \u0022filterable\u0022: true,      \u0022facetable\u0022: false    },    {      \u0022name\u0022: \u0022keyPhrases\u0022,      \u0022type\u0022: \u0022Collection(Edm.String)\u0022,      \u0022searchable\u0022: true,      \u0022sortable\u0022: false,      \u0022filterable\u0022: true,      \u0022facetable\u0022: true    },    {      \u0022name\u0022: \u0022organizations\u0022,      \u0022type\u0022: \u0022Collection(Edm.\r\nString)\u0022,      \u0022searchable\u0022: true,      \u0022sortable\u0022: false,      \u0022filterable\u0022: true,      \u0022facetable\u0022: true    },    {      \u0022name\u0022: \u0022persons\u0022,      \u0022type\u0022: \u0022Collection(Edm.String)\u0022,      \u0022searchable\u0022: true,      \u0022sortable\u0022: false,      \u0022filterable\u0022: true,      \u0022facetable\u0022: true    },    {      \u0022name\u0022: \u0022locations\u0022,3. Send the request.\r\nPostman should return a status code of 201 confirming success.Call Create Indexer to drive the pipeline. The three components you have created thusfar (data source, skillset, index) are inputs to an indexer. Creating the indexer on AzureAI Search is the event that puts the entire pipeline into motion.1. Select the \u0022Create an indexer\u0022 request.2.\r\nThe body of the request includes references to the previous objects, configurationproperties required for image processing, and two types of field mappings.\u0022fieldMappings\u0022 are processed before the skillset, sending content from the datasource to target fields in an index. You\u0027ll use field mappings to send existing,unmodified content to the index. If field names and types are the same at bothends, no mapping is required.\u0022outputFieldMappings\u0022 are for fields created by skills, after skillset execution. Thereferences to sourceFieldName in outputFieldMappings don\u0027t exist until documentcracking or enrichment creates them. The targetFieldName is a field in an index,defined in the index schema.      \u0022type\u0022: \u0022Collection(Edm.\n"
}