{
  "Id": "357",
  "Title": "\u0022Creating and Testing Custom Analyzers in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor simplicity, the Postman collection creates a newindex named tutorial-first-analyzer with the analyzer we defined.After creating the index, you can now test out the analyzer we created using thefollowing request:HTTP\u0022analyzers\u0022: [  {    \u0022@odata.type\u0022: \u0022#Microsoft.Azure.Search.\r\nCustomAnalyzer\u0022,    \u0022name\u0022: \u0022phone_analyzer\u0022,    \u0022tokenizer\u0022: \u0022keyword_v2\u0022,    \u0022tokenFilters\u0022: [      \u0022custom_ngram_filter\u0022    ],    \u0022charFilters\u0022: [      \u0022phone_char_mapping\u0022    ]  }]ﾉExpand table6 - Test the custom analyzerPOST https://\u003CYOUR-SEARCH-SERVICE-NAME\u003E.search.windows.\r\nnet/indexes/tutorial-first-analyzer/analyze?api-version=2019-05-06  Content-Type: application/json  api-key: \u003CYOUR-ADMIN-API-KEY\u003E  You will then be able to see the collection of tokens resulting from the phone number:JSONAfter making some sample queries against the index with the custom analyzer, you\u0027llfind that recall has improved and all matching phone numbers are now returned.\r\nHowever, the n-gram token filter causes some false positives to be returned as well. Thisis a common side effect of an n-gram token filter.To prevent false positives, we\u0027ll create a separate analyzer for querying. This analyzer willbe the same as the analyzer we created already but without the custom_ngram_filter.\r\nJSON  {    \u0022text\u0022: \u0022\u002B1 (321) 555-0199\u0022,    \u0022analyzer\u0022: \u0022phone_analyzer\u0022  }{    \u0022tokens\u0022: [        {            \u0022token\u0022: \u0022132\u0022,            \u0022startOffset\u0022: 1,            \u0022endOffset\u0022: 17,            \u0022position\u0022: 0        },        {            \u0022token\u0022: \u00221321\u0022,            \u0022startOffset\u0022: 1,            \u0022endOffset\u0022: 17,            \u0022position\u0022: 0        },        {            \u0022token\u0022: \u002213215\u0022,            \u0022startOffset\u0022: 1,            \u0022endOffset\u0022: 17,            \u0022position\u0022: 0        },        .\n..        ...        ...    ]}7 - Build a custom analyzer for queriesIn the index definition, we then specify both an indexAnalyzer and a searchAnalyzer.JSONWith this change, you\u0027re all set. Recreate the index, index the data, and test the queriesagain to verify the search works as expected.\n"
}