{
  "Id": "256",
  "Title": "\u0022Creating Azure Storage and AI Search Services Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis tutorial creates one of each.Before starting, make sure you have room on your service to accept the newresources.Download filesThis tutorial uses Azure AI Search for indexing and queries, and Azure Blob Storage toprovide the data.If possible, create both in the same region and resource group for proximity andmanageability. In practice, your Azure Storage account can be in any region.1. Sign in to the Azure portal and click \u002B Create Resource.2. Search for storage account and select Microsoft\u0027s Storage Account offering.3. In the Basics tab, the following items are required. Accept the defaults foreverything else.Resource group.\r\nSelect an existing one or create a new one, but use thesame group for all services so that you can manage them collectively.Storage account name. If you think you might have multiple resources of thesame type, use the name to disambiguate by type and region, for exampleblobstoragewestus.Location. If possible, choose the same location used for Azure AI Search andAzure AI services.\r\nA single location voids bandwidth charges.Account Kind. Choose the default, StorageV2 (general purpose v2).4. Click Review \u002B Create to create the service.5. Once it\u0027s created, click Go to the resource to open the Overview page.6. Click Blobs service.7. Create a Blob container to contain sample data.\r\nYou can set the Public Access Levelto any of its valid values.8. After the container is created, open it and select Upload on the command bar.1 - Create servicesStart with Azure Storage9. Navigate to the folder containing the sample files. Select all of them and then clickUpload.After the upload completes, the files should appear in their own subfolder inside thedata container. The next resource is Azure AI Search, which you can create in the portal. You can use theFree tier to complete this walkthrough.As with Azure Blob Storage, take a moment to collect the access key. Further on, whenyou begin structuring requests, you will need to provide the endpoint and admin api-key used to authenticate each request.\n"
}