{
  "Id": "366",
  "Title": "\u0022Creating an Azure Search App: Step-by-Step Guide and Tips\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf5. Insert the following elements:A Text Label with the value \u0022Query:\u0022A Text Input element (call it txtQuery, default value: \u0022*\u0022)A button with the text \u0022Search\u0022A Vertical Gallery called (call it galleryResults)The canvas should look something like this:6. To make the Search button issue a query, paste the following action into OnSelect:The following screenshot shows the formula bar for the OnSelect action.\r\nIf(!IsBlank(txtQuery.Text),     ClearCollect(azResult, AzureSearchQuery.Query({search: txtQuery.Text}).value)) This action causes the button to update a new collection called azResult with theresult of the search query, using the text in the txtQuery text box as the queryterm.\r\n7. Link the Vertical Gallery control to the azResult collection that was created whenyou completed the previous step.Select the gallery control, and perform the following actions in the propertiespane.Set DataSource to azResult.Select a Layout that works for you based on the type of data in your index. Inthis case, we used the Title, subtitle and body layout.\r\nEdit Fields, and select the fields you would like to visualize.Since we provided a sample result when we defined the connector, the app isaware of the fields available in your index.７ NoteTry this if you get a formula syntax error \u0022The function \u0027ClearCollect\u0027 has someinvalid functions\u0022:First, make sure the connector reference is correct. Clear the connectorname and begin typing the name of your connector. Intellisense shouldsuggest the right connector and verb.If the error persists, delete and recreate the connector. If there aremultiple instances of a connector, the app might be using the wrongone.8. Press F5 to preview the app.When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created. Resources left running cancost you money. You can delete resources individually or delete the resource group todelete the entire set of resources.\n"
}