{
  "Id": "728",
  "Title": "\u0022Creating and Using Suggesters in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBoth requests target thedocuments collection of specific index and responses are returned after a user hasprovided at least a three character input string.To create a suggester, add one to an index definition. A suggester takes a name and acollection of fields over which the typeahead experience is enabled.\r\nThe best time tocreate a suggester is when you\u0027re also defining the field that will use it.Use string fields only.If the string field is part of a complex type (for example, a City field withinAddress), include the parent in the field path: \u0022Address/City\u0022 (REST and C# andPython), or [\u0022Address\u0022][\u0022City\u0022] (JavaScript).\r\nUse the default standard Lucene analyzer (\u0022analyzer\u0022: null) or a languageanalyzer (for example, \u0022analyzer\u0022: \u0022en.Microsoft\u0022) on the field.If you try to create a suggester using pre-existing fields, the API will disallow it. Prefixesare generated during indexing, when partial terms in two or more charactercombinations are tokenized alongside whole terms.\r\nGiven that existing fields are alreadytokenized, you\u0027ll have to rebuild the index if you want to add them to a suggester. Formore information, see How to rebuild an Azure Cognitive Search index.Although a suggester has several properties, it\u0027s primarily a collection of string fields forwhich you\u0027re enabling a search-as-you-type experience. There\u0027s one suggester for eachindex, so the suggester list must include all fields that contribute content for bothsuggestions and autocomplete.Autocomplete benefits from a larger pool of fields to draw from because the additionalcontent has more term completion potential. Suggestions, on the other hand, produce better results when your field choice isselective. Remember that the suggestion is a proxy for a search document so you\u0027ll wantHow to create a suggesterChoose fieldsfields that best represent a single result. Names, titles, or other unique fields thatdistinguish among multiple matches work best.\n"
}