{
  "Id": "291",
  "Title": "\u0022Creating and Managing Azure Cognitive Search Data Sources in C#\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis object provides all the methods youneed to create, list, update, or delete Azure Cognitive Search data sources.Create a new SearchIndexerDataSourceConnection instance by callingindexerClient.CreateOrUpdateDataSourceConnection(dataSource). The following codecreates a data source of type AzureBlob.C#3 - Create the pipelineStep 1: Create a data sourceprivate static SearchIndexerDataSourceConnection CreateOrUpdateDataSource(SearchIndexerClient indexerClient, IConfigurationRoot configuration){    SearchIndexerDataSourceConnection dataSource = new SearchIndexerDataSourceConnection(        name: \u0022demodata\u0022,        type: SearchIndexerDataSourceType.\r\nAzureBlob,        connectionString: configuration[\u0022AzureBlobConnectionString\u0022],        container: new SearchIndexerDataContainer(\u0022cog-search-demo\u0022))    {        Description = \u0022Demo files to demonstrate cognitive search capabilities.\u0022    };    // The data source does not need to be deleted if it was already created    // since we are using the CreateOrUpdate method    try    {        indexerClient.\r\nCreateOrUpdateDataSourceConnection(dataSource);    }    catch (Exception ex)    {        Console.WriteLine(\u0022Failed to create or update the data source\\n Exception message: {0}\\n\u0022, ex.Message);        ExitProgram(\u0022Cannot continue without a data source\u0022);    }    return dataSource;}For a successful request, the method will return the data source that was created. Ifthere is a problem with the request, such as an invalid parameter, the method will throwan exception.Now add a line in Main to call the CreateOrUpdateDataSource function that you\u0027ve justadded.C#Build and run the solution. Since this is your first request, check the Azure portal toconfirm the data source was created in Azure Cognitive Search. On the search serviceoverview page, verify the Data Sources list has a new item. You might need to wait a fewminutes for the portal page to refresh.In this section, you define a set of enrichment steps that you want to apply to your data.\n"
}