{
  "Id": "358",
  "Title": "\u0022Custom Analyzer Implementation for Azure Search Optimization\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u00221321\u0022,            \u0022startOffset\u0022: 1,            \u0022endOffset\u0022: 17,            \u0022position\u0022: 0        },        {            \u0022token\u0022: \u002213215\u0022,            \u0022startOffset\u0022: 1,            \u0022endOffset\u0022: 17,            \u0022position\u0022: 0        },        .\r\n..        ...        ...    ]}7 - Build a custom analyzer for queriesIn the index definition, we then specify both an indexAnalyzer and a searchAnalyzer.JSONWith this change, you\u0027re all set. Recreate the index, index the data, and test the queriesagain to verify the search works as expected.\r\nIf you\u0027re using the Postman collection, itwill create a third index named tutorial-second-analyzer.The analyzer above was designed to maximize the flexibility for search. However, it doesso at the cost of storing many potentially unimportant terms in the index.The example below shows a different analyzer that can also be used for this task.\r\nThe analyzer works well except for input data such as 14255550100 that makes it difficultto logically chunk the phone number. For example, the analyzer wouldn\u0027t be able toseparate the country code, 1, from the area code, 425. This discrepancy would lead tothe number above not being returned if a user didn\u0027t include a country code in theirsearch.\r\nJSON    {      \u0022@odata.type\u0022: \u0022#Microsoft.Azure.Search.CustomAnalyzer\u0022,      \u0022name\u0022: \u0022phone_analyzer_search\u0022,      \u0022tokenizer\u0022: \u0022custom_tokenizer_phone\u0022,      \u0022tokenFilters\u0022: [],      \u0022charFilters\u0022: [        \u0022phone_char_mapping\u0022      ]    }    {      \u0022name\u0022: \u0022phone_number\u0022,      \u0022type\u0022: \u0022Edm. String\u0022,      \u0022sortable\u0022: false,      \u0022searchable\u0022: true,      \u0022filterable\u0022: false,      \u0022facetable\u0022: false,      \u0022indexAnalyzer\u0022: \u0022phone_analyzer\u0022,      \u0022searchAnalyzer\u0022: \u0022phone_analyzer_search\u0022    }Alternate approaches\u0022analyzers\u0022: [  {You can see in the example below that the phone number is split into the chunks youwould normally expect a user to be searching for.\n"
}