{
  "Id": "348",
  "Title": "\u0022Custom Analyzers in Azure AI Search: Implementation and Testing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfShow how analyzers work＂Define a custom analyzer for searching phone numbers＂Test how the custom analyzer tokenizes text＂Create separate analyzers for indexing and searching to further improve results＂PrerequisitesDownload files1 - Create an Azure AI Search service2 - Set up PostmanNext, start Postman and import the collection you downloaded from Azure-Samples/azure-search-postman-samples.\r\nTo import the collection, go to Files \u003E Import, then select the collection file you\u0027d like toimport.For each request, you need to:1. Replace \u003CYOUR-SEARCH-SERVICE\u003E with the name of your search service.2. Replace \u003CYOUR-ADMIN-API-KEY\u003E with either the primary or secondary key of yoursearch service.\r\nIf you\u0027re unfamiliar with Postman, see Explore Azure AI Search REST APIs.In this step, we\u0027ll create an initial index, load documents into the index, and then querythe documents to see how our initial searches perform.We\u0027ll start by creating a simple index called tutorial-basic-index with two fields: idand phone_number.\r\nWe haven\u0027t defined an analyzer yet so the standard.lucene analyzerwill be used by default.To create the index, we send the following request:HTTP3 - Create an initial indexCreate indexPUT https://\u003CYOUR-SEARCH-SERVICE-NAME\u003E.search.windows.\r\nnet/indexes/tutorial-basic-index?api-version=2019-05-06  Content-Type: application/json  api-key: \u003CYOUR-ADMIN-API-KEY\u003E  {    \u0022fields\u0022: [Next, we\u0027ll load data into the index. In some cases, you may not have control over theformat of the phone numbers ingested so we\u0027ll test against different kinds of formats.Ideally, a search solution will return all matching phone numbers regardless of theirformat. Data is loaded into the index using the following request:HTTP      {        \u0022name\u0022: \u0022id\u0022,        \u0022type\u0022: \u0022Edm.String\u0022,        \u0022key\u0022: true,        \u0022searchable\u0022: true,        \u0022filterable\u0022: false,        \u0022facetable\u0022: false,        \u0022sortable\u0022: true      },      {        \u0022name\u0022: \u0022phone_number\u0022,        \u0022type\u0022: \u0022Edm.\n"
}