{
  "Id": "1679",
  "Title": "\u0022Custom Entity Lookup Skill Configuration and Usage Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfaliases(Optional) An array of complex objects that can be used to specifyalternative spellings or synonyms to the root entity name.Alias propertiesDescriptionAlias propertiesDescriptiontextThe alternative spelling or representation of some target entity name.caseSensitive(Optional) Acts the same as root entity \u0022caseSensitive\u0022 parameter above, butapplies to only this one alias.accentSensitive(Optional) Acts the same as root entity \u0022accentSensitive\u0022 parameter above,but applies to only this one alias.fuzzyEditDistance(Optional) Acts the same as root entity \u0022fuzzyEditDistance\u0022 parameter above,but applies to only this one alias.\r\nIn some cases, it may be more convenient to embed the custom entity definition so thatits inline with the skill definition. You can use the same JSON format as the onedescribed above, except that it\u0027s included within the skill definition. Only configurationsthat are less than 10 KB in size (serialized size) can be defined inline.\r\nA sample skill definition using an inline format is shown below:JSONInline formatSample skill definition  {     \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Text.CustomEntityLookupSkill\u0022,     \u0022context\u0022: \u0022/document\u0022,     \u0022inlineEntitiesDefinition\u0022:      [       {          \u0022name\u0022 : \u0022Bill Gates\u0022,         \u0022description\u0022 : \u0022Microsoft founder.\r\n\u0022 ,         \u0022aliases\u0022 : [              { \u0022text\u0022 : \u0022William H. Gates\u0022, \u0022caseSensitive\u0022 : false },             { \u0022text\u0022 : \u0022BillG\u0022, \u0022caseSensitive\u0022 : true }         ]       },        {          \u0022name\u0022 : \u0022Xbox One\u0022,          \u0022type\u0022: \u0022Hardware\u0022,         \u0022subtype\u0022 : \u0022Gaming Device\u0022,         \u0022id\u0022 : \u00224e36bf9d-5550-4396-8647-8e43d7564a76\u0022,         \u0022description\u0022 : \u0022The Xbox One product\u0022       }     ],         \u0022inputs\u0022: [ Alternatively, you can point to an external entities definition file.\n"
}