{
  "Id": "1084",
  "Title": "\u0022Custom Skill Execution and Error Handling Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTesting with a smaller sample of documents, evaluate the execution time of yourskill to the overall time taken to process the subset of documents. Does yourindexer spend more time building a batch or waiting for a response from yourskill?Consider the upstream implications of parallelism. If the input to a custom skill isan output from a prior skill, are all the skills in the skillset scaled out effectively tominimize latency?Custom skills should return a success status code HTTP 200 when the skill completessuccessfully. If one or more records in a batch result in errors, consider returning multi-status code 207.\r\nThe errors or warnings list for the record should contain theappropriate message.Any items in a batch that errors will result in the corresponding document failing. If youneed the document to succeed, return a warning.ConsiderationsError handling in the custom skillAny status code over 299 is evaluated as an error and all the enrichments are failedresulting in a failed document.Could not execute skill because it did not execute within the time limit\u002700:00:30\u0027. This is likely transient. Please try again later. For customskills, consider increasing the \u0027timeout\u0027 parameter on your skill in theskillset.\r\nSet the timeout parameter on the skill to allow for a longer executionduration.Could not execute skill because Web Api skill response is invalid. Indicativeof the skill not returning a message in the custom skill response format. This couldbe the result of an uncaught exception in the skill.Could not execute skill because the Web Api request failed. Most likely causedby authorization errors or exceptions.Could not execute skill. Commonly the result of the skill response beingmapped to an existing property in the document hierarchy. Start by testing your custom skill with a REST API client to validate:The skill implements the custom skill interface for requests and responsesThe skill returns valid JSON with the application/JSON MIME typeReturns a valid HTTP status codeCreate a debug session to add your skill to the skillset and make sure it produces a validenrichment. While a debug session does not allow you to tune the performance of theskill, it enables you to ensure that the skill is configured with valid values and returns theexpected enriched objects.While skills can accept and return larger payloads, consider limiting the responseto 150 MB or less when returning JSON.\n"
}