{
  "Id": "756",
  "Title": "\u0022Custom Analyzers in Azure AI Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfmicrosoftSlovaksk.microsoftSloveniansl.microsoftSpanishes.microsoftes.luceneSwedishsv.microsoftsv.luceneTamilta.microsoftTelugute.microsoftLanguageMicrosoft Analyzer NameLucene Analyzer NameThaith.microsoftth.luceneTurkishtr.microsofttr.luceneUkrainianuk.microsoftUrduur.microsoftVietnamesevi.microsoftAll analyzers with names annotated with Lucene are powered by Apache Lucene\u0027slanguage analyzers.\r\nCreate an indexCreate a multi-language indexCreate Index (REST API)LexicalAnalyzerName Class (Azure SDK for .NET)See alsoAdd custom analyzers to string fields inan Azure AI Search indexArticle•11/28/2023A custom analyzer is a user-defined combination of one tokenizer, one or more tokenfilters, and one or more character filters.\r\nA custom analyzer is specified within a searchindex, and then referenced by name on field definitions that require custom analysis. Acustom analyzer is invoked on a per-field basis. Attributes on the field will determinewhether it\u0027s used for indexing, queries, or both.In a custom analyzer, character filters prepare the input text before it\u0027s processed by thetokenizer (for example, removing markup). Next, the tokenizer breaks text into tokens.Finally, token filters modify the tokens emitted by the tokenizer. For concepts andexamples, see Analyzers in Azure AI Search. A custom analyzer gives you control over the process of converting text into indexableand searchable tokens by allowing you to choose which types of analysis or filtering toinvoke, and the order in which they occur.Create and assign a custom analyzer if none of default (Standard Lucence), built-in, orlanguage analyzers are sufficient for your needs. You might also create a customanalyzer if you want to use a built-in analyzer with custom options. For example, if youwanted to change the maxTokenLength on Standard, you would create a customanalyzer, with a user-defined name, to set that option.\n"
}