{
  "Id": "763",
  "Title": "\u0022Customizing Analyzers and Character Filters in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOptionsmaxTokenLength (type: int) - The maximumBuilt-in analyzersﾉExpand table1analyzer_nameanalyzer_type Description and Optionstoken length. The default is 255. Tokenslonger than the maximum length are split.Maximum token length that can be used is300 characters.stopwords (type: string array) - A list ofstopwords.\r\nThe default is an empty list.standardasciifolding.lucene(type applies onlywhen options areavailable)Standard analyzer with Ascii folding filter.stopStopAnalyzerDivides text at non-letters, applies thelowercase and stopword token filters.Optionsstopwords (type: string array) - A list ofstopwords. The default is a predefined listfor English.\r\nwhitespace(type applies onlywhen options areavailable)An analyzer that uses the whitespacetokenizer. Tokens that are longer than 255characters are split. Analyzer Types are always prefixed in code with #Microsoft.Azure.Search such thatPatternAnalyzer would actually be specified as#Microsoft.Azure.Search.PatternAnalyzer. We removed the prefix for brevity, but theprefix is required in your code.\r\nThe analyzer_type is only provided for analyzers that can be customized. If there are nooptions, as is the case with the keyword analyzer, there\u0027s no associated#Microsoft.Azure.Search type.Character filters add processing before a string reaches the tokenizer.Azure AI Search supports character filters in the following list.\r\nMore information abouteach one can be found in the Lucene API reference.11Character filtersﾉExpand tablechar_filter_namechar_filter_type Description and Optionshtml_strip(type applies only whenoptions are available)A char filter that attempts to strip out HTMLconstructs.mappingMappingCharFilterA char filter that applies mappings defined withthe mappings option. Matching is greedy(longest pattern matching at a given point wins).Replacement is allowed to be the empty string.Optionsmappings (type: string array) - A list ofmappings of the following format: a=\u003Eb (alloccurrences of the character a are replaced withcharacter b). Required.pattern_replacePatternReplaceCharFilterA char filter that replaces characters in the inputstring.\n"
}