{
  "Id": "1299",
  "Title": "\u0022Custom Scoring Profiles and Interpolations in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfdefaultScoringProfileWhen executing a search request, if no scoring profile isspecified, then default scoring is used (tf-idf only).You can override the built-in default, substituting a customprofile as the one to use when no specific profile is given in thesearch request.Interpolations allow you to set the shape of the slope used for scoring.\r\nBecause scoringis high to low, the slope is always decreasing, but the interpolation determines the curveof the downward slope. The following interpolations can be used:Set interpolationsInterpolationDescriptionlinearFor items that are within the max and min range, the boost applied to the itemwill be done in a constantly decreasing amount.\r\nLinear is the default interpolationfor a scoring profile.constantFor items that are within the start and ending range, a constant boost will beapplied to the rank results.quadraticIn comparison to a Linear interpolation that has a constantly decreasing boost,Quadratic will initially decrease at smaller pace and then as it approaches the endrange, it decreases at a much higher interval.\r\nThis interpolation option isn\u0027tallowed in tag scoring functions.logarithmicIn comparison to a Linear interpolation that has a constantly decreasing boost,Logarithmic will initially decrease at higher pace and then as it approaches theend range, it decreases at a much smaller interval. This interpolation option isn\u0027tallowed in tag scoring functions.boostingDuration is an attribute of the freshness function. You use it to set anexpiration period after which boosting will stop for a particular document. For example,to boost a product line or brand for a 10-day promotional period, you would specify the10-day period as \u0022P10D\u0022 for those documents. boostingDuration must be formatted as an XSD \u0022dayTimeDuration\u0022 value (a restrictedsubset of an ISO 8601 duration value). The pattern for this is: \u0022P[nD][T[nH][nM][nS]]\u0022.The following table provides several examples.\n"
}