{
  "Id": "1278",
  "Title": "\u0022Custom Analyzer Tutorial for Azure Cognitive Search Text Processing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn particular, consider using the Analyze Text API to return tokenized outputso that you can see exactly what an analyzer is creating for your index.Tutorial: Create a custom analyzer for phone numbersLanguage analyzers{ \u0022fields\u0022: [   {   \u0022name\u0022: \u0022accountNumber\u0022,   \u0022analyzer\u0022:\u0022myCustomAnalyzer\u0022,   \u0022type\u0022: \u0022Edm.\r\nString\u0022,  \u0022searchable\u0022: true,   \u0022filterable\u0022: true,   \u0022retrievable\u0022: true,   \u0022sortable\u0022: false,   \u0022facetable\u0022: false   } ], \u0022analyzers\u0022: [   {   \u0022@odata.type\u0022:\u0022#Microsoft.Azure.Search.CustomAnalyzer\u0022,   \u0022name\u0022:\u0022myCustomAnalyzer\u0022,   \u0022charFilters\u0022:[],   \u0022tokenizer\u0022:\u0022keyword_v2\u0022,   \u0022tokenFilters\u0022:[\u0022lowercase\u0022, \u0022my_edgeNGram\u0022]   } ], \u0022tokenizers\u0022:[], \u0022charFilters\u0022: [], \u0022tokenFilters\u0022: [   {   \u0022@odata.\r\ntype\u0022:\u0022#Microsoft.Azure.Search.EdgeNGramTokenFilterV2\u0022,   \u0022name\u0022:\u0022my_edgeNGram\u0022,   \u0022minGram\u0022: 2,   \u0022maxGram\u0022: 25,   \u0022side\u0022: \u0022front\u0022   } ] } Next stepsAnalyzers for text processing in Azure Cognitive SearchAnalyze Text API (REST)How full text search works (query architecture)Fuzzy search to correct misspellings andtyposArticle•04/21/2023Azure Cognitive Search supports fuzzy search, a type of query that compensates fortypos and misspelled terms in the input string.\r\nFuzzy search scans for terms having asimilar composition. Expanding search to cover near-matches has the effect ofautocorrecting a typo when the discrepancy is just a few misplaced characters.It\u0027s a query expansion exercise that produces a match on terms having a similarcomposition. When a fuzzy search is specified, the search engine builds a graph (basedon deterministic finite automaton theory) of similarly composed terms, for all wholeterms in the query.\n"
}