{
  "Id": "1755",
  "Title": "\u0022Custom Web API Skill Parameters and Usage Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSimilar to built-in skills, a Custom Web APIskill has inputs and outputs. Depending on the inputs, your Web API receives a JSONpayload when the indexer runs, and outputs a JSON payload as a response, along with asuccess status code. The response is expected to have the outputs specified by yourcustom skill. Any other response is considered an error and no enrichments areperformed.The structure of the JSON payload is described further down in this document.Microsoft.Skills.Custom.WebApiSkillParameters are case-sensitive.\r\nParameter nameDescriptionuriThe URI of the Web API to which the JSON payload will be sent. Only thehttps URI scheme is allowed.７ NoteThe indexer will retry twice for certain standard HTTP status codes returned fromthe Web API. These HTTP status codes are:502 Bad Gateway503 Service Unavailable429 Too Many Requests@odata.typeSkill parametersParameter nameDescriptionauthResourceId(Optional) A string that if set, indicates that this skill should use amanaged identity on the connection to the function or app hosting thecode. The value of this property is the application (client) ID of thefunction or app\u0027s registration in Azure Active Directory.\r\nThis value will beused to scope the authentication token retrieved by the indexer, and willbe sent along with the custom Web skill API request to the function orapp. Setting this property requires that your search service is configuredfor managed identity and your Azure function app is configured for anAzure AD login.httpMethodThe method to use while sending the payload. Allowed methods are PUTor POSThttpHeadersA collection of key-value pairs where the keys represent header namesand values represent header values that will be sent to your Web APIalong with the payload. The following headers are prohibited from beingin this collection: Accept, Accept-Charset, Accept-Encoding, Content-Length, Content-Type, Cookie, Host, TE, Upgrade, Via.\n"
}