{
  "Id": "385",
  "Title": "\u0022Customizing Lexical Analysis in Azure Search: An Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStage 2: Lexical analysis７ NoteAnalysis requirements can range from minimal to elaborate depending on yourscenario. You can control complexity of lexical analysis by the selecting one of thepredefined analyzers or by creating your own custom analyzer. Analyzers arescoped to searchable fields and are specified as part of a field definition. This allowsyou to vary lexical analysis on a per-field basis. Unspecified, the standard Luceneanalyzer is used.The behavior of an analyzer can be tested using the Analyze API. Provide the text youwant to analyze to see what terms given analyzer generates.\r\nFor example, to see howthe standard analyzer would process the text \u0022air-condition\u0022, you can issue the followingrequest:JSONThe standard analyzer breaks the input text into the following two tokens, annotatingthem with attributes like start and end offsets (used for hit highlighting) as well as theirposition (used for phrase matching):JSONTesting analyzer behaviors{    \u0022text\u0022:\r\n\u0022air-condition\u0022,    \u0022analyzer\u0022: \u0022standard\u0022}{  \u0022tokens\u0022: [    {      \u0022token\u0022: \u0022air\u0022,      \u0022startOffset\u0022: 0,      \u0022endOffset\u0022: 3,      \u0022position\u0022: 0    },    {      \u0022token\u0022: \u0022condition\u0022,      \u0022startOffset\u0022: 4,      \u0022endOffset\u0022: 13,      \u0022position\u0022: 1    }  ]}Exceptions to lexical analysisLexical analysis applies only to query types that require complete terms – either a termquery or a phrase query. It doesn’t apply to query types with incomplete terms – prefixquery, wildcard query, regex query – or to a fuzzy query. Those query types, includingthe prefix query with term air-condition* in our example, are added directly to thequery tree, bypassing the analysis stage. The only transformation performed on queryterms of those types is lowercasing.\n"
}