{
  "Id": "597",
  "Title": "\u0022Data Limits and Throttling in Azure AI Enrichment Pipeline\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfResourceFreeBasicS1S2S3S3-HDL1L2Maximum aliases610 or 301004004002000 per partition or 6000 per service2020An AI enrichment pipeline that makes calls to Azure AI Language resource for entityrecognition, entity linking, key phrase extraction, sentiment analysis, language detection, andpersonal-information detection is subject to data limits. The maximum size of a record shouldbe 50,000 characters as measured by String.\r\nLength. If you need to break up your data beforesending it to the sentiment analyzer, use the Text Split skill.API requests are throttled as the system approaches peak capacity. Throttling behavesdifferently for different APIs. Query APIs (Search/Suggest/Autocomplete) and indexing APIsthrottle dynamically based on the load on the service. Index APIs and service operations APIhave static request rate limits.\r\nStatic rate request limits for operations related to an index:List Indexes (GET /indexes): 3 per second per search unitGet Index (GET /indexes/myindex): 10 per second per search unitCreate Index (POST /indexes): 12 per minute per search unitCreate or Update Index (PUT /indexes/myindex): 6 per second per search unitDelete Index (DELETE /indexes/myindex): 12 per minute per search unitStatic rate request limits for operations related to a service:Service Statistics (GET /servicestats):\r\n4 per second per search unitIndex alias limitsData limits (AI enrichment)Throttling limitsAPI request limitsMaximum of 16 MB per request Maximum 8 KB URL lengthMaximum 1000 documents per batch of index uploads, merges, or deletesMaximum 32 fields in $orderby clauseMaximum 100, 000 characters in a search clauseThe maximum number of clauses in search (expressions separated by AND or OR) is 1024Maximum search term size is 32,766 bytes (32 KB minus 2 bytes) of UTF-8 encoded textMaximum search term size is 1000 characters for prefix search and regex searchWildcard search and Regular expression search are limited to a maximum of 1000 stateswhen processed by Lucene.\n"
}