{
  "Id": "551",
  "Title": "\u0022Data Access Strategies for Azure Cognitive Search and Storage\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStep 2: Approve the private endpoint connectionStep 3: Force indexers to run in the \u0022private\u0022 environment    {      \u0022name\u0022 : \u0022myindexer\u0022,      ... other indexer properties      \u0022parameters\u0022 : {          ... other parameters          \u0022configuration\u0022 : {            ... other configuration properties            \u0022executionEnvironment\u0022: \u0022Private\u0022          }        }    }A search service stores indexes and synonym lists.\r\nFor other features that requirestorage, Cognitive Search takes a dependency on Azure Storage. Enrichment caching,debug sessions, and knowledge stores fall into this category. The location of eachservice, and any network protections in place for storage, will determine your dataaccess strategy.In Azure Storage, access through a firewall requires that the request originates from adifferent region.\r\nIf Azure Storage and Azure Cognitive Search are in the same region,you can bypass the IP restrictions on the storage account by accessing data under thesystem identity of the search service.There are two options for supporting data access using the system identity:Configure search to run as a trusted service and use the trusted service exceptionin Azure Storage.\r\nConfigure a resource instance rule in Azure Storage that admits inbound requestsfrom an Azure resource.The above options depend on Azure Active Directory for authentication, which meansthat the connection must be made with an Azure AD login. Currently, only a CognitiveSearch system-assigned managed identity is supported for same-region connectionsthrough a firewall.When search and storage are in different regions, you can use the previously mentionedoptions or set up IP rules that admit requests from your service. Depending on theworkload, you might need to set up rules for multiple execution environments asdescribed in the next section. Now that you\u0027re familiar with indexer data access options for solutions deployed in anAzure virtual network, review either of the following how-to articles as your next step:How to make indexer connections to a private endpointHow to make indexer connections through an IP firewallAccess to a network-protected storage accountSame-region servicesServices in different regionsNext stepsAzure Policy Regulatory Compliancecontrols for Azure AI SearchArticle•12/04/2023If you are using Azure Policy to enforce the recommendations in Microsoft cloudsecurity benchmark, then you probably already know that you can create policies foridentifying and fixing non-compliant services.\n"
}