{
  "Id": "542",
  "Title": "\u0022Data Encryption and Residency in Azure AI Search Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn this scenario, data access isinternal only, with no third-party access.During support, this information might be used to provide quick resolution toissues and escalate product team if neededAt the storage layer, data encryption is built in for all service-managed content saved todisk, including indexes, synonym maps, and the definitions of indexers, data sources,Data residencyExceptions to data residency commitmentsData protectionand skillsets. Service-managed encryption applies to both long-term data storage andtemporary data storage.Optionally, you can add customer-managed keys (CMK) for supplemental encryption ofindexed content for double encryption of data at rest.\r\nFor services created after August1 2020, CMK encryption extends to short-term data on temporary disks.In Azure AI Search, encryption starts with connections and transmissions. For searchservices on the public internet, Azure AI Search listens on HTTPS port 443. All client-to-service connections use TLS 1.2 encryption. Earlier versions (1.0 or 1.1) aren\u0027t supported.For data handled internally by the search service, the following table describes the dataencryption models. Some features, such as knowledge store, incremental enrichment,and indexer-based indexing, read from or write to data structures in other AzureServices.\r\nServices that have a dependency on Azure Storage can use the encryptionfeatures of that technology.ModelKeys     Requirements     RestrictionsApplies toserver-sideencryptionMicrosoft-managedkeysNone (built-in)None, available onall tiers, in allregions, for contentcreated after January24, 2018. Content (indexes andsynonym maps) anddefinitions (indexers,data sources, skillsets),on data disks andtemporary disksserver-sideencryptioncustomer-managedkeysAzure Key VaultAvailable on billabletiers, in specificregions, for contentcreated after August1, 2020.Content (indexes andsynonym maps) ondata disksserver-sidefullencryptioncustomer-managedkeysAzure Key VaultAvailable on billabletiers, in all regions,on search servicesafter May 13, 2021.\n"
}