{
  "Id": "461",
  "Title": "\u0022Data Indexing and Search in Azure AI: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn Azure AI Search, this capability is implemented through indexers, currentlyavailable for these platforms:Azure Blob storageIndexing actions: upload, merge, mergeOrUpload, deletePulling data into an indexAzure Table storageAzure Data Lake Storage Gen2Azure Files (preview)Azure Cosmos DBAzure SQL Database, SQL Managed Instance, and SQL Server on Azure VMsSharePoint in Microsoft 365 (preview)Indexers connect an index to a data source (usually a table, view, or equivalentstructure), and map source fields to equivalent fields in the index.\r\nDuring execution, therowset is automatically transformed to JSON and loaded into the specified index. Allindexers support schedules so that you can specify how frequently the data is to berefreshed. Most indexers provide change tracking if the data source supports it. Bytracking changes and deletes to existing documents in addition to recognizing newdocuments, indexers remove the need to actively manage the data in your index.Indexer functionality is exposed in the Azure portal, the REST API, and the .NET SDK.An advantage to using the portal is that Azure AI Search can usually generate a defaultindex schema by reading the metadata of the source dataset.\r\nYou can modify thegenerated index until the index is processed, after which the only schema edits allowedare those that do not require reindexing. If the changes affect the schema itself, youwould need to rebuild the index.A quick way to perform a preliminary check on the document upload is to use Searchexplorer in the portal.The explorer lets you query an index without having to write any code. The searchexperience is based on default settings, such as the simple syntax and defaultsearchMode query parameter. Results are returned in JSON so that you can inspect theentire document.Here is an example query that you can run in Search Explorer. The \u0022HotelId\u0022 is thedocument key of the hotels-sample-index. The filter provides the document ID of aspecific document:How to pull data into an Azure AI Search indexVerify data import with Search explorerHTTPIf you\u0027re using REST, this Look up query achieves the same purpose.\n"
}