{
  "Id": "338",
  "Title": "\u0022Debugging Azure Cognitive Search: Step-by-Step Tutorial with Prerequisites\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUsing this tool, you can drill down to specific steps to easily see where an action mightbe falling down.In this article, use Debug sessions to find and fix missing inputs and outputs. Thetutorial is all-inclusive. It provides sample data, a Postman collection that createsobjects, and instructions for debugging problems in the skillset.Before you begin, have the following prerequisites in place:An active subscription. Create an account for free.Azure Cognitive Search. Create a service or find an existing service under yourcurrent subscription. You can use a free service for this tutorial.\r\nAzure Storage account with Blob storage, used for hosting sample data, and forpersisting cached data created during a debug session.Postman app and a Postman collection to create objects using the REST APIs.Sample PDFs (clinical trials).Prerequisites７ NoteThis tutorial also uses Azure AI services for language detection, entityrecognition, and key phrase extraction.\r\nBecause the workload is so small, Azure AIservices is tapped behind the scenes for free processing for up to 20 transactions.This means that you can complete this exercise without having to create a billableAzure AI services resource.This section creates the sample data set in Azure Blob Storage so that the indexer andskillset have content to work with.\r\n1. Download sample data (clinical-trials-pdf-19), consisting of 19 files.2. Create an Azure storage account or find an existing account.Choose the same region as Azure Cognitive Search to avoid bandwidthcharges.Choose the StorageV2 (general purpose V2) account type.3. Navigate to the Azure Storage services pages in the portal and create a Blobcontainer. Best practice is to specify the access level \u0022private\u0022. Name yourcontainer clinicaltrialdataset.4. In container, click Upload to upload the sample files you downloaded andunzipped in the first step.5. While in the portal, get and save off the connection string for Azure Storage.\n"
}