{
  "Id": "1030",
  "Title": "\u0022Debugging Azure Search: Step-by-Step Guide for Indexer Sessions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou\u0027ll be prompted to select and optionally create a blob containerin Blob Storage or Azure Data Lake Storage Gen2. You can reuse the samecontainer for all subsequent debug sessions you create. A helpful container namemight be \u0022cognitive-search-debug-sessions\u0022.6. In Indexer template, select the indexer that drives the skillset you want to debug.\r\nCopies of both the indexer and skillset are used to initialize the session.7. In Document to debug, choose the first document in the index or select a specificdocument. If you select a specific document, depending on the data source, you\u0027llbe asked for a URI or a row ID.If your specific document is a blob, you\u0027ll be asked for the blob URI.\r\nYou can findthe URL in the blob property page in the portal.Create a debug session8. Optionally, in Indexer settings, specify any indexer execution settings used tocreate the session. The settings should mimic the settings used by the actualindexer. Any indexer options that you specify in a debug session have no effect onthe indexer itself.9.\r\nYour configuration should look similar to this screenshot. Select Save Session toget started.The debug session begins by executing the indexer and skillset on the selecteddocument. The document\u0027s content and metadata created will be visible and available inthe session.A debug session can be canceled while it\u0027s executing using the Cancel button.\r\nIf you hitthe Cancel button you should be able to analyze partial results.It is expected for a debug session to take longer to execute than the indexer since itgoes through extra processing.Indexer execution history in the portal gives you the full error and warning list for alldocuments. In a debug session, the errors and warnings will be limited to onedocument. You\u0027ll work through this list, make your changes, and then return to the list toverify whether issues are resolved.To view the messages, select a skill in AI Enrichment \u003E Skill Graph and then selectErrors/Warnings in the details pane.As a best practice, resolve problems with inputs before moving on to outputs.\n"
}