{
  "Id": "1035",
  "Title": "\u0022Debugging Azure Functions and Skillset Annotations: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfEnsure that you append \u0022/api/FunctionName\u0022 when usingAzure Function for executing the skillset code.You can edit the skill definition in the portal.At this point, new requests from your debug session should now be sent to your localAzure Function. You can use breakpoints in your Visual Studio code to debug your codeor run step by step.\r\nNow that you understand the layout and capabilities of the Debug Sessions visualeditor, try the tutorial for a hands-on experience.Configure in Azure portalTest your codeNext stepsTutorial: Explore Debug sessionsReference an annotation in an AzureCognitive Search skillsetArticle•10/12/2022In this article, you\u0027ll learn how to reference annotations (or an enrichment node) in skilldefinitions, using examples to illustrate various scenarios.\r\nSkills read inputs and write outputs to nodes in an enriched document tree, building thetree as the enrichments progress. Any node can be referenced in an input for furtherdownstream enrichment, or mapped to an output field in an index. This articleintroduces the syntax and provides examples for specifying a path to a node. For the fullsyntax, see Skill context and input annotation language language.Paths to an annotation are specified in the \u0022context\u0022 and \u0022source\u0022 properties of askillset, and in output field mappings in an indexer.\r\nHere\u0027s an example of what pathsmight look like in a skillset:The example in the screenshot illustrates the path for an item in an Azure Cosmos DBcollection.\u0022context\u0022 path is /document/HotelId because the collection is partitioned intodocuments by the /HotelId field.\u0022source\u0022 path is /document/Description because the skill is a translation skill, andthe field that you\u0027ll want the skill to translate is the Description field in eachdocument. Before reviewing the syntax, let\u0027s revisit a few important concepts to better understandthe examples provided later in this article.TermDescription\u0022enricheddocument\u0022An enriched document is an internal structure that collects skill output as it\u0027screated and it holds all annotations related to a document.\n"
}