{
  "Id": "1033",
  "Title": "\u0022Debugging and Mapping Skills in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf1. Start with the default views: AI enrichment \u003E Skill Graph, with the graph type setto Dependency Graph.2. Select Field Mappings near the top. You should find at least the document key thatuniquely identifies and associates each search document in the search index withits source document in the data source.\r\nIf you\u0027re importing raw content straight from the data source, bypassingenrichment, you should find those fields in Field Mappings.Check field mappings3. Select Output Field Mappings at the bottom of the graph. Here you\u0027ll findmappings from skill outputs to target fields in the search index.\r\nUnless you usedthe Import Data wizard, output field mappings are defined manually and could beincomplete or mistyped.Verify that the fields in Output Field Mappings exist in the search index asspecified, checking for spelling and enrichment node path syntax.Custom skills can be more challenging to debug because the code runs externally, sothe debug session can\u0027t be used to debug them.\r\nThis section describes how to locallydebug your Custom Web API skill, debug session, Visual Studio Code and ngrok orTunnelmole. This technique works with custom skills that execute in Azure Functionsor any other Web Framework that runs locally (for example, FastAPI).Tunnelmole is an open source tunneling tool that can create a public URL that forwardsrequests to your local machine through a tunnel.\r\n1. Install Tunnelmole:npm: npm install -g tunnelmoleLinux: curl -s https://tunnelmole.com/sh/install-linux.sh | sudo bashMac: curl -s https://tunnelmole.com/sh/install-mac.sh --output install-mac.sh \u0026\u0026 sudo bash install-mac.shDebug a custom skill locallyGet a public URLUsing TunnelmoleWindows: Install by using npm. Or if you don\u0027t have NodeJS installed,download the precompiled .exe file for Windows and put it somewhere inyour PATH.2. Run this command to create a new tunnel:ConsoleIn the preceding example, https://m5hdpb-ip-49-183-170-144.tunnelmole.net forwardsto port 7071 on your local machine, which is the default port where Azure functions areexposed.\n"
}