{
  "Id": "517",
  "Title": "\u0022Debugging Custom Skills and Enriched Data in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen you debug an error with a custom skill, there is the option to generate a requestfor a skill invocation in the execution history.The Enriched Data Structure pane shows the document\u0027s enrichments through theskillset, detailing the context for each enrichment and the originating skill. TheExpression Evaluator can also be used to view the contents for each enrichment.Executions paneAI Enrichments tab \u003E Enriched Data StructureExpression Evaluator gives a quick peek into the value of any path. It allows for editingthe path and testing the results before updating any of the inputs or context for a skillor projection.\r\nYou can open the window from any node or element that shows the \u003C/\u003E symbol,including parts of a dependency graph or nodes in an enrichment tree.Expression Evaluator gives you full interactive access for testing skill context, inputs, andchecking outputs.Expression EvaluatorNow that you understand the elements of debug sessions, start your first debug sessionon an existing skillset.\r\nNext stepsHow to debug a skillsetKnowledge store in Azure CognitiveSearchArticle•01/31/2023Knowledge store is a data sink created by a Cognitive Search enrichment pipeline thatstores AI-enriched content in tables and blob containers in Azure Storage forindependent analysis or downstream processing in non-search scenarios like knowledgemining. If you\u0027ve used cognitive skills in the past, you already know that enriched content iscreated by skillsets. Skillsets move a document through a sequence of enrichments thatinvoke atomic transformations, such as recognizing entities or translating text.Output is always a search index, but it can also be projections in a knowledge store. Thetwo outputs, search index and knowledge store, are mutually exclusive products of thesame pipeline. They are derived from the same inputs, but their content is structured,stored, and used in different applications.Physically, a knowledge store is Azure Storage, either Azure Table Storage, Azure BlobStorage, or both.\n"
}