{
  "Id": "1123",
  "Title": "\u0022Defining Relationships and Projections in Azure Search: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfKey phrases would get the key phrase column. Entities would get the entitycolumns.JSONThe generatedKeyName and referenceKeyName properties are used to relate data acrosstables or even across projection types. Each row in the child table has a propertypointing back to the parent. The name of the column or property in the child is thereferenceKeyName from the parent.\r\nWhen the referenceKeyName isn\u0027t provided, theservice defaults it to the generatedKeyName from the parent.Power BI relies on these generated keys to discover relationships within the tables. If youneed the column in the child table named differently, set the referenceKeyName propertyon the parent table.\r\nOne example would be to set the generatedKeyName as ID on thetblDocument table and the referenceKeyName as DocumentID. This would result in thecolumn in the tblEntities and tblKeyPhrases tables containing the document ID beingnamed DocumentID.Object projections are JSON representations of the enrichment tree that can be sourcedfrom any node. In comparison with table projections, object projections are simpler todefine and are used when projecting whole documents. Object projections are limited toa single projection in a container and can\u0027t be sliced.To define an object projection, use the objects array in the projections property.\r\nAnobject projection has three required properties:\u0022projections\u0022 : [   {     \u0022tables\u0022: [     { \u0022tableName\u0022: \u0022MainTable\u0022, \u0022generatedKeyName\u0022: \u0022HotelId\u0022, \u0022source\u0022: \u0022/document/EnrichedShape\u0022 },     { \u0022tableName\u0022: \u0022KeyPhrases\u0022, \u0022generatedKeyName\u0022: \u0022KeyPhraseId\u0022, \u0022source\u0022: \u0022/document/EnrichedShape/*/KeyPhrases/*\u0022 },     { \u0022tableName\u0022: \u0022Entities\u0022, \u0022generatedKeyName\u0022: \u0022EntityId\u0022, \u0022source\u0022: \u0022/document/EnrichedShape/*/Entities/*\u0022 }     ]   } ] Naming relationshipsDefine an object projectionPropertyDescriptionPropertyDescriptionstorageContainerDetermines the name of a new container created in Azure Storage.\ngeneratedKeyNameColumn name for the key that uniquely identifies each row. The value issystem-generated.\n"
}