{
  "Id": "1124",
  "Title": "\u0022Defining Object and File Projections in Azure Storage\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022Entities\u0022, \u0022generatedKeyName\u0022: \u0022EntityId\u0022, \u0022source\u0022: \u0022/document/EnrichedShape/*/Entities/*\u0022 }     ]   } ] Naming relationshipsDefine an object projectionPropertyDescriptionPropertyDescriptionstorageContainerDetermines the name of a new container created in Azure Storage.\r\ngeneratedKeyNameColumn name for the key that uniquely identifies each row. The value issystem-generated.\r\nIf you omit this property, a column will be createdautomatically that uses the table name and \u0022key\u0022 as the namingconvention.sourceA path to a node in an enrichment tree that is the root of the projection.The node is usually a reference to a complex data shape that determinesblob structure.The following example projects individual hotel documents, one hotel document perblob, into a container called hotels.JSONThe source is the output of a Shaper skill, named \u0022objectprojection\u0022. Each blob willhave a JSON representation of each field input.\r\nJSON\u0022knowledgeStore\u0022: {   \u0022storageConnectionString\u0022: \u0022an Azure storage connection string\u0022,   \u0022projections\u0022 : [     {       \u0022tables\u0022: [ ]     },     {       \u0022objects\u0022: [         {         \u0022storageContainer\u0022: \u0022hotels\u0022,         \u0022source\u0022: \u0022/document/objectprojection\u0022,         }       ]     },     {         \u0022files\u0022: [ ]     }   ] }     {       \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Util.\r\nShaperSkill\u0022,       \u0022name\u0022: \u0022#3\u0022,       \u0022description\u0022: null,       \u0022context\u0022: \u0022/document\u0022,       \u0022inputs\u0022: [         { File projections are always binary, normalized images, where normalization refers topotential resizing and rotation for use in skillset execution. File projections, similar toobject projections, are created as blobs in Azure Storage, and contain binary data (asopposed to JSON). To define a file projection, use the files array in the projections property. A filesprojection has three required properties:PropertyDescriptionstorageContainerDetermines the name of a new container created in Azure Storage.generatedKeyNameColumn name for the key that uniquely identifies each row. The value issystem-generated. If you omit this property, a column will be createdautomatically that uses the table name and \u0022key\u0022 as the namingconvention.sourceA path to a node in an enrichment tree that is the root of the projection.For images files, the source is always /document/normalized_images/*. Fileprojections only act on the normalized_images collection.\n"
}