{
  "Id": "1676",
  "Title": "\u0022Defining Custom Entities in JSON Format for Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe JSON format gives you a bit more flexibility since it allows you to define matchingrules per term. For instance, you can specify the fuzzy matching distance (Damerau-Levenshtein distance) for each term or whether the matching should be case-sensitiveor not.Just like with CSV files, you need to provide the path to the JSON file and set it in the\u0022entitiesDefinitionUri\u0022 skill parameter.\r\nThe path should be at an https location. Thedefinition file can be up to 10 MB in size.The most basic JSON custom entity list definition can be a list of entities to match:JSONCSV formatBill Gates, BillG, William H. Gates Microsoft, MSFT Satya Nadella  JSON format[      {          \u0022name\u0022 : \u0022Bill Gates\u0022     },      {          \u0022name\u0022 : \u0022Microsoft\u0022     },      {          \u0022name\u0022 : \u0022Satya Nadella\u0022 More complex definitions can provide a user-defined ID, description, type, subtype, andaliases.\r\nIf an alias term is matched, the entity will be returned as well:JSONThe tables below describe the configuration parameters you can set when definingcustom entities:Field nameDescriptionnameThe top-level entity descriptor.\r\nMatches in the skill output will begrouped by this name, and it should represent the \u0022normalized\u0022 formof the text being found.    } ] [      {          \u0022name\u0022 : \u0022Bill Gates\u0022,         \u0022description\u0022 : \u0022Microsoft founder.\u0022 ,         \u0022aliases\u0022 : [              { \u0022text\u0022 : \u0022William H. Gates\u0022, \u0022caseSensitive\u0022 : false },             { \u0022text\u0022 : \u0022BillG\u0022, \u0022caseSensitive\u0022 : true }         ]     },      {          \u0022name\u0022 : \u0022Xbox One\u0022,          \u0022type\u0022: \u0022Hardware\u0022,         \u0022subtype\u0022 : \u0022Gaming Device\u0022,         \u0022id\u0022 :\n"
}