{
  "Id": "1121",
  "Title": "\u0022Defining Table Projections and Constraints in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can use a Shaper skill or inline shapes. TheShaper skill produces valid JSON, but the source could be the output from any skill, ifvalid JSON.The schema of a table is specified partly by the projection (table name and key), andalso by the source that provides the shape of table (columns).\r\nThis example shows justone table so that you can focus on the details of the definition.JSONColumns are derived from the \u0022source\u0022. The following data shape containing HotelId,HotelName, Category, and Description will result in creation of those columns in thetable.JSON７ NoteTable projections are subject to the storage limits imposed by Azure Storage.\r\nTheentity size cannot exceed 1 MB and a single property can be no bigger than 64 KB.These constraints make tables a good solution for storing a large number of smallentities.Single table example\u0022projections\u0022 : [   {     \u0022tables\u0022: [       { \u0022tableName\u0022: \u0022Hotels\u0022, \u0022generatedKeyName\u0022: \u0022HotelId\u0022, \u0022source\u0022: \u0022/document/tableprojection\u0022 }     ]   } ] {     \u0022@odata.\r\ntype\u0022: \u0022#Microsoft.Skills.Util.ShaperSkill\u0022,     \u0022name\u0022: \u0022#3\u0022,     \u0022description\u0022: null,     \u0022context\u0022: \u0022/document\u0022,     \u0022inputs\u0022: [     {         \u0022name\u0022: \u0022HotelId\u0022,         \u0022source\u0022: \u0022/document/HotelId\u0022     },     {         \u0022name\u0022: \u0022HotelName\u0022, A common pattern for table projections is to have multiple related tables, wheresystem-generated partitionKey and rowKey columns are created to support cross-tablerelationships for all tables under the same projection group.Creating multiple tables can be useful if you want control over how related data isaggregated. If enriched content has unrelated or independent components, for examplethe keywords extracted from a document might be unrelated from the entitiesrecognized in the same document, you can split those fields out into adjacent tables.When you\u0027re projecting to multiple tables, the complete shape is projected into eachtable, unless a child node is the source of another table within the same group.\n"
}