{
  "Id": "900",
  "Title": "\u0022Defining Data Sources and Metadata for Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor example, application/octet-stream.metadata_storage_last_modified (Edm.DateTimeOffset) - last modified timestampfor the blob. Azure Cognitive Search uses this timestamp to identify changedblobs, to avoid reindexing everything after the initial indexing.metadata_storage_size (Edm.Int64) - blob size in bytes.metadata_storage_content_md5 (Edm.String) - MD5 hash of the blob content, ifavailable.metadata_storage_sas_token (Edm.String) - A temporary SAS token that can beused by custom skills to get access to the blob. This token shouldn\u0027t be stored forlater use as it might expire.\r\nLastly, any metadata properties specific to the document format of the blobs you\u0027reindexing can also be represented in the index schema. For more information aboutcontent-specific metadata, see Content metadata properties.It\u0027s important to point out that you don\u0027t need to define fields for all of the aboveproperties in your search index - just capture the properties you need for yourapplication.\r\nThe data source definition specifies the data to index, credentials, and policies foridentifying changes in the data. A data source is defined as an independent resource sothat it can be used by multiple indexers.Define the data source1. Create or update a data source to set its definition:JSON2. Set \u0022type\u0022 to \u0022adlsgen2\u0022 (required).\r\n3. Set \u0022credentials\u0022 to an Azure Storage connection string. The next sectiondescribes the supported formats.4. Set \u0022container\u0022 to the blob container, and use \u0022query\u0022 to specify any subfolders.A data source definition can also include soft deletion policies, if you want the indexerto delete a search document when the source document is flagged for deletion. Indexers can connect to a blob container using the following connections.Full access storage account connection string{ \u0022connectionString\u0022 : \u0022DefaultEndpointsProtocol=https;AccountName=\u003Cyour storageaccount\u003E;AccountKey=\u003Cyour account key\u003E;\u0022 }You can get the connection string from the Storage account page in Azure portal by selectingAccess keys in the left navigation pane.\n"
}