{
  "Id": "654",
  "Title": "\u0022Defining and Using Field Attributes in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSimpleFieldHelper model. Can be any data type, is always non-searchable (it\u0027s ignored forfull text search queries), and is retrievable (it\u0027s not hidden). Other attributes areoff by default, but can be enabled. You might use a SimpleField for documentIDs or fields used only in filters, facets, or scoring profiles.\r\nIf so, be sure to applyany attributes that are necessary for the scenario, such as IsKey = true for adocument ID. For more information, see SimpleFieldAttribute.cs in sourcecode.SearchableFieldHelper model. Must be a string, and is always searchable and retrievable. Otherattributes are off by default, but can be enabled.\r\nBecause this field type issearchable, it supports synonyms and the full complement of analyzerproperties. For more information, see the SearchableFieldAttribute.cs insource code.Whether you use the basic SearchField API or either one of the helper models, youmust explicitly enable filter, facet, and sort attributes. For example, IsFilterable,IsSortable, and IsFacetable must be explicitly attributed, as shown in the sample above.Notice how each field is decorated with attributes such as IsFilterable, IsSortable,IsKey, and AnalyzerName. These attributes map directly to the corresponding fieldattributes in an Azure Cognitive Search index.\r\nThe FieldBuilder class uses theseproperties to construct field definitions for the index.The .NET types of the properties map to their equivalent field types in the indexdefinition. For example, the Category string property maps to the category field, whichChoosing a field classAdding field attributesField type mappingis of type Edm.String. There are similar type mappings between bool?, Edm.Boolean,DateTimeOffset?, and Edm.DateTimeOffset and so on.Did you happen to notice the SmokingAllowed property?C#The JsonIgnore attribute on this property tells the FieldBuilder to not serialize it to theindex as a field. This is a great way to create client-side calculated properties you canuse as helpers in your application.\n"
}