{
  "Id": "1060",
  "Title": "\u0022Defining Visual Features in Azure Search: Image Tagging and Captioning\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe skill definitionallows you to specify which visual features are of interest. For this example, tags anddescriptions were produced, but there are more outputs to choose from.\u0022imageCaption\u0022 output is an array of descriptions, one per image, denoted by\u0022tags\u0022 consisting of single words and longer phrases that describe the image.Notice the tags consisting of \u0022a flock of seagulls are swimming in the water\u0022, or \u0022aclose up of a bird\u0022.\u0022imageTags\u0022 output is an array of single tags, listed in the order of creation. Noticethat tags will repeat. There is no aggregation or grouping.\r\nJSON \u0022imageCaption\u0022: [       \u0022{\\\u0022tags\\\u0022:[\\\u0022bird\\\u0022,\\\u0022outdoor\\\u0022,\\\u0022water\\\u0022,\\\u0022flock\\\u0022,\\\u0022many\\\u0022,\\\u0022lot\\\u0022,\\\u0022bunch\\\u0022,\\\u0022group\\\u0022,\\\u0022several\\\u0022,\\\u0022gathered\\\u0022,\\\u0022pond\\\u0022,\\\u0022lake\\\u0022,\\\u0022different\\\u0022,\\\u0022family\\\u0022,\\\u0022flying\\\u0022,\\\u0022standing\\\u0022,\\\u0022little\\\u0022,\\\u0022air\\\u0022,\\\u0022beach\\\u0022,\\\u0022swimming\\\u0022,\\\u0022large\\\u0022,\\\u0022dog\\\u0022,\\\u0022landing\\\u0022,\\\u0022jumping\\\u0022,\\\u0022playing\\\u0022],\\\u0022captions\\\u0022:[{\\\u0022text\\\u0022:\\\u0022a flock of seagulls are swimming in the water\\\u0022,\\\u0022confidence\\\u0022:0.\r\n70419257326275686}]}\u0022,       \u0022{\\\u0022tags\\\u0022:[\\\u0022map\\\u0022],\\\u0022captions\\\u0022:[{\\\u0022text\\\u0022:\\\u0022map\\\u0022,\\\u0022confidence\\\u0022:0.99942880868911743}]}\u0022,       \u0022{\\\u0022tags\\\u0022:[\\\u0022animal\\\u0022,\\\u0022bird\\\u0022,\\\u0022raptor\\\u0022,\\\u0022eagle\\\u0022,\\\u0022sitting\\\u0022,\\\u0022table\\\u0022],\\\u0022captions\\\u0022:[{\\\u0022text\\\u0022:\\\u0022a close up of a bird\\\u0022,\\\u0022confidence\\\u0022:0.89643581933539462}]}\u0022,     . . . \u0022imageTags\u0022: [ When the images you want to process are embedded in other files, such as PDF orDOCX, the enrichment pipeline will extract just the images and then pass them to OCRor image analysis for processing. Separation of image from text content occurs duringthe document cracking phase, and once the images are separated, they remain separateunless you explicitly merge the processed output back into the source text.\n"
}