{
  "Id": "170",
  "Title": "\u0022Deploying Azure Search-Enabled Website: Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOn the left, select Indexes, and then select the good-books index.3. By default, the index opens in the Search explorer tab. Select Search to returndocuments from the index.npm install Run the bulk import script for Searchnpm startReview the new search indexUse the following git command in the Visual Studio Code integrated terminal at thebulk-insert directory, to roll back the changes.\r\nThey aren\u0027t needed to continue thetutorial and you shouldn\u0027t save or push these secrets to your repo.gitNote your Search resource name. You\u0027ll need this to connect the Azure Function app toyour search resource.Rollback bulk import file changesgit checkout .\r\nCopy your Search resource nameＵ CautionWhile you may be tempted to use your search admin key in the Azure Function,that isn\u0027t following the principle of least privilege. The Azure Function will use thequery key to conform to least privilege.Deploy your Static Web AppNext steps3 - Deploy the search-enabled websiteArticle•09/13/2023Deploy the search-enabled website as an Azure Static Web Apps site.\r\nThis deploymentincludes both the React app and the Function app.The static web app pulls the information and files for deployment from GitHub usingyour fork of the samples repository.1. In Visual Studio Code, open a folder at the repository root (for example, azure-search-javascript-samples).2. Select Azure from the Activity Bar, then open Resources from the side bar.\r\n3. Right-click Static Web Apps and then select Create Static Web App (Advanced). Ifyou don\u0027t see this option, verify that you have the Azure Functions extension forVisual Studio Code.4. If you see a pop-up window in Visual Studio Code asking which branch you wantto deploy from, select the default branch, usually main. Create a Static Web App in Visual Studio CodeThis setting means only changes you commit to that branch are deployed to yourstatic web app.5. If you see a pop-up window asking you to commit your changes, don\u0027t do this. Thesecrets from the bulk import step shouldn\u0027t be committed to the repository.\n"
}