{
  "Id": "200",
  "Title": "\u0022Deploying and Managing Azure Search and Static Web Apps\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSelect Search to returndocuments from the index.Run the bulk import script for SearchmacOS/Linuxpython3 bulk-upload.pyReview the new Search IndexUse the following git command in the Visual Studio Code integrated terminal at thebulk-insert directory, to roll back the changes. They aren\u0027t needed to continue thetutorial and you shouldn\u0027t save or push these secrets to your repo.\r\ngitNote your Search resource name. You\u0027ll need this to connect the Azure Function app toyour search resource.Rollback bulk import file changesgit checkout .Copy your Search resource nameＵ CautionWhile you may be tempted to use your search admin key in the Azure Function,that isn\u0027t following the principle of least privilege.\r\nThe Azure Function will use thequery key to conform to least privilege.Deploy your Static Web AppNext steps3 - Deploy the search-enabled PythonwebsiteArticle•07/18/2023Deploy the search-enabled website as an Azure Static Web Apps site. This deploymentincludes both the React app and the Function app.\r\nThe static web app pulls the information and files for deployment from GitHub usingyour fork of the samples repository.1. Select Azure from the Activity Bar, then open Resources from the Side bar.2. Right-click Static Web Apps and then select Create Static Web App (Advanced).3. If you see a pop-up window in VS Code asking which branch you want to deployfrom, select the default branch, usually master or main. Create a Static Web App in Visual Studio CodeThis setting means only changes you commit to that branch are deployed to yourstatic web app.4. If you see a pop-up window asking you to commit your changes, don\u0027t do this. Thesecrets from the bulk import step shouldn\u0027t be committed to the repository.To roll back the changes, in VS Code select the Source Control icon in the Activitybar, then select each changed file in the Changes list and select the Discardchanges icon.5. Follow the prompts to provide the following information:PromptEnterSelect a resource group fornew resources.\n"
}