{
  "Id": "125",
  "Title": "\u0022Deploying Azure AI Search Service Using ARM Template Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearch/searchServices\u0022,      \u0022apiVersion\u0022: \u00222020-08-01\u0022,      \u0022name\u0022: \u0022[parameters(\u0027name\u0027)]\u0022,      \u0022location\u0022: \u0022[parameters(\u0027location\u0027)]\u0022,      \u0022sku\u0022: {        \u0022name\u0022: \u0022[parameters(\u0027sku\u0027)]\u0022      },      \u0022properties\u0022: {        \u0022replicaCount\u0022: \u0022[parameters(\u0027replicaCount\u0027)]\u0022,        \u0022partitionCount\u0022: \u0022[parameters(\u0027partitionCount\u0027)]\u0022,        \u0022hostingMode\u0022: \u0022[parameters(\u0027hostingMode\u0027)]\u0022      }    }  ]}Deploy the templateSelect the following image to sign in to Azure and open a template.\r\nThe templatecreates an Azure AI Search resource.The portal displays a form that allows you to easily provide parameter values. Someparameters are pre-filled with the default values from the template.\r\nYou will need toprovide your subscription, resource group, location, and service name. If you want touse Azure AI services in an AI enrichment pipeline, for example to analyze binary imagefiles for text, choose a location that offers both Azure AI Search and Azure AI services.Both services are required to be in the same region for AI enrichment workloads.\r\nOnceyou have completed the form, you will need to agree to the terms and conditions andthen select the purchase button to complete your deployment.When your deployment is complete you can access your new resource group and newsearch service in the portal.Review deployed resourcesOther Azure AI Search quickstarts and tutorials build upon this quickstart. If you plan tocontinue on to work with subsequent quickstarts and tutorials, you may wish to leavethis resource in place. When no longer needed, you can delete the resource group,which deletes the Azure AI Search service and related resources.In this quickstart, you created an Azure AI Search service using an ARM template, andvalidated the deployment. To learn more about Azure AI Search and Azure ResourceManager, continue on to the articles below.Read an overview of Azure AI Search.Create an index for your search service.Create a demo app using the portal wizard.Create a skillset to extract information from your data.\n"
}