{
  "Id": "126",
  "Title": "\u0022Deploying Azure AI Search with Bicep: Quickstart and Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you plan tocontinue on to work with subsequent quickstarts and tutorials, you may wish to leavethis resource in place. When no longer needed, you can delete the resource group,which deletes the Azure AI Search service and related resources.In this quickstart, you created an Azure AI Search service using an ARM template, andvalidated the deployment. To learn more about Azure AI Search and Azure ResourceManager, continue on to the articles below.Read an overview of Azure AI Search.Create an index for your search service.Create a demo app using the portal wizard.Create a skillset to extract information from your data.\r\nClean up resourcesNext stepsQuickstart: Deploy Azure AI Searchusing BicepArticle•11/15/2023This article walks you through the process for using a Bicep file to deploy an Azure AISearch resource in the Azure portal.Bicep is a domain-specific language (DSL) that uses declarative syntax to deploy Azureresources. It provides concise syntax, reliable type safety, and support for code reuse.\r\nBicep offers the best authoring experience for your infrastructure-as-code solutions inAzure.Only those properties included in the template are used in the deployment. If morecustomization is required, such as setting up network security, you can update theservice as a post-deployment task. To customize an existing service with the feweststeps, use Azure CLI or Azure PowerShell.\r\nIf you\u0027re evaluating preview features, use theManagement REST API.If you don\u0027t have an Azure subscription, create a free account before you begin.The Bicep file used in this quickstart is from Azure Quickstart Templates.Bicep TipFor an alternative Bicep template that deploys Azure AI Search with a pre-configured indexer to Cosmos DB for NoSQL, see Bicep deployment of Azure AISearch. The template creates an indexer, index, and data source. The indexer runson a schedule that refreshes from Cosmos DB on a 5-minute interval.PrerequisitesReview the Bicep file@description(\u0027Service name must only contain lowercase letters, digits or dashes, cannot use dash as the first two or last one characters, cannot contain consecutive dashes, and is limited between 2 and 60 characters in length.\n"
}