{
  "Id": "307",
  "Title": "\u0022Developing Azure AI Search Pipeline for Information Extraction\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe skillset is attached to an indexer. It uses built-in skills from Microsoft to find andextract information. Steps in the pipeline include Optical Character Recognition (OCR)on images, language detection, key phrase extraction, and entity recognition(organizations, locations, people). New information created by the pipeline is stored innew fields in an index.\r\nOnce the index is populated, you can use those fields in queries,facets, and filters.Postman appAzure StorageAzure AI SearchSet up a development environment.＂Define a pipeline that uses OCR, language detection, entity recognition, and keyphrase extraction.＂Execute the pipeline to invoke transformations, and to create and load a searchindex.\r\n＂Explore results using full text search and a rich query syntax.＂OverviewPrerequisitesSample dataThe sample data consists of 14 files of mixed content type that you\u0027ll upload to AzureBlob Storage in a later step.1. Get the files from azure-search-sample-data/ai-enrichment-mixed-media/ andcopy them to your local computer.2.\r\nNext, get the source code, a Postman collection file, for this tutorial. Source codecan be found at azure-search-postman-samples/tree/main/Tutorial.This tutorial uses Azure AI Search for indexing and queries, Azure AI services on thebackend for AI enrichment, and Azure Blob Storage to provide the data.\r\nThis tutorialstays under the free allocation of 20 transactions per indexer per day on Azure AIservices, so the only services you need to create are search and storage.If possible, create both in the same region and resource group for proximity andmanageability. In practice, your Azure Storage account can be in any region.1. Sign in to the Azure portal and select \u002B Create Resource. 2. Search for storage account and select Microsoft\u0027s Storage Account offering.７ NoteYou can use the free service for this tutorial. A free search service limits you to threeindexes, three indexers, and three data sources. This tutorial creates one of each.Before starting, make sure you have room on your service to accept the newresources.Download files1 - Create servicesStart with Azure Storage3. In the Basics tab, the following items are required. Accept the defaults foreverything else.Resource group. Select an existing one or create a new one, but use thesame group for all services so that you can manage them collectively.\n"
}