{
  "Id": "591",
  "Title": "\u0022Document and Element Limits in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAn element of a complex collection is defined asa member of that collection. For example, assume a Hotel document with a Rooms complexcollection, each room in the Rooms collection is considered an element. During indexing, theindexing engine can safely process a maximum of 3000 elements across the document as awhole. This limit was introduced in api-version=2019-05-06 and applies to complex collectionsonly, and not to string collections or to complex fields.You might find some variation in maximum limits if your service happens to be provisioned ona more powerful cluster. The limits here represent the common denominator.\r\nIndexes built tothe above specifications are portable across equivalent service tiers in any region.There are no longer any document limits per service in Azure AI Search, however, there\u0027s a limitof approximately 24 billion documents per index on Basic, S1, S2, S3, L1, and L2 search services.For S3 HD, the limit is 2 billion documents per index.\r\nEach element of a complex collectioncounts as a separate document in terms of these limits.The maximum document size when calling an Index API is approximately 16 megabytes.Document size is actually a limit on the size of the Index API request body. Since you can pass abatch of multiple documents to the Index API at once, the size limit realistically depends onhow many documents are in the batch. For a batch with a single document, the maximumdocument size is 16 MB of JSON.1123Document limitsDocument size limits per API callWhen estimating document size, remember to consider only those fields that can be consumedby a search service. Any binary or image data in source documents should be omitted fromyour calculations.When you index documents with vector fields, Azure AI Search constructs internal vectorindexes using the algorithm parameters you provide. The size of these vector indexes isrestricted by the memory reserved for vector search for your service\u0027s tier (or SKU).The service enforces a vector index size quota for every partition in your search service.\n"
}