{
  "Id": "1459",
  "Title": "\u0022Double Encryption with Customer-Managed Keys in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn both cases, keys and user inputs into skills are encrypted.When you introduce CMK encryption, you\u0027re encrypting content twice. For the objectsand fields noted in the previous section, content is first encrypted with your CMK, andsecondly with the Microsoft-managed key.\r\nContent is doubly encrypted on data disksfor long-term storage, and on temporary disks used for short-term storage.Enabling CMK encryption will increase index size and degrade query performance. Basedon observations to date, you can expect to see an increase of 30-60 percent in querytimes, although actual performance will vary depending on the index definition andtypes of queries.\r\nBecause of the negative performance impact, we recommend that youonly enable this feature on indexes that really require it.Although double encryption is now available in all regions, support was rolled out in twophases:The first rollout was on August 1, 2020 and included the five regions listed below.Search services created in the following regions supported CMK for data disks, butnot temporary disks:West US 2East USSouth Central USUS Gov VirginiaUS Gov ArizonaThe second rollout on May 13, 2021 added encryption for temporary disks andextended CMK encryption to all supported regions.\r\nIf you\u0027re using CMK from a service created during the first rollout and you alsowant CMK encryption over temporary disks, you\u0027ll need to create a new searchservice in your region of choice and redeploy your content.The following tools and services are used in this scenario.Azure Cognitive Search on a billable tier (Basic or above, in any region). Full double encryptionPrerequisitesAzure Key Vault, you can create key vault using Azure portal, Azure CLI, or AzurePowerShell. Create the resource in the same subscription as Azure CognitiveSearch. The key vault must have soft-delete and purge protection enabled.Azure Active Directory. If you don\u0027t have one, set up a new tenant.You should have a search client that can create the encrypted object.\n"
}