{
  "Id": "1215",
  "Title": "\u0022Dynamic HTML for Faceted Navigation in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfJavaScriptHTML for faceted navigation\u003Cdiv class=\u0022widget sidebar-widget jobs-filter-widget\u0022\u003E  \u003Ch5 class=\u0022widget-title\u0022\u003EFilter Results\u003C/h5\u003E    \u003Cp id=\u0022filterReset\u0022\u003E\u003C/p\u003E    \u003Cdiv class=\u0022widget-content\u0022\u003E      \u003Ch6 id=\u0022businessTitleFacetTitle\u0022\u003EBusiness Title\u003C/h6\u003E      \u003Cul class=\u0022filter-list\u0022 id=\u0022business_title_facets\u0022\u003E      \u003C/ul\u003E\r\n\u003Ch6\u003ELocation\u003C/h6\u003E      \u003Cul class=\u0022filter-list\u0022 id=\u0022posting_type_facets\u0022\u003E      \u003C/ul\u003E      \u003Ch6\u003EPosting Type\u003C/h6\u003E      \u003Cul class=\u0022filter-list\u0022 id=\u0022posting_type_facets\u0022\u003E\u003C/ul\u003E      \u003Ch6\u003EMinimum Salary\u003C/h6\u003E      \u003Cul class=\u0022filter-list\u0022 id=\u0022salary_range_facets\u0022\u003E      \u003C/ul\u003E  \u003C/div\u003E\u003C/div\u003EBuild HTML dynamicallyfunction UpdateBusinessTitleFacets(data)\r\n{  var facetResultsHTML = \u0027\u0027;\r\nfor (var i = 0; i \u003C data.\r\nlength; i\u002B\u002B) {    facetResultsHTML \u002B= \u0027\u003Cli\u003E\u003Ca href=\u0022javascript:void(0)\u0022 onclick=\u0022ChooseBusinessTitleFacet(\\\u0027\u0027 \u002B data[i].Value \u002B \u0027\\\u0027);\u0022\u003E\u0027 \u002B data[i].Value \u002B \u0027 (\u0027 \u002B data[i].Count \u002B \u0027)\u003C/span\u003E\u003C/a\u003E\u003C/li\u003E\u0027;  }This section is a collection of tips and workarounds that might be helpful.\r\nOne of the challenges of faceted navigation in Azure Cognitive Search is that facets existfor current results only. In practice, it\u0027s common to retain a static set of facets so that theuser can navigate in reverse, retracing steps to explore alternative paths through searchcontent. Although this is a common use case, it\u0027s not something the faceted navigation structurecurrently provides out-of-the-box. Developers who want static facets typically workaround the limitation by issuing two filtered queries: one scoped to the results, the otherused to create a static list of facets for navigation purposes.When you design the search results page, remember to add a mechanism for clearingfacets. If you add check boxes, you can easily see how to clear the filters. For otherlayouts, you might need a breadcrumb pattern or another creative approach. In thehotels C# sample, you can send an empty search to reset the page.\n"
}