{
  "Id": "1147",
  "Title": "\u0022Effective Query Strategies for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHere\u0027s a full text search query expression that works for the Hotels sampleindex:JSONThe following screenshot illustrates the query and response:Azure portal   {       \u0022search\u0022: \u0022pool spa \u002Bairport\u0022,       \u0022queryType\u0022: \u0022simple\u0022,       \u0022searchMode\u0022: \u0022any\u0022,       \u0022searchFields\u0022: \u0022Description, Tags\u0022,       \u0022select\u0022: \u0022HotelName, Description, Tags\u0022,       \u0022top\u0022: 10,       \u0022count\u0022: true   }If your query is full text search, a query parser is used to process any text that\u0027s passedas search terms and phrases.\r\nAzure AI Search offers two query parsers.The simple parser understands the simple query syntax. This parser was selected asthe default for its speed and effectiveness in free form text queries. The syntaxsupports common search operators (AND, OR, NOT) for term and phrase searches,and prefix (*) search (as in \u0022sea*\u0022 for Seattle and Seaside). A generalrecommendation is to try the simple parser first, and then move on to full parser ifapplication requirements call for more powerful queries.The full Lucene query syntax, enabled when you add queryType=full to therequest, is based on the Apache Lucene Parser.\r\nFull syntax and simple syntax overlap to the extent that both support the same prefixand boolean operations, but the full syntax provides more operators. In full, there aremore operators for boolean expressions, and more operators for advanced queries suchas fuzzy search, wildcard search, proximity search, and regular expressions.Search is fundamentally a user-driven exercise, where terms or phrases are collectedfrom a search box, or from click events on a page. The following table summarizes theChoose a query type: simple | fullChoose query methodsmechanisms by which you can collect user input, along with the expected searchexperience. InputExperienceSearch methodA user types the terms or phrases into a search box, with or without operators,and clicks Search to send the request. Search can be used with filters on thesame request, but not with autocomplete or suggestions.AutocompletemethodA user types a few characters, and queries are initiated after each new characteris typed.\n"
}