{
  "Id": "464",
  "Title": "\u0022Efficient Data Enrichment with Azure Search: Benefits and Limitations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027re new to enrichment, the ability to have these steps handled for you allowsyou to measure the value of a skill without having to invest much time and effort.Sampling is the process by which an index schema is inferred, and it has somelimitations. When the data source is created, the wizard picks a random sample ofdocuments to decide what columns are part of the data source.\r\nNot all files are read, asthis could potentially take hours for very large data sources. Given a selection ofdocuments, source metadata, such as field name or type, is used to create a fieldscollection in an index schema. Depending on the complexity of source data, you mightneed to edit the initial schema for accuracy, or extend it for completeness.\r\nYou can makeyour changes inline on the index definition page.Overall, the advantages of using the wizard are clear: as long as requirements are met,you can prototype a queryable index within minutes. Some of the complexities ofindexing, such as serializing data as JSON documents, are handled by the wizard.\r\nThe wizard isn\u0027t without limitations. Constraints are summarized as follows:Benefits and limitationsThe wizard doesn\u0027t support iteration or reuse. Each pass through the wizardcreates a new index, skillset, and indexer configuration. Only data sources can bepersisted and reused within the wizard. To edit or refine other objects, either deletethe objects and start over, or use the REST APIs or .\r\nNET SDK to modify thestructures.Source content must reside in a supported data source.Sampling is over a subset of source data. For large data sources, it\u0027s possible forthe wizard to miss fields. You might need to extend the schema, or correct theinferred data types, if sampling is insufficient. AI enrichment, as exposed in the portal, is limited to a subset of built-in skills.A knowledge store, which can be created by the wizard, is limited to a few defaultprojections and uses a default naming convention. If you want to customize namesor projections, you\u0027ll need to create the knowledge store through REST API or theSDKs.\n"
}