{
  "Id": "232",
  "Title": "\u0022Efficient Data Generation and Indexing in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfcs file to generate data for testing.The sole purpose of this class is to make it easy to generate a large number ofdocuments with a unique ID for indexing.To get a list of 100,000 hotels with unique IDs, you\u0027d run the following lines of code:C#There are two sizes of hotels available for testing in this sample: small and large.The schema of your index can have a significant impact on indexing speeds. Because ofthis impact, it makes sense to convert this class to generate data matching yourintended index schema after you run through this tutorial.\r\nAzure AI Search supports the following APIs to load single or multiple documents intoan index:Add, Update, or Delete Documents (REST API)IndexDocumentsAction class or IndexDocumentsBatch classprivate static async Task CreateIndexAsync(string indexName, SearchIndexClient indexClient){    // Create a new search index structure that matches the properties of the Hotel class.    // The Address class is referenced from the Hotel class.\r\nThe FieldBuilder    // will enumerate these to create a complex data structure for the index.    FieldBuilder builder = new FieldBuilder();    var definition = new SearchIndex(indexName, builder.Build(typeof(Hotel)));    await indexClient.CreateIndexAsync(definition);}Generating datalong numDocuments = 100000;DataGenerator dg = new DataGenerator();List\u003CHotel\u003E hotels = dg.\r\nGetHotels(numDocuments, \u0022large\u0022);4 - Test batch sizesIndexing documents in batches will significantly improve indexing performance. Thesebatches can be up to 1000 documents, or up to about 16 MB per batch.Determining the optimal batch size for your data is a key component of optimizingindexing speeds. The two primary factors influencing the optimal batch size are:The schema of your indexThe size of your dataBecause the optimal batch size is dependent on your index and your data, the bestapproach is to test different batch sizes to determine what results in the fastest indexingspeeds for your scenario.The following function demonstrates a simple approach to testing batch sizes.\n"
}