{
  "Id": "459",
  "Title": "\u0022Efficient Data Population in Azure AI Search: Push vs Pull\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis article describes the two basic workflows for populating an index: push yourdata into the index programmatically, or pull in the data using a search indexer.With either approach, the objective is to load data from an external data source.Although you can create an empty index, it\u0027s not queryable until you add the content.\r\nThe push model, used to programmatically send your data to Azure AI Search, is themost flexible approach for the following reasons:First, there are no restrictions on data source type. The dataset must be composedof JSON documents that map to your index schema, but the data can come fromanywhere.Second, there are no restrictions on frequency of execution.\r\nYou can push changesto an index as often as you like. For applications having low latency requirements(for example, if you need search operations to be in sync with dynamic inventorydatabases), the push model is your only option.Third, you can upload documents individually or in batches up to 1000 per batch,or 16 MB per batch, whichever limit comes first.\r\nFourth, connectivity and the secure retrieval of documents are fully under yourcontrol. In contrast, indexer connections are authenticated using the securityfeatures provided in Azure AI Search.You can use the following APIs to load single or multiple documents into an index:Add, Update, or Delete Documents (REST API)７ NoteIf AI enrichment is a solution requirement, you must use the pull model (indexers)to load an index.\r\nSkillsets are attached to an indexer and don\u0027t run independently.Pushing data to an indexHow to push data to an Azure AI Search indexIndexDocumentsAction class (Azure SDK for .NET) or IndexDocumentsBatch classThere is currently no tool support for pushing data via the portal. For an introduction to the push APIs, see:Quickstart: Full text search using the Azure SDKsC# Tutorial: Optimize indexing with the push APIREST Quickstart: Create an Azure AI Search index using PowerShellYou can control the type of indexing action on a per-document basis, specifyingwhether the document should be uploaded in full, merged with existing documentcontent, or deleted.\n"
}