{
  "Id": "441",
  "Title": "\u0022Efficient Semantic Ranking: Summarization and Scoring for Quick Results\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSemantic ranking is both resource and time intensive. In order to complete processingwithin the expected latency of a query operation, inputs to the semantic ranker areconsolidated and reduced so that the reranking step can be completed as quickly aspossible.How semantic ranking worksThere are two steps to semantic ranking: summarization and scoring.\r\nOutputs consist ofrescored results, captions, and answers.In semantic ranking, the query subsystem passes search results as an input tosummarization and ranking models. Because the ranking models have input sizeconstraints and are processing intensive, search results must be sized and structured(summarized) for efficient handling.1.\r\nSemantic ranking starts with a BM25-ranked result from a text query or an RRF-ranked result from a hybrid query. Only text fields are used in the rerankingexercise, and only the top 50 results progress to semantic ranking, even if resultsinclude more than 50. Typically, fields used in semantic ranking are informationaland descriptive.\r\n2. For each document in the search result, the summarization model accepts up to2,000 tokens, where a token is approximately 10 characters. Inputs are assembledfrom the \u0022title\u0022, \u0022keyword\u0022, and \u0022content\u0022 fields listed in the semanticconfiguration.3. Excessively long strings are trimmed to ensure the overall length meets the inputrequirements of the summarization step.\r\nThis trimming exercise is why it\u0027simportant to add fields to your semantic configuration in priority order. If you havevery large documents with text-heavy fields, anything after the maximum limit isignored.Semantic fieldToken limit\u0022title\u0022128 tokens\u0022keywords128 tokens\u0022content\u0022remaining tokens4. Summarization output is a summary string for each document, composed of themost relevant information from each field. Summary strings are sent to the rankerfor scoring, and to machine reading comprehension models for captions andanswers.The maximum length of each generated summary string passed to the semanticranker is 256 tokens.How inputs are collected and summarizedFrom each summary string, the machine reading comprehension models find passagesthat are the most representative.Outputs are:A semantic caption for the document. Each caption is available in a plain textversion and a highlight version, and is frequently fewer than 200 words perdocument.\n"
}