{
  "Id": "462",
  "Title": "\u0022Efficient Data Import and Indexing with Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe \u0022HotelId\u0022 is thedocument key of the hotels-sample-index. The filter provides the document ID of aspecific document:How to pull data into an Azure AI Search indexVerify data import with Search explorerHTTPIf you\u0027re using REST, this Look up query achieves the same purpose.\r\nIndexer overviewPortal quickstart: create, load, query an index$filter=HotelId eq \u002750\u0027See alsoImport data wizard in Azure AI SearchArticle•11/16/2023The Import data wizard in the Azure portal creates multiple objects used for indexingand AI enrichment on a search service. If you\u0027re new to Azure AI Search, it\u0027s one of themost powerful features at your disposal.\r\nWith minimal effort, you can create an indexingor enrichment pipeline that exercises most of the functionality of Azure AI Search.If you\u0027re using the wizard for proof-of-concept testing, this article explains the internalworkings of the wizard so that you can use it more effectively.This article isn\u0027t a step by step.\r\nFor help with using the wizard with built-in sample data,see the Quickstart: Create a search index or Quickstart: Create a text translation andentity skillset.In the Azure portal, open the search service page from the dashboard or find yourservice in the service list. In the service Overview page at the top, select Import data.\r\nThe wizard opens fully expanded in the browser window so that you have more room towork.You can also launch Import data from other Azure services, including Azure Cosmos DB,Azure SQL Database, SQL Managed Instance, and Azure Blob Storage. Look for AddAzure AI Search in the left-navigation pane on the service overview page. The wizard will output the objects in the following table. After the objects are created,you can review their JSON definitions in the portal or call them from code.ObjectDescriptionIndexerA configuration object specifying a data source, target index, an optional skillset,optional schedule, and optional configuration settings for error handing and base-64 encoding.\n"
}