{
  "Id": "724",
  "Title": "\u0022Efficient Index Management in Azure Cognitive Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSwitchtiersIn-place upgrades aren\u0027t supported. If you require more capacity, you must create anew service and rebuild your indexes from scratch. To help automate this process,you can use the index-backup-restore sample code in this Azure Cognitive Search.NET sample repo. This app will back up your index to a series of JSON files, andthen recreate the index in a search service you specify.Many other modifications can be made without impacting existing physical structures.Specifically, the following changes don\u0027t require an index rebuild. For these changes,you can update an existing index definition with your changes.\r\nAdd a new fieldSet the retrievable attribute on an existing fieldUpdate searchAnalyzer on a field having an existing indexAnalyzerAdd a new analyzer definition in an index (which can be applied to new fields)Add, update, or delete scoring profilesAdd, update, or delete CORS settingsAdd, update, or delete synonymMapsAdd, update, or delete semantic configurationsWhen you add a new field, existing indexed documents are given a null value for thenew field.\r\nOn a future data refresh, values from external source data replace the nullsadded by Azure Cognitive Search. For more information on updating index content, seeAdd, Update or Delete Documents.\r\nDuring development, the index schema changes frequently. You can plan for it bycreating indexes that can be deleted, recreated, and reloaded quickly with a smallrepresentative data set.For applications already in production, we recommend creating a new index that runsside by side an existing index to avoid query downtime. Your application code providesredirection to the new index.Modifications with no rebuild requirementHow to rebuild an index1. Determine whether a rebuild is required. If you\u0027re just adding fields, or changingsome part of the index that is unrelated to fields, you might be able to simplyupdate the definition without deleting, recreating, and fully reloading it.2.\n"
}