{
  "Id": "492",
  "Title": "\u0022Enabling Enrichment Caching for Azure Cognitive Search Indexer\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOptionally, enable enrichment caching in the indexer configuration. This stepallows you to reuse existing enrichments later on.5. Run queries to evaluate results or start a debug session to work through anyskillset issues.To repeat any of the above steps, reset the indexer before you run it. Or, delete andrecreate the objects on each run (recommended if you’re using the free tier).\r\nIf youAvailability and pricingChecklist: A typical workflowenabled caching the indexer pulls from the cache if data is unchanged at the source,and if your edits to the pipeline don\u0027t invalidate the cache.\r\nQuickstart: Create a skillset for AI enrichmentTutorial: Learn about the AI enrichment REST APIsSkillset conceptsKnowledge store conceptsCreate a skillsetCreate a knowledge storeNext stepsIncremental enrichment and caching inAzure Cognitive SearchArticle•04/21/2023Incremental enrichment refers to the use of cached enrichments during skillset executionso that only new and changed skills and documents incur AI processing. The cachecontains the output from document cracking, plus the outputs of each skill for everydocument.\r\nAlthough caching is billable (it uses Azure Storage), the overall cost ofenrichment is reduced because the costs of storage are less than image extraction andAI processing.When you enable caching, the indexer evaluates your updates to determine whetherexisting enrichments can be pulled from the cache. Image and text content from thedocument cracking phase, plus skill outputs that are upstream or orthogonal to youredits, are likely to be reusable.After performing the incremental enrichments as indicated by the skillset update,refreshed results are written back to the cache, and also to the search index orknowledge store. Physically, the cache is stored in a blob container in your Azure Storage account, one perindexer. Each indexer is assigned a unique and immutable cache identifier thatcorresponds to the container it is using.The cache is created when you specify the \u0022cache\u0022 property and run the indexer. Onlyenriched content can be cached.\n"
}