{
  "Id": "1303",
  "Title": "\u0022Enabling and Disabling Semantic Ranking in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCheck the Products Available by Region page on the Azure web site tosee if your region is listed.4. On the left-nav pane, select Semantic ranking.5. Select either the Free plan or the Standard plan. You can switch between thefree plan and the standard plan at any time.Enable semantic rankingAzure portalThe free plan is capped at 1,000 queries per month.\r\nAfter the first 1,000 queries inthe free plan, you\u0027ll receive an error message letting you know you\u0027ve exhaustedyour quota the next time you issue a semantic query. When this happens, you needto upgrade to the standard plan to continue using semantic ranking.To reverse feature enablement, or for full protection against accidental usage andcharges, you can disable semantic ranking using the Create or Update Service API onyour search service.\r\nAfter the feature is disabled, any requests that include the semanticquery type will be rejected.Management REST API calls are authenticated through Microsoft Entra ID. See Manageyour Azure AI Search service with REST APIs for instructions on how to authenticate.HTTPDisable semantic ranking using the REST APIPATCH https://management.azure.\r\ncom/subscriptions/{{subscriptionId}}/resourcegroups/{{resource-group}}/providers/Microsoft.Search/searchServices/{{search-service-name}}?api-version=2023-11-01    {      \u0022properties\u0022: {        \u0022semanticSearch\u0022: \u0022disabled\u0022      }    }To re-enable semantic ranking, rerun the above request, setting \u0022semanticSearch\u0022 toeither \u0022free\u0022 (default) or \u0022standard\u0022. Configure semantic ranking so that you can test out semantic ranking on your content.Next stepsConfigure semantic ranking and returncaptions in search resultsArticle•11/15/2023In this article, learn how to invoke a semantic ranking over a result set, promoting themost semantically relevant results to the top of the stack.\n"
}