{
  "Id": "624",
  "Title": "\u0022Enabling Availability Zone Support for Azure Cognitive Search Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfReview Case Study: Use Cognitive Search to Support Complex AI Scenarios formore configuration guidance.Next stepsMigrate Azure Cognitive Search toavailability zone supportArticle•02/24/2023This guide describes how to migrate Azure Cognitive Search from non-availability zonesupport to availability support.Azure Cognitive Search services can take advantage of availability support in regionsthat support availability zones. Services with two or more replicas in these regionscreated after availability support was enabled can automatically utilize availability zones.Each replica will be placed in a different availability zone within the region.\r\nIf you havemore replicas than availability zones, the replicas will be distributed across availabilityzones as evenly as possible.If a search service was created before availability zone support was enabled in its region,the search service must be recreated to take advantage of availability zone support.The following are the current requirements/limitations for enabling availability zonesupport:The search service must be in a region that supports availability zonesThe search service must be created after availability zone support was enabled inits region.The search service must have at least two replicasDowntime will be dependent on how you decide to carry out the migration.\r\nMigrationwill consist of a side-by-side deployment where you\u0027ll create a new search service.Downtime will depend on how you choose to redirect traffic from your old searchservice to your new availability zone enabled search service. For example, if you\u0027re usingAzure Front Door, downtime will be dependent on the time it takes to update AzureFront Door with your new search service\u0027s information.\r\nAlternatively, you can routetraffic to multiple search services at the same time using Azure Traffic Manager.PrerequisitesDowntime requirementsIf you created your search service in a region that supports availability zones before thissupport was enabled, you\u0027ll need to recreate the search service.1. Create a new search service in the same region as the old search service. Thisregion should support availability zones on or after the current date.2. Add at least two replicas to your new search service. Once the search service has atleast two replicas, it automatically takes advantage of availability zone support.3.\n"
}