{
  "Id": "1465",
  "Title": "\u0022Enforcing CMK Encryption Policy in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfEncryption is transparent to the user and developer.Azure policies help to enforce organizational standards and to assess compliance at-scale. Azure Cognitive Search has an optional built-in policy for service-wide CMKenforcement.In this section, you\u0027ll set the policy that defines a CMK standard for your search service.\r\nThen, you\u0027ll set up your search service to enforce this policy.1. Navigate to the built-in policy in your web browser. Select Assign2. Set up the policy scope. In the Parameters section, uncheck Only showparameters... and set Effect to Deny.During evaluation of the request, a request that matches a deny policy definition ismarked as non-compliant.\r\nAssuming the standard for your service is CMKencryption, \u0022deny\u0022 means that requests that don\u0027t specify CMK encryption are non-compliant.      \u0022applicationSecret\u0022: \u0022myApplicationSecret\u0022     }   } } ７ NoteNone of these key vault details are considered secret and could be easily retrievedby browsing to the relevant Azure Key Vault page in Azure portal.\r\n6 - Set up policy７ NotePolicy set up requires the preview Services - Create or Update API.3. Finish creating the policy.4. Call the Services - Create or Update API to enable CMK policy enforcement at theservice level.HTTPThis section shows the JSON for several objects so that you can see where to locate\u0022encryptionKey\u0022 in an object definition.The details of creating a new index via the REST API could be found at Create Index(REST API), where the only difference is specifying the encryption key details as part ofthe index definition:JSONPATCH https://management.azure. com/subscriptions/[subscriptionId]/resourceGroups/[resourceGroupName]/providers/Microsoft.Search/searchServices/[serviceName]?api-version=2021-04-01-preview {     \u0022properties\u0022: {         \u0022encryptionWithCmk\u0022: {             \u0022enforcement\u0022: \u0022Enabled\u0022,             \u0022encryptionComplianceStatus\u0022: \u0022Compliant\u0022         }     } } REST examplesIndex encryption{  \u0022name\u0022: \u0022hotels\u0022,  \u0022fields\u0022: [   {\u0022name\u0022: \u0022HotelId\u0022, \u0022type\u0022: \u0022Edm.\n"
}