{
  "Id": "983",
  "Title": "\u0022Enhancing Searchable Content with Azure AI Search Field Types\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCreate more fields to add more searchable content. See Create an index forguidance.SQL data typeAzure AI Search fieldtypesNotesbitEdm.Boolean,Edm.Stringint, smallint, tinyintEdm.Int32, Edm.Int64,Edm.StringbigintEdm.Int64, Edm.Stringreal, floatEdm.Double, Edm.Stringsmallmoney, moneydecimal numericEdm.\r\nStringAzure AI Search doesn\u0027t support convertingdecimal types into Edm.Double becausedoing so would lose precisionchar, nchar, varchar,nvarcharEdm.StringCollection(Edm.String)A SQL string can be used to populate aCollection(Edm.String) field if the stringrepresents a JSON array of strings: [\u0022red\u0022,\u0022white\u0022, \u0022blue\u0022]smalldatetime,datetime, datetime2,date, datetimeoffsetEdm.\r\nDateTimeOffset,Edm.StringuniqueidentiferEdm.StringgeographyEdm.GeographyPointOnly geography instances of type POINTwith SRID 4326 (which is the default) aresupported    }  ]}Mapping data typesSQL data typeAzure AI Search fieldtypesNotesrowversionNot applicableRow-version columns can\u0027t be stored in thesearch index, but they can be used forchange trackingtime, timespan, binary,varbinary, image, xml,geometry, CLR typesNot applicableNot supportedOnce the index and data source have been created, you\u0027re ready to create the indexer.\r\nIndexer configuration specifies the inputs, parameters, and properties controlling runtime behaviors.1.\r\nCreate or update an indexer by giving it a name and referencing the data sourceand target index:HTTPConfigure and run the Azure SQL indexerPOST https://[service name].search.windows.\r\nnet/indexers? api-version=2020-06-30Content-Type: application/jsonapi-key: [search service admin key]{    \u0022name\u0022 : \u0022[my-sqldb-indexer]\u0022,    \u0022dataSourceName\u0022 : \u0022[my-sqldb-ds]\u0022,    \u0022targetIndexName\u0022 : \u0022[my-search-index]\u0022,    \u0022disabled\u0022: null,    \u0022schedule\u0022: null,    \u0022parameters\u0022: {        \u0022batchSize\u0022: null,        \u0022maxFailedItems\u0022:\n"
}