{
  "Id": "427",
  "Title": "\u0022Enhancing Search Relevance and Boosting Scores in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfsearch.windows.net/indexes/hotels/docs/search?api-version=2020-06-30{    \u0022search\u0022: \u0022\u003Cquery string\u003E\u0022,    \u0022sessionId\u0022: \u0022\u003Cstring\u003E\u0022}７ NoteIn Azure Cognitive Search, you can configure BM25 algorithm parameters, and tunesearch relevance and boost search scores through these mechanisms:ApproachImplementationDescriptionScoringalgorithmconfigurationSearch indexScoring profilesSearch indexProvide criteria for boosting the search score of a matchbased on content characteristics. For example, you mightwant to boost matches based on their revenue potential,promote newer items, or perhaps boost items that havebeen in inventory too long.\r\nA scoring profile is part of theindex definition, composed of weighted fields, functions,and parameters. You can update an existing index withscoring profile changes, without incurring an index rebuild.SemanticrankingQuery requestApplies machine reading comprehension to search results,promoting more semantically relevant results to the top.featuresModeparameterQuery requestThis parameter is mostly used for unpacking a score, but itcan be used for in code that provides a custom scoringsolution.Search Documents requests have a new featuresMode parameter that can provide moredetail about relevance at the field level.\r\nWhereas the @searchScore is calculated for thedocument all-up (how relevant is this document in the context of this query), throughfeaturesMode you can get information about individual fields, as expressed in a@search.features structure. The structure contains all fields used in the query (eitherspecific fields through searchFields in a query, or all fields attributed as searchable in anindex). For each field, you get the following values:Number of unique tokens found in the fieldReusing the same sessionId values repeatedly can interfere with the loadbalancing of the requests across replicas and adversely affect the performance ofthe search service. The value used as sessionId cannot start with a \u0027_\u0027 character.Relevance tuningfeaturesMode parameter (preview)Similarity score, or a measure of how similar the content of the field is, relative tothe query termTerm frequency, or the number of times the query term was found in the fieldFor a query that targets the \u0022description\u0022 and \u0022title\u0022 fields, a response that includes@search.\n"
}