{
  "Id": "636",
  "Title": "\u0022Enhanced Indexing and Query Features for Azure Data Sources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfMySQL indexerIndexerdata sourceNew data source forindexer-based indexing ofAzure MySQL data sources.Sign up to enable thefeature. Use Create orUpdate Data Source(preview), 2020-06-30-Preview or later, .NET SDK11.2.1, and Azure portal.Azure Cosmos DB forMongoDB indexerIndexerdata sourceNew data source forindexer-based indexingSign up to enable thefeature.\r\nUse Create orFeature                        CategoryDescriptionAvailabilitythrough the MongoDB APIsin Azure Cosmos DB.Update Data Source(preview), 2020-06-30-Preview or later, or theAzure portal.Azure Cosmos DB forApache GremlinindexerIndexerdata sourceNew data source forindexer-based indexingthrough the ApacheGremlin APIs in AzureCosmos DB.\r\nSign up to enable thefeature. Use Create orUpdate Data Source(preview), 2020-06-30-Preview or later.Native blob soft deleteIndexerdata sourceApplies to the Azure BlobStorage indexer.Recognizes blobs that arein a soft-deleted state, andremoves the correspondingsearch document duringindexing.\r\nCreate or Update DataSource (preview), 2020-06-30-Preview or later.Reset DocumentsIndexerReprocesses individuallyselected search documentsin indexer workloads.Reset Documents(preview), 2020-06-30-Preview or later.spellerQueryOptional spelling correctionon query term inputs forsimple, full, and semanticqueries.\r\nSearch Documents(preview), 2020-06-30-Preview or later, andSearch Explorer (portal).NormalizersQueryNormalizers provide simpletext preprocessing:consistent casing, accentremoval, and ASCII folding,without invoking the fulltext analysis chain.Search Documents(preview), 2020-06-30-Preview or later. featuresModeparameterRelevance(scoring)Relevance score expansionto include details: per fieldsimilarity score, per fieldterm frequency, and perfield number of uniquetokens matched. You canconsume these data pointsin custom scoringsolutions.Search Documents(preview), 2019-05-06-Preview or later.Azure MachineLearning (AML) skillAIenrichment(skills)A new skill type tointegrate an inferencingendpoint from AzureMachine Learning.\n"
}