{
  "Id": "1290",
  "Title": "\u0022Enhancing Search Relevance with Scoring Profiles in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNotice that thisquery includes other parameters, such as scoringParameter. Query parameters, including\u0022scoringParameter\u0022, are described in Search Documents (REST API).See the Extended example to review a more detailed example of a scoring profile.\r\n},    \u0022functions\u0022: [      {          \u0022type\u0022: \u0022distance\u0022,        \u0022boost\u0022: 5,        \u0022fieldName\u0022: \u0022location\u0022,        \u0022interpolation\u0022: \u0022logarithmic\u0022,        \u0022distance\u0022: {          \u0022referencePointParameter\u0022: \u0022currentLocation\u0022,          \u0022boostingDistance\u0022: 10        }                              }                                          ]                       }            ]GET /indexes/hotels/docs?search\u002Binn\u0026scoringProfile=geo\u0026scoringParameter=currentLocation--122.\r\n123,44.77233\u0026api-version=2020-06-30POST /indexes/hotels/docs\u0026api-version=2020-06-30{    \u0022search\u0022: \u0022inn\u0022,    \u0022scoringProfile\u0022: \u0022geo\u0022,    \u0022scoringParameters\u0022: [\u0022currentLocation--122.123,44.77233\u0022]}Scores are computed for full text search queries. Matches are scored based on howrelevant the match is, and the highest scoring matches are returned in the queryresponse.\r\nThe overall score for each document is an aggregation of the individual scoresfor each field, where the individual score of each field is computed based on the termfrequency and document frequency of the searched terms within that field (known asTF-IDF or term frequency-inverse document frequency). You can use the featuresMode (preview) parameter to request extra scoring details withthe search results (including the field level scores).You should create one or more scoring profiles when the default ranking behaviordoesn’t go far enough in meeting your business objectives. For example, you mightdecide that search relevance should favor newly added items. Likewise, you might havea field that contains profit margin, or some other field indicating revenue potential.Boosting results that are more meaningful to your users or the business is often thedeciding factor in adoption of scoring profiles.\n"
}