{
  "Id": "408",
  "Title": "\u0022Enhancing Azure AI Search with Vector Fields and LLM Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAlthough most samples and demos include vector fields, it\u0027s not a requirement. Thequery is executed using the existing search engine in Azure AI Search, which can handlekeyword (or term) and vector queries. The index is created in advance, based on aschema you define, and loaded with your content that\u0027s sourced from files, databases, orstorage.\r\nThe LLM receives the original prompt, plus the results from Azure AI Search. The LLManalyzes the results and formulates a response. If the LLM is ChatGPT, the userinteraction might be a back and forth conversation. If you\u0027re using Davinci, the promptmight be a fully composed answer. An Azure solution most likely uses Azure OpenAI,but there\u0027s no hard dependency on this specific service.\r\nAzure AI Search doesn\u0027t provide native LLM integration, web frontends, or vectorencoding (embeddings) out of the box, so you need to write code that handles thoseparts of the solution. You can review demo source (Azure-Samples/azure-search-openai-demo) for a blueprint of what a full solution entails.\r\nIn Azure AI Search, all searchable content is stored in a search index that\u0027s hosted onyour search service. A search index is designed for fast queries with millisecondresponse times, so its internal data structures exist to support that objective. To thatend, a search index stores indexed content, and not whole content files like entire PDFsor images.\r\nInternally, the data structures include inverted indexes of tokenized text,vector indexes for embeddings, and unaltered text for cases where verbatim matching isrequired (for example, in filters, fuzzy search, regular expression queries).When you set up the data for your RAG solution, you use the features that create andload an index in Azure AI Search. An index includes fields that duplicate or representyour source content. An index field might be simple transference (a title or description ina source document becomes a title or description in a search index), or a field mightcontain the output of an external process, such as vectorization or skill processing thatgenerates a representation or text description of an image.\n"
}