{
  "Id": "1170",
  "Title": "\u0022Enhancing Search Experiences with Azure AI Search Features\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf8851871,    \u0022title\u0022: \u0022Azure AI Search\u0022,    \u0022content\u0022: \u0022Azure AI Search is a fully managed search-as-a-service that enables you to build rich search experiences for your applications. It provides features like full-text search, faceted navigation, and filters. Azure AI Search supports various data sources, such as Azure SQL Database, Azure Blob Storage, and Azure Cosmos DB.\r\nYou can use Azure AI Search to index your data, create custom scoring profiles, and integrate with other Azure services. It also integrates with other Azure services, such as Azure Cognitive Services and Azure Machine Learning.\u0022,Hybrid Search: Combined keyword and vector search results using Reciprocal RankFusion.\r\nJSONAs a next step, we recommend reviewing the demo code for Python, C# orJavaScript.    \u0022category\u0022: \u0022AI \u002B Machine Learning\u0022},{    \u0022@search.score\u0022: 0.03333333507180214,    \u0022title\u0022: \u0022Azure AI Search\u0022,    \u0022content\u0022: \u0022Azure AI Search is a fully managed search-as-a-service that enables you to build rich search experiences for your applications.\r\nIt provides features like full-text search, faceted navigation, and filters. Azure AI Search supports various data sources, such as Azure SQL Database, Azure Blob Storage, and Azure Cosmos DB. You can use Azure AI Search to index your data, create custom scoring profiles, and integrate with other Azure services.\r\nIt also integrates with other Azure services, such as Azure Cognitive Services and Azure Machine Learning.\u0022,    \u0022category\u0022: \u0022AI \u002B Machine Learning\u0022},Next stepsHow to add autocomplete and searchsuggestions in client appsArticle•10/03/2023Search-as-you-type is a common technique for improving query productivity. In AzureCognitive Search, this experience is supported through autocomplete, which finishes aterm or phrase based on partial input (completing \u0022micro\u0022 with \u0022microsoft\u0022). A seconduser experience is suggestions, or a short list of matching documents (returning booktitles with an ID so that you can link to a detail page about that book). Bothautocomplete and suggestions are predicated on a match in the index.\n"
}