{
  "Id": "440",
  "Title": "\u0022Enhancing Search Experience with Semantic Ranking: Features and Functionality\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSecond, it extracts and returns captions and answers in the response, which youcan render on a search page to improve the user\u0027s search experience.Here are the features of semantic ranking.FeatureDescriptionSemanticrankingUses the context or semantic meaning of a query to compute a new relevancescore over preranked results.Check regional availability.＂Enable semantic ranking on your search service.＂Create or modify queries to return semantic captions and highlights.＂Add a few more query properties to also return semantic answers.＂７ NoteLooking for vector support and similarity search? See Vector search in Azure AISearch for details.\r\nWhat is semantic ranking?FeatureDescriptionSemanticcaptions andhighlightsExtracts verbatim sentences and phrases from a document that best summarizethe content, with highlights over key passages for easy scanning. Captions thatsummarize a result are useful when individual content fields are too dense for thesearch results page.\r\nHighlighted text elevates the most relevant terms andphrases so that users can quickly determine why a match was consideredrelevant.SemanticanswersAn optional and extra substructure returned from a semantic query. It provides adirect answer to a query that looks like a question. It requires that a documenthas text with the characteristics of an answer.\r\nSemantic ranking looks for context and relatedness among terms, elevating matchesthat make more sense for the query.The following illustration explains the concept. Consider the term \u0022capital\u0022. It hasdifferent meanings depending on whether the context is finance, law, geography, orgrammar. Through language understanding, the semantic ranker can detect context andpromote results that fit query intent. Semantic ranking is both resource and time intensive. In order to complete processingwithin the expected latency of a query operation, inputs to the semantic ranker areconsolidated and reduced so that the reranking step can be completed as quickly aspossible.How semantic ranking worksThere are two steps to semantic ranking: summarization and scoring.\nOutputs consist ofrescored results, captions, and answers.In semantic ranking, the query subsystem passes search results as an input tosummarization and ranking models. Because the ranking models have input sizeconstraints and are processing intensive, search results must be sized and structured(summarized) for efficient handling.1.\n"
}