{
  "Id": "1715",
  "Title": "\u0022Enhancing Data Privacy with Azure Cognitive Services Text PIIDetectionSkill\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis skill uses the detection models provided in AzureCognitive Services for Language.Microsoft.Skills.Text.PIIDetectionSkillThe maximum size of a record should be 50,000 characters as measured byString.Length. If you need to chunk your data before sending it to the skill, considerusing the Text Split skill.\r\nIf you do use a text split skill, set the page length to 5000 forthe best performance.Parameters are case-sensitive and all are optional.Parameter nameDescriptiondefaultLanguageCode(Optional) The language code to apply to documents that don\u0027t specifylanguage explicitly. If the default language code is not specified, English(en) will be used as the default language code.\r\nSee the full list of supported languages.minimumPrecisionA value between 0.0 and 1.0. If the confidence score (in the piiEntitiesoutput) is lower than the set minimumPrecision value, the entity is notreturned or masked. The default is 0.0.７ NoteThis skill is bound to Cognitive Services and requires a billable resource fortransactions that exceed 20 documents per indexer per day.\r\nExecution of built-inskills is charged at the existing Cognitive Services pay-as-you go price.@odata.typeData limitsSkill parametersParameter nameDescriptionmaskingModeA parameter that provides various ways to mask the personal informationdetected in the input text.\r\nThe following options are supported:\u0022none\u0022 (default): No masking occurs and the maskedText output willnot be returned.\u0022replace\u0022: Replaces the detected entities with the character givenin the maskingCharacter parameter. The character will be repeatedto the length of the detected entity so that the offsets will correctlycorrespond to both the input text and the output maskedText. When this skill was in public preview, the maskingMode option redact wasalso supported, which allowed removing the detected entities entirelywithout replacement. The redact option has since been deprecated andare longer be supported.maskingCharacterThe character used to mask the text if the maskingMode parameter is set toreplace.\nThe following option is supported: * (default). This parametercan only be null if maskingMode is not set to replace.  When this skill was in public preview, there was support for themaskingCharacter options, X and #. Both X and # options have sincebeen deprecated and are longer be supported.\n"
}