{
  "Id": "1291",
  "Title": "\u0022Enhancing Search Relevance with Azure Scoring Profiles: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can use the featuresMode (preview) parameter to request extra scoring details withthe search results (including the field level scores).You should create one or more scoring profiles when the default ranking behaviordoesn’t go far enough in meeting your business objectives. For example, you mightdecide that search relevance should favor newly added items. Likewise, you might havea field that contains profit margin, or some other field indicating revenue potential.Boosting results that are more meaningful to your users or the business is often thedeciding factor in adoption of scoring profiles.\r\nRelevancy-based ordering in a search page is also implemented through scoringprofiles. Consider search results pages you’ve used in the past that let you sort by price,date, rating, or relevance. In Azure AI Search, scoring profiles can be used to drive the‘relevance’ option.\r\nThe definition of relevance is user-defined, predicated on businessobjectives and the type of search experience you want to deliver.To implement custom scoring behavior, add a scoring profile to the schema that definesthe index. You can have up to 100 scoring profiles within an index (see Service Limits),but you can only specify one profile at time in any given query.1. Start with an index definition.\r\nYou can add and update scoring profiles on anexisting index without having to rebuild it. Use an Update Index request to postyour revision.2. Paste in the Template provided in this article.3. Provide a name. Scoring profiles are optional, but if you add one, the name isrequired. Be sure to follow Azure AI Search naming conventions for fields (startswith a letter, avoids special characters and reserved words). How scores are computedWhen to add scoring logicSteps for adding a scoring profile4. Specify boosting criteria. A single profile can contain weighted fields, functions, orboth.You should work iteratively, using a data set that will help you prove or disprove theefficacy of a given profile.\nScoring profiles can be defined in Azure portal as shown in the following screenshot, orprogrammatically through REST APIs or in Azure SDKs, such as the ScoringProfile classin the Azure SDK for .NET.Use weighted fields when field context is important and queries are full text search.\n"
}