{
  "Id": "17",
  "Title": "\u0022Enhancing Azure AI Search: Features and Security Protocols Explained\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSynonyms associates equivalent terms that implicitly expand thescope of a query, without the user having to provide the alternateterms.Hit highlighting applies text formatting to a matching keyword insearch results. You can choose which fields return highlightedsnippets.Sorting is offered for multiple fields via the index schema and thentoggled at query-time with a single search parameter.Paging and throttling your search results is straightforward with thefinely tuned control that Azure AI Search offers over your searchresults.Category                           FeaturesData encryptionMicrosoft-managed encryption-at-rest is built into the internalstorage layer and is irrevocable.\r\nCustomer-managed encryption keys that you create and manage inAzure Key Vault can be used for supplemental encryption of indexesSecurity featuresCategory                           Featuresand synonym maps. For services created after August 1 2020, CMKencryption extends to data on temporary disks, for full doubleencryption of indexed content.Endpoint protectionIP rules for inbound firewall support allows you to set up IP rangesover which the search service will accept requests.Create a private endpoint using Azure Private Link to force allrequests through a virtual network.\r\nInbound accessAzure role-based access control assigns roles to users and groupsin Microsoft Entra ID for controlled access to search content andoperations. You can also use key-based authentication if you don\u0027thave an Azure tenant.Outbound security(indexers)Data access through private endpoints allows an indexer toconnect to Azure resources that are protected through Azure PrivateLink.Data access using a trusted identity means that connection stringsto external data sources can omit user names and passwords. Whenan indexer connects to the data source, the resource allows theconnection if the search service was previously registered as atrusted service. Category                           FeaturesTools for prototyping andinspectionAdd index is an index designer in the portal that you can use tocreate a basic schema consisting of attributed fields and a fewother settings. After saving the index, you can populate it using anSDK or the REST API to provide the data.\n"
}