{
  "Id": "516",
  "Title": "\u0022Enhancing and Debugging Skills in the Azure Search Interface\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe SkillGraph is where you will select which skill to debug or enhance. The details pane to theright is where you edit and explore.When you select an object in the Skill Graph, the adjacent pane provides interactivework areas in a tabbed layout. An illustration of the details pane can be found in theprevious screenshot.\r\nSkill details include the following areas:Skill Settings shows a formatted version of the skill definition.Skill JSON Editor shows the raw JSON document of the definition.AI Enrichments tab \u003E Skill GraphSkill details paneExecutions shows the data corresponding to each time a skill was executed.Errors and warnings shows the messages generated upon session start or refresh.\r\nOn Executions or Skill Settings, select the \u003C/\u003E symbol to open the Expression Evaluatorused for viewing and editing the expressions of the skills inputs and outputs.Nested input controls in Skill Settings can be used to build complex shapes forprojections, output field mappings for a complex type field, or an input to a skill.\r\nWhenused with the Expression Evaluator, nested inputs provide an easy test and validateexpression builder.A skill can execute multiple times in a skillset for a single document. For example, theOCR skill will execute once for each image extracted from a single document. TheExecutions pane displays the skill\u0027s execution history providing a deeper look into eachinvocation of the skill.\r\nThe execution history enables tracking a specific enrichment back to the skill thatgenerated it. Clicking on a skill input navigates to the skill that generated that input,providing a stack-trace like feature. This allows identification of the root cause of aproblem that might manifest in a downstream skill. When you debug an error with a custom skill, there is the option to generate a requestfor a skill invocation in the execution history.The Enriched Data Structure pane shows the document\u0027s enrichments through theskillset, detailing the context for each enrichment and the originating skill. TheExpression Evaluator can also be used to view the contents for each enrichment.Executions paneAI Enrichments tab \u003E Enriched Data StructureExpression Evaluator gives a quick peek into the value of any path. It allows for editingthe path and testing the results before updating any of the inputs or context for a skillor projection.\n"
}