{
  "Id": "637",
  "Title": "\u0022Enhancements and Innovations in Azure Search and AI Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdffeaturesModeparameterRelevance(scoring)Relevance score expansionto include details: per fieldsimilarity score, per fieldterm frequency, and perfield number of uniquetokens matched. You canconsume these data pointsin custom scoringsolutions.Search Documents(preview), 2019-05-06-Preview or later.Azure MachineLearning (AML) skillAIenrichment(skills)A new skill type tointegrate an inferencingendpoint from AzureMachine Learning.\r\nCreate or Update Skillset(preview), 2019-05-06-Preview or later. Alsoavailable in the portal, inskillset design, assumingFeature                        CategoryDescriptionAvailabilityAzure AI Search andAzure Machine Learningservices are deployed inthe same subscription.\r\nIncrementalenrichmentAIenrichment(skills)Adds caching to anenrichment pipeline,allowing you to reuseexisting output if a targetedmodification, such as anupdate to a skillset oranother object, doesn\u0027tchange the content.Caching applies only toenriched documentsproduced by a skillset.Create or Update Indexer(preview), API versions2021-04-30-Preview,2020-06-30-Preview, or2019-05-06-Preview.\r\nmoreLikeThisQueryFinds documents that arerelevant to a specificdocument. This feature hasbeen in earlier previews.Search Documents(preview) calls, in allsupported API versions:2023-10-10-Preview,2023-07-01-Preview,2021-04-30-Preview,2020-06-30-Preview,2019-05-06-Preview,2016-09-01-Preview,2017-11-11-Preview. Experimental features are available through the preview REST API first, followed byAzure portal, and then the Azure SDKs.The following statements apply to preview features:Preview features are available under Supplemental Terms of Use, without aservice level agreement.Preview features might undergo breaking changes if a redesign is required.\nSometimes preview features don\u0027t make it into a GA release.Each Azure SDK team releases beta packages on their own timeline. Check the changelog for mentions of new features in beta packages:Using preview featuresPreview feature support in Azure SDKsChange log for Azure SDK for .\n"
}