{
  "Id": "1279",
  "Title": "\u0022Enhancing Search with Fuzzy Query Expansion in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfExpanding search to cover near-matches has the effect ofautocorrecting a typo when the discrepancy is just a few misplaced characters.It\u0027s a query expansion exercise that produces a match on terms having a similarcomposition. When a fuzzy search is specified, the search engine builds a graph (basedon deterministic finite automaton theory) of similarly composed terms, for all wholeterms in the query.\r\nFor example, if your query includes three terms \u0022university ofwashington\u0022, a graph is created for every term in the query search=university~ of~washington~ (there\u0027s no stop-word removal in fuzzy search, so \u0022of\u0022 gets a graph).\r\nThe graph consists of up to 50 expansions, or permutations, of each term, capturingboth correct and incorrect variants in the process. The engine then returns the topmostrelevant matches in the response.For a term like \u0022university\u0022, the graph might have \u0022unversty, universty, university,universe, inverse\u0022. Any documents that match on those in the graph are included inresults.\r\nIn contrast with other queries that analyze the text to handle different forms ofthe same word (\u0022mice\u0022 and \u0022mouse\u0022), the comparisons in a fuzzy query are taken at facevalue without any linguistic analysis on the text. \u0022Universe\u0022 and \u0022inverse\u0022, which aresemantically different, will match because the syntactic discrepancies are small.\r\nA match succeeds if the discrepancies are limited to two or fewer edits, where an edit isan inserted, deleted, substituted, or transposed character. The string correctionalgorithm that specifies the differential is the Damerau-Levenshtein distance metric. It\u0027s described as the \u0022minimum number of operations (insertions, deletions,substitutions, or transpositions of two adjacent characters) required to change one wordinto the other\u0022.In Azure Cognitive Search:Fuzzy query applies to whole terms. Phrases aren\u0027t supported directly but you canspecify a fuzzy match on each term of a multi-part phrase through ANDWhat is fuzzy search?constructions.\n"
}