{
  "Id": "396",
  "Title": "\u0022Enhancing Search Capabilities with Azure AI Vector Database Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOptionally, add semantic ranking for even more accuracy with L2 reranking usingthe same language models that power Bing.Filtered vector search. A query request can include a vector query and a filterexpression. Filters apply to text and numeric fields, and are useful for metadatafilters, and including or excluding search documents based on filter criteria.\r\nAlthough a vector field isn\u0027t filterable itself, you can set up a filterable text ornumeric field. The search engine can process the filter before or after the vectorquery executes.Vector database. Use Azure AI Search as a vector store to serve as long-termmemory or an external knowledge base for Large Language Models (LLMs), orother applications.\r\nFor example, you can use Azure AI Search as a vector index inan Azure Machine Learning prompt flow for Retrieval Augmented Generation(RAG) applications.You can use other Azure services to provide embeddings and data storage.Azure OpenAI provides embedding models. Demos and samples target the text-embedding-ada-002 and other models.\r\nWe recommend Azure OpenAI forgenerating embeddings for text.What scenarios can vector search support?Azure integration and related servicesImage Retrieval Vectorize Image API(Preview) supports vectorization of imagecontent. We recommend this API for generating embeddings for images.Azure AI Search can automatically index vector data from two data sources: Azureblob indexers and Azure Cosmos DB for NoSQL indexers.\r\nFor more information,see Add vector fields to a search index.LangChain is a framework for developing applications powered by languagemodels. Use the Azure AI Search vector store integration to simplify the creationof applications using LLMs with Azure AI Search as your vector datastore. Semantic kernel is a lightweight SDK enabling integration of AI Large LanguageModels (LLMs) with conventional programming languages. It\u0027s useful for chunkinglarge documents in a larger workflow that sends inputs to embedding models.If you\u0027re new to vectors, this section explains some core concepts.Vector search is a method of information retrieval where documents and queries arerepresented as vectors instead of plain text. In vector search, machine learning modelsgenerate the vector representations of source inputs, which can be text, images, audio,or video content. Having a mathematic representation of content provides a commonbasis for search scenarios.\n"
}