{
  "Id": "1500",
  "Title": "\u0022Enhancing Search Capabilities with Semantic and Vector Search in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfsearch.windows.net\u0022,      \u0022indexname\u0022: \u0022nycjobs\u0022    }}{    \u0022SearchClient\u0022: {      \u0022credential\u0022: { \u0022key\u0022: \u0022\u003Cyou resource key\u003E\u0022 }    }}SEARCH__CREDENTIAL__KEY=\u0022...\u0022Key conceptsCreate, delete, update, or configure a search indexDeclare custom synonym maps to expand or rewrite queriesSearchIndexerClient allows you to:Create indexers to automatically crawl data sourcesDefine AI powered Skillsets to transform and enrich your dataAzure Cognitive Search provides two powerful features:Semantic search enhances the quality of search results for text-based queries.\r\nByenabling Semantic Search on your search service, you can improve the relevance ofsearch results in two ways:It applies secondary ranking to the initial result set, promoting the mostsemantically relevant results to the top.It extracts and returns captions and answers in the response, which can bedisplayed on a search page to enhance the user\u0027s search experience.To learn more about Semantic Search, you can refer to the sample.Additionally, for more comprehensive information about Semantic Search, including itsconcepts and usage, you can refer to the documentation. The documentation providesin-depth explanations and guidance on leveraging the power of Semantic Search inAzure Cognitive Search.\r\nVector Search is an information retrieval technique that overcomes the limitations oftraditional keyword-based search. Instead of relying solely on lexical analysis andmatching individual query terms, Vector Search utilizes machine learning models tocapture the contextual meaning of words and phrases. It represents documents andqueries as vectors in a high-dimensional space called an embedding. By understandingthe intent behind the query, Vector Search can deliver more relevant results that alignwith the user\u0027s requirements, even if the exact terms are not present in the document.Moreover, Vector Search can be applied to various types of content, including imagesand videos, not just text. To learn how to index vector fields and perform vector search, you can refer to thesample. This sample provides detailed guidance on indexing vector fields anddemonstrates how to perform vector search.Semantic SearchVector SearchAdditionally, for more comprehensive information about Vector Search, including itsconcepts and usage, you can refer to the documentation. The documentation providesin-depth explanations and guidance on leveraging the power of Vector Search in AzureCognitive Search.The Azure.Search.Documents client library (v11) is a brand new offering for .NETdevelopers who want to use search technology in their applications.\n"
}