{
  "Id": "436",
  "Title": "\u0022Enhancing Search Results with Reciprocal Rank Fusion (RRF)\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfExamples of scenarios where RRFis always used include hybrid search and multiple vector queries executing concurrently.RRF is based on the concept of reciprocal rank, which is the inverse of the rank of thefirst relevant document in a list of search results. The goal of the technique is to takeinto account the position of the items in the original rankings, and give higherimportance to items that are ranked higher in multiple lists. This can help improve theoverall quality and reliability of the final ranking, making it more useful for the task offusing multiple ordered search results.\r\nRRF works by taking the search results from multiple methods, assigning a reciprocalrank score to each document in the results, and then combining the scores to create anew ranking. The concept is that documents appearing in the top positions acrossmultiple search methods are likely to be more relevant and should be ranked higher inthe combined result.\r\nHere\u0027s a simple explanation of the RRF process:1. Obtain ranked search results from multiple queries executing in parallel.2. Assign reciprocal rank scores for result in each of the ranked lists. RRF generates anew @search.score for each match in each result set. For each document in thesearch results, the engine assigns a reciprocal rank score based on its position inthe list.\r\nThe score is calculated as 1/(rank \u002B k), where rank is the position of thedocument in the list, and k is a constant, which was experimentally observed toperform best if it\u0027s set to a small value like 60. Note that this k value is a constantin the RRF algorithm and entirely separate from the k that controls the numberof nearest neighbors. How RRF ranking works3. Combine scores. For each document, the engine sums the reciprocal rank scoresobtained from each search system, producing a combined score for eachdocument. 4. The engine ranks documents based on combined scores and sorts them. Theresulting list is the fused ranking.\nOnly fields marked as searchable in the index, or searchFields in the query, are usedfor scoring. Only fields marked as retrievable, or fields specified in select in the query,are returned in search results, along with their search score.RRF is used anytime there\u0027s more than one query execution.\n"
}