{
  "Id": "2",
  "Title": "\u0022Enhancing Search Capabilities with Azure AI Search Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA search engine for full text and vector search over a search indexRich indexing, with integrated data chunking and vectorization (preview), lexicalanalysis for text, and optional AI enrichment for content extraction andtransformationRich query syntax for vector queries, text search, hybrid search, fuzzy search,autocomplete, geo-search and othersAzure scale, security, and reachAzure integration at the data layer, machine learning layer, Azure AI services andAzure OpenAIArchitecturally, a search service sits between the external data stores that contain yourun-indexed data, and your client app that sends query requests to a search index andhandles the response.\r\nAzure AI SearchIn your client app, the search experience is defined using APIs from Azure AI Search, andcan include relevance tuning, semantic ranking, autocomplete, synonym matching, fuzzymatching, pattern matching, filter, and sort.\r\nAcross the Azure platform, Azure AI Search can integrate with other Azure services inthe form of indexers that automate data ingestion/retrieval from Azure data sources,and skillsets that incorporate consumable AI from Azure AI services, such as image andCreate a search servicenatural language processing, or custom AI that you create in Azure Machine Learning orwrap inside Azure Functions.\r\nOn the search service itself, the two primary workloads are indexing and querying.Indexing is an intake process that loads content into your search service andmakes it searchable. Internally, inbound text is processed into tokens and stored ininverted indexes, and inbound vectors are stored in vector indexes. The documentformat that Azure AI Search can index is JSON. You can upload JSON documentsthat you\u0027ve assembled, or use an indexer to retrieve and serialize your data intoJSON.AI enrichment through cognitive skills is an extension of indexing. If you haveimages or large unstructured text in source document, you can attach skills thatperform OCR, describe images, infer structure, translate text and more.\n"
}