{
  "Id": "1053",
  "Title": "\u0022Enhancing Image Processing with Azure Cognitive Search: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf the image was not from a PDF, this field will be 0.Sample value of normalized_images:JSONThis section supplements the skill reference articles by providing context for workingwith skill inputs, outputs, and patterns, as they relate to image processing.1. Create or update a skillset to add skills.2. Add templates for OCR and Image Analysis from the portal, or copy the definitionsfrom the skill reference documentation. Insert them into the skills array of yourskillset definition.3. If necessary, include multi-service key in the Cognitive Services property of theskillset.\r\nCognitive Search makes calls to a billable Azure Cognitive Services resourcefor OCR and image analysis for transactions that exceed the free limit (20 per[   {     \u0022data\u0022: \u0022BASE64 ENCODED STRING OF A JPEG IMAGE\u0022,     \u0022width\u0022: 500,     \u0022height\u0022: 300,     \u0022originalWidth\u0022: 5000,       \u0022originalHeight\u0022: 3000,     \u0022rotationFromOriginal\u0022: 90,     \u0022contentOffset\u0022: 500,     \u0022pageNumber\u0022: 2   } ] Define skillsets for image processingindexer per day).\r\nCognitive Services must be in the same region as your searchservice.4. If original images are embedded in PDF or application files like PPTX or DOCX,you\u0027ll need to add a Text Merge skill if you want image output and text outputtogether. Working with embedded images is discussed further on in this article.Once the basic framework of your skillset is created and Cognitive Services isconfigured, you can focus on each individual image skill, defining inputs and sourcecontext, and mapping outputs to fields in either an index or knowledge store.As noted, images are extracted during document cracking and then normalized as apreliminary step. The normalized images are the inputs to any image processing skill,and are always represented in an enriched document tree in either one of two ways:\u0022/document/normalized_images/*\u0022 is for documents that are processed whole.\n"
}