{
  "Id": "1054",
  "Title": "\u0022Enhancing Cognitive Services with Image Processing and OCR Skills\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWorking with embedded images is discussed further on in this article.Once the basic framework of your skillset is created and Cognitive Services isconfigured, you can focus on each individual image skill, defining inputs and sourcecontext, and mapping outputs to fields in either an index or knowledge store.As noted, images are extracted during document cracking and then normalized as apreliminary step. The normalized images are the inputs to any image processing skill,and are always represented in an enriched document tree in either one of two ways:\u0022/document/normalized_images/*\u0022 is for documents that are processed whole.\r\n\u0022/document/normalized_images/*/pages\u0022 is for documents that are processed inchunks (pages).Whether you\u0027re using OCR and image analysis in the same, inputs have virtually thesame construction:JSON７ NoteSee REST Tutorial: Use REST and AI to generate searchable content from Azureblobs for an example skillset that combines image processing with downstreamnatural language processing. It shows how to feed skill imaging output into entityrecognition and key phrase extraction.About inputs for image processing    {       \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Vision.\r\nOcrSkill\u0022,       \u0022context\u0022: \u0022/document/normalized_images/*\u0022,       \u0022detectOrientation\u0022: true,       \u0022inputs\u0022: [         {           \u0022name\u0022: \u0022image\u0022,           \u0022source\u0022: \u0022/document/normalized_images/*\u0022         }       ],       \u0022outputs\u0022: [ ] Cognitive Search is a full text search and knowledge mining solution, so Image Analysisand OCR skill output is always text. Output text is represented as nodes in an internalenriched document tree, and each node must be mapped to fields in a search index orprojections in a knowledge store to make the content available in your app.1. In the skillset, review the \u0022outputs\u0022 section of each skill to determine which nodesexist in the enriched document:JSON2. Create or update a search index to add fields to accept the skill outputs.\n"
}