{
  "Id": "1358",
  "Title": "\u0022Enhancing Search Performance with Power BI Analytics Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfvar properties = new Dictionary \u003Cstring, string\u003E  {     {\u0022SearchServiceName\u0022, \u003Cservice name\u003E},     {\u0022SearchId\u0022, \u003Csearch id\u003E},     {\u0022ClickedDocId\u0022, \u003Cclicked document id\u003E},     {\u0022Rank\u0022, \u003Cclicked document position\u003E} }; _telemetryClient.TrackEvent(\u0022Click\u0022, properties); appInsights.\r\ntrackEvent(\u0022Click\u0022, {     SearchServiceName: \u003Cservice name\u003E,     SearchId: \u003Csearch id\u003E,     ClickedDocId: \u003Cclicked document id\u003E,     Rank: \u003Cclicked document position\u003E }); After you have instrumented your app and verified your application is correctlyconnected to Application Insights, you download a predefined report template toanalyze data in Power BI desktop.\r\nThe report contains predefined charts and tablesuseful for analyzing the additional data captured for search traffic analytics.1. In the Azure Cognitive Search dashboard left-navigation pane, under Settings, clickSearch traffic analytics.2. On the Search traffic analytics page, in step 3, click Get Power BI Desktop toinstall Power BI.3.\r\nOn the same page, click Download Power BI report.4. The report opens in Power BI Desktop, and you are prompted to connect toApplication Insights and provide credentials. You can find connection informationin the Azure portal pages for your Application Insights resource. For credentials,provide the same user name and password that you use for portal sign-in.5. Click Load.\r\nThe report contains charts and tables that help you make more informed decisions toimprove your search performance and relevance.3 - Analyze in Power BIMetrics included the following items:Search volume and most popular term-document pairs: terms that result in thesame document clicked, ordered by clicks. Searches without clicks: terms for top queries that register no clicksThe following screenshot shows what a built-in report might look like if you have usedall of the schema elements.Instrument your search application to get powerful and insightful data about yoursearch service.Next stepsYou can find more information on Application Insights and visit the pricing page tolearn more about their different service tiers.\n"
}