{
  "Id": "1059",
  "Title": "\u0022Enhancing Search with Cognitive Services and Azure Image Analysis\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfscore\u0022: 1,         \u0022metadata_storage_name\u0022: \u0022Cognitive Services and Content Intelligence.pptx\u0022,         \u0022text\u0022: [             \u0022\u0022,             \u0022Microsoft\u0022,             \u0022\u0022,             \u0022\u0022,             \u0022\u0022, \u0022layoutText\u0022 stores OCR-generated information about text location on the page,described in terms of bounding boxes and coordinates of the normalized image.\r\nThis node should be mapped to field of type Collection(Edm.String). There is one\u0022layoutText\u0022 field per search document consisting of comma-delimited strings.\u0022merged_content\u0022 stores the output of a Text Merge skill, and it should be onelarge field of type Edm.String that contains raw text from the source document,with embedded \u0022text\u0022 in place of an image.\r\nIf files are text-only, then OCR andimage analysis have nothing to do, and \u0022merged_content\u0022 will be the same as\u0022content\u0022 (a blob property that contains the content of the blob).\u0022imageCaption\u0022 captures a description of an image as individuals tags and alonger text description.\r\n\u0022imageTags\u0022 stores tags about an image as a collection of keywords, one collectionfor all images in the source document.The following screenshot is an illustration of a PDF that includes text and embeddedimages. Document cracking detected three embedded images: flock of seagulls, map,eagle. Other text in the example (including titles, headings, and body text) was extractedas text and excluded from image processing.            \u0022Cognitive Search and Augmentation Combining Microsoft Cognitive Services and Azure Search\u0022         ]     } ] Image analysis output is illustrated in the JSON below (search result). The skill definitionallows you to specify which visual features are of interest. For this example, tags anddescriptions were produced, but there are more outputs to choose from.\u0022imageCaption\u0022 output is an array of descriptions, one per image, denoted by\u0022tags\u0022 consisting of single words and longer phrases that describe the image.Notice the tags consisting of \u0022a flock of seagulls are swimming in the water\u0022, or \u0022aclose up of a bird\u0022.\u0022imageTags\u0022 output is an array of single tags, listed in the order of creation. Noticethat tags will repeat. There is no aggregation or grouping.\n"
}