{
  "Id": "1213",
  "Title": "\u0022Enhancing Faceted Search Accuracy in Azure Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA few minutes away is Time\u0027s Square and the historic centre of the city, as well as other places of interest that make New York one of America\u0027s most attractive and cosmopolitan cities.\u0022,            \u0022Category\u0022: \u0022Boutique\u0022,            \u0022Tags\u0022: [                \u0022pool\u0022,                \u0022air conditioning\u0022,                \u0022concierge\u0022            ],            \u0022ParkingIncluded\u0022: false,        }    ]}Facets syntaxPOST https://{{service_name}}.\r\nsearch.windows.net/indexes/hotels/docs/search?api-version={{api_version}}{    \u0022search\u0022: \u0022*\u0022,    \u0022facets\u0022: [ \u0022Category\u0022, \u0022Tags,count:5\u0022, \u0022Rating,values:1|2|3|4|5\u0022],    \u0022count\u0022: true}Under certain circumstances, you might find that facet counts aren\u0027t fully accurate dueto the sharding architecture.\r\nEvery search index is spread across multiple shards, andeach shard reports the top N facets by document count, which are then combined into asingle result. Because it\u0027s just the top N facets for each shard, it\u0027s possible to miss orunder-count matching documents in the facet response.\r\nTo guarantee accuracy, you can artificially inflate the count:\u003Cnumber\u003E to a large numberto force full reporting from each shard. You can specify \u0022count\u0022: \u00220\u0022 for unlimitedfacets. Or, you can set \u0022count\u0022 to a value that\u0027s greater than or equal to the number ofunique values of the faceted field. For example, if you\u0027re faceting by a \u0022size\u0022 field thathas five unique values, you could set \u0022count:5\u0022 to ensure all matches are represented inthe facet response.The tradeoff with this workaround is increased query latency, so use it only whennecessary.In application code, the pattern is to use facet query parameters to return the facetednavigation structure along with facet results, plus a $filter expression.\n"
}