{
  "Id": "1216",
  "Title": "\u0022Enhancing Search Results with Faceted Navigation: Best Practices and Tips\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAlthough this is a common use case, it\u0027s not something the faceted navigation structurecurrently provides out-of-the-box. Developers who want static facets typically workaround the limitation by issuing two filtered queries: one scoped to the results, the otherused to create a static list of facets for navigation purposes.When you design the search results page, remember to add a mechanism for clearingfacets. If you add check boxes, you can easily see how to clear the filters. For otherlayouts, you might need a breadcrumb pattern or another creative approach. In thehotels C# sample, you can send an empty search to reset the page.\r\nIn contrast, theNYCJobs sample application provides a clickable [X] after a selected facet to clear thefacet, which is a stronger visual queue to the user.Facet results are documents found in the search results that match a facet term. In thefollowing example, in search results for cloud computing, 254 items also have internalspecification as a content type.\r\nItems aren\u0027t necessarily mutually exclusive. If an itemmeets the criteria of both filters, it\u0027s counted in each one. This duplication is possiblewhen faceting on Collection(Edm.String) fields, which are often used to implementdocument tagging.Output  $(\u0022#business_title_facets\u0022). html(facetResultsHTML);}Tips for working with facetsPreserve a facet navigation structure asynchronously offiltered resultsClear facetsTrim facet results with more filtersIn general, if you find that facet results are consistently too large, we recommend thatyou add more filters to give users more options for narrowing the search.If your application uses faceted navigation exclusively (that is, no search box), you canmark the field as searchable=false, filterable=true, facetable=true to produce amore compact index. Your index won\u0027t include inverted indexes and there will be no textanalysis or tokenization. Filters are made on exact matches at the character level.\n"
}