{
  "Id": "1661",
  "Title": "\u0022Enhancing Search Queries with MoreLikeThis Parameter in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen a searchrequest is made with moreLikeThis, a query is generated with search terms extractedfrom the given document that describe that document best. The generated query isthen used to make the search request. The moreLikeThis parameter can\u0027t be used withthe search parameter, search=[string].By default, the contents of all top-level searchable fields are considered. If you want tospecify particular fields instead, you can use the searchFields parameter.The moreLikeThis parameter isn\u0027t supported for complex types and the presence ofcomplex types will impact your query logic.\r\nIf your index is a complex type, you must setsearchFields to the top-level searchable fields over which moreLikeThis iterates. Forexample, if the index has a searchable field1 of type Edm.String, and field2 that\u0027s acomplex type with searchable subfields, the value of searchFields must be set tofield1 to exclude field2.\r\nAll following examples use the hotels sample from Quickstart: Create a search index inthe Azure portal.The following query finds documents whose description fields are most similar to thefield of the source document as specified by the moreLikeThis parameter:HTTP） ImportantThis feature is in public preview under Supplemental Terms of Use. The previewREST API supports this feature. ExamplesSimple queryIn this example, the request searches for hotels similar to the one with HotelId 29.Rather than using HTTP GET, you can also invoke MoreLikeThis using HTTP POST:HTTPMoreLikeThis can be combined with other common query parameters like $filter. Forinstance, the query can be restricted to only hotels whose category is \u0027Budget\u0027 andwhere the rating is higher than 3.5:HTTPThe $top selector can be used to limit how many results should be returned in aMoreLikeThis query. Also, fields can be selected with $select.\n"
}