{
  "Id": "410",
  "Title": "\u0022Enhancing Search Capabilities with Azure AI: Vectors and Enrichment\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearchable content in Azure AI Search121ContenttypeIndexed asFeaturesvideovectors Video files can be vectorized externally for a mathematicalrepresentation of video content and then indexed as vector fields inyour index.audiovectors Audio files can be vectorized externally for a mathematicalrepresentation of audio content and then indexed as vector fields inyour index. The generally available functionality of vector support requires that you call otherlibraries or models for data chunking and vectorization. However, integratedvectorization (preview) embeds these steps. For code samples showing bothapproaches, see azure-search-vectors repo.\r\nSkills are built-in support for AI enrichment. For OCR and Image Analysis, the indexingpipeline makes an internal call to the Azure AI Vision APIs. These skills pass an extractedimage to Azure AI for processing, and receive the output as text that\u0027s indexed by AzureAI Search.Vectors provide the best accommodation for dissimilar content (multiple file formatsand languages) because content is expressed universally in mathematic representations.Vectors also support similarity search: matching on the coordinates that are most similarto the vector query. Compared to keyword search (or term search) that matches ontokenized terms, similarity search is more nuanced.\r\nIt\u0027s a better choice if there\u0027sambiguity or interpretation requirements in the content or in queries.Once your data is in a search index, you use the query capabilities of Azure AI Search toretrieve content.In a non-RAG pattern, queries make a round trip from a search client. The query issubmitted, it executes on a search engine, and the response returned to the clientapplication. The response, or search results, consist exclusively of the verbatim contentfound in your index.In a RAG pattern, queries and responses are coordinated between the search engine andthe LLM. A user\u0027s question or query is forwarded to both the search engine and to theLLM as a prompt.\n"
}