{
  "Id": "380",
  "Title": "\u0022Enhancing Search Capabilities with Azure Cognitive Search: An Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis step helps to cast a broader net over what could be７ NoteAzure Cognitive Search uses Apache Lucene for full text search, but Luceneintegration is not exhaustive. We selectively expose and extend Lucene functionalityto enable the scenarios important to Azure Cognitive Search.Architecture overview and diagramconsidered as a potential match. The search engine then scans the index to finddocuments with matching terms and scores each match. A result set is then sorted by arelevance score assigned to each individual matching document. Those at the top of theranked list are returned to the calling application.The diagram below illustrates the components used to process a search request.\r\nKeycomponentsFunctional descriptionQuery parsersSeparate query terms from query operators and create the query structure (aquery tree) to be sent to the search engine.AnalyzersPerform lexical analysis on query terms. This process can involve transforming,removing, or expanding of query terms.IndexAn efficient data structure used to store and organize searchable termsextracted from indexed documents.Search engineRetrieves and scores matching documents based on the contents of theinverted index.A search request is a complete specification of what should be returned in a result set. Insimplest form, it\u0027s an empty query with no criteria of any kind.\r\nA more realistic exampleincludes parameters, several query terms, perhaps scoped to certain fields, with possiblya filter expression and ordering rules.Anatomy of a search requestThe following example is a search request you might send to Azure Cognitive Searchusing the REST API.For this request, the search engine does the following operations:1. Finds documents where the price is at least $60 and less than $300.2. Executes the query. In this example, the search query consists of phrases andterms: \u0022Spacious, air-condition* \u002B\\\u0022Ocean view\\\u0022\u0022 (users typically don\u0027t enterpunctuation, but including it in the example allows us to explain how analyzershandle it).\n"
}