{
  "Id": "489",
  "Title": "\u0022Enhancing Azure AI Search with Built-in and Custom Skills\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA skillset that\u0027s assembled using built-in skills is well suited for the following applicationscenarios:Image processing skills include Optical Character Recognition (OCR) andidentification of visual features, such as facial detection, image interpretation,image recognition (famous people and landmarks), or attributes like imageorientation. These skills create text representations of image content for full textsearch in Azure AI Search.Machine translation is provided by the Text Translation skill, often paired withlanguage detection for multi-language solutions.Natural language processing analyzes chunks of text. Skills in this categoryinclude Entity Recognition, Sentiment Detection (including opinion mining), andPersonal Identifiable Information Detection.\r\nWith these skills, unstructured text ismapped as searchable and filterable fields in an index.Custom skills execute external code that you provide and wrap in the custom skill webinterface. Several examples of custom skills can be found in the azure-search-power-skills GitHub repository.Custom skills aren’t always complex. For example, if you have an existing package thatprovides pattern matching or a document classification model, you can wrap it in acustom skill.In Azure AI Search, an indexer saves the output it creates. A single indexer run cancreate up to three data structures that contain enriched and indexed output.\r\nData storeRequiredLocationDescriptionsearchableindexRequiredSearchserviceUsed for full text search and other query forms. Specifyingan index is an indexer requirement. Index content ispopulated from skill outputs, plus any source fields thatare mapped directly to fields in the index. Use-cases for custom skillsStoring outputData storeRequiredLocationDescriptionknowledgestoreOptionalAzureStorageUsed for downstream apps like knowledge mining or datascience. A knowledge store is defined within a skillset. Itsdefinition determines whether your enriched documentsare projected as tables or objects (files or blobs) in AzureStorage.enrichmentcacheOptionalAzureStorageUsed for caching enrichments for reuse in subsequentskillset executions.\n"
}