{
  "Id": "74",
  "Title": "\u0022Enhancing Search Queries and Resource Management in Azure AI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfJSONBy default, misspelled query terms like seatle for Seattle fail to return matches in atypical search. The queryType=full parameter invokes the full Lucene query parser,which supports the tilde ~ operand. When these parameters are present, the queryperforms a fuzzy search for the specified keyword.\r\nThe query seeks matching resultsalong with results that are similar to but not an exact match to the keyword.{    \u0022search\u0022: \u0022beach OR spa\u0022,    \u0022select\u0022: \u0022HotelId, HotelName, Description, Rating\u0022,    \u0022count\u0022: true,    \u0022top\u0022: 10,    \u0022filter\u0022: \u0022ParkingIncluded\u0022}{    \u0022search\u0022: \u0022*\u0022,    \u0022select\u0022: \u0022HotelName, Address/City, Address/StateProvince\u0022,    \u0022count\u0022: true,    \u0022top\u0022: 10,    \u0022filter\u0022: \u0022geo.\r\ndistance(Location, geography\u0027POINT(-122.12 47.67)\u0027) le 5\u0022}Full Lucene syntax examples{    \u0022queryType\u0022: \u0022full\u0022,    \u0022search\u0022: \u0022seatle~\u0022,    \u0022select\u0022: \u0022HotelId, HotelName,Address/City, Address/StateProvince\u0022,    \u0022count\u0022: true}Take a minute to try a few of these example queries for your index.\r\nTo learn more aboutqueries, see Querying in Azure AI Search.When you work in your own subscription, it\u0027s a good idea at the end of a project toidentify whether you still need the resources you created. Resources left running cancost you money. You can delete resources individually or delete the resource group todelete the entire set of resources. You can find and manage resources for your service in the Azure portal under Allresources or Resource groups in the left pane.If you use a free service, remember that the limit is three indexes, indexers, and datasources. You can delete individual items in the Azure portal to stay under the limit.Try an Azure portal wizard to generate a ready-to-use web app that runs in a browser.Use this wizard on the small index you created in this quickstart, or use one of the built-in sample data sets for a richer search experience.\n"
}