{
  "Id": "1182",
  "Title": "\u0022Enhancing Search Results with Document Details and Relevance Scores\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFree shuttle to the mall and airport.\u0022,         \u0022Category\u0022: \u0022Resort and Spa\u0022,         \u0022Tags\u0022: [             \u0022continental breakfast\u0022,             \u0022air conditioning\u0022,             \u002224-hour front desk service\u0022 Notice the search score in the response. This is the relevance score of the match. Bydefault, a search service returns the top 50 matches based on this score.\r\nUniform scores of \u00221.0\u0022 occur when there\u0027s no rank, either because the search wasn\u0027t fulltext search, or because no criteria were provided. For example, in an empty search(search=*), rows come back in arbitrary order. When you include actual criteria, you\u0027llsee search scores evolve into meaningful values.\r\nWhen you return search results in a query, a logical next step is to provide a details pagethat includes more fields from the document. This example shows you how to return asingle document using Lookup Document by passing in the document ID.HTTPAll documents have a unique identifier.\r\nIf you\u0027re using the portal, select the index fromthe Indexes tab and then look at the field definitions to determine which field is the key.Using REST, the Get Index call returns the index definition in the response body.Response for the above query consists of the document whose key is 41. Any field thatis marked as \u0022retrievable\u0022 in the index definition can be returned in search results andrendered in your app. JSON        ]     } Example 2: Look up by IDGET /indexes/hotels-sample-index/docs/41?api-version=2020-06-30 {     \u0022HotelId\u0022: \u002241\u0022,     \u0022HotelName\u0022: \u0022Ocean Air Motel\u0022,     \u0022Description\u0022: \u0022Oceanfront hotel overlooking the beach features rooms with a private balcony and 2 indoor and outdoor pools. Various shops and art entertainment are on the boardwalk, just steps away.\n"
}