{
  "Id": "412",
  "Title": "\u0022Enhancing Search Results with Hybrid Query Techniques in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfVectors can represent all types of content, inany language.HybridsearchCombines any or all of the abovequery techniques. Vector andnon-vector queries execute inparallel and are returned in aunified result set.The most significant gains in precision andrecall are through hybrid queries.\r\nA query\u0027s response provides the input to the LLM, so the quality of your search results iscritical to success. Results are a tabular row set. The composition or structure of theresults depends on:Fields that determine which parts of the index are included in the response.Rows that represent a match from index.Fields appear in search results when the attribute is \u0022retrievable\u0022.\r\nA field definition in theindex schema has attributes, and those determine whether a field is used in a response.Only \u0022retrievable\u0022 fields are returned in full text or vector query results. By default all\u0022retrievable\u0022 fields are returned, but you can use \u0022select\u0022 to specify a subset.\r\nBesidesStructure the query response\u0022retrievable\u0022, there are no restrictions on the field. Fields can be of any length or type.Regarding length, there\u0027s no maximum field length limit in Azure AI Search, but thereare limits on the size of an API request.Rows are matches to the query, ranked by relevance, similarity, or both.\r\nBy default,results are capped at the top 50 matches for full text search or k-nearest-neighbormatches for vector search. You can change the defaults to increase or decrease the limitup to the maximum of 1,000 documents. You can also use top and skip pagingparameters to retrieve results as a series of paged results. When you\u0027re working with complex processes, a large amount of data, and expectationsfor millisecond responses, it\u0027s critical that each step adds value and improves the qualityof the end result. On the information retrieval side, relevance tuning is an activity thatimproves the quality of the results sent to the LLM. Only the most relevant or the mostsimilar matching documents should be included in results.\n"
}