{
  "Id": "435",
  "Title": "\u0022Enhancing Search Results with Vector and Full Text Hybrid Approach\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027re familiar with full text search, you know to expect zeroresults if the index doesn\u0027t contain a term or phrase. However, in vector search, similarityis relative to the input query vector, not absolute. It\u0027s possible to get positive results fora nonsensical or off-topic query. Less relevant results have a worse similarity score, butthey\u0027re still the \u0022nearest\u0022 vectors if there isn\u0027t anything closer. As such, a response withno meaningful results can still return k results, but each result\u0027s similarity score wouldbe low. A hybrid approach that includes full text search can mitigate this problem.\r\nTry the quickstartdouble ScoreToSimilarity(double score){    double cosineDistance = (1 - score) / score;    return  -cosineDistance \u002B 1;}Number of ranked results in a vector queryresponseNext stepsLearn more about embeddingsLearn more about data chunkingRelevance scoring in hybrid search usingReciprocal Rank Fusion (RRF)Article•11/01/2023Reciprocal Rank Fusion (RRF) is an algorithm that evaluates the search scores frommultiple, previously ranked results to produce a unified result set.\r\nIn Azure AI Search,RRF is used whenever there are two or more queries that execute in parallel. Each queryproduces a ranked result set, and RRF is used to merge and homogenize the rankingsinto a single result set, returned in the query response. Examples of scenarios where RRFis always used include hybrid search and multiple vector queries executing concurrently.RRF is based on the concept of reciprocal rank, which is the inverse of the rank of thefirst relevant document in a list of search results. The goal of the technique is to takeinto account the position of the items in the original rankings, and give higherimportance to items that are ranked higher in multiple lists. This can help improve theoverall quality and reliability of the final ranking, making it more useful for the task offusing multiple ordered search results.\n"
}