{
  "Id": "1716",
  "Title": "\u0022Enhancements and Deprecations in Personally Identifiable Information Detection\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen this skill was in public preview, the maskingMode option redact wasalso supported, which allowed removing the detected entities entirelywithout replacement. The redact option has since been deprecated andare longer be supported.maskingCharacterThe character used to mask the text if the maskingMode parameter is set toreplace.\r\nThe following option is supported: * (default). This parametercan only be null if maskingMode is not set to replace.  When this skill was in public preview, there was support for themaskingCharacter options, X and #. Both X and # options have sincebeen deprecated and are longer be supported.\r\ndomain(Optional) A string value, if specified, will set the domain to include only asubset of the entity categories. Possible values include: \u0022phi\u0022 (detectconfidential health information only), \u0022none\u0022.piiCategories(Optional) If you want to specify which entities will be detected andreturned, use this optional parameter (defined as a list of strings) with theappropriate entity categories.\r\nThis parameter can also let you detectentities that aren\u0027t enabled by default for your document language. SeeSupported Personally Identifiable Information entity categories for the fulllist.modelVersion(Optional) Specifies the version of the model to use when callingpersonally identifiable information detection. It will default to the mostrecent version when not specified. We recommend you do not specify thisvalue unless it\u0027s necessary.Input nameDescriptionlanguageCodeA string indicating the language of the records. If this parameter is not specified,the default language code will be used to analyze the records.  See the full list of supported languages. Skill inputsInput nameDescriptiontextThe text to analyze.OutputnameDescriptionpiiEntitiesAn array of complex types that contains the following fields:\u0022text\u0022 (The actual personally identifiable information as extracted)\u0022type\u0022\u0022subType\u0022\u0022score\u0022 (Higher value means it\u0027s more likely to be a real entity)\u0022offset\u0022 (into the input text)\u0022length\u0022See Supported Personally Identifiable Information entity categories for the full list.\n"
}