{
  "Id": "1197",
  "Title": "\u0022Enhancing Search Results with Filter Dependencies in Azure AISearch\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIt\u0027s the filter attached to the search query that provides the geolocationcoordinates, the facet category selected by the user, or the security ID of the requestor.Common scenarios include:Slice search results based on content in the index. Given a schema with hotellocation, categories, and amenities, you might create a filter to explicitly match oncriteria (in Seattle, on the water, with a view).\r\nImplement a search experience comes with a filter dependency:Faceted navigation uses a filter to pass back the facet category selected by theuser.Geospatial search uses a filter to pass coordinates of the current location in\u0022find near me\u0022 apps and functions that match within an area or by distance.Security filters pass security identifiers as filter criteria, where a match in theindex serves as a proxy for access rights to the document.Do a \u0022numbers search\u0022. Numeric fields are retrievable and can appear in searchresults, but they aren\u0027t searchable (subject to full text search) individually. If youneed selection criteria based on numeric data, use a filter.\r\nAt query time, a filter parser accepts criteria as input, converts the expression intoatomic Boolean expressions represented as a tree, and then evaluates the filter tree overWhen to use a filterHow filters are executedfilterable fields in an index.Filtering occurs in tandem with search, qualifying which documents to include indownstream processing for document retrieval and relevance scoring. When paired witha search string, the filter effectively reduces the recall set of the subsequent searchoperation. When used alone (for example, when the query string is empty wheresearch=*), the filter criteria is the sole input. Filters are OData expressions, articulated in the filter syntax supported by Azure AISearch.You can specify one filter for each search operation, but the filter itself can includemultiple fields, multiple criteria, and if you use an ismatch function, multiple full-textsearch expressions.\n"
}