{
  "Id": "1297",
  "Title": "\u0022Enhancing Search Ranking with Freshness, Distance, and Tag Functions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen set to true, the fullboost will continue to apply to documents that have a value forthe target field that’s higher than the upper end of the range. Iffalse, the boost of this function won’t be applied to documentshaving a value for the target field that falls outside of the range.functions \u003E freshnessThe freshness scoring function is used to alter ranking scores foritems based on values in DateTimeOffset fields.\r\nFor example, anitem with a more recent date can be ranked higher than olderitems.It\u0027s also possible to rank items like calendar events with futuredates such that items closer to the present can be ranked higherthan items further in the future.In the current service release, one end of the range will be fixedto the current time. The other end is a time in the past based onthe boostingDuration. To boost a range of times in the future,use a negative boostingDuration.The rate at which the boosting changes from a maximum andminimum range is determined by the Interpolation applied tothe scoring profile (see the figure below).\r\nTo reverse theboosting factor applied, choose a boost factor of less than 1.functions \u003E freshness \u003EboostingDurationSets an expiration period after which boosting will stop for aparticular document. See Set boostingDuration in the followingsection for syntax and examples.functions \u003E distanceThe distance scoring function is used to affect the score ofdocuments based on how close or far they\u0027re relative to aAttributeDescriptionreference geographic location. The reference location is given aspart of the query in a parameter (using the scoringParameterquery parameter) as a lon,lat argument. functions \u003E distance \u003EreferencePointParameterA parameter to be passed in queries to use as reference location(using the scoringParameter query parameter).functions \u003E distance \u003EboostingDistanceA number that indicates the distance in kilometers from thereference location where the boosting range ends.functions \u003E tagThe tag scoring function is used to affect the score of documentsbased on tags in documents and search queries. Documents thathave tags in common with the search query will be boosted. Thetags for the search query are provided as a scoring parameter ineach search request (using the scoringParameter queryparameter).\n"
}