{
  "Id": "1560",
  "Title": "\u0022Enhancing Security for Azure Cognitive Search Services: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf0.0Azure CognitiveSearch servicesshould have localDisabling local authentication methodsimproves security by ensuring that AzureCognitive Search services exclusivelyAudit, Deny,Disabled1.0.0Azure Cognitive SearchﾉExpand table(Azure portal)(GitHub)NameDescriptionEffect(s)Versionauthenticationmethods disabledrequire Azure Active Directory identities forauthentication.\r\nLearn more at:https://aka.ms/azure-cognitive-search/rbac. Note that while the disablelocal authentication parameter is still inpreview, the deny effect for this policy mayresult in limited Azure Cognitive Searchportal functionality since some features ofthe Portal use the GA API which does notsupport the parameter.\r\nAzure CognitiveSearch servicesshould usecustomer-managedkeys to encrypt dataat restEnabling encryption at rest using acustomer-managed key on your AzureCognitive Search services providesadditional control over the key used toencrypt data at rest. This feature is oftenapplicable to customers with specialcompliance requirements to manage dataencryption keys using a key vault.Audit, Deny,Disabled1.0.\r\n0Azure CognitiveSearch servicesshould use privatelinkAzure Private Link lets you connect yourvirtual network to Azure services without apublic IP address at the source ordestination. The Private Link platformhandles the connectivity between theconsumer and services over the Azurebackbone network. By mapping privateendpoints to Azure Cognitive Search, dataleakage risks are reduced.\r\nLearn moreabout private links at: https://aka.ms/azure-cognitive-search/inbound-private-endpoints.Audit, Disabled1.0.0Configure AzureCognitive Searchservices to disablelocal authenticationDisable local authentication methods sothat your Azure Cognitive Search servicesexclusively require Azure Active Directoryidentities for authentication. Learn more at:https://aka.ms/azure-cognitive-search/rbac.Modify, Disabled1.0.0Configure AzureCognitive Searchservices to disablepublic networkaccessDisable public network access for yourAzure Cognitive Search service so that it isnot accessible over the public internet. Thiscan reduce data leakage risks. Learn moreat: https://aka.\n"
}