{
  "Id": "1489",
  "Title": "\u0022Enhancing Search with Azure AI: Features and Limitations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIntegrated vectorization is a preview feature that calls the Azure OpenAIembeddings model to vectorize data and store embeddings in Azure Searchfor similarity search.AI enrichment in Azure AI Search uses the indexer and data source features of theservice to call Azure AI Services to perform the content enrichment. Limitations ofthe indexers and data sources used in this process will apply. Review the indexerand data source documentation for more information about these relatedlimitations. The limitations of each Azure AI Service used by the AI enrichmentpipeline in Azure AI Search will also apply. See the transparency notes for eachservice for more information about these limitations.\r\nUse casesExample use casesLimitationsAI enrichmentMicrosoft AI principlesMicrosoft responsible AI resourcesMicrosoft Azure Learning courses on responsible AIIntroduction to Azure AI SearchFeature descriptionsAI enrichment conceptsRetrieval Augmented Generation (RAG) in Azure AI SearchLearn more about responsible AILearn more about Azure AI SearchAzure AI Search REST API referenceArticle•11/14/2023Azure AI Search (formerly known as Azure Cognitive Search) is a fully managed cloudsearch service that provides information retrieval over user-owned content.Data plane REST APIs are used for indexing and query workflows.\r\nControl plane operations are accessed through a separate Management REST API.REST API docs are now versioned.1. Expand Reference \u003E Data Plane.2. Open an API reference page.3. Select the API version from the dropdown filter on the top left.Azure AI Search has the concepts of search services, indexes, documents, indexers, datasources, skillsets, and synonym maps.\r\nA search service hosts index, indexers, data sources, skillsets, and synonym maps astop-level objects.A search index provides persistent storage of search documents. Searchdocuments are your data, articulated as a collection of fields, loaded from externalsources and pushed to an index to make it searchable. A search indexer adds automation, reading data in native formats and serializing itinto JSON.An indexer has a data source and points to an index.An indexer might also have a skillset that adds AI enrichment and integratedvectorization to the indexing pipeline. Skillsets are always attached to an indexer.\n"
}