{
  "Id": "1252",
  "Title": "\u0022Enhancing Search Functionality with Azure: Query String and Highlights\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor the following examples, assume a query string that includes the quote-enclosedphrase \u0022super bowl\u0022. Before July 2020, any term in the phrase is highlighted:JSONFor search services created after July 2020, only phrases that match the full phrase querywill be returned in \u0022@search.highlights\u0022:JSON{    \u0022@odata.count\u0022: 1,    \u0022value\u0022: [        {            \u0022@search.score\u0022: 19.\r\n593246,            \u0022@search.highlights\u0022: {                \u0022title\u0022: [                    \u0022\u003Cb\u003EDivine\u003C/b\u003E \u003Cb\u003ESecrets\u003C/b\u003E of the Ya-Ya Sisterhood\u0022                ]            },            \u0022original_title\u0022: \u0022Divine Secrets of the Ya-Ya Sisterhood\u0022,            \u0022title\u0022: \u0022Divine Secrets of the Ya-Ya Sisterhood\u0022        }    ]}Phrase highlighting on older services\u0022@search.\r\nhighlights\u0022: {    \u0022sentence\u0022: [        \u0022The \u003Cem\u003Esuper\u003C/em\u003E \u003Cem\u003Ebowl\u003C/em\u003E is \u003Cem\u003Esuper\u003C/em\u003E awesome with a \u003Cem\u003Ebowl\u003C/em\u003E of chips\u0022   ]\u0022@search.\r\nhighlights\u0022: {    \u0022sentence\u0022: [        \u0022The \u003Cem\u003Esuper\u003C/em\u003E \u003Cem\u003Ebowl\u003C/em\u003E is super awesome with a bowl of chips\u0022   ]Next stepsTo quickly generate a search page for your client, consider these options:Application Generator, in the portal, creates an HTML page with a search bar,faceted navigation, and results area that includes images.Add search to an ASP.NET Core (MVC) app is a tutorial and code sample thatbuilds a functional client. Add search to web apps is a tutorial and code sample that uses the ReactJavaScript libraries for the user experience. The app is deployed using Azure StaticWeb Apps.Return a semantic answer in Azure AISearchArticle•10/04/2023When invoking semantic ranking and captions, you can optionally extract content fromthe top-matching documents that \u0022answers\u0022 the query directly.\n"
}