{
  "Id": "15",
  "Title": "\u0022Enhanced Azure Search: Vectorization, AI Enrichment, and Relevance Modeling\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIntegrated vectorization (preview) provides an end-to-endindexing pipeline from source files to queries.Import and vectorize data(preview)A new wizard in the Azure portal that creates a full indexingpipeline that includes data chunking and vectorization. Thewizard creates all of the objects and configuration settings.\r\nVector and hybrid searchAI enrichment and knowledge miningCategory                           FeaturesAI processing during indexingAI enrichment refers to embedded image and naturallanguage processing in an indexer pipeline that extracts textand information from content that can\u0027t otherwise be indexedfor full text search. AI processing is achieved by adding andcombining skills in a skillset, which is then attached to anindexer.\r\nAI can be either built-in skills from Microsoft, such astext translation or Optical Character Recognition (OCR), orcustom skills that you provide.Storing enriched content foranalysis and consumption innon-search scenariosKnowledge store is persistent storage of enriched content,intended for non-search scenarios like knowledge mining anddata science processing. A knowledge store is defined in askillset, but created in Azure Storage as objects or tabularrowsets.Cached enrichmentsIncremental enrichment (preview) refers to cachedenrichments that can be reused during skillset execution.Caching is particularly valuable in skillsets that include OCRand image analysis, which are expensive to process. Category                           FeaturesFree-form text searchFull-text search is a primary use case for most search-based apps.Queries can be formulated using a supported syntax.Simple query syntax provides logical operators, phrase searchoperators, suffix operators, precedence operators.Full Lucene query syntax includes all operations in simple syntax,with extensions for fuzzy search, proximity search, term boosting,and regular expressions.RelevanceSimple scoring is a key benefit of Azure AI Search. Scoring profilesare used to model relevance as a function of values in thedocuments themselves.\n"
}