{
  "Id": "81",
  "Title": "\u0022Enhancing Search Experience with Faceted Navigation and Typeahead Suggestions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn Description, choose a field that provides details that might help someone decidewhether to click through to that particular document.The search service supports faceted navigation, which is often rendered as a sidebar.Facets are based on filterable and facetable fields, as expressed in the index schema.\r\nIn Azure Cognitive Search, faceted navigation is a cumulative filtering experience. Withina category, selecting multiple filters expands the results (for example, selecting Seattleand Bellevue within City). Across categories, selecting multiple filters narrows results.1. In the wizard, select the Sidebar tab at the top of the page. You\u0027ll see a list of allfields that are attributed as filterable and facetable in the index.2. Accept the current selection of faceted fields and continue to the next page.Typeahead functionality is available in the form of autocomplete and query suggestions.The wizard supports query suggestions.\r\nBased on keystroke inputs provided by the user,the search service returns a list of \u0022completed\u0022 query strings that can be selected as theinput.Suggestions are enabled on specific field definitions. The wizard gives you options forconfiguring how much information is included in a suggestion.\r\nAdd a sidebar TipYou can view the full index schema in the portal. Look for the Index definition(JSON) link in each index\u0027s overview page. Fields that qualify for faceted navigationhave \u0022filterable: true\u0022 and \u0022facetable: true\u0022 attributes.Add typeaheadThe following screenshot shows options in the wizard, juxtaposed with a rendered pagein the app. You can see how field selections are used, and how \u0022Show Field Name\u0022 isused to include or exclude labeling within the suggestion.Suggestions refer to automated query prompts that are attached to the search box.Cognitive Search supports two: autocompletion of a partially entered search term, andsuggestions for a dropdown list of potential matching documents based.\n"
}