{
  "Id": "9",
  "Title": "\u0022Enhancements and Demos in Azure Search: 2023 Updates and Features\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWerecommend creating new indexes for 2023-10-01-Preview.You might encounter an HTTP 400 on some features on amigrated index, even if you migrated correctly.Item                        TypeDescriptionEnhanced semanticrankingFeatureUpgraded models are rolling out for semantic reranking, andavailability is extended to more regions.\r\nMaximum uniquetoken counts doubled from 128 to 256.Item                        TypeDescriptionVector demo (AzureSDK for JavaScript)SampleUses Node.js and the @azure/search-documents 12.0.0-beta.2 library to generate embeddings, create and load anindex, and run several vector queries.\r\nVector demo (AzureSDK for .NET)SampleUses the Azure.Search.Documents 11.5.0-beta.3 library togenerate embeddings, create and load an index, and runseveral vector queries. You can also try this sample fromthe Azure SDK team.Vector demo (AzureSDK for Python)SampleUses the latest beta release of the azure.search.documentsto generate embeddings, create and load an index, and runseveral vector queries.\r\nVisit the cognitive-search-vector-pr/demo-python repo for more vector search demos.August 2023ﾉExpand tableJuly 2023ﾉExpand tableJune 2023ﾉExpand tableItem                        TypeDescriptionVector search publicpreviewFeatureAdds vector fields to a search index for similarity search overvector representations of data. 2023-07-01-PreviewSearch REST APIAPINew preview version of the Search REST APIs that addssupport for vector search. This API version is inclusive of allpreview features. If you\u0027re using earlier previews, switch to2023-07-01-preview with no loss of functionality.Semantic searchavailabilityFeatureSemantic search is now available on the Basic tier.Item                        TypeDescriptionAzure RBAC (role-based access control)FeatureAnnouncing general availability.2022-09-01Management RESTAPIAPINew stable version of the Management REST APIs, withsupport for configuring search to use Azure RBAC.\n"
}