{
  "Id": "498",
  "Title": "\u0022Enhancing Azure Cognitive Search with Incremental Enrichment and Caching\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfif a skill that provides an input to this skill isupdatedUpdates to the knowledge store projection location, results in re-projectingdocumentsChanges to the knowledge store projections, results in re-projecting documentsOutput field mappings changed on an indexer results in re-projecting documentsto the indexREST API version 2020-06-30-Preview or later provides incremental enrichment throughadditional properties on indexers.\r\nSkillsets and data sources can use the generallyavailable version. In addition to the reference documentation, see Configure caching forincremental enrichment for details about order of operations.Create or Update Indexer (api-version=2020-06-30-Preview)Update Skillset (api-version=2020-06-30) (New URI parameter on the request)Reset Skills (api-version=2020-06-30)Update Data Source, when called with a preview API version, provides a newparameter named \u0022ignoreResetRequirement\u0022, which should be set to true whenyour update action should not invalidate the cache.\r\nUse \u0022ignoreResetRequirement\u0022sparingly as it could lead to unintended inconsistency in your data that will not bedetected easily.APIs used for cachingLimitationsＵ CautionIf you\u0027re using the SharePoint Online indexer (Preview), you should avoidincremental enrichment. Under certain circumstances, the cache becomes invalid,requiring an indexer reset and run, should you choose to reload it. Next stepsIncremental enrichment is a powerful feature that extends change tracking to skillsetsand AI enrichment. Incremental enrichment enables reuse of existing processed contentas you iterate over skillset design. As a next step, enable caching on your indexers.Enable caching for incremental enrichmentSkillset concepts in Azure Cognitive SearchArticle•08/08/2023This article is for developers who need a deeper understanding of skillset concepts and composition,and assumes familiarity with the high-level concepts of AI enrichment.A skillset is a reusable resource in Azure Cognitive Search that\u0027s attached to an indexer.\n"
}