{
  "Id": "52",
  "Title": "\u0022Enhancing Search Capabilities with Azure: Key Field and Vector Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfKey points:The \u0022fields\u0022 collection includes a required key field, text and vector fields (suchas \u0022Description\u0022, \u0022DescriptionVector\u0022) for keyword and vector search. Colocatingvector and non-vector fields in the same index enables hybrid queries. Forinstance, you can combine filters, keyword search with semantic ranking, andvectors into a single query operation.Vector fields must be \u0022type\u0022: \u0022Collection(Edm.\r\nSingle)\u0022 with \u0022dimensions\u0022 and\u0022vectorSearchProfile\u0022 properties. See Create or Update Index for propertydescriptions.The \u0022vectorSearch\u0022 section is an array of Approximate Nearest Neighbors (ANN)algorithm configurations and profiles. Supported algorithms include HNSW andexhaustive KNN. See Relevance scoring in vector search for details.\r\n}            }        ],        \u0022profiles\u0022: [                  {                \u0022name\u0022: \u0022my-vector-profile\u0022,                \u0022algorithm\u0022: \u0022my-hnsw-vector-config-1\u0022            }      ]    },    \u0022semantic\u0022: {        \u0022configurations\u0022: [            {                \u0022name\u0022: \u0022my-semantic-config\u0022,                \u0022prioritizedFields\u0022: {                    \u0022titleField\u0022: {                        \u0022fieldName\u0022:\r\n\u0022HotelName\u0022                    },                    \u0022prioritizedContentFields\u0022: [                        { \u0022fieldName\u0022: \u0022Description\u0022 }                    ],                    \u0022prioritizedKeywordsFields\u0022: [                        { \u0022fieldName\u0022: \u0022Tags\u0022 }                    ]                }            }        ]    }}[Optional]: The \u0022semantic\u0022 configuration enables reranking of search results.\r\nYoucan rerank results in queries of type \u0022semantic\u0022 for string fields that are specifiedin the configuration. See Semantic ranking overview to learn more.Use the Index Documents REST API for this request.For readability, the following excerpt shows just the fields used in queries, minus thevector values associated with DescriptionVector. Each vector field contains 1536embeddings, so those values are omitted for readability.HTTPUpload documentsPOST https://{{search-service-name}}.search.windows.net/indexes/{{index-name}}/docs/index?api-version=2023-11-01Content-Type: application/jsonapi-key: {{admin-api-key}}{    \u0022value\u0022: [        {            \u0022@search.\n"
}