{
  "Id": "788",
  "Title": "\u0022Enhancing Search Experience with Synonyms in C# Code\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfC#After the synonym map is uploaded and the index is updated to use the synonym map,the second RunQueriesWithNonExistentTermsInIndex call outputs the following:Bashmotel\\ninternet,wifi\\nfive star=\u003Eluxury\\neconomy,inexpensive=\u003Ebudget\u0022);   indexClient.CreateOrUpdateSynonymMap(synonymMap);}private static SearchIndex AddSynonymMapsToFields(SearchIndex index){   index.Fields.\r\nFirst(f =\u003E f.Name == \u0022category\u0022).SynonymMapNames.Add(\u0022desc-synonymmap\u0022);   index.Fields.First(f =\u003E f.Name == \u0022tags\u0022).SynonymMapNames.Add(\u0022desc-synonymmap\u0022);   return index;}index.Fields.First(f =\u003E f.Name == \u0022category\u0022).SynonymMapNames.\r\nAdd(\u0022desc-synonymmap\u0022);\u0022After\u0022 queriesSearch the entire index for the phrase \u0022five star\u0022:Name: Fancy Stay        Category: Luxury        Tags: [pool, view, wifi, concierge]Search the entire index for the term \u0027internet\u0027:The first query finds the document from the rule five star=\u003Eluxury. The second queryexpands the search using internet,wifi and the third using both hotel, motel andeconomy,inexpensive=\u003Ebudget in finding the documents they matched.\r\nAdding synonyms completely changes the search experience. In this example, theoriginal queries failed to return meaningful results even though the documents in ourindex were relevant. By enabling synonyms, we can expand an index to include terms incommon use, with no changes to underlying data in the index. The fastest way to clean up after an example is by deleting the resource groupcontaining the Azure AI Search service. You can delete the resource group now topermanently delete everything in it. In the portal, the resource group name is on theOverview page of Azure AI Search service.This example demonstrated the synonyms feature in C# code to create and postmapping rules and then call the synonym map on a query.\n"
}