{
  "Id": "401",
  "Title": "\u0022Enhanced Vector Search: Hybrid Full Text and Vector Queries\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis class of algorithms employs different data structures ordata partitioning methods to significantly reduce the search space to accelerate queryprocessing.ANN algorithms sacrifice some accuracy, but offer scalable and faster retrieval ofapproximate nearest neighbors, which makes them ideal for balancing accuracy againstefficiency in modern information retrieval applications.\r\nYou can adjust the parameters ofyour algorithm to fine-tune the recall, latency, memory, and disk footprint requirementsof your search application.Azure AI Search uses HNSW for its ANN algorithm.Try the quickstartLearn more about vector indexingLearn more about vector queriesAzure Cognitive Search and LangChain: A Seamless Integration for EnhancedVector Search CapabilitiesApproximate Nearest NeighborsNext stepsHybrid search using vectors and full textin Azure AI SearchArticle•11/15/2023Hybrid search is a combination of full text and vector queries that execute against asearch index that contains both searchable plain text content and generatedembeddings.\r\nFor query purposes, hybrid search is:A single query request that includes both search and vectors query parametersExecuting in parallelWith merged results in the query response, scored using Reciprocal Rank Fusion(RRF)This article explains the concepts, benefits, and limitations of hybrid search. Watch thisembedded video for an explanation and short demos of how hybrid retrieval contributesto high quality chat-style and copilot apps.In Azure AI Search, vector indexes containing embeddings can live alongside textual andnumerical fields allowing you to issue hybrid full text and vector queries. Hybrid queriescan take advantage of existing functionality like filtering, faceting, sorting, scoringprofiles, and semantic ranking in a single search request.Hybrid search combines results from both full text and vector queries, which usedifferent ranking functions such as BM25 and HNSW. A Reciprocal Rank Fusion (RRF)algorithm is used to merge results. The query response provides just one result set,using RRF to determine which matches are included.\n"
}