{
  "Id": "545",
  "Title": "\u0022Enhancing Azure Cognitive Search Security: Policies, Compliance, and Network Access\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor well-known benchmarks, Azure Policy provides built-in definitions that provide both criteriaand an actionable response that addresses noncompliance.For Azure AI Search, there\u0027s currently one built-in definition. It\u0027s for resource logging.You can assign a policy that identifies search services that are missing resource logging,and then turn it on. For more information, see Azure Policy Regulatory Compliancecontrols for Azure AI Search.Watch this fast-paced video for an overview of the security architecture and each featurecategory.Azure security fundamentalsAzure SecurityMicrosoft Defender for CloudCertifications and complianceWatch this videohttps://learn.microsoft.\r\ncom/Shows/AI-Show/Azure-Cognitive-Search-Whats-new-in-security/playerSee alsoIndexer access to content protected byAzure network securityArticle•07/19/2023If your search solution requirements include an Azure virtual network, this conceptarticle explains how a search indexer can access content that\u0027s protected by networksecurity. It describes the outbound traffic patterns and indexer execution environments.It also covers the network protections supported by Cognitive Search and factors thatmight influence your security strategy. Finally, because Azure Storage is used for bothdata access and persistent storage, this article also covers network considerations thatare specific to search and storage connectivity.\r\nLooking for step-by-step instructions instead? See How to configure firewall rules toallow indexer access or How to make outbound connections through a private endpoint.Azure Cognitive Search indexers can make outbound calls to various Azure resourcesduring execution. An indexer makes outbound calls in three situations:Connecting to external data sources during indexingConnecting to external, encapsulated code through a skillset that includes customskillsConnecting to Azure Storage during skillset execution to cache enrichments, savedebug session state, or write to a knowledge storeA list of all possible Azure resource types that an indexer might access in a typical runare listed in the table below. ResourcePurpose within indexer runAzure Storage (blobs, ADLS Gen 2,files, tables)Data sourceAzure Storage (blobs, tables)Skillsets (caching enrichments, debug sessions, knowledgestore projections)Azure Cosmos DB (various APIs)Data sourceAzure SQL DatabaseData sourceSQL Server on Azure virtualmachinesData sourceResources accessed by indexersResourcePurpose within indexer runSQL Managed InstanceData sourceAzure FunctionsAttached to a skillset and used to host for custom web APIskillsYour Azure resources could be protected using any number of the network isolationmechanisms offered by Azure.\n"
}