{
  "Id": "1253",
  "Title": "\u0022Enhancing User Experience with Semantic Search in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAdd search to web apps is a tutorial and code sample that uses the ReactJavaScript libraries for the user experience. The app is deployed using Azure StaticWeb Apps.Return a semantic answer in Azure AISearchArticle•10/04/2023When invoking semantic ranking and captions, you can optionally extract content fromthe top-matching documents that \u0022answers\u0022 the query directly.\r\nOne or more answerscan be included in the response, which you can then render on a search page toimprove the user experience of your app.A semantic answer is verbatim content in your search index that a readingcomprehension model has recognized as an answer to the query posed in the request.\r\nIt\u0027s not a generated answer. For guidance on a chat-style user interaction model thatuses generative AI to compose answers from your content, see Retrieval AugmentedGeneration (RAG).In this article, learn how to request a semantic answer, unpack the response, and findout what content characteristics are most conducive to producing high-quality answers.All prerequisites that apply to semantic queries also apply to answers, including servicetier and region.Query logic must include the semantic query parameters \u0022queryType=semantic\u0022,plus the \u0022answers\u0022 parameter. Required parameters are discussed in this article.\r\nQuery strings entered by the user must be recognizable as a question (what,where, when, how).Search documents in the index must contain text having the characteristics of ananswer, and that text must exist in one of the fields listed in the semanticconfiguration. For example, given a query \u0022what is a hash table\u0022, if none of thefields in the semantic configuration contain passages that include \u0022A hash table is. ..\u0022, then it\u0027s unlikely an answer is returned.Prerequisites７ NoteStarting in 2021-04-30-Preview, in Create or Update Index (Preview) requests, a\u0022semanticConfiguration\u0022 is required for specifying input fields for semanticranking.A semantic answer is a substructure of a semantic query response.\n"
}