{
  "Id": "418",
  "Title": "\u0022Enhancing Search Capabilities with Azure AI Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFull text queries iterate over inverted indexes that arestructured for fast scans, where a match can be found inpotentially any field, within any number of search documents.Text is analyzed and tokenized for full text search.VectorsearchVector indexes ofgeneratedembeddings.Vector queries iterate over vector fields in a search index.HybridsearchAll of the above, ina single searchindex.\r\nCombines text search and vector search in a single queryrequest. Text search works on plain text content in \u0022searchable\u0022and \u0022filterable\u0022 fields. Vector search works on content in vectorfields.OthersPlain text andalphanumericcontent.Raw content, extracted verbatim from source documents,supporting filters and pattern matching queries like geo-spatialsearch, fuzzy search, and fielded search.\r\nThis article brings focus to the last category: queries that work on plain text andalphanumeric content, extracted intact from original source, used for filters and otherspecialized query forms.Autocomplete or suggested results are alternatives to search that fire successive queryrequests based on partial string inputs (after each character) in a search-as-you-typeexperience. You can use autocomplete and suggestions parameter together orseparately, as described in this walkthrough, but you can\u0027t use them with search. Bothcompleted terms and suggested queries are derived from index contents.\r\nThe engineTypes of queriesAutocomplete and suggested queriesnever returns a string or suggestion that is nonexistent in your index. For moreinformation, see Autocomplete (REST API) and Suggestions (REST API).Filters are widely used in apps that are based on Azure AI Search. On application pages,filters are often visualized as facets in link navigation structures for user-directedfiltering. Filters are also used internally to expose slices of indexed content. For example,you might initialize a search page using a filter on a product category, or a language ifan index contains fields in both English and French.You might also need filters to invoke a specialized query form, as described in thefollowing table.\nYou can use a filter with an unspecified search (search=*) or with aquery string that includes terms, phrases, operators, and patterns.FilterscenarioDescriptionRange filtersIn Azure AI Search, range queries are built using the filter parameter. For moreinformation and examples, see Range filter example.\n"
}