{
  "Id": "1772",
  "Title": "\u0022Enhancing Text Analysis with Named Entity Recognition Skill (v2)\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022category\u0022,                    \u0022source\u0022: \u0022/document/namedEntities/*/category\u0022                },                {                    \u0022name\u0022: \u0022confidence\u0022,                    \u0022source\u0022: \u0022/document/namedEntities/*/confidenceScore\u0022                }            ]        }    ],    \u0022outputs\u0022: [        {            \u0022name\u0022: \u0022output\u0022,            \u0022targetName\u0022: \u0022entities\u0022        }    ]}See alsoNamed Entity Recognition cognitive skill(v2)Article•11/15/2023The Named Entity Recognition skill (v2) extracts named entities from text.\r\nAvailableentities include the types person, location and organization.Microsoft.Skills.Text.NamedEntityRecognitionSkillThe maximum size of a record should be 50,000 characters as measured byString.Length. If you need to break up your data before sending it to the key phraseextractor, consider using the Text Split skill.\r\nIf you do use a text split skill, set the pagelength to 5000 for the best performance.） ImportantNamed entity recognition skill (v2)(Microsoft.Skills.Text.NamedEntityRecognitionSkill) is now discontinued replacedby Microsoft.Skills.Text.V3.EntityRecognitionSkill. Follow the recommendations inDeprecated Azure AI Search skills to migrate to a supported skill.\r\n７ NoteAs you expand scope by increasing the frequency of processing, adding moredocuments, or adding more AI algorithms, you will need to attach a billable AzureAI services resource. Charges accrue when calling APIs in Azure AI services, and forimage extraction as part of the document-cracking stage in Azure AI Search. Thereare no charges for text extraction from documents. Execution of built-in skills ischarged at the existing Azure AI services pay-as-you go price.Image extraction is an extra charge metered by Azure AI Search, as described onthe pricing page. Text extraction is free.@odata.typeData limitsParameters are case-sensitive.Parameter nameDescriptioncategoriesArray of categories that should be extracted.\n"
}