{
  "Id": "10",
  "Title": "\u0022Enhancements and Features in Azure Search REST API 2023\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf2023-07-01-PreviewSearch REST APIAPINew preview version of the Search REST APIs that addssupport for vector search. This API version is inclusive of allpreview features. If you\u0027re using earlier previews, switch to2023-07-01-preview with no loss of functionality.Semantic searchavailabilityFeatureSemantic search is now available on the Basic tier.Item                        TypeDescriptionAzure RBAC (role-based access control)FeatureAnnouncing general availability.2022-09-01Management RESTAPIAPINew stable version of the Management REST APIs, withsupport for configuring search to use Azure RBAC.\r\nTheAz.Search module of Azure PowerShell and Az search moduleof the Azure CLI are updated to support search serviceauthentication options. You can also use the Terraformprovider to configure authentication options (see thisTerraform quickstart for details).Item                        TypeDescriptionMulti-region deployment of AzureAI Search for business continuityand disaster recoverySampleDeployment scripts that fully configure a multi-regional solution for Azure AI Search, withoptions for synchronizing content and requestredirection if an endpoint fails.\r\nMay 2023ﾉExpand tableApril 2023ﾉExpand tableMarch 2023Item                        TypeDescriptionChatGPT \u002B Enterprise data withAzure OpenAI and Azure AISearch (GitHub)SamplePython code and a template for combining Azure AISearch with the large language models in OpenAI.For background, see this Tech Community blog post:Revolutionize your Enterprise Data with ChatGPT. Key points:Use Azure AI Search to consolidate and indexsearchable content.Query the index for initial search results.Assemble prompts from those results and send tothe gpt-35-turbo (preview) model in Azure OpenAI.Return a cross-document answer and providecitations and transparency in your customer-facingapp so that users can assess the response.\n"
}