{
  "Id": "23",
  "Title": "\u0022Enhancing Search Efficiency with Azure AI\u0027s Vector Search Capabilities\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen a user performs a search, the query is summarized into a vectorrepresentation and the vector search engine identifies the most similar documents. ToCan I move, backup, and restore indexes?Can I restore my index or service once it\u0027sdeleted?Can I index from SQL Database replicas?VectorsWhat is vector search?improve efficiency on large databases, vector search often provides the approximatenearest neighbors for a query vector.\r\nSee Vector search overview for the specifics ofAzure AI Search\u0027s vector search product offering.Azure AI Search supports vector indexing and retrieval. It can vectorize query strings andcontent if you use the preview and beta libraries.With standalone vector search, you first use a deep neural network (DNN), such as alarge language model (LLM), to transform content into a vector representation within anembedding space. You can then provide these vectors in a document payload to thesearch index for indexing.\r\nTo serve search requests, you use the same DNN fromindexing to transform the search query into a vector representation, and vector searchfinds the most similar vectors and return the corresponding documents.In Azure AI Search, you can index vector data as fields in documents alongside textualand other types of content. The data type for a vector field is Collection(Edm.Single).Vector queries can be issued standalone or in combination with other query types,including term queries and filters in the same search request.Integrated vectorization is now in public preview.Most existing services support vector search.\r\nIf you\u0027re using a package or API thatsupports vector search and index creation fails, the underlying search service doesn\u0027tsupport vector search, and a new service must be created. This can occur for a smallsubset of services created prior to January 1, 2019. Does Azure AI Search support vector search?How does vector search work in Azure AISearch?Can Azure AI Search vectorize my content orqueries?Does my search service support vector search?Can I add vector search to an existing index?If your search service supports vector search, both existing and new indexes canaccommodate vector fields.We\u0027re rolling out improved vector index size limits worldwide for new search services,but we\u0027re still building out infrastructure capacity in certain regions.\n"
}