{
  "Id": "57",
  "Title": "\u0022Enhancing Search Results with Vector Queries in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you do a keyword search for \u0022classic lodging nearrunning trails, eateries, retail\u0022, results are zero. We use this example to show how youcan get relevant results even if there are no matching terms.\r\nIn this vector query, which is shortened for brevity, the \u0022value\u0022 contains the vectorizedtext of the query input, \u0022fields\u0022 determines which vector fields are searched, and \u0022k\u0022specifies the number of nearest neighbors to return.The vector query string is \u0022classic lodging near running trails, eateries, retail\u0022 - vectorizedinto 1536 embeddings for this query.\r\nHTTPRun queriesSingle vector searchPOST https://{{search-service-name}}.search.windows.net/indexes/{{index-name}}/docs/search?api-version=2023-11-01The response for the vector equivalent of \u0022classic lodging near running trails, eateries,retail\u0022 includes seven results.\r\nEach result provides a search score and the fields listed in\u0022select\u0022. In a similarity search, the response always includes \u0022k\u0022 results ordered by thevalue similarity score.HTTPContent-Type: application/jsonapi-key: {{admin-api-key}}{    \u0022count\u0022: true,    \u0022select\u0022: \u0022HotelId, HotelName, Description, Category\u0022,    \u0022vectors\u0022: [        {            \u0022value\u0022: [0.\r\n01944167, 0.0040178085                . . .                 010858015, -0.017496133],            \u0022k\u0022: 7,            \u0022fields\u0022: \u0022DescriptionVector\u0022,            \u0022kind\u0022: \u0022vector\u0022,            \u0022exhaustive\u0022: true        }    ]}{    \u0022@odata.context\u0022: \u0022https://my-demo-search.search.windows.net/indexes(\u0027hotels-vector-quickstart\u0027)/$metadata#docs(*)\u0022,    \u0022@odata. count\u0022: 7,    \u0022value\u0022: [        {            \u0022@search.score\u0022: 0.857736,            \u0022HotelName\u0022: \u0022Nordick\u0027s Motel\u0022,            \u0022Description\u0022: \u0022Only 90 miles (about 2 hours) from the nation\u0027s capital and nearby most everything the historic valley has to offer.  Hiking? Wine Tasting? Exploring the caverns?  It\u0027s all nearby and we have specially priced packages to help make our B\u0026B your home base for fun while visiting the valley.\n"
}