{
  "Id": "1200",
  "Title": "\u0022Enhancing Azure Search with IsMatchScoring and Filterable Fields\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfismatchscoring with filtersusing and instead of or, but this is functionally equivalent to using the search and$filter parameters in a search request.\r\nFor example, the following two queriesproduce the same result:HTTPIn the REST API, filterable is on by default for simple fields. Filterable fields increaseindex size; be sure to set \u0022filterable\u0022: false for fields that you don\u0027t plan to actuallyuse in a filter. For more information about settings for field definitions, see Create Index.\r\nIn the .NET SDK, the filterable is off by default. You can make a field filterable by settingthe IsFilterable property of the corresponding SearchField object to true. In the nextexample, the attribute is set on the BaseRate property of a model class that maps to theindex definition.\r\nC#You can\u0027t modify existing fields to make them filterable. Instead, you need to add a newfield, or rebuild the index. For more information about rebuilding an index orrepopulating fields, see How to rebuild an Azure AI Search index.# Match on hostels rated higher than 4 OR 5-star motels.$filter=search.\r\nismatchscoring(\u0027hostel\u0027) and Rating ge 4 or search.ismatchscoring(\u0027motel\u0027) and Rating eq 5# Match on \u0027luxury\u0027 or \u0027high-end\u0027 in the description field OR on category exactly equal to \u0027Luxury\u0027.$filter=search.ismatchscoring(\u0027luxury | high-end\u0027, \u0027Description\u0027) or Category eq \u0027Luxury\u0027\u0026$count=true$filter=search. ismatchscoring(\u0027pool\u0027) and Rating ge 4search=pool\u0026$filter=Rating ge 4Field requirements for filtering[IsFilterable, IsSortable, IsFacetable]public double? BaseRate { get; set; }Making an existing field filterableText filters match string fields against literal strings that you provide in the filter:$filter=Category eq \u0027Resort and Spa\u0027Unlike full-text search, there\u0027s no lexical analysis or word-breaking for text filters, socomparisons are for exact matches only.\n"
}