{
  "Id": "1166",
  "Title": "\u0022Enhancing Search Results with Semantic Hybrid Query and Filtering\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo usepostFilter, set the filter processing mode.When you postfilter query results, the number of results might be less than top-n.Assuming that you enabled semantic ranking and your index definition includes asemantic configuration, you can formulate a query that includes vector search, pluskeyword search.\r\nSemantic ranking occurs over the merged result set, adding captionsand answers.HTTPKey points:Semantic hybrid searchPOST https://{{search-service-name}}.search.windows.net/indexes/{{index-name}}/docs/search?api-version=2023-11-01Content-Type: application/jsonapi-key: {{admin-api-key}}{    \u0022vectorQueries\u0022: [        {            \u0022vector\u0022: [                -0.\r\n009154141,                0.018708462,                . . .                 -0.02178128,                -0.\r\n00086512347            ],            \u0022fields\u0022: \u0022contentVector\u0022,            \u0022kind\u0022: \u0022vector\u0022,            \u0022k\u0022: 50        }    ],    \u0022search\u0022: \u0022what azure services support full text search\u0022,    \u0022select\u0022: \u0022title, content, category\u0022,    \u0022queryType\u0022: \u0022semantic\u0022,    \u0022semanticConfiguration\u0022: \u0022my-semantic-config\u0022,    \u0022captions\u0022: \u0022extractive\u0022,    \u0022answers\u0022: \u0022extractive\u0022,    \u0022top\u0022: \u002250\u0022}Semantic ranking accepts up to 50 results from the merged response.\r\nSet \u0022k\u0022 and\u0022top\u0022 to 50 for equal representation of both queries.\u0022queryType\u0022 and \u0022semanticConfiguration\u0022 are required. \u0022captions\u0022 and \u0022answers\u0022 are optional. Values are extracted from verbatim text inthe results. An answer is only returned if the results include content having thecharacteristics of an answer to the query.Here\u0027s the last query in the collection. It\u0027s the same semantic hybrid query as theprevious example, but with a filter.\n"
}