{
  "Id": "86",
  "Title": "\u0022Enhancing Search with OCR and Image Analysis Wizard Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfEnable OCR to add image analysis skills to wizard page.Choose entity recognition (people, organizations, locations) and image analysisskills (tags, captions).Step 2: Add cognitive skillsContinue to the next page.An index contains your searchable content and the Import data wizard can usuallycreate the schema by sampling the data source. In this step, review the generatedschema and potentially revise any settings.For this quickstart, the wizard does a good job setting reasonable defaults:Default fields are based on metadata properties of existing blobs, plus the newfields for the enrichment output (for example, people, organizations, locations).\r\nStep 3: Configure the indexData types are inferred from metadata and by data sampling.Default document key is metadata_storage_path (selected because the fieldcontains unique values).Default attributes are Retrievable and Searchable. Searchable allows full textsearch a field. Retrievable means field values can be returned in results.\r\nThe wizardassumes you want these fields to be retrievable and searchable because youcreated them via a skillset. Select Filterable if you want to use fields in a filterexpression.Marking a field as Retrievable doesn\u0027t mean that the field must be present in the searchresults. You can control search results composition by using the select query parameterto specify which fields to include.\r\nContinue to the next page.The indexer drives the indexing process. It specifies the data source name, a targetindex, and frequency of execution. The Import data wizard creates several objects,including an indexer that you can reset and run repeatedly.Step 4: Configure the indexer1. In the Indexer page, accept the default name and select Once. 2. Select Submit to create and simultaneously run the indexer.Select Indexers from the left navigation pane to monitor status, and then select theindexer. Skills-based indexing takes longer than text-based indexing, especially OCR andimage analysis.To view details about execution status, select Success (or Failed) to view executiondetails.\n"
}