{
  "Id": "6",
  "Title": "\u0022Enhancing Search Capabilities with Azure AI: Latest Updates and Features\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfKey strengths include:Relevance tuning through semantic ranking and scoring profiles.Data integration (crawlers) at the indexing layer.Azure AI integration for transformations that make content text and vectorsearchable.Microsoft Entra security for trusted connections, and Azure Private Link for privateconnections in no-internet scenarios.Full search experience: Linguistic and custom text analysis in 56 languages.Faceting, autocomplete queries and suggested results, and synonyms. TipFor help with complex or custom solutions, contact a partner with deep expertisein Azure AI Search technology.Compare search optionsAzure scale, reliability, and global reach.\r\nWhat\u0027s new in Azure AI SearchArticle•11/27/2023Azure Cognitive Search is now Azure AI Search. Learn about the latest updates toAzure AI Search functionality, docs, and samples.Item                        TypeDescriptionVector search, generallyavailableFeatureVector search is now supported for production workloads.The previous restriction on customer-managed keys (CMK)is now lifted. Prefiltering and exhaustive K-nearestneighbor algorithm are also now generally available.Semantic ranking,generally availableFeatureSemantic ranking (formerly known as \u0022semantic search\u0022) isnow supported for production workloads.\r\nIntegrated vectorization(preview)FeatureAdds data chunking and text-to-vector conversions duringindexing, and also adds text-to-vector conversions atquery time.Import and vectorizedata wizard (preview)FeatureA new wizard in the Azure portal that automates datachunking and vectorization. It targets the 2023-10-01-Preview REST API. Index projections(preview)FeatureA component of a skillset definition that defines the shapeof a secondary index. Index projections are used for a one-to-many index pattern, where content from an enrichmentpipeline can target multiple indexes. You can define indexprojections using the 2023-10-01-Preview REST API, theAzure portal, and any Azure SDK beta packages that areupdated to use this feature.\n"
}