{
  "Id": "1307",
  "Title": "\u0022Enhancing Query Requests with Semantic Ranking in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn this step, add parameters to the query request. To be successful, your query should befull text search (using the search parameter to pass in a string), and the index shouldcontain text fields with rich semantic content and a semantic configuration.Search explorer has been updated to include options for semantic ranking.1. Sign in to the Azure portal.2. Open your search index and select Search explorer.3. There are two ways to specify the query, JSON or options. Using JSON, youcan paste definitions into the query editor:4 - Set up the queryAzure portal4.\r\nUsing options, specify that you want to use semantic ranking and to create aconfiguration. If you don\u0027t see these options, make sure semantic ranking isenabled and also refresh your browser.Only the top 50 matches from the initial results can be semantically ranked. As with allqueries, a response is composed of all fields marked as retrievable, or just those fieldslisted in the select parameter.\r\nA response includes the original relevance score, andmight also include a count, or batched results, depending on how you formulated therequest.In semantic ranking, the response has more elements: a new semantically rankedrelevance score, an optional caption in plain text and with highlights, and an optionalanswer.\r\nIf your results don\u0027t include these extra elements, then your query might bemisconfigured. As a first step towards troubleshooting the problem, check the semanticconfiguration to ensure it\u0027s specified in both the index definition and query.In a client app, you can structure the search page to include a caption as the descriptionof the match, rather than the entire contents of a specific field. This approach is usefulwhen individual fields are too dense for the search results page.The response for the above example query returns the following match as the top pick. Captions are returned because the \u0022captions\u0022 property is set, with plain text andhighlighted versions. Answers are omitted from the example because one couldn\u0027t bedetermined for this particular query and corpus.5 - Evaluate the responseJSONIf your semantic ranking code is using preview APIs, this section explains how to migrateto stable versions.\n"
}