{
  "Id": "1155",
  "Title": "\u0022Enhancing Azure Search with Vector Queries and Filters\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf0018343845,                0.017952163,                0.0025753193,                ...            ]        },        {            \u0022@search.score\u0022: 0.78856903,            \u0022title\u0022: \u0022Azure Application Insights\u0022,            \u0022category\u0022: \u0022Management \u002B Governance\u0022,            \u0022contentVector\u0022: [                -0.\r\n016821077,                0.0037742127,                0.016136652,                ...            ]        },        {            \u0022@search.score\u0022: 0.78650564,            \u0022title\u0022: \u0022Azure Media Services\u0022,            \u0022category\u0022: \u0022Media\u0022,            \u0022contentVector\u0022: [                -0.025449317,                0.\r\n0038463024,                -0.02488436,                ...            ]        }    ]}exclude vector fields from results). The text fields used in the response (\u0022select\u0022:\u0022title, category\u0022) aren\u0027t used during query execution. The match is made onvector data alone. However, a response can include any \u0022retrievable\u0022 field in anindex.\r\nAs such, the inclusion of text fields is helpful because its values are easilyrecognized by users.A query request can include a vector query and a filter expression. Filters apply to\u0022filterable\u0022 text and numeric fields, and are useful for including or excluding searchdocuments based on filter criteria. Although a vector field isn\u0027t filterable itself, a querycan specify filters on other fields in the same index.In newer API versions, you can set a filter mode to apply filters before or after vectorquery execution. For a comparison of each mode and the expected performance basedon index size, see Filters in vector queries. REST API version 2023-11-01 is the stable version for this API. It has:vectorFilterMode for prefilter (default) or postfilter filtering modes.filter provides the criteria.In the following example, the vector is a representation of this query string: \u0022whatAzure services support full text search\u0022. The query targets the \u0022contentVector\u0022 field.The actual vector has 1536 embeddings, so it\u0027s trimmed in this example forreadability.The filter criteria are applied to a filterable text field (\u0022category\u0022 in this example)before the search engine executes the vector query.\n"
}