{
  "Id": "1283",
  "Title": "\u0022Enhancing Search Results with Fuzzy Matching and Hit Highlighting\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBoth tools are interactive, which means you can quickly step throughmultiple variants of a term and evaluate the responses that come back.When results are ambiguous, hit highlighting can help you identify the match in theresponse.Assume the following string exists in a \u0022Description\u0022 field in a search document: \u0022Testqueries with special characters, plus strings for MSFT, SQL and Java.\u0022Start with a fuzzy search on \u0022special\u0022 and add hit highlighting to the Description field:ConsoleIn the response, because you added hit highlighting, formatting is applied to \u0022special\u0022as the matching term.\r\nOutputTry the request again, misspelling \u0022special\u0022 by taking out several letters (\u0022pe\u0022):Testing fuzzy search７ NoteThe use of hit highlighting to identify fuzzy matches has limitations and only worksfor basic fuzzy search. If your index has scoring profiles, or if you layer the querywith more syntax, hit highlighting might fail to identify the match.\r\nExample 1: fuzzy search with the exact termsearch=special~\u0026highlight=Description \u0022@search.highlights\u0022: {     \u0022Description\u0022: [         \u0022Test queries with \u003Cem\u003Especial\u003C/em\u003E characters, plus strings for MSFT, SQL and Java.\u0022     ] ConsoleSo far, no change to the response. Using the default of 2 degrees distance, removingtwo characters \u0022pe\u0022 from \u0022special\u0022 still allows for a successful match on that term.\r\nOutputTrying one more request, further modify the search term by taking out one last characterfor a total of three deletions (from \u0022special\u0022 to \u0022scal\u0022):ConsoleNotice that the same response is returned, but now instead of matching on \u0022special\u0022,the fuzzy match is on \u0022SQL\u0022. OutputThe point of this expanded example is to illustrate the clarity that hit highlighting canbring to ambiguous results. In all cases, the same document is returned. Had you reliedon document IDs to verify a match, you might have missed the shift from \u0022special\u0022 to\u0022SQL\u0022.How full text search works in Azure Cognitive Search (query parsing architecture)Search explorerHow to query in .\n"
}