{
  "Id": "16",
  "Title": "\u0022Enhancing Search Experience with Azure AI Search Features\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCategory                           FeaturesFree-form text searchFull-text search is a primary use case for most search-based apps.Queries can be formulated using a supported syntax.Simple query syntax provides logical operators, phrase searchoperators, suffix operators, precedence operators.Full Lucene query syntax includes all operations in simple syntax,with extensions for fuzzy search, proximity search, term boosting,and regular expressions.RelevanceSimple scoring is a key benefit of Azure AI Search. Scoring profilesare used to model relevance as a function of values in thedocuments themselves.\r\nFor example, you might want newerproducts or discounted products to appear higher in the searchresults. You can also build scoring profiles using tags forpersonalized scoring based on customer search preferences you\u0027vetracked and stored separately.Semantic ranking is premium feature that reranks results based onsemantic relevance to the query. Depending on your content andscenario, it can significantly improve search relevance with almostminimal configuration or effort.Query and user experienceCategory                           FeaturesGeospatial searchGeospatial functions filter over and match on geographiccoordinates. You can match on distance or by inclusion in a polygonshape.\r\nFilters and facetsFaceted navigation is enabled through a single query parameter.Azure AI Search returns a faceted navigation structure you can useas the code behind a categories list, for self-directed filtering (forexample, to filter catalog items by price-range or brand).\r\nFilters can be used to incorporate faceted navigation into yourapplication\u0027s UI, enhance query formulation, and filter based onuser- or developer-specified criteria. Create filters using the ODatasyntax.User experienceAutocomplete can be enabled for type-ahead queries in a searchbar.Search suggestions also works off of partial text inputs in a searchbar, but the results are actual documents in your index rather thanquery terms. Synonyms associates equivalent terms that implicitly expand thescope of a query, without the user having to provide the alternateterms.Hit highlighting applies text formatting to a matching keyword insearch results. You can choose which fields return highlightedsnippets.Sorting is offered for multiple fields via the index schema and thentoggled at query-time with a single search parameter.Paging and throttling your search results is straightforward with thefinely tuned control that Azure AI Search offers over your searchresults.Category                           FeaturesData encryptionMicrosoft-managed encryption-at-rest is built into the internalstorage layer and is irrevocable.\n"
}