{
  "Id": "646",
  "Title": "\u0022Enhanced Azure Cognitive Search .NET SDK Version 11\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfVersion 11 is more consistent in terms of Azureprogrammability. Some examples include AzureKeyCredential key authentication, andSystem.Text.Json.Serialization for JSON serialization.As with previous versions, you can use this library to:Create and manage search indexes, data sources, indexers, skillsets, and synonymmapsLoad and manage search documents in an indexExecute queries, all without having to deal with the details of HTTP and JSONInvoke and manage AI enrichment (skillsets) and outputsThe library is distributed as a single Azure.Search.Documents NuGet package, whichincludes all APIs used for programmatic access to a search service.\r\nThe client library defines classes like SearchIndex, SearchField, and SearchDocument, aswell as operations like SearchIndexClient.CreateIndex and SearchClient.Search on theSearchIndexClient and SearchClient classes. These classes are organized into thefollowing namespaces:Azure.Search.DocumentsAzure.Search.Documents.IndexesAzure.Search.Documents.Indexes.ModelsAzure.Search.Documents.ModelsAzure.Search.Documents (version 11) targets the 2020-06-30 search servicespecification.The client library doesn\u0027t provide service management operations, such as creating andscaling search services and managing API keys. If you need to manage your searchAbout version 11resources from a .\r\nNET application, use the Microsoft.Azure.Management.Search libraryin the Azure SDK for .NET.If you have been using the previous version of the .NET SDK and you\u0027d like to upgradeto the current generally available version, see Upgrade to Azure Cognitive Search .NETSDK version 11.Visual Studio 2019 or later.Your own Azure Cognitive Search service. In order to use the SDK, you\u0027ll need thename of your service and one or more API keys. Create a service in the portal if youdon\u0027t have one.Download the Azure.Search.Documents package using Tools \u003E NuGet PackageManager \u003E Manage NuGet Packages for Solution in Visual Studio. Search for thepackage name Azure.Search.Documents.\n"
}