{
  "Id": "1148",
  "Title": "\u0022Enhancing User Experience with Azure Search Methods and Navigation\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfInputExperienceSearch methodA user types the terms or phrases into a search box, with or without operators,and clicks Search to send the request. Search can be used with filters on thesame request, but not with autocomplete or suggestions.AutocompletemethodA user types a few characters, and queries are initiated after each new characteris typed.\r\nThe response is a completed string from the index. If the stringprovided is valid, the user clicks Search to send that query to the service.SuggestionsmethodAs with autocomplete, a user types a few characters and incremental queries aregenerated. The response is a dropdown list of matching documents, typicallyrepresented by a few unique or descriptive fields.\r\nIf any of the selections arevalid, the user clicks one and the matching document is returned.FacetednavigationA page shows clickable navigation links or breadcrumbs that narrow the scopeof the search. A faceted navigation structure is composed dynamically based onan initial query. For example, search=* to populate a faceted navigation treecomposed of every possible category. A faceted navigation structure is createdfrom a query response, but it\u0027s also a mechanism for expressing the next query.n REST API reference, facets is documented as a query parameter of a SearchDocuments operation, but it can be used without the search parameter.\r\nFilter methodFilters are used with facets to narrow results. You can also implement a filterbehind the page, for example to initialize the page with language-specific fields.In REST API reference, $filter is documented as a query parameter of a SearchDocuments operation, but it can be used without the search parameter. If you\u0027re familiar with query types and composition, you might remember that theparameters on a query request depend on field attributes in an index. For example, onlyfields marked as searchable and retrievable can be used in queries and search results.When setting the search, filter, and orderby parameters in your request, you shouldcheck attributes to avoid unexpected results.\n"
}