{
  "Id": "395",
  "Title": "\u0022Enhancing Search Capabilities with Azure AI Vector Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor eitherapproach, Azure AI Search returns documents with the requested k nearest neighbors(kNN) in the results.Azure AI Search supports hybrid scenarios. You can index vector data as fields indocuments alongside alphanumeric content. Vector queries can be issued singly or incombination with filters and other query types, including term queries and semanticranking in the same search request.\r\nVector search is available as part of all Azure AI Search tiers in all regions at no extracharge.Newer services created after July 1, 2023 support higher quotas for vector indexes.Availability and pricing７ NoteSome older search services created before January 1, 2019 are deployed oninfrastructure that doesn\u0027t support vector workloads.\r\nIf you try to add a vector fieldto a schema and get an error, it\u0027s a result of outdated services. In this situation, youmust create a new search service to try out the vector feature.Scenarios for vector search include:Vector search for text.\r\nEncode text using embedding models such as OpenAIembeddings or open source models such as SBERT, and retrieve documents withqueries that are also encoded as vectors.Vector search across different data types (multi-modal). Encode images, text,audio, and video, or even a mix of them (for example, with models like CLIP) anddo a similarity search across them.Multi-lingual search.\r\nUse a multi-lingual embeddings model to represent yourdocument in multiple languages in a single vector space to find documentsregardless of the language they are in.Hybrid search. Vector search is implemented at the field level, which means youcan build queries that include both vector fields and searchable text fields. Thequeries execute in parallel and the results are merged into a single response. Optionally, add semantic ranking for even more accuracy with L2 reranking usingthe same language models that power Bing.Filtered vector search. A query request can include a vector query and a filterexpression. Filters apply to text and numeric fields, and are useful for metadatafilters, and including or excluding search documents based on filter criteria.\n"
}