{
  "Id": "7",
  "Title": "\u0022Enhancements and Features in Azure Search: 2023 Updates\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIndex projections(preview)FeatureA component of a skillset definition that defines the shapeof a secondary index. Index projections are used for a one-to-many index pattern, where content from an enrichmentpipeline can target multiple indexes. You can define indexprojections using the 2023-10-01-Preview REST API, theAzure portal, and any Azure SDK beta packages that areupdated to use this feature.\r\n2023-11-01 Search RESTAPIAPINew stable version of the Search REST APIs for vectorfields, vector queries, and semantic ranking. See UpgradeREST APIs for migration steps to generally availablefeatures.2023-11-01 ManagementREST APIAPINew stable version of the Management REST APIs forcontrol plane operations. This version adds APIs thatenable or disable semantic ranking.Azure OpenAIEmbedding skill (preview)SkillConnects to a deployed embedding model on your AzureOpenAI resource to generate embeddings during skillsetNovember 2023ﾉExpand tableItem                        TypeDescriptionexecution.\r\nThis skill is available through the 2023-10-01-Preview REST API, the Azure portal, and any Azure SDKbeta packages that are updated to use this feature.Text Split skill (preview)SkillUpdated in 2023-10-01-Preview to support native datachunking.\r\nHow vector search andsemantic rankingimprove your GPTpromptsVideoWatch this short video to learn how hybrid retrieval givesyou optimal grounding data for generating useful AIresponses and enables search over both concepts andkeywords.Access Control inGenerative AIapplicationsBlogExplains how to use Microsoft Entra ID and MicrosoftGraph API to roll out granular user permissions onchunked content in your index. Item                        TypeDescription\u0022Chat with your data\u0022solution acceleratorSampleEnd-to-end RAG pattern that uses Azure AI Search as aretriever. It provides indexing, data chunking, orchestrationand chat based on Azure OpenAI GPT.Exhaustive K-NearestNeighbors (KNN)FeatureExhaustive K-Nearest Neighbors (KNN) is a new scoringalgorithm for similarity search in vector space.\n"
}