{
  "Id": "428",
  "Title": "\u0022Enhancing Search Relevance and Pagination in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe value used as sessionId cannot start with a \u0027_\u0027 character.Relevance tuningfeaturesMode parameter (preview)Similarity score, or a measure of how similar the content of the field is, relative tothe query termTerm frequency, or the number of times the query term was found in the fieldFor a query that targets the \u0022description\u0022 and \u0022title\u0022 fields, a response that includes@search.\r\nfeatures might look like this:JSONYou can consume these data points in custom scoring solutions or use theinformation to debug search relevance problems.By default, if you aren\u0027t using pagination, the search engine returns the top 50 highestranking matches for full text search.\r\nYou can use the top parameter to return a smalleror larger number of items (up to 1000 in a single response). Full text search is subject toa maximum limit of 1,000 matches (see API response limits). Once 1,000 matches arefound, the search engine no longer looks for more.To return more or less results, use the paging parameters top, skip, and next.\r\nPaging ishow you determine the number of results on each logical page and navigate throughthe full payload. For more information, see How to work with search results.\u0022value\u0022: [ {    \u0022@search.score\u0022: 5.1958685,    \u0022@search.features\u0022: {        \u0022description\u0022: {            \u0022uniqueTokenMatches\u0022: 1. 0,            \u0022similarityScore\u0022: 0.29541412,            \u0022termFrequency\u0022 : 2        },        \u0022title\u0022: {            \u0022uniqueTokenMatches\u0022: 3.0,            \u0022similarityScore\u0022: 1.75451557,            \u0022termFrequency\u0022 : 6        }    } }]Number of ranked results in a full text queryresponseSee alsoScoring ProfilesREST API ReferenceSearch Documents APIAzure Cognitive Search .\n"
}