{
  "Id": "1163",
  "Title": "\u0022Enhancing Search Capabilities with Azure\u0027s Vector Search Feature\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUse Search Post REST API version 2023-11-01, Search Explorer in the Azure portal,or packages in the Azure SDKs that have been updated to use this feature.(Optional) If you want to also use semantic ranking and vector search together,your search service must be Basic tier or higher, with semantic ranking enabled.\r\nThe stable version (2023-11-01) of vector search doesn\u0027t provide built-in vectorization ofthe query input string. Encoding (text-to-vector) of the query string requires that youpass the query string to an external embedding model for vectorization. You would thenpass the response to the search engine for similarity search over vector fields.\r\nThe preview version (2023-10-01-Preview) of vector search adds integratedvectorization. If you want to explore this feature, create and assign a vectorizer to getbuilt-in embedding of query strings.All results are returned in plain text, including vectors in fields marked as retrievable.\r\nBecause numeric vectors aren\u0027t useful in search results, choose other fields in the indexas a proxy for the vector match. For example, if an index has \u0022descriptionVector\u0022 andPrerequisitesTips\u0022descriptionText\u0022 fields, the query can match on \u0022descriptionVector\u0022 but the searchresult can show \u0022descriptionText\u0022. Use the select parameter to specify only human-readable fields in the results.\r\nA hybrid query combines full text search and vector search, where the \u0022search\u0022parameter takes a query string and \u0022vectors.value\u0022 takes the vector query. The searchengine runs full text and vector queries in parallel. All matches are evaluated forrelevance using Reciprocal Rank Fusion (RRF) and a single result set is returned in theresponse. Hybrid queries are useful because they add support for all query capabilities, includingorderby and semantic ranking. For example, in addition to the vector query, you couldsearch over people or product names or titles, scenarios for which similarity search isn\u0027ta good fit.The following example is from the Postman collection of REST APIs that demonstratehybrid query configurations.\n"
}