{
  "Id": "1487",
  "Title": "\u0022Enhancing Search Experience with Azure AI Enrichment and Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearchable data can be in the form of text or vectors and ingested as-is from a datasource or enriched by using AI to improve the overall search experience. Developers canconvert data to vectors by using external machine learning models they call, andindexers can optionally include skill sets that support a powerful suite of dataenrichment capabilities by using several Azure AI Language services, such as NamedEntity Recognition (NER) and personally identifiable information (PII) detection, andAzure AI Vision services, including optical character recognition (OCR) and imageanalysis.\r\nWhat is a Transparency Note?The basics of Azure AI SearchIntroductionSee the following tabs for more information about how Azure AI Search improves thesearch experience by using Azure AI Services or other AI systems to better understandthe intent, semantics, and implied structure of a customer\u0027s content.AI enrichment is the application of machine learning models from Azure AI Servicesover content that is not easily searchable in its raw form. Through enrichment,analysis and inference are used to create searchable content and structure wherenone previously existed.\r\nAI enrichment is an optional extension of the Azure AI Search indexer pipeline thatconnects to Azure AI Services in the same region as a customer\u0027s search service. Anenrichment pipeline has the same core components as a typical indexer (indexer,data source, index), plus a skill set that specifies the atomic enrichment steps. A skillset can be assembled by using built-in skills based on the Azure AI Services APIs,such as Computer Vision and Language Service, or custom skills that run externalcode that you provide.Several built-in skills for AI enrichment in Azure AI Search take advantage of AzureAI Services. See the Transparency Notes for each built-in skill linked below forconsiderations when choosing to use a skill:Key Phrase Extraction Skill: Language Service - Key Phrase ExtractionLanguage Detection Skill: Language Service - Language DetectionEntity Linking Skill: Language Service - Entity LinkingEntity Recognition Skill: Language Service - Named Entity Recognition (NER)PII Detection Skill:\n"
}