{
  "Id": "727",
  "Title": "\u0022Enhancing Search with Typeahead and Suggestions in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA suggester provides a list of fields that undergo extra tokenization,generating prefix sequences to support matches on partial terms. For example, asuggester that includes a City field with a value for \u0022Seattle\u0022 will have prefixcombinations of \u0022sea\u0022, \u0022seat\u0022, \u0022seatt\u0022, and \u0022seattl\u0022 to support typeahead.Matches on partial terms can be either an autocompleted query or a suggested match.The same suggester supports both experiences.Typeahead can be autocomplete, which completes a partial input for a whole term query,or suggestions that invite click through to a particular match. Autocomplete produces aquery.\r\nSuggestions produce a matching document.The following screenshot from Create your first app in C# illustrates both. Autocompleteanticipates a potential term, finishing \u0022tw\u0022 with \u0022in\u0022. Suggestions are mini search results,where a field like hotel name represents a matching hotel search document from theindex. For suggestions, you can surface any field that provides descriptive information.You can use these features separately or together. To implement these behaviors inAzure Cognitive Search, there\u0027s an index and query component.Add a suggester to a search index definition. The remainder of this article isfocused on creating a suggester.\r\nTypeahead experiences in Cognitive SearchCall a suggester-enabled query, in the form of a Suggestion request orAutocomplete request, using one of the APIs listed below.Search-as-you-type support is enabled on a per-field basis for string fields. You canimplement both typeahead behaviors within the same search solution if you want anexperience similar to the one indicated in the screenshot. Both requests target thedocuments collection of specific index and responses are returned after a user hasprovided at least a three character input string.To create a suggester, add one to an index definition. A suggester takes a name and acollection of fields over which the typeahead experience is enabled.\n"
}