{
  "Id": "376",
  "Title": "\u0022Enhancing Enterprise Data with Azure AI Search and Python\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfLoad documentsDemonstrates how to upload or merge documents into an index ina data import operation.SDK samplesSamplesDescriptionSimple queryDemonstrates how to set up a basic query.Filter queryDemonstrates setting up a filter expression.Facet queryDemonstrates working with facets.Vector searchDemonstrates how to get embeddings from a description field andthen send vector queries against the data.Code samples from the Azure AI Search team demonstrate features and workflows.Many of these samples are referenced in tutorials, quickstarts, and how-to articles. Youcan find these samples in Azure-Samples/azure-search-python-samples on GitHub.\r\nSamplesArticlequickstartSource code for the Python portion of Quickstart: Full text search using theAzure SDKs. This article covers the basic workflow for creating, loading, andquerying a search index using sample data.search-website-functions-v4Source code for Tutorial: Add search to web apps.\r\nDemonstrates an end-to-end search app that includes a rich client plus components for hosting theapp and handling search requests.tutorial-ai-enrichmentSource code for Tutorial: Use Python and AI to generate searchable contentfrom Azure blobs. This article shows how to create a blob indexer with acognitive skillset, where the skillset creates and transforms raw content tomake it searchable or consumable.\r\nA demo repo provides proof-of-concept source code for examples or scenarios shownin demonstrations. Demo solutions aren\u0027t designed for adaptation by customers.RepositoryDescriptionazure-search-vector-python-sample.ipynbUses the azure.search.documents library in the Azure SDK forPython to generate embeddings, create and load an index, and runseveral vector queries. For more vector search Python demos, seecognitive-search-vector-pr/demo-python.ChatGPT \u002B Enterprise datawith Azure OpenAI andPython code showing how to use Azure AI Search with the largelanguage models in Azure OpenAI. For background, see this TechDoc samplesDemosRepositoryDescriptionCognitive SearchCommunity blog post: Revolutionize your Enterprise Data withChatGPT.\n"
}