{
  "Id": "1508",
  "Title": "\u0022Enhancing Azure Cognitive Search with MSAL.NET and OpenTelemetry\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIdentity is out of box for supporting MSAL.NET.- Support [OpenTelemetry](https://opentelemetry.io/) for distributed tracing.- HTTP pipeline with custom policies.- Better error-handling.- Support uniform telemetry across all languages.Getting startedInstall the packagedotnet add package Azure.ResourceManager.SearchPrerequisitesAuthenticate the ClientKey concepts of the Microsoft Azure SDK for .NET can be found here.Documentation is available to help you learn how to use this package:Quickstart.API References.Authentication.Code samples for using the management library for .NET can be found in the followinglocations.NET Management Library Code SamplesFile an issue via GitHub Issues.\r\nCheck previous questions or ask new ones on Stack Overflow using Azure and.NET tags.For more information about Microsoft Azure SDK, see this website.For details on contributing to this repository, see the contributing guide.This project welcomes contributions and suggestions. Most contributions require you toagree to a Contributor License Agreement (CLA) declaring that you have the right to,and actually do, grant us the rights to use your contribution. For details, visithttps://cla.microsoft.com.When you submit a pull request, a CLA-bot will automatically determine whether youneed to provide a CLA and decorate the PR appropriately (for example, label, comment).\r\nKey conceptsDocumentationExamplesTroubleshootingNext stepsContributingFollow the instructions provided by the bot. You\u0027ll only need to do this action onceacross all repositories using our CLA.This project has adopted the Microsoft Open Source Code of Conduct. For moreinformation, see the Code of Conduct FAQ or contact opencode@microsoft.com withany other questions or comments. Azure Cognitive Search client library forJava - version 11.6.0Article•11/14/2023This is the Java client library for Azure Cognitive Search. Azure Cognitive Search serviceis a search-as-a-service cloud solution that gives developers APIs and tools for adding arich search experience over private, heterogeneous content in web, mobile, andenterprise applications.\n"
}