{
  "Id": "439",
  "Title": "\u0022Enhancing Search Relevance with Semantic Ranking in Azure AI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfwindows.net/indexes/{{index-name}}/docs/search?api-version=2023-11-01Content-Type: application/jsonapi-key: {{admin-api-key}}{Learn more about hybrid searchLearn more about vector search   \u0022queryType\u0022:\u0022semantic\u0022,   \u0022search\u0022:\u0022hello world\u0022,   \u0022searchFields\u0022:\u0022field_a, field_b\u0022,   \u0022vectorQueries\u0022: [       {           \u0022kind\u0022:\u0022vector\u0022,           \u0022vector\u0022: [1.\r\n0, 2.0, 3.0],           \u0022fields\u0022: \u0022field_c, field_d\u0022       },       {           \u0022kind\u0022:\u0022vector\u0022,           \u0022vector\u0022: [4.0, 5.0, 6.0],           \u0022fields\u0022: \u0022field_d, field_e\u0022       }   ],   \u0022scoringProfile\u0022:\u0022my_scoring_profile\u0022}See alsoSemantic ranking in Azure AI SearchArticle•11/15/2023In Azure AI Search, semantic ranking measurably improves search relevance by usinglanguage understanding to rerank search results.\r\nThis article is a high-level introductionto semantic ranking. The embedded video describes the technology, and the section atthe end covers availability and pricing.Semantic ranking is a premium feature, billed by usage.\r\nWe recommend this article forbackground, but if you\u0027d rather get started, follow these steps:Semantic ranking is a collection of query-related capabilities that improve the quality ofan initial BM25-ranked or RRF-ranked search result for text-based queries. When youenable it on your search service, semantic ranking extends the query execution pipelinein two ways:First, it adds secondary ranking over an initial result set that was scored usingBM25 or RRF. This secondary ranking uses multi-lingual, deep learning modelsadapted from Microsoft Bing to promote the most semantically relevant results. Second, it extracts and returns captions and answers in the response, which youcan render on a search page to improve the user\u0027s search experience.Here are the features of semantic ranking.FeatureDescriptionSemanticrankingUses the context or semantic meaning of a query to compute a new relevancescore over preranked results.Check regional availability.＂Enable semantic ranking on your search service.＂Create or modify queries to return semantic captions and highlights.＂Add a few more query properties to also return semantic answers.＂７ NoteLooking for vector support and similarity search? See Vector search in Azure AISearch for details.\n"
}