{
  "Id": "519",
  "Title": "\u0022Enrichment Pipelines and Knowledge Store: Shaping and Storing Data\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis flexibility opens up new scenarios for consuming the analyzedand enriched content produced by an enrichment pipeline.The same skillset that enriches data can also be used to shape data. Some tools likePower BI work better with tables, whereas a data science workload might require acomplex data structure in a blob format. Adding a Shaper skill to a skillset gives youcontrol over the shape of your data. You can then pass these shapes to projections,either tables or blobs, to create physical data structures that align with the data\u0027sintended use.The following video explains both of these benefits and more.\r\nA knowledge store is defined inside a skillset definition and it has two components:A connection string to Azure StorageBenefits of knowledge storehttps://www.youtube-nocookie.com/embed/XWzLBP8iWqg?version=3Knowledge store definitionProjections that determine whether the knowledge store consists of tables, objectsor files. The projections element is an array.\r\nYou can create multiple sets of table-object-file combinations within one knowledge store.JSONThe type of projection you specify in this structure determines the type of storage usedby knowledge store, but not its structure. Fields in tables, objects, and files aredetermined by Shaper skill output if you\u0027re creating the knowledge storeprogrammatically, or by the Import data wizard if you\u0027re using the portal. tables project enriched content into Table Storage. Define a table projection whenyou need tabular reporting structures for inputs to analytical tools or export asdata frames to other data stores. You can specify multiple tables within the sameprojection group to get a subset or cross section of enriched documents. Withinthe same projection group, table relationships are preserved so that you can workwith all of them.Projected content is not aggregated or normalized. The following screenshotshows a table, sorted by key phrase, with the parent document indicated in theadjacent column.\n"
}