{
  "Id": "311",
  "Title": "\u0022Enrichment Steps for Content: Create Skillset and Built-in Skills\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCall Create Skillset to specify which enrichment steps are applied to your content.1. Select the \u0022Create a skillset\u0022 request.2. The body of the request specifies the following built-in skills:SkillDescriptionOpticalCharacterRecognitionRecognizes text and numbers in image files.\r\nText MergeCreates \u0022merged content\u0022 that recombines previously separated content,useful for documents with embedded images (PDF, DOCX, and so forth).Images and text are separated during the document cracking phase. Themerge skill recombines them by inserting any recognized text, imagecaptions, or tags created during enrichment into the same location wherethe image was extracted from in the document.\r\nWhen you\u0027re working with merged content in a skillset, this node will beinclusive of all text in the document, including text-only documents thatnever undergo OCR or image analysis.LanguageDetectionDetects the language and outputs either a language name or code.\r\nInmultilingual data sets, a language field can be useful for filters.EntityRecognitionExtracts the names of people, organizations, and locations from mergedcontent.Text SplitBreaks large merged content into smaller chunks before calling the keyphrase extraction skill. Key phrase extraction accepts inputs of 50,000characters or less.\r\nA few of the sample files need splitting up to fit withinthis limit.Key PhraseExtractionPulls out the top key phrases.    \u0022name\u0022 : \u0022{{container_name}}\u0022  }}Step 2: Create a skillsetEach skill executes on the content of the document. During processing, Azure AISearch cracks each document to read content from different file formats. Foundtext originating in the source file is placed into a generated content field, one foreach document. As such, the input becomes \u0022/document/content\u0022.For key phrase extraction, because we use the text splitter skill to break larger filesinto pages, the context for the key phrase extraction skill is \u0022document/pages/*\u0022(for each page in the document) instead of \u0022/document/content\u0022.JSON{  \u0022description\u0022: \u0022Apply OCR, detect language, extract entities, and extract key-phrases.\u0022,  \u0022cognitiveServices\u0022: null,  \u0022skills\u0022:  [    {      \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Vision.\n"
}