{
  "Id": "1026",
  "Title": "\u0022Enrichment and Custom Skills in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you have multipleskills that return the same output, use the \u0022targetName\u0022 for name disambiguationin enrichment node paths. If the target name is unspecified, the name property isused for both.Some situations call for referencing each element of an array separately. For example,suppose you want to pass each element of \u0022/document/orgs\u0022 separately to another skill.\r\nTo do so, add an asterisk to the path: \u0022/document/orgs/*\u0022.Skill output is written to the enriched document as a new node in the enrichment tree. Itmight be a simple value, such as a sentiment score or language code. It could also be acollection, such as a list of organizations, people, or locations.\r\nSkill output can also be acomplex structure, as is the case with the Shaper skill. The inputs of the skill determinethe composition of the shape, but the output is the named object, which can bereferenced in a search index, a knowledge store projection, or another skill by its name.This section includes an example of a custom skill.\r\nThe URI points to an Azure Function,which in turn invokes the model or transformation that you provide. For moreinformation, see Define a custom interface.Although the custom skill is executing code that is external to the pipeline, in a skillsarray, it\u0027s just another skill. Like the built-in skills, it has a type, context, inputs, andoutputs.\r\nIt also reads and writes to an enrichment tree, just as the built-in skills do.Notice that the \u0022context\u0022 field is set to \u0022/document/orgs/*\u0022 with an asterisk, meaning theenrichment step is called for each organization under \u0022/document/orgs\u0022.Output, such as the company description in this example, is generated for eachorganization that\u0027s identified. When referring to the node in a downstream step (forexample, in key phrase extraction), you would use the path\u0022/document/orgs/*/companyDescription\u0022 to do so.JSON    }]Add a custom skillAlthough skill output can be optionally cached for reuse purposes, it\u0027s usually temporaryand exists only while skill execution is in progress.\n"
}