{
  "Id": "518",
  "Title": "\u0022Enriched Content Creation and Flexible Data Access in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027ve used cognitive skills in the past, you already know that enriched content iscreated by skillsets. Skillsets move a document through a sequence of enrichments thatinvoke atomic transformations, such as recognizing entities or translating text.Output is always a search index, but it can also be projections in a knowledge store. Thetwo outputs, search index and knowledge store, are mutually exclusive products of thesame pipeline. They are derived from the same inputs, but their content is structured,stored, and used in different applications.Physically, a knowledge store is Azure Storage, either Azure Table Storage, Azure BlobStorage, or both.\r\nAny tool or process that can connect to Azure Storage can consumethe contents of a knowledge store.Viewed through Azure portal, a knowledge store looks like any other collection oftables, objects, or files. The following screenshot shows a knowledge store composed ofthree tables. You can adopt a naming convention, such as a \u0022kstore\u0022 prefix, to keep yourcontent together.\r\nThe primary benefits of a knowledge store are two-fold: flexible access to content, andthe ability to shape data.Unlike a search index that can only be accessed through queries in Cognitive Search, aknowledge store can be accessed by any tool, app, or process that supports connectionsto Azure Storage. This flexibility opens up new scenarios for consuming the analyzedand enriched content produced by an enrichment pipeline.The same skillset that enriches data can also be used to shape data. Some tools likePower BI work better with tables, whereas a data science workload might require acomplex data structure in a blob format. Adding a Shaper skill to a skillset gives youcontrol over the shape of your data. You can then pass these shapes to projections,either tables or blobs, to create physical data structures that align with the data\u0027sintended use.The following video explains both of these benefits and more.\n"
}