{
  "Id": "520",
  "Title": "\u0022Enriched Content Projection and Storage in Azure Knowledge Store\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdftables project enriched content into Table Storage. Define a table projection whenyou need tabular reporting structures for inputs to analytical tools or export asdata frames to other data stores. You can specify multiple tables within the sameprojection group to get a subset or cross section of enriched documents. Withinthe same projection group, table relationships are preserved so that you can workwith all of them.Projected content is not aggregated or normalized. The following screenshotshows a table, sorted by key phrase, with the parent document indicated in theadjacent column.\r\nIn contrast with data ingestion during indexing, there is nolinguistic analysis or aggregation of content. Plural forms and differences in casingare considered unique instances.\u0022knowledgeStore\u0022: {     \u0022storageConnectionString\u0022:\u0022\u003CYOUR-AZURE-STORAGE-ACCOUNT-CONNECTION-STRING\u003E\u0022,     \u0022projections\u0022:[        {           \u0022tables\u0022:[ ],           \u0022objects\u0022:[ ],           \u0022files\u0022:[ ]        }     ] } objects project JSON document into Blob storage.\r\nThe physical representation ofan object is a hierarchical JSON structure that represents an enriched document.files project image files into Blob storage. A file is an image extracted from adocument, transferred intact to Blob storage.\r\nAlthough it is named \u0022files\u0022, it showsup in Blob Storage, not file storage.To create knowledge store, use the portal or an API.You\u0027ll need Azure Storage, a skillset, and an indexer. Because indexers require a searchindex, you\u0027ll also need to provide an index definition.Go with the portal approach for the fastest route to a finished knowledge store. Or,choose the REST API for a deeper understanding of how objects are defined and related.Create your first knowledge store in four steps using the Import data wizard.1. Define a data source that contains the data you want to enrich.2. Define a skillset. The skillset specifies enrichment steps and the knowledgestore.3. Define an index schema. You might not need one, but indexers require it. Thewizard can infer an index.4. Complete the wizard. Data extraction, enrichment, and knowledge storecreation occur in this last step.The wizard automates several tasks. Specifically, both shaping and projections(definitions of physical data structures in Azure Storage) are created for you.Once enriched content exists in storage, any tool or technology that connects to AzureStorage can be used to explore, analyze, or consume the contents.\n"
}