{
  "Id": "484",
  "Title": "\u0022Enriching Data with Azure Search: Field and Skillset Mapping\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen you define a field mapping, thevalue of the source field is sent as-is to the destination field with no modifications.Skillset execution is an optional step that invokes built-in or custom AI processing.Skillsets can add optical character recognition (OCR) or other forms of image analysis ifthe content is binary. Skillsets can also add natural language processing. For example,you can add text translation or key phrase extraction.Whatever the transformation, skillset execution is where enrichment occurs. If an indexeris a pipeline, you can think of a skillset as a \u0022pipeline within the pipeline\u0022.\r\nStage 2: Field mappingsStage 3: Skillset executionStage 4: Output field mappingsIf you include a skillset, you\u0027ll need to specify output field mappings in the indexerdefinition. The output of a skillset is manifested internally as a tree structure referred toas an enriched document. Output field mappings allow you to select which parts of thistree to map into fields in your index.\r\nDespite the similarity in names, output field mappings and field mappings buildassociations from different sources. Field mappings associate the content of source fieldto a destination field in a search index. Output field mappings associate the content ofan internal enriched document (skill outputs) to destination fields in the index. Unlikefield mappings, which are considered optional, an output field mapping is required forany transformed content that should be in the index.The next image shows a sample indexer debug session representation of the indexerstages: document cracking, field mappings, skillset execution, and output fieldmappings.Indexers can offer features that are unique to the data source. In this respect, someaspects of indexer or data source configuration will vary by indexer type. However, allindexers share the same basic composition and requirements. Steps that are common toall indexers are covered below.\n"
}