{
  "Id": "505",
  "Title": "\u0022Enriching Azure Blob Storage Data with Metadata and Skills\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe indexer adds metadata fields from Blob storage, and skills addtranslated text, sentiment scores, and key phrase detection.In the hotel reviews example, a \u0022document\u0022 within the enrichment process represents a single hotelreview.Indexer definitionEnrichment exampleConceptually, the initial enrichment tree looks as follows:The root node for all enrichments is \u0022/document\u0022.\r\nWhen you\u0027re working with blob indexers, the\u0022/document\u0022 node will have child nodes of \u0022/document/content\u0022 and \u0022/document/normalized_images\u0022.When the data is CSV, as in this example, the column names will map to nodes beneath \u0022/document\u0022.When source content consists of large chunks of text, it\u0027s helpful to break it into smaller componentsfor greater accuracy of language, sentiment, and key phrase detection.\r\nThere are two grains available:pages and sentences. A page consists of approximately 5000 characters.A text split skill is typically first in a skillset.JSON TipYou can create a search index and knowledge store for this data in Azure portal or throughPostman and the REST APIs.\r\nYou can also use Debug Sessions for insights into skillsetcomposition, dependencies, and effects on an enrichment tree. Images in this article are pulledfrom Debug Sessions.Skill #1: Split skill\u0022@odata.type\u0022: \u0022#Microsoft.Skills.Text.\r\nSplitSkill\u0022,\u0022name\u0022: \u0022#1\u0022,\u0022description\u0022: null,\u0022context\u0022: \u0022/document/reviews_text\u0022,\u0022defaultLanguageCode\u0022: \u0022en\u0022,\u0022textSplitMode\u0022: \u0022pages\u0022,\u0022maximumPageLength\u0022: 5000,\u0022inputs\u0022: [{    \u0022name\u0022: \u0022text\u0022,    \u0022source\u0022: \u0022/document/reviews_text\u0022}With the skill context of \u0022/document/reviews_text\u0022, the split skill executes once for the reviews_text.The skill output is a list where the reviews_text is chunked into 5000 character segments. The outputfrom the split skill is named pages and it\u0027s added to the enrichment tree. The targetName featureallows you to rename a skill output before being added to the enrichment tree.The enrichment tree now has a new node placed under the context of the skill. This node is availableto any skill, projection, or output field mapping.\n"
}