{
  "Id": "507",
  "Title": "\u0022Enrichment Tree Visualization and Shaping with Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfParallel to sentiment analysis, key phrase detection identifiesand extracts words and short phrases that appear consequential.Given the context of /document/reviews_text/pages/*, both sentiment analysis and key phrase skillswill be invoked once for each of the items in the pages collection. The output from the skill will be anode under the associated page element.\r\nYou should now be able to look at the rest of the skills in the skillset and visualize how the tree ofenrichments will continue to grow with the execution of each skill. Some skills, such as the merge skilland the shaper skill, also create new nodes but only use data from existing nodes and don\u0027t createnet new enrichments.\r\nSkills #3 and #4 (sentiment analysis and key phrase detection)The colors of the connectors in the tree above indicate that the enrichments were created bydifferent skills and the nodes will need to be addressed individually and won\u0027t be part of the objectreturned when selecting the parent node.\r\nIf output includes a knowledge store, add a Shaper skill as a last step. The Shaper skill creates datashapes out of nodes in an enrichment tree. For example, you might want to consolidate multiplenodes into a single shape. You can then project this shape as a table (nodes become the columns in atable), passing the shape by name to a table projection.\r\nThe Shaper skill is easy to work with because it focuses shaping under one skill. Alternatively, you canopt for in-line shaping within individual projections. The Shaper Skill doesn\u0027t add or detract from anenrichment tree, so it\u0027s not visualized. Instead, you can think of a Shaper skill as the means by whichyou rearticulate the enrichment tree you already have. Conceptually, this is similar to creating viewsout of tables in a database.JSONSkill #5 Shaper skill{  \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Util.\n"
}