{
  "Id": "521",
  "Title": "\u0022Enrichment and Knowledge Store Management in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe skillset specifies enrichment steps and the knowledgestore.3. Define an index schema. You might not need one, but indexers require it. Thewizard can infer an index.4. Complete the wizard. Data extraction, enrichment, and knowledge storecreation occur in this last step.The wizard automates several tasks. Specifically, both shaping and projections(definitions of physical data structures in Azure Storage) are created for you.Once enriched content exists in storage, any tool or technology that connects to AzureStorage can be used to explore, analyze, or consume the contents.\r\nThe following list is astart:Create a knowledge storeAzure portalConnect with appsStorage Explorer or Storage browser (preview) in Azure portal to view enricheddocument structure and content. Consider this as your baseline tool for viewingknowledge store contents.Power BI for reporting and analysis.Azure Data Factory for further manipulation.Each time you run the indexer and skillset, the knowledge store is updated if the skillsetor underlying source data has changed. Any changes picked up by the indexer arepropagated through the enrichment process to the projections in the knowledge store,ensuring that your projected data is a current representation of content in theoriginating data source.\r\nFor data sources that support change tracking, an indexer will process new and changeddocuments, and bypass existing documents that have already been processed.Timestamp information varies by data source, but in a blob container, the indexer looksat the lastmodified date to determine which blobs need to be ingested. If you are making changes to a skillset, you should enable caching of enricheddocuments to reuse existing enrichments where possible.Without incremental caching, the indexer will always process documents in order of thehigh water mark, without going backwards. For blobs, the indexer would process blobssorted by lastModified, regardless of any changes to indexer settings or the skillset.\n"
}