{
  "Id": "506",
  "Title": "\u0022Enrichment Tree and Language Processing in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe outputfrom the split skill is named pages and it\u0027s added to the enrichment tree. The targetName featureallows you to rename a skill output before being added to the enrichment tree.The enrichment tree now has a new node placed under the context of the skill. This node is availableto any skill, projection, or output field mapping.\r\nTo access any of the enrichments added to a node by a skill, the full path for the enrichment isneeded. For example, if you want to use the text from the pages node as an input to another skill,you\u0027ll need to specify it as \u0022/document/reviews_text/pages/*\u0022. For more information about paths, seeReference annotations.\r\nHotel review documents include customer feedback expressed in multiple languages. The languagedetection skill determines which language is used. The result will then be passed to key phraseextraction and sentiment detection (not shown), taking language into consideration when detectingsentiment and phrases.While the language detection skill is the third (skill #3) skill defined in the skillset, it\u0027s the next skill toexecute. It doesn\u0027t require any inputs so it executes in parallel with the previous skill. Like the splitskill that preceded it, the language detection skill is also invoked once for each document. Theenrichment tree now has a new node for language.\r\n],\u0022outputs\u0022: [{    \u0022name\u0022: \u0022textItems\u0022,    \u0022targetName\u0022: \u0022pages\u0022}Skill #2 Language detectionCustomer feedback reflects a range of positive and negative experiences. The sentiment analysis skillanalyzes the feedback and assigns a score along a continuum of negative to positive numbers, orneutral if sentiment is undetermined. Parallel to sentiment analysis, key phrase detection identifiesand extracts words and short phrases that appear consequential.Given the context of /document/reviews_text/pages/*, both sentiment analysis and key phrase skillswill be invoked once for each of the items in the pages collection. The output from the skill will be anode under the associated page element.\n"
}