{
  "Id": "502",
  "Title": "\u0022Enriched Document Structure and Processing in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022/document/reviews_text\u0022                }            ],            \u0022outputs\u0022: [                {                    \u0022name\u0022: \u0022textItems\u0022,                    \u0022targetName\u0022: \u0022pages\u0022                }            ]        },        {An enriched document is a temporary, tree-like data structure created during skillset execution thatcollects all of the changes introduced through skills.\r\nCollectively, enrichments are represented as ahierarchy of addressable nodes.\r\nNodes also include any unenriched fields that are passed in verbatimfrom the external data source.An enriched document exists for the duration of skillset execution, but can be cached or sent to aknowledge store.Initially, an enriched document is simply the content extracted from a data source during documentcracking, where text and images are extracted from the source and made available for language orimage analysis.The initial content is metadata and the root node (document/content).\r\nThe root node is usually awhole document or a normalized image that is extracted from a data source during documentcracking. How it\u0027s articulated in an enrichment tree varies for each data source type. The followingtable shows the state of a document entering into the enrichment pipeline for several supported datasources:Data Source\\Parsing ModeDefaultJSON, JSON Lines \u0026 CSVBlob Storage/document/content/document/normalized_images/*/document/{key1}/document/{key2}            \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Text.\r\nSentimentSkill\u0022,            \u0022name\u0022: \u0022#2\u0022,            \u0022description\u0022: null,            \u0022context\u0022: \u0022/document/reviews_text/pages/*\u0022,            \u0022defaultLanguageCode\u0022: \u0022en\u0022,            \u0022inputs\u0022: [                {                    \u0022name\u0022: \u0022text\u0022,                    \u0022source\u0022: \u0022/document/reviews_text/pages/*\u0022,                }            ],            \u0022outputs\u0022: [                {                    \u0022name\u0022: \u0022sentiment\u0022,                    \u0022targetName\u0022: \u0022sentiment\u0022                },                {                    \u0022name\u0022: \u0022confidenceScores\u0022,                    \u0022targetName\u0022: \u0022confidenceScores\u0022                },                {                    \u0022name\u0022: \u0022sentences\u0022,                    \u0022targetName\u0022: \u0022sentences\u0022                }            ]        }      .\n"
}