{
  "Id": "622",
  "Title": "\u0022Ensuring Data Residency and Disaster Recovery in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAbout data residency in a multi-regiondeploymentAzure AI Search won\u0027t store data outside of your specified region without yourauthorization. Authorization is implicit when you use features that write to an AzureStorage resource: enrichment cache, debug session, knowledge store. In all cases, thestorage account is one that you provide, in the region of your choice.As stated in the Service Level Agreement (SLA), Microsoft guarantees a high level ofavailability for index query requests when an Azure AI Search service instance isconfigured with two or more replicas, and index update requests when an Azure AISearch service instance is configured with three or more replicas.\r\nHowever, there\u0027s nobuilt-in mechanism for disaster recovery. If continuous service is required in the event ofa catastrophic failure outside of Microsoft’s control, we recommend provisioning asecond service in a different region and implementing a geo-replication strategy toensure indexes are fully redundant across all services.Customers who use indexers to populate and refresh indexes can handle disasterrecovery through geo-specific indexers that retrieve data from the same data source.Two services in different regions, each running an indexer, could index the same datasource to achieve geo-redundancy.\r\nIf you\u0027re indexing from data sources that are alsogeo-redundant, remember that Azure AI Search indexers can only perform incrementalindexing (merging updates from new, modified, or deleted documents) from primaryreplicas. In a failover event, be sure to redirect the indexer to the new primary replica. If you don\u0027t use indexers, you would use your application code to push objects and datato different search services in parallel. For more information, see Keep data synchronizedacross multiple services.７ NoteIf both the storage account and the search service are in the same region, networktraffic between search and storage uses a private IP address and occurs over theMicrosoft backbone network.\n"
}