{
  "Id": "1688",
  "Title": "\u0022Entity Recognition and Extraction in Text Processing with Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfquantitiesAn array of strings where each string represents a quantity.Skill inputsSkill outputs７ NoteNot all entity categories are supported for all languages. See Supported NamedEntity Recognition (NER) entity categories to know which entity categories aresupported for the language you will be using.Output nameDescriptiondateTimesAn array of strings where each string represents a DateTime (as it appears in thetext) value.\r\nurlsAn array of strings where each string represents a URLemailsAn array of strings where each string represents an emailpersonTypesAn array of strings where each string represents a PersonTypeeventsAn array of strings where each string represents an eventproductsAn array of strings where each string represents a productskillsAn array of strings where each string represents a skilladdressesAn array of strings where each string represents an addressphoneNumbersAn array of strings where each string represents a telephone numberipAddressesAn array of strings where each string represents an IP AddressnamedEntitiesAn array of complex types that contains the following fields:\r\ncategorysubcategoryconfidenceScore (Higher value means it\u0027s more to be a real entity)length (The length(number of characters) of this entity)offset (The location where it was found in the text)text (The actual entity name as it appears in the text)JSONSample definition  {     \u0022@odata.\r\ntype\u0022: \u0022#Microsoft.Skills.Text.V3.EntityRecognitionSkill\u0022,     \u0022context\u0022: \u0022/document\u0022,     \u0022categories\u0022: [ \u0022Person\u0022, \u0022Email\u0022],     \u0022defaultLanguageCode\u0022: \u0022en\u0022,      \u0022minimumPrecision\u0022: 0. 5,      \u0022inputs\u0022: [         {             \u0022name\u0022: \u0022text\u0022,              \u0022source\u0022: \u0022/document/content\u0022         },         {             \u0022name\u0022: \u0022languageCode\u0022,              \u0022source\u0022: \u0022/document/language\u0022 JSONJSON        }     ],     \u0022outputs\u0022: [         {             \u0022name\u0022: \u0022persons\u0022,              \u0022targetName\u0022: \u0022people\u0022         },         {             \u0022name\u0022:\n"
}