{
  "Id": "491",
  "Title": "\u0022Exploring Azure Search: Enrichment, Pricing, and Workflow Checklist\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfExploring contentQuery a search indexUse data exploration tools on a knowledge storeA table is useful if you need slices of enriched documents, or if you want to includeor exclude specific parts of the output. For analysis in Power BI, tables are therecommended data source for data exploration and visualization in Power BI.Enrichment is available in regions that have Azure AI services.\r\nYou can check theavailability of enrichment on the Azure products available by region page.Billing follows a pay-as-you-go pricing model. The costs of using built-in skills arepassed on when a multi-region Azure AI services key is specified in the skillset. There arealso costs associated with image extraction, as metered by Azure AI Search.\r\nTextextraction and utility skills, however, aren\u0027t billable. For more information, see Howyou\u0027re charged for Azure AI Search.An enrichment pipeline consists of indexers that have skillsets. Post-indexing, you canquery an index to validate your results.Start with a subset of data in a supported data source.\r\nIndexer and skillset design is aniterative process. The work goes faster with a small representative data set.1. Create a data source that specifies a connection to your data.2. Create a skillset. Unless your project is small, you should attach an Azure AI multi-service resource. If you\u0027re creating a knowledge store, define it within the skillset.3.\r\nCreate an index schema that defines a search index.4. Create and run the indexer to bring all of the above components together. Thisstep retrieves the data, runs the skillset, and loads the index.An indexer is also where you specify field mappings and output field mappingsthat set up the data path to a search index. Optionally, enable enrichment caching in the indexer configuration. This stepallows you to reuse existing enrichments later on.5. Run queries to evaluate results or start a debug session to work through anyskillset issues.To repeat any of the above steps, reset the indexer before you run it. Or, delete andrecreate the objects on each run (recommended if you’re using the free tier).\nIf youAvailability and pricingChecklist: A typical workflowenabled caching the indexer pulls from the cache if data is unchanged at the source,and if your edits to the pipeline don\u0027t invalidate the cache.\n"
}