{
  "Id": "369",
  "Title": "\u0022Exploring Azure Search with .NET: Code Samples and Tutorials\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfVector search sampleShows you how to index a vector field and perform vector searchusing the Azure SDK for .NET. Vector search is in preview.Code samples from the Azure AI Search team demonstrate features and workflows. Allof the following samples are referenced in tutorials, quickstarts, and how-to articles thatexplain the code in detail.\r\nYou can find these samples in Azure-Samples/azure-search-dotnet-samples and in Azure-Samples/search-dotnet-getting-started on GitHub.Code sampleRelated articlePurposequickstartQuickstart: Fulltext search usingthe Azure SDKsCovers the basic workflow forcreating, loading, and querying asearch index in C# using sample data.\r\nsearch-websiteTutorial: Addsearch to webappsDemonstrates an end-to-end searchapp that includes a rich client pluscomponents for hosting the app andhandling search requests.DotNetHowToHow to use the.NET client librarySteps through the basic workflow,but in more detail and withdiscussion of API usage.\r\nDotNetHowToSynonymsExample: Addsynonyms in C#Synonym lists are used for queryexpansion, providing matchableterms that are external to an index.DotNetToIndexersTutorial: IndexAzure SQL dataShows how to configure an AzureSQL indexer that has a schedule, fieldmappings, and parameters.DotNetHowToEncryptionUsingCMKHow to configurecustomer-managed keysShows how to create objects that areencrypted with a Customer Key.\r\nDoc samples TipTry the Samples browser to search for Microsoft code samples in GitHub, filteredby product, service, and language.Code sampleRelated articlePurposefor dataencryptionmultiple-data-sourcesTutorial: Indexfrom multipledata sources.Merges content from two datasources into one search index. Optimize-data-indexingTutorial:Optimizeindexing with thepush API.Demonstrates optimizationtechniques for pushing data into asearch index.tutorial-ai-enrichmentTutorial: AI-generatedsearchablecontent fromAzure blobsShows how to configure an indexerand skillset.create-mvc-appTutorial: Addsearch to anASP.\n"
}