{
  "Id": "18",
  "Title": "\u0022Exploring Azure Search: Tools, Features, and APIs Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCategory                           FeaturesTools for prototyping andinspectionAdd index is an index designer in the portal that you can use tocreate a basic schema consisting of attributed fields and a fewother settings. After saving the index, you can populate it using anSDK or the REST API to provide the data.\r\nImport data wizard creates indexes, indexers, skillsets, and datasource definitions. If your data exists in Azure, this wizard can saveyou significant time and effort, especially for proof-of-conceptinvestigation and exploration.Search explorer is used to test queries and refine scoring profiles.Create demo app is used to generate an HTML page that can beused to test the search experience.\r\nDebug Sessions is a visual editor that lets you debug a skillsetPortal featuresCategory                           Featuresinteractively. It shows you dependencies, output, andtransformations.Monitoring and diagnosticsEnable monitoring features to go beyond the metrics-at-a-glancethat are always visible in the portal.\r\nMetrics on queries per second,latency, and throttling are captured and reported in portal pageswith no extra configuration required.Category                           FeaturesRESTService REST API is for data plane operations, including alloperations related to indexing, queries, and AI enrichment. You canalso use this client library to retrieve system information andstatistics. Management REST API is for service creation and provisioningthrough Azure Resource Manager. You can also use this API tomanage keys and capacity.Azure SDK for .NETAzure.Search.Documents is for data plane operations, including alloperations related to indexing, queries, and AI enrichment. You canalso use this client library to retrieve system information andstatistics.Microsoft.Azure.Management.Search is for service creation andprovisioning through Azure Resource Manager. You can also usethis API to manage keys and capacity.Azure SDK for Javacom.azure.search.documents is for data plane operations,including all operations related to indexing, queries, and AIenrichment.\n"
}