{
  "Id": "1343",
  "Title": "\u0022Exploring Azure Search Metrics and Logs: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor deeper exploration, open metrics explorer from the Monitoring menu so that youcan layer, zoom in, and visualize data to explore trends or anomalies. Learn more aboutmetrics explorer by completing this tutorial on creating a metrics chart.1. Under the Monitoring section, select Metrics to open the metrics explorer with thescope set to your search service.2. Under Metric, choose one from the dropdown list and review the list of availableaggregations for a preferred type. The aggregation defines how the collectedvalues will be sampled over each time interval.Explore metrics in the portal3.\r\nIn the top-right corner, set the time interval.4. Choose a visualization. The default is a line chart.5. Layer additional aggregations by choosing Add metric and selecting differentaggregations.6. Zoom into an area of interest on the line chart. Put the mouse pointer at thebeginning of the area, click and hold the left mouse button, drag to the other sideof area, and release the button.\r\nThe chart will zoom in on that time range.When you enable resource logging, the system captures query requests in theAzureDiagnostics table. As a prerequisite, you must have already enabled resourcelogging, specifying a log analytics workspace or another storage option.1.\r\nUnder the Monitoring section, select Logs to open up an empty query window inLog Analytics.2. Run the following expression to search Query.Search operations, returning atabular result set consisting of the operation name, query string, the index queried,and the number of documents found. The last two statements exclude querystrings consisting of an empty or unspecified search, over a sample index, whichcuts down the noise in your results.KustoReturn query strings entered by users   AzureDiagnostics | project OperationName, Query_s, IndexName_s, Documents_d | where OperationName == \u0022Query.Search\u0022 3. Optionally, set a Column filter on Query_s to search over a specific syntax or string.\n"
}