{
  "Id": "368",
  "Title": "\u0022Exploring Azure AI Search with .NET: Code Samples and Tutorials\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThese samples use the Azure AI Search client library for theAzure SDK for .NET, which you can explore through the following links.TargetLinkPackagedownloadwww.nuget.org/packages/Azure.Search.Documents/API referenceazure.search.documentsAPI test casesgithub.com/Azure/azure-sdk-for-net/tree/main/sdk/search/Azure.Search.Documents/testsSource codegithub.com/Azure/azure-sdk-for-net/tree/main/sdk/search/Azure.Search.Documents/srcCode samples from the Azure SDK development team demonstrate API usage. You canfind these samples in Azure/azure-sdk-for-net/tree/main/sdk/search/Azure.Search.\r\nDocuments/samples on GitHub.SamplesDescription\u0022Hello world\u0022,synchronouslyDemonstrates how to create a client, authenticate, and handle errorsusing synchronous methods.\u0022Hello world\u0022,asynchronouslyDemonstrates how to create a client, authenticate, and handle errorsusing asynchronous methods.Service-level operationsDemonstrates how to create indexes, indexers, data sources, skillsets,and synonym maps. This sample also shows you how to get servicestatistics and how to query an index.Index operationsDemonstrates how to perform an action on existing index, in thiscase getting a count of documents stored in the index.\r\nFieldBuilderIgnoreDemonstrates a technique for working with unsupported data types.Indexing documents(push model)\u0022Push\u0022 model indexing, where you send a JSON payload to an indexon a service.SDK samplesSamplesDescriptionEncryption key sampleDemonstrates using a customer-managed encryption key to add anextra layer of protection over sensitive content. Vector search sampleShows you how to index a vector field and perform vector searchusing the Azure SDK for .NET. Vector search is in preview.Code samples from the Azure AI Search team demonstrate features and workflows. Allof the following samples are referenced in tutorials, quickstarts, and how-to articles thatexplain the code in detail.\n"
}