{
  "Id": "635",
  "Title": "\u0022Exploring Azure AI Search: Preview Features and Capabilities\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAll Azure SDKsPreview features in Azure AI SearchArticle•11/15/2023This article identifies all features in public preview. This list is helpful for checking featurestatus.Preview features are removed from this list if they\u0027re retired or transition to generalavailability. For announcements regarding general availability and retirement, seeService Updates or What\u0027s New.\r\nFeature                        CategoryDescriptionAvailabilityIntegratedvectorizationIndex,skillset,queriesSkills-driven data chunkingand vectorization duringindexing, and text-to-vector conversion duringquery execution.Create or Update Index(preview) for vectorizer,Create or Update Skillset(preview) for SplitSkill,and Search POST(preview) forvectorQueries, 2023-10-01-Preview or later.\r\nImport and vectorizedataAzureportalA wizard that creates a fullindexing pipeline thatincludes data chunking andvectorization. The wizardcreates all of the objectsand configuration settings.Available on all searchservices, in all regions.\r\nAzure Files indexerIndexerdata sourceNew data source forindexer-based indexingfrom Azure FilesCreate or Update DataSource (preview), 2021-04-30-Preview or later.SharePoint IndexerIndexerdata sourceNew data source forindexer-based indexing ofSharePoint content.Sign up to enable thefeature. Use Create orUpdate Data Source(preview), 2020-06-30-Preview or later, or theAzure portal. MySQL indexerIndexerdata sourceNew data source forindexer-based indexing ofAzure MySQL data sources.Sign up to enable thefeature. Use Create orUpdate Data Source(preview), 2020-06-30-Preview or later, .NET SDK11.2.1, and Azure portal.Azure Cosmos DB forMongoDB indexerIndexerdata sourceNew data source forindexer-based indexingSign up to enable thefeature.\n"
}