{
  "Id": "393",
  "Title": "\u0022Exploring Vector Search in Azure AI Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBuild the sample index, try out different queries and review results. Forinstructions, see Build and query an index in the portal.Try other query syntax from the Search Documents example section or from Simplequery syntax in Search explorer in the portal.Review scoring profiles if you want to tune ranking in your search application.Learn how to apply language-specific lexical analyzers.\r\nConfigure custom analyzers for either minimal processing or specializedprocessing on specific fields.Search Documents REST APISimple query syntaxFull Lucene query syntaxHandle search resultsNext stepsSee alsoVector search in Azure AI SearchArticle•12/05/2023Vector search is an approach in information retrieval that uses numeric representationsof content for search scenarios.\r\nBecause the content is numeric rather than plain text,the search engine matches on vectors that are the most similar to the query, with norequirement for matching on exact terms.This article is a high-level introduction to vector support in Azure AI Search. It alsoexplains integration with other Azure services and covers terminology and conceptsrelated to vector search development.We recommend this article for background, but if you\u0027d rather get started, follow thesesteps:You could also begin with the vector quickstart or the code samples on GitHub.\r\nVector search is in the Azure portal and the Azure SDKs for .NET, Python, andJavaScript.Vector search is a new capability for indexing, storing, and retrieving vector embeddingsfrom a search index. You can use it to power similarity search, multi-modal search,recommendations engines, or applications implementing the Retrieval AugmentedGeneration (RAG) architecture. The following diagram shows the indexing and query workflows for vector search.Generate vector embeddings before you start, or try out integrated vectorization(preview).＂Add vector fields to an index.＂Load vector data into an index using push or pull methodologies.＂Query vector data using the Azure portal, REST APIs, or Azure SDK packages.\n＂What\u0027s vector search in Azure AI Search?On the indexing side, Azure AI Search takes vector embeddings and uses a nearestneighbors algorithm to co-locate similar vectors together in the search index (vectorsabout popular movies are closer than vectors about popular dog breeds).\n"
}