{
  "Id": "781",
  "Title": "\u0022Explicit Mapping and Synonyms in Full Text Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfJSONRules for an explicit mapping are denoted by an arrow =\u003E. When specified, a termsequence of a search query that matches the left-hand side of =\u003E will be replaced withDefine rulesEquivalency rules{ \u0022format\u0022: \u0022solr\u0022, \u0022synonyms\u0022: \u0022     USA, United States, United States of America\\n     dog, puppy, canine\\n     coffee, latte, cup of joe, java\\n\u0022 } Explicit mappingthe alternatives on the right-hand side at query time.\r\nIn the explicit case, a query for Washington, Wash. or WA will be rewritten as WA, and thequery engine will only look for matches on the term WA. Explicit mapping only applies inthe direction specified, and doesn\u0027t rewrite the query WA to Washington in this case.JSONIn full text search, synonyms are analyzed during query processing just like any otherquery term, which means that rules around reserved and special characters apply to theterms in your synonym map.\r\nThe list of characters that requires escaping varies betweenthe simple syntax and full syntax:simple syntax \u002B | \u0022 ( ) \u0027 \\full syntax \u002B - \u0026 | ! ( ) { } [ ] ^ \u0022 ~ * ? : \\ /Recall that if you need to preserve characters that would otherwise be discarded by thedefault analyzer during indexing, you should substitute an analyzer that preserves them.Some choices include Microsoft natural language analyzers, which preserveshyphenated words, or a custom analyzer for more complex patterns. For moreinformation, see Partial terms, patterns, and special characters. The following example shows an example of how to escape a character with a backslash:JSONSince the backslash is itself a special character in other languages like JSON and C#,you\u0027ll probably need to double-escape it. For example, the JSON sent to the REST APIfor the above synonym map would look like this:{ \u0022format\u0022: \u0022solr\u0022, \u0022synonyms\u0022: \u0022     Washington, Wash., WA =\u003E WA\\n    California, Calif.\n"
}