{
  "Id": "374",
  "Title": "\u0022Exploring Azure AI Search: Code Samples and Tutorials\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis sample category also includes a service statisticsample.dataSourceConnections (forindexers)Demonstrates how to create, update, get, list, and delete indexerdata sources, required for indexer-based indexing of supportedAzure data sources.indexersDemonstrates how to create, update, get, list, reset, and deleteindexers.\r\nskillSetDemonstrates how to create, update, get, list, and delete skillsetsthat are attached indexers, and that perform AI-basedenrichment during indexing.synonymMapsDemonstrates how to create, update, get, list, and deletesynonym maps.Code samples from the Azure AI Search team demonstrate features and workflows.\r\nMany of these samples are referenced in tutorials, quickstarts, and how-to articles. Youcan find these samples in Azure-Samples/azure-search-javascript-samples onGitHub.SamplesArticlequickstartSource code for the JavaScript portion of Quickstart: Full text search using theAzure SDKs. Covers the basic workflow for creating, loading, and querying asearch index using sample data.\r\nsearch-websiteSource code for Tutorial: Add search to web apps. Demonstrates an end-to-endsearch app that includes a rich client plus components for hosting the app andhandling search requests.TypeScript samplesDoc samplesThe following samples are also published by the Azure AI Search team, but aren\u0027treferenced in documentation. Associated readme files provide usage instructions.SamplesDescriptionazure-search-vector-sample.jsVector search sample using the Azure SDK for JavaScriptazure-search-react-templateReact template for Azure AI Search (github.com) TipTry the Samples browser to search for Microsoft code samples in GitHub, filteredby product, service, and language. Other samplesPython samples for Azure AI SearchArticle•11/15/2023Learn about the Python code samples that demonstrate the functionality and workflowof an Azure AI Search solution. These samples use the Azure AI Search client library forthe Azure SDK for Python, which you can explore through the following links.TargetLinkPackagedownloadpypi.\n"
}