{
  "Id": "638",
  "Title": "\u0022Exploring Azure Preview Features and REST API Access\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfExperimental features are available through the preview REST API first, followed byAzure portal, and then the Azure SDKs.The following statements apply to preview features:Preview features are available under Supplemental Terms of Use, without aservice level agreement.Preview features might undergo breaking changes if a redesign is required.\r\nSometimes preview features don\u0027t make it into a GA release.Each Azure SDK team releases beta packages on their own timeline. Check the changelog for mentions of new features in beta packages:Using preview featuresPreview feature support in Azure SDKsChange log for Azure SDK for .\r\nNETChange log for Azure SDK for JavaChange log for Azure SDK for JavaScriptChange log for Azure SDK for Python.Preview REST APIs are accessed through the api-version parameter on the URI. Olderpreviews are still operational but become stale over time and aren\u0027t updated with newfeatures or bug fixes.For content operations, 2023-10-01-Preview is the most recent preview version.\r\nThefollowing example shows the syntax for Search POST (preview):HTTPFor management operations, 2021-04-01-Preview is the most recent preview version.The following example shows the syntax for Update Service 2021-04-01-preview version.HTTPQuickstart: REST APIsSearch REST API overviewSearch REST API versionsHow to call a preview REST APIGET {endpoint}/indexes(\u0027{indexName}\u0027)?api-version=2023-10-01-PreviewPATCH https://management.azure.com/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.\r\nSearch/searchServices/{searchServiceName}? api-version=2021-04-01-preview{  \u0022location\u0022: \u0022{{region}}\u0022,  \u0022sku\u0022: {    \u0022name\u0022: \u0022basic\u0022  },  \u0022properties\u0022: {    \u0022replicaCount\u0022: 3,    \u0022partitionCount\u0022: 1,    \u0022hostingMode\u0022:\n"
}