{
  "Id": "1663",
  "Title": "\u0022Exploring Azure Cognitive Search REST APIs with Postman and Skills\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWe recommend usingPostman for this exercise.Explore Azure Cognitive Search REST APIs using PostmanSkills for extra processing duringindexing (Azure AI Search)Article•11/15/2023This article describes the skills provided with Azure AI Search that you can include in askillset to access external processing.A skill provides an atomic operation that transforms content in some way. Often, it\u0027s anoperation that recognizes or extracts text, but it can also be a utility skill that reshapesthe enrichments that are already created. Typically, the output is text-based so that itcan be used in full text search or vectors used in vector search.\r\nSkills are organized into categories:A built-in skill wraps API calls to an Azure resource, where the inputs, outputs, andprocessing steps are well understood. For skills that call an Azure AI resource, theconnection is made over the internal network. For skills that call Azure OpenAI, youprovide the connection information that the search service uses to connect to theresource.\r\nA small quantity of processing is non-billable, but at larger volumes,processing is billable. Built-in skills are based on pretrained models from Microsoft,which means you can\u0027t train the model using your own training data.A custom skill provides custom code that executes externally to the search service.It\u0027s accessed through a URI.\r\nCustom code is often made available through an Azurefunction app. To attach an open-source or third-party vectorization model, use acustom skill.A utility is internal to Azure AI Search, with no dependency on external resourcesor outbound connections. Most utilities are non-billable. Skills that call the Azure AI are billed at the pay-as-you-go rate when you attach an AIservice resource.OData typeDescriptionMeteredbyMicrosoft.Skills.Text.CustomEntityLookupSkillLooks for text from a custom, user-defined list of words and phrases.Azure AISearch(pricing)Azure AI resource skillsOData typeDescriptionMeteredbyMicrosoft.Skills.Text.\n"
}