{
  "Id": "372",
  "Title": "\u0022Exploring Azure AI Search Client Library for Java SDK\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThese samples use the Azure AI Search client library forthe Azure SDK for Java, which you can explore through the following links.TargetLinkPackagedownloadsearch.maven.org/artifact/com.azure/azure-search-documentsAPI referencecom.azure.search.documentsAPI test casesgithub.com/Azure/azure-sdk-for-java/tree/azure-search-documents_11.1.3/sdk/search/azure-search-documents/src/testSource codegithub.\r\ncom/Azure/azure-sdk-for-java/tree/azure-search-documents_11.1.3/sdk/search/azure-search-documents/srcCode samples from the Azure SDK development team demonstrate API usage. You canfind these samples in Azure/azure-sdk-for-java/tree/main/sdk/search/azure-search-documents/src/samples on GitHub.\r\nSamplesDescriptionSearch index creationDemonstrates how to create search indexes.Synonym creationDemonstrates how to create synonym maps.Search indexer creationDemonstrates how to create indexers.Search indexer datasource creationDemonstrates how to create indexer data sources, required forindexer-based indexing of supported Azure data sources.\r\nSkillset creationDemonstrates how to create skillsets that are attached indexers, andthat perform AI-based enrichment during indexing.Load documentsDemonstrates how to upload or merge documents into an index in adata import operation.Query syntaxDemonstrates how to set up a basic query.Vector searchDemonstrates how to set up a vector field and then generate aSDK samplesSamplesDescriptionvector query.\r\nCode samples from the Azure AI Search team are located in Azure-Samples/azure-search-java-samples on GitHub.SamplesArticlequickstartSource code for the Java portion of Quickstart: Full text search using the AzureSDKs.Doc samples TipTry the Samples browser to search for Microsoft code samples in GitHub, filteredby product, service, and language. JavaScript samples for Azure AI SearchArticle•11/15/2023Learn about the JavaScript code samples that demonstrate the functionality andworkflow of an Azure AI Search solution. These samples use the Azure AI Search clientlibrary for the Azure SDK for JavaScript, which you can explore through the followinglinks.TargetLinkPackagedownloadwww.\n"
}