{
  "Id": "20",
  "Title": "\u0022Exploring Azure AI Search: Features, FAQs, and Client Support\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhat\u0027s new in Azure AI SearchPreview features in Azure AI SearchSee alsoAzure AI Search Frequently AskedQuestionsFAQFind answers to commonly asked questions about Azure AI Search.Azure AI Search is a service on Azure that provides a dedicated search engine andpersistent storage of your searchable content for full text and vector search scenarios.\r\nItalso includes optional, integrated AI to extract more text and structure from rawcontent, and to chunk and vectorize content for vector search.The primary workflow is create, load, and query an index. Although you can use theportal for most tasks, Azure AI Search is intended to be used programmatically, handlingrequests from client code. Programmatic support is provided through REST APIs andclient libraries in .NET, Python, Java, and JavaScript SDKs for Azure.Azure Search was renamed to Azure Cognitive Search in October 2019 to reflect theexpanded (yet optional) use of cognitive skills and AI processing in service operations.\r\nAzure Cognitive Search was renamed to Azure AI Search in October 2023 to align withAzure AI services.The default analyzer used for tokenization is standard Lucene and its language agnostic.Otherwise, language support is expressed through language analyzers that applylinguistic rules to inbound (indexing) and outbound (queries) content.\r\nSome features,such as semantic ranking and speller, are limited to a subset of languages.GeneralWhat is Azure AI Search?How do I work with AI Search?Are \u0022Azure Search\u0022 and \u0022Azure Cognitive Search\u0022and \u0022Azure AI Search\u0022 the same product?What languages are supported?Client code should call the client libraries or REST APIs to connect to a search index,formulate queries, and handle responses. You can also write code that builds andrefreshes an index, or runs indexers programmatically or by script.Not always. The REST API is always the first to implement new features in preview APIversions, and the generally available versions support all programmatic operations. Theclient libraries in Azure SDKs will pick up new features over time, but are released ontheir own schedule.\n"
}