{
  "Id": "65",
  "Title": "\u0022Exquisite Hotels: Luxury, Resort, and Boutique Accommodations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf8399129,            \u0022HotelId\u0022: \u002249\u0022,            \u0022HotelName\u0022: \u0022Old Carrabelle Hotel\u0022,            \u0022Description\u0022: \u0022Spacious rooms, glamorous suites and residences, rooftop pool, walking access to shopping, dining, entertainment and the city center.\u0022,            \u0022Category\u0022: \u0022Luxury\u0022        },        {            \u0022@search.score\u0022: 0.8383954,            \u0022HotelId\u0022: \u002213\u0022,            \u0022HotelName\u0022: \u0022Historic Lion Resort\u0022,            \u0022Description\u0022: \u0022Unmatched Luxury.\r\nVisit our downtown hotel to indulge in luxury accommodations. Moments from the stadium, we feature the best in comfort\u0022,            \u0022Category\u0022: \u0022Resort and Spa\u0022        },        {            \u0022@search.score\u0022: 0.8254346,            \u0022HotelId\u0022: \u00224\u0022,            \u0022HotelName\u0022: \u0022Sublime Cliff Hotel\u0022,            \u0022Description\u0022: \u0022Sublime Cliff Hotel is located in the heart of the historic center of Sublime in an extremely vibrant and lively area within short walking distance to the sites and landmarks of the city and is surrounded by the extraordinary beauty of churches, buildings, shops and monuments.\r\nSublime Cliff is part of a lovingly restored 1800 palace.\u0022,            \u0022Category\u0022: \u0022Boutique\u0022        },        {            \u0022@search.score\u0022: 0.82380056,            \u0022HotelId\u0022: \u00221\u0022,            \u0022HotelName\u0022: \u0022Secret Point Hotel\u0022,            \u0022Description\u0022: \u0022The hotel is ideally located on the main commercial artery of the city in the heart of New York.\u0022,            \u0022Category\u0022: \u0022Boutique\u0022        },        {            \u0022@search.score\u0022: 0. 81514084,            \u0022HotelId\u0022: \u00222\u0022,            \u0022HotelName\u0022: \u0022Twin Dome Hotel\u0022,            \u0022Description\u0022: \u0022The hotel is situated in a  nineteenth century plaza, which has been expanded and renovated to the highest architectural standards to create a modern, functional and first-class hotel in which art and unique historical elements coexist with the most modern comforts.\n"
}