{
  "Id": "1718",
  "Title": "\u0022Extracting PII Entities and Language Service APIs in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022            }       }     ] } Sample output{   \u0022values\u0022: [     {       \u0022recordId\u0022: \u00221\u0022,       \u0022data\u0022 :        {         \u0022piiEntities\u0022:[             {                \u0022text\u0022:\u0022859-98-0987\u0022,               \u0022type\u0022:\u0022U.S. Social Security Number (SSN)\u0022,               \u0022subtype\u0022:\u0022\u0022,               \u0022offset\u0022:28,               \u0022length\u0022:11,               \u0022score\u0022:0.\r\n65            }         ],         \u0022maskedText\u0022: \u0022Microsoft employee with ssn *********** is using our awesome API\u0027s.\u0022       }     }   ] } The offsets returned for entities in the output of this skill are directly returned from theLanguage Service APIs, which means if you are using them to index into the originalstring, you should use the StringInfo class in .\r\nNET in order to extract the correct content.For more information, see Multilingual and emoji support in Language service features.If the language code for the document is unsupported, a warning is returned and noentities are extracted. If your text is empty, a warning is returned.\r\nIf your text is largerthan 50,000 characters, only the first 50,000 characters will be analyzed and a warningwill be issued.If the skill returns a warning, the output maskedText may be empty, which can impactany downstream skills that expect the output. For this reason, be sure to investigate allwarnings related to missing output when writing your skillset definition. Built-in skillsHow to define a skillsetErrors and warningsSee alsoSentiment cognitive skill (v3)Article•07/18/2023The Sentiment skill (v3) evaluates unstructured text and for each record, providessentiment labels (such as \u0022negative\u0022, \u0022neutral\u0022 and \u0022positive\u0022) based on the highestconfidence score found by the service at a sentence and document-level.\n"
}