{
  "Id": "1212",
  "Title": "\u0022Faceted Navigation in Azure Search: Parameters and Syntax\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf7,                \u0022value\u0022: \u0022Boutique\u0022            },            {                \u0022count\u0022: 5,                \u0022value\u0022: \u0022Suite\u0022            },            {                \u0022count\u0022: 4,                \u0022value\u0022: \u0022Extended-Stay\u0022            }        ]    },    \u0022value\u0022: [        {            \u0022@search.\r\nscore\u0022: 1.0,            \u0022HotelId\u0022: \u00221\u0022,            \u0022HotelName\u0022: \u0022Secret Point Motel\u0022,A facet query parameter is set to a comma-delimited list of \u0022facetable\u0022 fields anddepending on the data type, can be further parameterized to set counts, sort orders,and ranges: count:\u003Cinteger\u003E, sort:\u003C\u003E, interval:\u003Cinteger\u003E, and values:\u003Clist\u003E.\r\nFormore detail about facet parameters, see \u0022Query parameters\u0022 in the REST API.HTTPFor each faceted navigation tree, there\u0027s a default limit of the top ten facets. This defaultmakes sense for navigation structures because it keeps the values list to a manageablesize. You can override the default by assigning a value to \u0022count\u0022.\r\nFor example,\u0022Tags,count:5\u0022 reduces the number of tags under the Tags section to the top five.For Numeric and DateTime values only, you can explicitly set values on the facet field(for example, facet=Rating,values:1|2|3|4|5) to separate results into contiguousranges (either ranges based on numeric values or time periods). Alternatively, you canadd \u0022interval\u0022, as in facet=Rating,interval:1.\r\nEach range is built using 0 as a starting point, a value from the list as an endpoint, andthen trimmed of the previous range to create discrete intervals.            \u0022Description\u0022: \u0022The hotel is ideally located on the main commercial artery of the city in the heart of New York. A few minutes away is Time\u0027s Square and the historic centre of the city, as well as other places of interest that make New York one of America\u0027s most attractive and cosmopolitan cities.\u0022,            \u0022Category\u0022: \u0022Boutique\u0022,            \u0022Tags\u0022: [                \u0022pool\u0022,                \u0022air conditioning\u0022,                \u0022concierge\u0022            ],            \u0022ParkingIncluded\u0022: false,        }    ]}Facets syntaxPOST https://{{service_name}}.\n"
}