{
  "Id": "1217",
  "Title": "\u0022Facet Navigation Best Practices for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfhtml(facetResultsHTML);}Tips for working with facetsPreserve a facet navigation structure asynchronously offiltered resultsClear facetsTrim facet results with more filtersIn general, if you find that facet results are consistently too large, we recommend thatyou add more filters to give users more options for narrowing the search.If your application uses faceted navigation exclusively (that is, no search box), you canmark the field as searchable=false, filterable=true, facetable=true to produce amore compact index. Your index won\u0027t include inverted indexes and there will be no textanalysis or tokenization. Filters are made on exact matches at the character level.\r\nIf you build the list of facets dynamically based on untrusted user input, validate that thenames of the faceted fields are valid. Or, escape the names when building URLs by usingeither Uri.EscapeDataString() in .NET, or the equivalent in your platform of choice.Several samples include faceted navigation. This section has links to the samples andalso notes which client library and language is used for each one.\r\nTutorials and samples in C#, Python, and JavaScript include faceted navigation as well asfilters, suggestions, and autocomplete. These samples use React for the presentationlayer.The NYCJobs sample is an ASP.NET MVC application that uses Ajax in the presentationlayer. It\u0027s available as a live demo app and as source code on Azure-Samples repo onGitHub. Search term: \u0022cloud computing\u0022Content type   Internal specification (254)   Video (10)A facet-only search experienceValidate inputs at query-timeDemos and samplesAdd search to web apps (React)NYCJobs sample code and demo (Ajax)Understanding OData collection filtersin Azure AI SearchArticle•11/15/2023To filter on collection fields in Azure AI Search, you can use the any and all operatorstogether with lambda expressions.\n"
}