{
  "Id": "1214",
  "Title": "\u0022Faceted Navigation and Filtering in Azure Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor example, if you\u0027re faceting by a \u0022size\u0022 field thathas five unique values, you could set \u0022count:5\u0022 to ensure all matches are represented inthe facet response.The tradeoff with this workaround is increased query latency, so use it only whennecessary.In application code, the pattern is to use facet query parameters to return the facetednavigation structure along with facet results, plus a $filter expression.\r\nThe filterexpression handles the click event and further narrows the search result based on thefacet selection.The following code snippet from the JobsSearch.cs file in the NYCJobs demo adds theselected Business Title to the filter if you select a value from the Business Title facet.C#Here\u0027s another example from the hotels sample.\r\nThe following code snippet addscategoyrFacet to the filter if a user selects a value from the category facet.C#Discrepancies in facet countsPresentation layerFacet and filter combinationif (businessTitleFacet != \u0022\u0022)  filter = \u0022business_title eq \u0027\u0022 \u002B businessTitleFacet \u002B \u0022\u0027\u0022;if (!String.\r\nIsNullOrEmpty(categoryFacet))    filter = $\u0022category eq \u0027{categoryFacet}\u0027\u0022;The following example, taken from the index.cshtml file of the NYCJobs sampleapplication, shows the static HTML structure for displaying faceted navigation on thesearch results page. The list of facets is built or rebuilt dynamically when you submit asearch term, or select or clear a facet.\r\nHTMLThe following code snippet from the index.cshtml (also from NYCJobs demo)dynamically builds the HTML to display the first facet, Business Title. Similar functionsdynamically build the HTML for the other facets. Each facet has a label and a count,which displays the number of items found for that facet result. JavaScriptHTML for faceted navigation\u003Cdiv class=\u0022widget sidebar-widget jobs-filter-widget\u0022\u003E  \u003Ch5 class=\u0022widget-title\u0022\u003EFilter Results\u003C/h5\u003E    \u003Cp id=\u0022filterReset\u0022\u003E\u003C/p\u003E    \u003Cdiv class=\u0022widget-content\u0022\u003E      \u003Ch6 id=\u0022businessTitleFacetTitle\u0022\u003EBusiness Title\u003C/h6\u003E      \u003Cul class=\u0022filter-list\u0022 id=\u0022business_title_facets\u0022\u003E      \u003C/ul\u003E\n"
}