{
  "Id": "1210",
  "Title": "\u0022Faceted Navigation Best Practices in Azure Search REST API\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfGeographyPoint\u0022 }  ]}Choosing fieldsDefaults in REST and Azure SDKsEdm.Int32, Edm.Int64, Edm.DoubleCollections of any of the above types, for example Collection(Edm.String) orCollection(Edm.Double)You can\u0027t use Edm.GeographyPoint or Collection(Edm.GeographyPoint) fields in facetednavigation. Facets work best on fields with low cardinality.\r\nDue to the resolution of geo-coordinates, it\u0027s rare that any two sets of coordinates will be equal in a given dataset. Assuch, facets aren\u0027t supported for geo-coordinates. You would need a city or region fieldto facet by location.Facets are specified on the query, and the faceted navigation structure is returned at thetop of the response.\r\nThe structure of a request and response is fairly simple. In fact, thereal work behind faceted navigation lies in the presentation layer, covered in a latersection.The following REST example is an unqualified query (\u0022search\u0022: \u0022*\u0022) that is scoped tothe entire index (see the built-in hotels sample).\r\nFacets are usually a list of fields, but thisquery shows just one for a more readable response below.HTTP TipAs a best practice for performance and storage optimization, turn faceting off forfields that should never be used as a facet. In particular, string fields for uniquevalues, such as an ID or product name, should be set to \u0022facetable\u0022: false toprevent their accidental (and ineffective) use in faceted navigation. This is especiallytrue for the REST API that enables filters and facets by default.Facet request and responsePOST https://{{service_name}}.search.windows. net/indexes/hotels/docs/search?api-version={{api_version}}{    \u0022search\u0022: \u0022*\u0022,    \u0022queryType\u0022: \u0022simple\u0022,    \u0022select\u0022: \u0022\u0022,    \u0022searchFields\u0022: \u0022\u0022,    \u0022filter\u0022: \u0022\u0022,    \u0022facets\u0022: [ \u0022Category\u0022],     \u0022orderby\u0022: \u0022\u0022,    \u0022count\u0022: true}It\u0027s useful to initialize a search page with an open query to completely fill in the facetednavigation structure.\n"
}