{
  "Id": "1480",
  "Title": "\u0022Filtering Azure AI Search Results Using Microsoft Entra Security Identities\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf0,     \u0022file_id\u0022:\u00222\u0022,     \u0022file_name\u0022:\u0022secured_file_b\u0022   } ]}This article described a pattern for filtering results based on user identity and thesearch.in() function. You can use this function to pass in principal identifiers for therequesting user to match against principal identifiers associated with each targetdocument.\r\nWhen a search request is handled, the search.in function filters out searchresults for which none of the user\u0027s principals have read access. The principal identifierscan represent things like security groups, roles, or even the user\u0027s own identity.For an alternative pattern based on Microsoft Entra ID, or to revisit other securityfeatures, see the following links.\r\nSecurity filters for trimming results using Active Directory identitiesSecurity in Azure AI SearchNext stepsSecurity filters for trimming Azure AISearch results using Microsoft Entratenants and identitiesArticle•11/15/2023This article demonstrates how to use Microsoft Entra security identities together withfilters in Azure AI Search to trim search results based on user group membership.This article covers the following tasks:Your index in Azure AI Search must have a security field to store the list of groupidentities having read access to the document.\r\nThis use case assumes a one-to-onecorrespondence between a securable item (such as an individual\u0027s college application)and a security field specifying who has access to that item (admissions personnel).You must have Microsoft Entra administrator permissions (Owner or administrator) tocreate users, groups, and associations. Your application must also be registered with Microsoft Entra ID as a multi-tenant app,as described in the following procedure.This step integrates your application with Microsoft Entra ID for the purpose ofaccepting sign-ins of user and group accounts. If you aren\u0027t a tenant admin in yourorganization, you might need to create a new tenant to perform the following steps.1. In Azure portal, find the Microsoft Entra tenant.2.\n"
}