{
  "Id": "1485",
  "Title": "\u0022Filtering Azure AI Search Results Using Microsoft Entra Sign-ins\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfGetGroupsForUsers(client, users);    _groupsCache = new ConcurrentDictionary\u003Cstring, List\u003Cstring\u003E\u003E(userGroups);}Step 2: Compose the search requestprivate static void SearchQueryWithFilter(string user){    // Using the filter below, the search result will contain all documents that their GroupIds field       // contain any one of the Ids in the groups list    string filter = String.\r\nFormat(\u0022groupIds/any(p:search.in(p, \u0027{0}\u0027))\u0022, string.Join(\u0022,\u0022, String.Join(\u0022,\u0022, _groupsCache[user])));    SearchOptions searchOptions =        new SearchOptions()        {            Filter = filter        };The response includes a filtered list of documents, consisting of those that the user haspermission to view. Depending on how you construct the search results page, you mightwant to include visual cues to reflect the filtered result set.\r\nIn this walkthrough, you learned a pattern for using Microsoft Entra sign-ins to filterdocuments in Azure AI Search results, trimming the results of documents that don\u0027tmatch the filter provided on the request. For an alternative pattern that might besimpler, or to revisit other security features, see the following links.\r\nSecurity filters for trimming resultsSecurity in Azure AI Search    searchOptions.Select.Add(\u0022name\u0022);    SearchResults\u003CSecuredFiles\u003E results = searchClient.Search\u003CSecuredFiles\u003E(\u0022*\u0022, searchOptions);    Console.WriteLine(\u0022Results for groups \u0027{0}\u0027 : {1}\u0022, _groupsCache[user], results.GetResults().Select(r =\u003E r.Document. Name));}Step 3: Handle the resultsNext stepsTransparency note: Azure AI SearchArticle•11/14/2023An AI system includes not only the technology, but also the people who will use it, thepeople who will be affected by it, and the environment in which it is deployed. Creatinga system that is fit for its intended purpose requires an understanding of how thetechnology works, what its capabilities and limitations are, and how to achieve the bestperformance.\n"
}