{
  "Id": "1258",
  "Title": "\u0022Fog Formation in Cold Valleys: A Satellite Perspective\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCold air is denser than warm air, and it sinks down into the \\n\\nvalleys. The moist air in the valleys gets chilled to its dew point, and fog forms. If undisturbed by winds, such fog may persist for \\n\\ndays. The Terra satellite captured this image of foggy valleys northeast of Vancouver in February 2010.\r\n\\n\\n\\n\u0022,            \u0022locations\u0022: [                \u0022Pacific Northwest\u0022,                \u0022North America\u0022,                \u0022Vancouver\u0022            ]        }    ]}extraction model looks for characteristics of an answer to find the appropriatecontent, but doesn\u0027t compose new language in the response.\u0022score\u0022 is a confidence score that reflects the strength of the answer.\r\nIf there aremultiple answers in the response, this score is used to determine the order. Topanswers and top captions can be derived from different search documents, wherethe top answer originates from one document, and the top caption from another,but in general the same documents appear in the top positions within each array.Answers are followed by the \u0022value\u0022 array, which always includes scores, captions, andany fields that are retrievable by default. If you specified the select parameter, the\u0022value\u0022 array is limited to the fields that you specified. See Configure semantic rankingfor details.\r\nFor best results, return semantic answers on a document corpus having the followingcharacteristics:The \u0022semanticConfiguration\u0022 must include fields that offer sufficient text in whichan answer is likely to be found. Fields more likely to contain answers should belisted first in \u0022prioritizedContentFields\u0022. Only verbatim text from a document canappear as an answer. Query strings must not be null (search=*) and the string should have thecharacteristics of a question, such as \u0022what is\u0022 or \u0022how to\u0022, as opposed to akeyword search consisting of terms or phrases in arbitrary order. If the query stringdoesn\u0027t appear to be a question, answer processing is skipped, even if the requestspecifies \u0022answers\u0022 as a query parameter.\n"
}