{
  "Id": "1080",
  "Title": "\u0022Formatting Web API Inputs and Outputs for Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022authResourceId\u0022: \u0022[for managed identity connections, your app\u0027s client ID goes here]\u0022,\u0022timeout\u0022: \u0022PT230S\u0022,Format Web API inputsA \u0022data\u0022 member, which is essentially a bag of input fields for each record.The resulting Web API request might look like this:JSONIn practice, your code may get called with hundreds or thousands of records instead ofonly the three shown here.\r\nThe format of the output is a set of records containing a \u0022recordId\u0022, and a property bag.This particular example has only one output, but you could output more than oneproperty. As a best practice, consider returning error and warning messages if a recordcouldn\u0027t be processed.\r\nJSON{    \u0022values\u0022: [      {        \u0022recordId\u0022: \u0022a1\u0022,        \u0022data\u0022:           {             \u0022contractText\u0022:                 \u0022This is a contract that was issues on November 3, 2017 and that involves... \u0022           }      },      {        \u0022recordId\u0022: \u0022b5\u0022,        \u0022data\u0022:           {             \u0022contractText\u0022:                 \u0022In the City of Seattle, WA on February 5, 2018 there was a decision made.\r\n..\u0022           }      },      {        \u0022recordId\u0022: \u0022c3\u0022,        \u0022data\u0022:           {             \u0022contractText\u0022: null           }      }    ]}Format Web API outputsWhen you create a Web API enricher, you can describe HTTP headers and parameters aspart of the request. The following snippet shows how request parameters and optionalHTTP headers can be included in the skillset definition. Setting an HTTP header is usefulif you need to pass configuration settings to your code. JSON{  \u0022values\u0022:   [      {        \u0022recordId\u0022: \u0022b5\u0022,        \u0022data\u0022 :         {            \u0022contractDate\u0022:  { \u0022day\u0022 : 5, \u0022month\u0022: 2, \u0022year\u0022 : 2018 }        }      },      {        \u0022recordId\u0022: \u0022a1\u0022,        \u0022data\u0022 : {            \u0022contractDate\u0022: { \u0022day\u0022 : 3, \u0022month\u0022: 11, \u0022year\u0022 :\n"
}