{
  "Id": "1495",
  "Title": "\u0022Foundational REST APIs and SDKs for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe REST APIs are foundational to Azure AI Search, and any changes to theprogramming model are reflected in the REST APIs first.Alternatives include the following Azure SDKs, which are independently updated onseparate release schedules:Microsoft Azure AI Search management client library for .\r\nNETMicrosoft Azure SDK for PythonAzure Search Management client library for JavaScriptAzure Resource Manager Azure AI Search client library for JavaConnect to the management endpointhttps://management.azure.com/subscriptions/[subscriptionId]/resourceGroups/[resourceGroupName]/providers/Microsoft.Search/searchServices/[serviceName]?api-version=2020-08-01Management APIs in other SDKsAzure AI Search documentationManage Azure AI Search with RESTManage Azure AI Search with Azure PowerShellManage Azure AI Search with Azure CLIManage Azure AI Search using Azure portalSee alsoAzure Cognitive Search client library for.NET - version 11.5.\r\n1Article•11/29/2023Azure Cognitive Search is a search-as-a-service cloud solution that gives developersAPIs and tools for adding a rich search experience over private, heterogeneous contentin web, mobile, and enterprise applications.The Azure Cognitive Search service is well suited for the following application scenarios:Consolidate varied content types into a single searchable index. To populate anindex, you can push JSON documents that contain your content, or if your data isalready in Azure, create an indexer to pull in data automatically.Attach skillsets to an indexer to create searchable content from images and largetext documents.\r\nA skillset leverages AI from Cognitive Services for built-in OCR,entity recognition, key phrase extraction, language detection, text translation, andsentiment analysis. You can also add custom skills to integrate external processingof your content during data ingestion.In a search client application, implement query logic and user experiences similarto commercial web search engines. Use the Azure.Search.Documents client library to:Submit queries for simple and advanced query forms that include fuzzy search,wildcard search, regular expressions.Implement filtered queries for faceted navigation, geospatial search, or to narrowresults based on filter criteria.Create and manage search indexes.Upload and update documents in the search index.\nCreate and manage indexers that pull data from Azure into an index.Create and manage skillsets that add AI enrichment to data ingestion.Create and manage analyzers for advanced text analysis or multi-lingual content.Optimize results through scoring profiles to factor in business logic or freshness.\n"
}