{
  "Id": "1280",
  "Title": "\u0022Fuzzy Search in Azure Cognitive Search: Techniques and Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIt\u0027s described as the \u0022minimum number of operations (insertions, deletions,substitutions, or transpositions of two adjacent characters) required to change one wordinto the other\u0022.In Azure Cognitive Search:Fuzzy query applies to whole terms. Phrases aren\u0027t supported directly but you canspecify a fuzzy match on each term of a multi-part phrase through ANDWhat is fuzzy search?constructions.\r\nFor example, search=dr~ AND cleanin~. This query expression findsmatches on \u0022dry cleaning\u0022.The default distance of an edit is 2. A value of ~0 signifies no expansion (only theexact term is considered a match), but you could specify ~1 for one degree ofdifference, or one edit.\r\nA fuzzy query can expand a term up to 50 permutations. This limit isn\u0027tconfigurable, but you can effectively reduce the number of expansions bydecreasing the edit distance to 1.Responses consist of documents containing a relevant match (up to 50).During query processing, fuzzy queries don\u0027t undergo lexical analysis.\r\nThe query input isadded directly to the query tree and expanded to create a graph of terms. The onlytransformation performed is lower casing.Collectively, the graphs are submitted as match criteria against tokens in the index. Asyou can imagine, fuzzy search is inherently slower than other query forms. The size andcomplexity of your index can determine whether the benefits are enough to offset thelatency of the response.String fields that are attributed as \u0022searchable\u0022 are candidates for fuzzy search.Analyzers aren\u0027t used to create an expansion graph, but that doesn\u0027t mean analyzersshould be ignored in fuzzy search scenarios. Analyzers are important for tokenization７ NoteBecause fuzzy search tends to be slow, it might be worthwhile to investigatealternatives such as n-gram indexing, with its progression of short charactersequences (two and three character sequences for bigram and trigram tokens).Depending on your language and query surface, n-gram might give you betterperformance.\n"
}