{
  "Id": "411",
  "Title": "\u0022Generative AI Capabilities and Content Retrieval in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe response, or search results, consist exclusively of the verbatim contentfound in your index.In a RAG pattern, queries and responses are coordinated between the search engine andthe LLM. A user\u0027s question or query is forwarded to both the search engine and to theLLM as a prompt.\r\nThe search results come back from the search engine and areredirected to an LLM. The response that makes it back to the user is generative AI, eithera summation or answer from the LLM.1112Content retrieval in Azure AI SearchThere\u0027s no query type in Azure AI Search - not even semantic or vector search - thatcomposes new answers.\r\nOnly the LLM provides generative AI. Here are the capabilitiesin Azure AI Search that are used to formulate queries:QueryfeaturePurposeWhy use itSimple orfull LucenesyntaxQuery execution over text andnon-vector numeric contentFull text search is best for exact matches,rather than similar matches.\r\nFull text searchqueries are ranked using the BM25 algorithmand support relevance tuning through scoringprofiles. It also supports filters and facets.Filters andfacetsApplies to text or numeric (non-vector) fields only. Reduces thesearch surface area based oninclusion or exclusion criteria.Adds precision to your queries.\r\nSemanticrankingRe-ranks a BM25 result set usingsemantic models. Producesshort-form captions and answersthat are useful as LLM inputs.Easier than scoring profiles, and depending onyour content, a more reliable technique forrelevance tuning.VectorsearchQuery execution over vectorfields for similarity search, wherethe query string is one or morevectors. Vectors can represent all types of content, inany language.HybridsearchCombines any or all of the abovequery techniques. Vector andnon-vector queries execute inparallel and are returned in aunified result set.The most significant gains in precision andrecall are through hybrid queries.\n"
}