{
  "Id": "618",
  "Title": "\u0022Geo-Distributed Search Services: Strategies for Global Availability and Performance\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf2021 or laterNorway EastJanuary 20, 2022 or laterQatar CentralAugust 25, 2022 or laterSouth Africa NorthSeptember 7, 2022 or laterSouth Central USApril 30, 2021 or laterSouth East Asia January 31, 2021 or laterSweden CentralJanuary 21, 2022 or laterSwitzerland NorthSeptember 7, 2022 or laterUAE NorthSeptember 9,\r\n2022 or laterUK South January 30, 2021 or laterUS Gov VirginiaApril 30, 2021 or laterWest Europe January 29, 2021 or laterWest US 2 January 30, 2021 or laterWest US 3 June 02, 2021 or later７ NoteAvailability zones don\u0027t change the terms of the Azure AI Search Service LevelAgreement.\r\nYou still need three or more replicas for query high availability.\r\nMultiple services in separate geographicregionsService redundancy is necessary if your operational requirements include:Business continuity and disaster recovery (BCDR) requirements (Azure AI Searchdoesn\u0027t provide instant failover if there\u0027s an outage).Fast performance for a globally distributed application. If query and indexingrequests come from all over the world, users who are closest to the host datacenter experience faster performance. Creating more services in regions with closeproximity to these users can equalize performance for all users.If you need two or more search services, creating them in different regions can meetapplication requirements for continuity and recovery, and faster response times for aglobal user base. Azure AI Search doesn\u0027t provide an automated method of replicating search indexesacross geographic regions, but there are some techniques that can make this processsimple to implement and manage. These techniques are outlined in the next fewsections.The goal of a geo-distributed set of search services is to have two or more indexesavailable in two or more regions, where a user is routed to the Azure AI Search servicethat provides the lowest latency:You can implement this architecture by creating multiple services and designing astrategy for data synchronization. Optionally, you can include a resource like AzureTraffic Manager for routing requests.\n"
}