{
  "Id": "1630",
  "Title": "\u0022Geo-Spatial Queries and Null: Azure AI Search Filter Examples\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfintersects(location,geography\u0027POLYGON((179 65, 179 66, -179 66, -179 65, 179 65))\u0027). Otherwise, for non-rectangular or unaligned shapes, consider the split polygon approach.Like all other non-collection fields in Azure AI Search, fields of type Edm.\r\nGeographyPointcan contain null values. When Azure AI Search evaluates geo.intersects for a field thatis null, the result will always be false. The behavior of geo.distance in this casedepends on the context:In filters, geo.distance of a null field results in null. This means the documentwill not match because null compared to any non-null value evaluates to false.\r\nWhen sorting results using $orderby, geo.distance of a null field results in themaximum possible distance. Documents with such a field will sort lower than allothers when the sort direction asc is used (the default), and higher than all otherswhen the direction is desc.geo.\r\nintersectsGeo-spatial queries and polygons spanning the 180thmeridianGeo-spatial functions and nullExamplesFind all hotels within 10 kilometers of a given reference point (where location is a fieldof type Edm.GeographyPoint):odata-filter-exprFind all hotels within a given viewport described as a polygon (where location is a fieldof type Edm.\r\nGeographyPoint). Note that the polygon is closed (the first and last pointsets must be the same) and the points must be listed in counterclockwise order.odata-filter-exprSort hotels descending by rating, then ascending by distance from the givencoordinates:odata-filter-exprSort hotels in descending order by search. score and rating, and then in ascendingorder by distance from the given coordinates so that between two hotels with identicalratings, the closest one is listed first:odata-filter-exprFilters in Azure AI SearchOData expression language overview for Azure AI SearchFilter examples    geo.distance(location, geography\u0027POINT(-122.131577 47.\n"
}