{
  "Id": "1511",
  "Title": "\u0022Getting Started with Azure Cognitive Search: Key Concepts and Operations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfazure\u003C/groupId\u003E    \u003CartifactId\u003Eazure-search-documents\u003C/artifactId\u003EJava Development Kit (JDK) with version 8 or aboveAzure subscriptionAzure Cognitive Search serviceTo create a new search service, you can use the Azure portal, Azure PowerShell, orthe Azure CLI. Here\u0027s an example using the Azure CLI to create a free instance forgetting started:BashSee choosing a pricing tier for more information about available options.\r\nTo interact with the Search service, you\u0027ll need to create an instance of the appropriateclient class: SearchClient for searching indexed documents, SearchIndexClient formanaging indexes, or SearchIndexerClient for crawling data sources and loading searchdocuments into an index. To instantiate a client object, you\u0027ll need an endpoint and APIkey.\r\nYou can refer to the documentation for more information on supportedauthenticating approaches with the Search service.You can get the endpoint and an API key from the Search service in the Azure Portal.Please refer the documentation for instructions on how to get an API key.Alternatively, you can use the following Azure CLI command to retrieve the API key fromthe Search service:BashNote:    \u003Cversion\u003E11.\r\n6.0\u003C/version\u003E\u003C/dependency\u003EPrerequisitesaz search service create --name \u003Cmysearch\u003E --resource-group \u003Cmysearch-rg\u003E --sku free --location westusAuthenticate the clientGet an API Keyaz search admin-key show --service-name \u003Cmysearch\u003E --resource-group \u003Cmysearch-rg\u003EThe example Azure CLI snippet above retrieves an admin key. This allows for easieraccess when exploring APIs, but it should be managed carefully.There are two types of keys used to access your search service: admin (read-write)and query (read-only) keys. Restricting access and operations in client apps isessential to safeguarding the search assets on your service. Always use a query keyrather than an admin key for any query originating from a client app.The SDK provides three clients.SearchIndexClient for CRUD operations on indexes and synonym maps.SearchIndexerClient for CRUD operations on indexers, data sources, and skillsets.\n"
}