{
  "Id": "288",
  "Title": "\u0022Getting Started with Azure Cognitive Search: Setup and Configuration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can use the Free tier to complete this walkthrough.To interact with your Azure Cognitive Search service you will need the service URL andan access key.1. Sign in to the Azure portal, and in your search service Overview page, get thename of your search service. You can confirm your service name by reviewing theendpoint URL.\r\nIf your endpoint URL were https://mydemo.search.windows.net, yourservice name would be mydemo.2. In Settings \u003E Keys, get an admin key for full rights on the service. You can copyeither the primary or secondary key.DefaultEndpointsProtocol=https;AccountName=cogsrchdemostorage;AccountKey=\u003Cyour account key\u003E;EndpointSuffix=core.windows.\r\nnetAzure AI servicesAzure Cognitive SearchCopy an admin api-key and URL for Azure CognitiveSearchHaving a valid key establishes trust, on a per request basis, between the applicationsending the request and the service that handles it.Begin by opening Visual Studio and creating a new Console App project that can run on.NET Core.The Azure Cognitive Search .\r\nNET SDK consists of a client library that enables you tomanage your indexes, data sources, indexers, and skillsets, as well as upload andmanage documents and execute queries, all without having to deal with the details ofHTTP and JSON. This client library is distributed as a NuGet package.For this project, install version 11 or later of the Azure.Search.Documents and the latestversion of Microsoft.Extensions.\r\nConfiguration.1. In Visual Studio, select Tools \u003E NuGet Package Manager \u003E Manage NuGetPackages for Solution...2. Browse for Azure.Search.Document.3. Select the latest version and then click Install.4. Repeat the previous steps to install Microsoft.Extensions.Configuration andMicrosoft.Extensions.Configuration.Json.2 - Set up your environmentInstall Azure.Search. Documents1. Right-click on your project in the Solution Explorer and select Add \u003E New Item... .2. Name the file appsettings.json and select Add.3. Include this file in your output directory.a. Right-click on appsettings.json and select Properties.b. Change the value of Copy to Output Directory to Copy if newer.4. Copy the below JSON into your new JSON file.\n"
}