{
  "Id": "1514",
  "Title": "\u0022Getting Started with Azure Cognitive Search: Java SDK Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfMake sure you use the right namespace for DefaultAzureCredential at the top of yoursource file:JavaThen you can create an instance of DefaultAzureCredential and pass it to a newinstance of your client:JavaTo get running with Azure Cognitive Search first create an index following this guide.With an index created you can use the following samples to begin using the SDK.import com.azure.identity.DefaultAzureCredential;import com.azure.identity.DefaultAzureCredentialBuilder;String indexName = \u0022nycjobs\u0022;// Get the service endpoint from the environmentString endpoint = Configuration.getGlobalConfiguration().\r\nget(\u0022SEARCH_ENDPOINT\u0022);DefaultAzureCredential credential = new DefaultAzureCredentialBuilder().build();// Create a clientSearchClient client = new SearchClientBuilder()    .endpoint(endpoint)    .indexName(indexName)    .credential(credential)    .buildClient();Send your first search queryAn Azure Cognitive Search service contains one or more indexes that provide persistentstorage of searchable data in the form of JSON documents. (If you\u0027re new to search, youcan make a very rough analogy between indexes and database tables.) The azure-search-documents client library exposes operations on these resources through two main clienttypes.\r\nSearchClient helps with:Searching your indexed documents using rich queries and powerful datashapingAutocompleting partially typed search terms based on documents in the indexSuggesting the most likely matching text in documents as a user typesAdding, Updating or Deleting Documents documents from an indexSearchIndexClient allows you to: Create, delete, update, or configure a search indexDeclare custom synonym maps to expand or rewrite queriesMost of the SearchServiceClient functionality is not yet available in our currentpreviewSearchIndexerClient allows you to:Start indexers to automatically crawl data sourcesDefine AI powered Skillsets to transform and enrich your dataAzure Cognitive Search provides two powerful features:Semantic search enhances the quality of search results for text-based queries.\n"
}