{
  "Id": "1542",
  "Title": "\u0022Getting Started with Azure Cognitive Search: Essential Setup Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf7 or later is required to use this package.You need an Azure subscription and an Azure Cognitive Search service to usethis package.To create a new search service, you can use the Azure portal, Azure PowerShell, or theAzure CLI.PowershellSee choosing a pricing tier for more information about available options.To interact with the Search service, you\u0027ll need to create an instance of the appropriateclient class: SearchClient for searching indexed documents, SearchIndexClient formanaging indexes, or SearchIndexerClient for crawling data sources and loading searchdocuments into an index. To instantiate a client object, you\u0027ll need an endpoint and anAPI key.\r\nYou can refer to the documentation for more information on supportedauthenticating approaches with the Search service.You can get the endpoint and an API key from the Search service in the Azure Portal.Please refer the documentation for instructions on how to get an API key.\r\nAlternatively, you can use the following Azure CLI command to retrieve the API key fromthe Search service:Powershellpip install azure-search-documentsPrerequisitesaz search service create --name \u003Cmysearch\u003E --resource-group \u003Cmysearch-rg\u003E --sku free --location westusAuthenticate the clientGet an API KeyThere are two types of keys used to access your search service: admin (read-write) andquery (read-only) keys. Restricting access and operations in client apps is essential tosafeguarding the search assets on your service. Always use a query key rather than anadmin key for any query originating from a client app.Note: The example Azure CLI snippet above retrieves an admin key so it\u0027s easier to getstarted exploring APIs, but it should be managed carefully.To instantiate the SearchClient, you\u0027ll need the endpoint, API key and index name:PythonYou can also create a SearchClient, SearchIndexClient, or SearchIndexerClient usingAzure Active Directory (AAD) authentication.\n"
}