{
  "Id": "1759",
  "Title": "\u0022Handling Errors and Deprecated Cognitive Skills in Azure AI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis property is required, but can have anull value.The ordering of objects in the values in either the request or response isn\u0027timportant. However, the recordId is used for correlation so any record in theresponse containing a recordId which was not part of the original request to theWeb API will be discarded.\r\nJSON{     \u0022values\u0022: [         {             \u0022recordId\u0022: \u00223\u0022,             \u0022data\u0022: {             },             \u0022errors\u0022: [               {                 \u0022message\u0022 : \u0022\u0027phraseList\u0027 should not be null or empty\u0022               }             ],             \u0022warnings\u0022: null         },         {             \u0022recordId\u0022: \u00222\u0022, In addition to your Web API being unavailable, or sending out non-successful statuscodes the following are considered erroneous cases:If the Web API returns a success status code but the response indicates that it isnot application/json then the response is considered invalid and no enrichmentswill be performed.\r\nIf there are invalid records (for example, recordId is missing or duplicated) in theresponse values array, no enrichment will be performed for the invalid records.For cases when the Web API is unavailable or returns an HTTP error, a friendly error withany available details about the HTTP error will be added to the indexer executionhistory.\r\n\u0022data\u0022: {                 \u0022hitPositions\u0022: [6, 16]             },             \u0022errors\u0022: null,             \u0022warnings\u0022: null         },         {             \u0022recordId\u0022: \u00220\u0022,             \u0022data\u0022: {                 \u0022hitPositions\u0022: [0, 23]             },             \u0022errors\u0022: null,             \u0022warnings\u0022: null         },         {             \u0022recordId\u0022: \u00221\u0022,             \u0022data\u0022: {                 \u0022hitPositions\u0022: []             },             \u0022errors\u0022: null,             \u0022warnings\u0022: {                 \u0022message\u0022: \u0022No occurrences of \u0027Hi\u0027 were found in the input text\u0022             }         },     ] } Error casesSee alsoHow to define a skillsetAdd custom skill to an AI enrichment pipelineExample: Creating a custom skill for AI enrichmentDeprecated Cognitive Skills in Azure AISearchArticle•11/15/2023This document describes cognitive skills that are considered deprecated (retired).\nUsethe following guide for the contents:Skill Name: The name of the skill that will be deprecated; it maps to the@odata.\n"
}