{
  "Id": "616",
  "Title": "\u0022High Availability and Replicas in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn Azure AI Search, replicas are copies of your index. A search service is commissionedwith at least one replica, and can have up to 12 replicas. Adding replicas allows Azure AISearch to do machine reboots and maintenance against one replica, while queryexecution continues on other replicas.For each individual search service, Microsoft guarantees at least 99.9% availability forconfigurations that meet these criteria:Two replicas for high availability of read-only workloads (queries)Three or more replicas for high availability of read-write workloads (queries andindexing)The system has internal mechanisms for monitoring replica health and partitionintegrity.\r\nIf you provision a specific combination of replicas and partitions, the systemensures that level of capacity for your service.High availabilityNo SLA is provided for the Free tier. For more information, see SLA for Azure AISearch.Availability zones are an Azure platform capability that divides a region\u0027s data centersinto distinct physical location groups to provide high-availability, within the sameregion.\r\nIn Azure AI Search, individual replicas are the units for zone assignment. A searchservice runs within one region; its replicas run in different physical data centers (orzones) within that region.Availability zones are used when you add two or more replicas to your search service. Each replica is placed in a different availability zone within the region. If you have morereplicas than available zones in the search service region, the replicas are distributedacross zones as evenly as possible. There\u0027s no specific action on your part, except tocreate a search service in a region that provides availability zones, and then to configurethe service to use multiple replicas.Service tier must be Standard or higher.Service region must be in a region that has available zones (listed in the followingtable).Configuration must include multiple replicas: two for read-only query workloads,three for read-write workloads that include indexing.\n"
}