{
  "Id": "68",
  "Title": "\u0022Hotel Listings and Azure AI Search: A Comprehensive Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf5094974040985107,            \u0022HotelId\u0022: \u002249\u0022,            \u0022HotelName\u0022: \u0022Old Carrabelle Hotel\u0022,            \u0022Description\u0022: \u0022Spacious rooms, glamorous suites and residences, rooftop pool, walking access to shopping, dining, entertainment and the city center.\u0022,            \u0022Category\u0022: \u0022Luxury\u0022,            \u0022Address\u0022: {                \u0022City\u0022: \u0022Arlington\u0022,                \u0022StateProvince\u0022: \u0022VA\u0022            }        },        {            \u0022@search.score\u0022: 0.\r\n03306011110544205,            \u0022@search.rerankerScore\u0022: 2.0370211601257324,            \u0022HotelId\u0022: \u002248\u0022,            \u0022HotelName\u0022: \u0022Nordick\u0027s Motel\u0022,            \u0022Description\u0022: \u0022Only 90 miles (about 2 hours) from the nation\u0027s capital and nearby most everything the historic valley has to offer.\r\nHiking? Wine Tasting? Exploring the caverns?  It\u0027s all nearby and we have specially priced packages to help make our B\u0026B your home base for fun while visiting the valley.\u0022,            \u0022Category\u0022: \u0022Boutique\u0022,            \u0022Address\u0022: {                \u0022City\u0022: \u0022Washington D.C.\u0022,                \u0022StateProvince\u0022: null            }        },        {            \u0022@search.score\u0022: 0.032258063554763794,            \u0022@search.\r\nrerankerScore\u0022: 1.6706111431121826,Key points:Vector search is specified through the vector \u0022vectors.value\u0022 property. Keywordsearch is specified through \u0022search\u0022 property.In a hybrid search, you can integrate vector search with full text search overkeywords. Filters, spell check, and semantic ranking apply to textual content only,and not vectors. In this final query, there\u0027s no semantic \u0022answer\u0022 because thesystem didn\u0027t produce one that was sufficiently strong.Actual results include more detail, including semantic captions and highlights.Results have been modified for readability. You should run the request in thePostman collection to get the full structure of the response.Azure AI Search is a billable resource.\n"
}