{
  "Id": "404",
  "Title": "\u0022Hybrid Retrieval with Semantic Ranking in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdffacets\u0022: {        \u0022Address/StateProvince\u0022: [            {                \u0022count\u0022: 1,                \u0022value\u0022: \u0022NY\u0022            },            {                \u0022count\u0022: 1,                \u0022value\u0022: \u0022VA\u0022            }        ]    },    \u0022value\u0022: [        {            \u0022@search.score\u0022: 0.\r\n03333333507180214,            \u0022@search.rerankerScore\u0022: 2.5229012966156006,            \u0022HotelId\u0022: \u002249\u0022,            \u0022HotelName\u0022: \u0022Old Carrabelle Hotel\u0022,            \u0022Description\u0022: \u0022Spacious rooms, glamorous suites and residences, rooftop pool, walking access to shopping, dining, entertainment and the city center.\r\n\u0022,            \u0022Category\u0022: \u0022Luxury\u0022,            \u0022Address\u0022: {                \u0022City\u0022: \u0022Arlington\u0022,                \u0022StateProvince\u0022: \u0022VA\u0022            }        },        {            \u0022@search.score\u0022: 0.032522473484277725,            \u0022@search.rerankerScore\u0022: 2.111117362976074,            \u0022HotelId\u0022: \u002248\u0022,            \u0022HotelName\u0022: \u0022Nordick\u0027s Motel\u0022,            \u0022Description\u0022: \u0022Only 90 miles (about 2 hours) from the nation\u0027s capital and nearby most everything the historic valley has to offer.\r\nHiking? Wine Tasting? Exploring the caverns?  It\u0027s all nearby and we have specially priced packages to help make our B\u0026B your home base for fun while visiting the valley.\u0022,            \u0022Category\u0022: \u0022Boutique\u0022,Hybrid search combines the strengths of vector search and keyword search. Theadvantage of vector search is finding information that\u0027s conceptually similar to yoursearch query, even if there are no keyword matches in the inverted index. The advantageof keyword or full text search is precision, with the ability to apply semantic ranking thatimproves the quality of the initial results. Some scenarios - such as querying overproduct codes, highly specialized jargon, dates, and people\u0027s names - can performbetter with keyword search because it can identify exact matches.Benchmark testing on real-world and benchmark datasets indicates that hybrid retrievalwith semantic ranking offers significant benefits in search relevance.\n"
}