{
  "Id": "1165",
  "Title": "\u0022Hybrid Search and Filter: Azure Search API Key Points\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022k\u0022 determines how many nearest neighbor matches are returned from the vectorquery and provided to the RRF ranker.\u0022top\u0022 determines how many matches are returned in the response all-up. In thisexample, the response includes 10 results, assuming there are at least 10 matchesin the merged results.\r\nThis example adds a filter, which is applied to the \u0022filterable\u0022 nonvector fields of thesearch index.HTTPKey points:Hybrid search with filterPOST https://{{search-service-name}}.search.windows.net/indexes/{{index-name}}/docs/search?api-version=2023-11-01Content-Type: application/jsonapi-key: {{admin-api-key}}{    \u0022vectorQueries\u0022: [        {            \u0022vector\u0022: [                -0.\r\n009154141,                0.018708462,                . . .                 -0.02178128,                -0.00086512347            ],            \u0022fields\u0022: \u0022contentVector\u0022,            \u0022kind\u0022: \u0022vector\u0022,            \u0022k\u0022: 10        }    ],    \u0022search\u0022: \u0022what azure services support full text search\u0022,    \u0022vectorFilterMode\u0022: \u0022postFilter\u0022,    \u0022filter\u0022: \u0022category eq \u0027Databases\u0027\u0022,    \u0022top\u0022: \u002210\u0022}Filters are applied to the content of filterable fields.\r\nIn this example, the categoryfield is marked as filterable in the index schema.In hybrid queries, filters can be applied before query execution to reduce the querysurface, or after query execution to trim results. \u0022preFilter\u0022 is the default. To usepostFilter, set the filter processing mode.When you postfilter query results, the number of results might be less than top-n.Assuming that you enabled semantic ranking and your index definition includes asemantic configuration, you can formulate a query that includes vector search, pluskeyword search.\n"
}