{
  "Id": "1049",
  "Title": "\u0022Image Processing and Storage in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA maximum of 1000 images will be extracted from a givenSource files that include images＂A search indexer, configured for image actions＂A skillset with built-in or custom skills that invoke OCR or image analysis＂A search index with fields to receive the analyzed text output, plus output fieldmappings in the indexer that establish association.＂Set up source filesdocument. If there are more than 1000 images in a document, the first 1000 will beextracted and a warning will be generated.\r\nAzure Blob Storage is the most frequently used storage for image processing inCognitive Search. There are three main tasks related to retrieving images from a blobcontainer:Enable access to content in the container. If you\u0027re using a full access connectionstring that includes a key, the key gives you permission to the content.\r\nAlternatively, you can authenticate using Azure Active Directory (Azure AD) orconnect as a trusted service.Create a data source of type \u0022azureblob\u0022 that connects to the blob containerstoring your files.Review service tier limits to make sure that your source data is under maximumsize and quantity limits for indexers and enrichment.Extracting images from the source content files is the first step of indexer processing. Extracted images are queued for image processing. Extracted text is queued for textprocessing, if applicable.Image processing requires image normalization to make images more uniform fordownstream processing. This second step occurs automatically and is internal to indexerprocessing. As a developer, you enable image normalization by setting the\u0022imageAction\u0022 parameter in indexer configuration.Image normalization includes the following operations:Large images are resized to a maximum height and width to make them uniformand consumable during skillset processing.For images that have metadata on orientation, image rotation is adjusted forvertical loading.Metadata adjustments are captured in a complex type created for each image.\n"
}