{
  "Id": "1052",
  "Title": "\u0022Image Normalization and Processing: Parameters, Configuration, and Samples\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfwidthWidth of the normalized image in pixels.heightHeight of the normalized image in pixels.originalWidthThe original width of the image before normalization.originalHeightThe original height of the image before normalization.rotationFromOriginalCounter-clockwise rotation in degrees that occurred to create thenormalized image. A value between 0 degrees and 360 degrees. This stepreads the metadata from the image that is generated by a camera orscanner. Usually a multiple of 90 degrees.{   \u0022parameters\u0022 : {        \u0022configuration\u0022 : {            \u0022indexedFileNameExtensions\u0022 : \u0022.\r\npdf, .docx\u0022,           \u0022excludedFileNameExtensions\u0022 : \u0022.png, .jpeg\u0022        }    } } About normalized imagesImage memberDescriptioncontentOffsetThe character offset within the content field where the image wasextracted from. This field is only applicable for files with embeddedimages.\r\nNote that the contentOffset for images extracted from PDFdocuments will always be at the end of the text on the page it wasextracted from in the document. This means images will be after all thetext on that page, regardless of the original location of the image in thepage.pageNumberIf the image was extracted or rendered from a PDF, this field contains thepage number in the PDF it was extracted or rendered from, starting from1. If the image was not from a PDF, this field will be 0.Sample value of normalized_images:JSONThis section supplements the skill reference articles by providing context for workingwith skill inputs, outputs, and patterns, as they relate to image processing.1. Create or update a skillset to add skills.2. Add templates for OCR and Image Analysis from the portal, or copy the definitionsfrom the skill reference documentation. Insert them into the skills array of yourskillset definition.3. If necessary, include multi-service key in the Cognitive Services property of theskillset.\n"
}