{
  "Id": "1692",
  "Title": "\u0022Image Analysis Skill: Output Structure and Data Types Explained\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIt also returns a rectangle withfour bounding box coordinates (x, y, w, h, in pixels) indicating placement insidethe image. For the rectangle, x and y are the top left. Bottom left is x, y\u002Bh. Topright is x\u002Bw, y. Bottom right is x\u002Bw, y\u002Bh.\r\ncategoriesOutput is an array of category objects, where each category object is a complextype consisting of a name (string), score (double), and optional detail thatcontains celebrity or landmark details. See the category taxonomy for the full listof category names. A detail is a nested complex type. A celebrity detail consists ofa name, confidence score, and face bounding box. A landmark detail consists of aname and confidence score.\r\ndescriptionOutput is a single description object of a complex type, consisting of lists of tagsand caption (an array consisting of Text (string) and confidence (double)).facesComplex type consisting of age, gender, and faceBoundingBox having fourbounding box coordinates (in pixels) indicating placement inside the image.Coordinates are top, left, width, height.objectsOutput is an array of visual feature objects. Each object is a complex type,consisting of object (string), confidence (double), rectangle (with four boundingbox coordinates indicating placement inside the image), and a parent thatcontains an object name and confidence .\r\ntagsOutput is an array of imageTag objects, where a tag object is a complex typeconsisting of name (string), hint (string), and confidence (double). The addition ofa hint is rare. It\u0027s only generated if a tag is ambiguous. For example, an imagetagged as \u0022curling\u0022 might have a hint of \u0022sports\u0022 to better indicate its content. JSONSample skill definition{    \u0022description\u0022: \u0022Extract image analysis.\u0022,    \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Vision.ImageAnalysisSkill\u0022,    \u0022context\u0022: \u0022/document/normalized_images/*\u0022,    \u0022defaultLanguageCode\u0022: \u0022en\u0022,    \u0022visualFeatures\u0022: [        \u0022adult\u0022,        \u0022brands\u0022,For single objects (such as adult and description), you can structure them in the indexas a Collection(Edm.\nComplexType) to return adult and description output for all ofthem. For more information about mapping outputs to index fields, see Flatteninginformation from complex types.\n"
}