{
  "Id": "784",
  "Title": "\u0022Implementing Synonyms in Azure AI Search: Best Practices and Usage\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf youwant to preserve punctuation, such as periods or dashes, in the synonym term, apply acontent-preserving analyzer on the field.Internally, the synonyms feature rewrites the original query with synonyms with the ORoperator. For this reason, hit highlighting and scoring profiles treat the original term andsynonyms as equivalent.\r\nSynonyms apply to free-form text queries only and aren\u0027t supported for filters, facets,autocomplete, or suggestions. Autocomplete and suggestions are based only on theoriginal term; synonym matches don\u0027t appear in the response.Synonym expansions don\u0027t apply to wildcard search terms; prefix, fuzzy, and regex termsaren\u0027t expanded.\r\nIf you need to do a single query that applies synonym expansion and wildcard, regex, orfuzzy searches, you can combine the queries using the OR syntax. For example, tocombine synonyms with wildcards for simple query syntax, the term would be \u003Cquery\u003E |\u003Cquery\u003E*.            ]         }     ] } Query on equivalent or mapped fieldsHow synonyms are used during queryexecutionIf you have an existing index in a development (non-production) environment,experiment with a small dictionary to see how the addition of synonyms changes thesearch experience, including impact on scoring profiles, hit highlighting, andsuggestions.\r\nNext stepsCreate a synonym map (REST API)Example: Add synonyms for Azure AISearch in C#Article•11/15/2023Synonyms expand a query by matching on terms considered semantically equivalent tothe input term. For example, you might want \u0022car\u0022 to match documents containing theterms \u0022automobile\u0022 or \u0022vehicle\u0022.In Azure AI Search, synonyms are defined in a synonym map, through mapping rules thatassociate equivalent terms. This example covers essential steps for adding and usingsynonyms with an existing index.In this example, you will learn how to:You can query a synonym-enabled field as you would normally. There is no additionalquery syntax required to access synonyms.You can create multiple synonym maps, post them as a service-wide resource availableto any index, and then reference which one to use at the field level.\n"
}