{
  "Id": "779",
  "Title": "\u0022Implementing Synonym Maps and Token Filters in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf1 Token Filter Types are always prefixed in code with #Microsoft.Azure.Search such thatArabicNormalizationTokenFilter would actually be specified as#Microsoft.Azure.Search.ArabicNormalizationTokenFilter. We removed the prefix toreduce the width of the table, but please remember to include it in your code.\r\nAzure AI Search REST APIsAnalyzers in Azure AI Search (Examples)Create Index (REST)1See alsoSynonyms in Azure Cognitive SearchArticle•09/13/2022Within a search service, synonym maps are a global resource that associate equivalentterms, expanding the scope of a query without the user having to actually provide theterm. For example, assuming \u0022dog\u0022, \u0022canine\u0022, and \u0022puppy\u0022 are mapped synonyms, aquery on \u0022canine\u0022 will match on a document containing \u0022dog\u0022.\r\nA synonym map is an asset that can be created once and used by many indexes. Theservice tier determines how many synonym maps you can create, ranging from threesynonym maps for Free and Basic tiers, up to 20 for the Standard tiers.You might create multiple synonym maps for different languages, such as English andFrench versions, or lexicons if your content includes technical or obscure terminology.Although you can create multiple synonym maps in your search service, within an index,a field definition can only have one synonym map assignment.A synonym map consists of name, format, and rules that function as synonym mapentries.\r\nThe only format that is supported is solr, and the solr format determines ruleconstruction.HTTPTo create a synonym map, do so programmatically (the portal doesn\u0027t support synonymmap definitions):Create Synonym Map (REST API). This reference is the most descriptive.SynonymMap class (. NET) and Add Synonyms using C#SynonymMap class (Python)SynonymMap interface (JavaScript)SynonymMap class (Java)Create synonymsPOST /synonymmaps?api-version=2020-06-30 {     \u0022name\u0022: \u0022geo-synonyms\u0022,     \u0022format\u0022: \u0022solr\u0022,     \u0022synonyms\u0022: \u0022         USA, United States, United States of America\\n         Washington, Wash., WA =\u003E WA\\n\u0022 } Mapping rules adhere to the open-source synonym filter specification of Apache Solr,described in this document: SynonymFilter.\n"
}