{
  "Id": "938",
  "Title": "\u0022Implementing Soft Delete Strategies for Azure Storage Indexing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor indexed content that originates from AzureStorage, change detection occurs automatically because indexers keep track of the lastupdate using the built-in timestamps on objects and files in Azure Storage.Although change detection is a given, deletion detection isn\u0027t. An indexer doesn\u0027t trackobject deletion in data sources.\r\nTo avoid having orphan search documents, you canimplement a \u0022soft delete\u0022 strategy that results in deleting search documents first, withphysical deletion in Azure Storage following as a second step.\r\nThere are two ways to implement a soft delete strategy:Native blob soft delete (preview), applies to Blob Storage onlySoft delete using custom metadataUse an Azure Storage indexer for Blob Storage, Table Storage, File Storage, or DataLake Storage Gen2Use consistent document keys and file structure. Changing document keys ordirectory names and paths (applies to ADLS Gen2) breaks the internal trackinginformation used by indexers to know which content was indexed, and when it waslast indexed.\r\nPrerequisites７ NoteADLS Gen2 allows directories to be renamed. When a directory is renamed, thetimestamps for the blobs in that directory do not get updated. As a result, theindexer will not re-index those blobs. If you need the blobs in a directory to bereindexed after a directory rename because they now have new URLs, you will needto update the LastModified timestamp for all the blobs in the directory so that theindexer knows to re-index them during a future run.\r\nThe virtual directories in AzureBlob Storage cannot be changed, so they do not have this issue.For this deletion detection approach, Azure AI Search depends on the native blob softdelete feature in Azure Blob Storage to determine whether blobs have transitioned to asoft deleted state. When blobs are detected in this state, a search indexer uses thisinformation to remove the corresponding document from the index.Blobs must be in an Azure Blob Storage container. The Azure AI Search native blobsoft delete policy isn\u0027t supported for blobs in ADLS Gen2.Enable soft delete for blobs.Document keys for the documents in your index must be mapped to either be ablob property or blob metadata, such as \u0022metadata_storage_path\u0022.You must use the preview REST API (api-version=2020-06-30-Preview), or theindexer Data Source configuration in the Azure portal, to configure support for softdelete.\n"
}