{
  "Id": "1249",
  "Title": "\u0022Implementing Hit Highlighting in Azure Cognitive Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis techniqueis described further on in this section.Hit highlighting instructions are provided on the query request. Queries that triggerquery expansion in the engine, such as fuzzy and wildcard search, have limited supportfor hit highlighting.Fields must be Edm.String or Collection(Edm.String)Fields must be attributed at searchableBoost relevance using a scoring profileHit highlightingRequirements for hit highlightingSpecify highlighting in the requestTo return highlighted terms, include the \u0022highlight\u0022 parameter in the query request. Theparameter is set to a comma-delimited list of fields.\r\nBy default, the format mark up is \u003Cem\u003E, but you can override the tag usinghighlightPreTag and highlightPostTag parameters. Your client code handles theresponse (for example, applying a bold font or a yellow background).HTTPBy default, Azure Cognitive Search returns up to five highlights per field.\r\nYou can adjustthis number by appending a dash followed by an integer. For example, \u0022highlight\u0022:\u0022description-10\u0022 returns up to 10 highlighted terms on matching content in the\u0022description\u0022 field.When highlighting is added to the query, the response includes an \u0022@search.highlights\u0022for each result so that your application code can target that structure.\r\nThe list of fieldsspecified for \u0022highlight\u0022 are included in the response.In a keyword search, each term is scanned for independently. A query for \u0022divinesecrets\u0022 will return matches on any document containing either term. POST /indexes/good-books/docs/search?api-version=2020-06-30     {        \u0022search\u0022: \u0022divine secrets\u0022,        \u0022highlight\u0022: \u0022title, original_title\u0022,      \u0022highlightPreTag\u0022: \u0022\u003Cb\u003E\u0022,      \u0022highlightPostTag\u0022: \u0022\u003C/b\u003E\u0022    }Highlighted resultsWithin a highlighted field, formatting is applied to whole terms. For example, on amatch against \u0022The Divine Secrets of the Ya-Ya Sisterhood\u0022, formatting is applied toeach term separately, even though they\u0027re consecutive.JSONKeyword search highlighting\u0022@odata.\n"
}