{
  "Id": "46",
  "Title": "\u0022Implementing Semantic Ranking in Azure AI Search: A Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSelect.Add(\u0022HotelName\u0022);options.Select.Add(\u0022Category\u0022);options.Select.Add(\u0022Description\u0022);// response = srchclient.Search\u003CHotel\u003E(\u0022*\u0022, options);response = srchclient.Search\u003CHotel\u003E(\u0022what hotel has a good restaurant on site\u0022, options);WriteDocuments(response);For comparison, here are results from a query that uses the default BM25 ranking,based on term frequency and proximity.\r\nGiven the query \u0022what hotel has a goodrestaurant on site\u0022, the BM25 ranking algorithm returns matches in the order shownin this screenshot:In contrast, when semantic ranking is applied to the same query (\u0022what hotel has agood restaurant on site\u0022), the results are reranked based on semantic relevance tothe query. This time, the top result is the hotel with the restaurant, which alignsbetter to user expectations.Press F5 to rebuild the app and run the program in its entirety.Output includes messages from Console.WriteLine, with the addition of queryinformation and results.\r\nWhen you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created. Resources left running cancost you money. You can delete resources individually or delete the resource group todelete the entire set of resources.\r\nYou can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.Run the programClean up resourcesNext stepsIn this quickstart, you learned how to invoke semantic ranking on an existing index. Werecommend trying semantic ranking on your own indexes as a next step. However, ifyou want to continue with demos, visit the following link. Tutorial: Add search to web appsQuickstart: Vector search using RESTAPIsArticle•11/15/2023Get started with vector search in Azure AI Search using the 2023-11-01 REST APIs thatcreate, load, and query a search index.Search indexes can have vector fields in the fields collection.\n"
}