{
  "Id": "1172",
  "Title": "\u0022Implementing Search-As-You-Type with Azure Autocomplete REST API\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe following script illustrates components of a request, using theAutocomplete REST API as an example.HTTPSet up a requestThe \u0022suggesterName\u0022 gives you the suggester-aware fields used to complete terms orsuggestions. For suggestions in particular, the field list should be composed of thosethat offer clear choices among matching results.\r\nOn a site that sells computer games,the field might be the game title.The \u0022search\u0022 parameter provides the partial query, where characters are fed to the queryrequest through the jQuery Autocomplete control. In the above example, \u0022minecraf\u0022 is astatic illustration of what the control might have passed in.\r\nThe APIs do not impose minimum length requirements on the partial query; it can be aslittle as one character. However, jQuery Autocomplete provides a minimum length. Aminimum of two or three characters is typical.Matches are on the beginning of a term anywhere in the input string.\r\nGiven \u0022the quickbrown fox\u0022, both autocomplete and suggestions will match on partial versions of \u0022the\u0022,\u0022quick\u0022, \u0022brown\u0022, or \u0022fox\u0022 but not on partial infix terms like \u0022rown\u0022 or \u0022ox\u0022. Furthermore,each match sets the scope for downstream expansions. A partial query of \u0022quick br\u0022 willmatch on \u0022quick brown\u0022 or \u0022quick bread\u0022, but neither \u0022brown\u0022 or \u0022bread\u0022 by themselveswould be match unless \u0022quick\u0022 precedes them.\r\nFollow these links for the REST and .NET SDK reference pages:Suggestions REST APIAutocomplete REST APISuggestAsync methodAutocompleteAsync methodResponses for autocomplete and suggestions are what you might expect for the pattern:Autocomplete returns a list of terms, Suggestions returns terms plus a document ID sothat you can fetch the document (use the Lookup Document API to fetch the specificdocument for a detail page). POST /indexes/myxboxgames/docs/autocomplete?search\u0026api-version=2020-06-30{  \u0022search\u0022: \u0022minecraf\u0022,  \u0022suggesterName\u0022: \u0022sg\u0022}APIs for search-as-you-typeStructure a responseResponses are shaped by the parameters on the request:For Autocomplete, set the autocompleteMode to determine whether textcompletion occurs on one or two terms.\n"
}