{
  "Id": "941",
  "Title": "\u0022Implementing Soft Delete Policies in Azure Storage and AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf1. In Azure Storage, add a custom metadata key-value pair to the file to indicate thefile is flagged for deletion. For example, you could name the property \u0022IsDeleted\u0022,set to false. When you want to delete the file, change it to true.2. In Azure AI Search, edit the data source definition to include a\u0022dataDeletionDetectionPolicy\u0022 property.\r\nFor example, the following policyconsiders a file to be deleted if it has a metadata property IsDeleted with thevalue true:HTTPReindex undeleted blobs using native soft delete policiesSoft delete strategy using custom metadataPUT https://[service name].search.windows.\r\nnet/datasources/file-datasource?api-version=2020-06-30{    \u0022name\u0022 : \u0022file-datasource\u0022,    \u0022type\u0022 : \u0022azurefile\u0022,    \u0022credentials\u0022 : { \u0022connectionString\u0022 : \u0022\u003Cyour storage connection string\u003E\u0022 },    \u0022container\u0022 : { \u0022name\u0022 : \u0022my-share\u0022, \u0022query\u0022 : null },    \u0022dataDeletionDetectionPolicy\u0022 : {        \u0022@odata.type\u0022 :\u0022#Microsoft.Azure.Search.SoftDeleteColumnDeletionDetectionPolicy\u0022,        \u0022softDeleteColumnName\u0022 : \u0022IsDeleted\u0022,3.\r\nRun the indexer. Once the indexer has processed the file and deleted thedocument from the search index, you can then delete the physical file in AzureStorage.You can reverse a soft-delete if the original source file still physically exists in AzureStorage.1. Change the \u0022softDeleteMarkerValue\u0022 : \u0022false\u0022 on the blob or file in AzureStorage.\r\n2. Check the blob or file\u0027s LastModified timestamp to make it\u0027s newer than the lastindexer run. You can force an update to the current date and time by resaving theexisting metadata.3. Run the indexer. Indexers in Azure AI SearchHow to configure a blob indexerBlob indexing overview        \u0022softDeleteMarkerValue\u0022 : \u0022true\u0022    }}Reindex undeleted blobs and filesNext stepsImport data from Azure Cosmos DB forNoSQL for queries in Azure AI SearchArticle•11/15/2023In this article, learn how to configure an indexer that imports content from AzureCosmos DB for NoSQL and makes it searchable in Azure AI Search.\n"
}