{
  "Id": "1067",
  "Title": "\u0022Implementing Image and Text Enrichment in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfencode(\u0027utf-8\u0027)   inputBytes = base64.b64decode(base64Bytes) Similarly to return an image, return a base64 encoded string within a JSON object with a$type property of file.PythonCreate indexer (REST)Image Analysis skillOCR skillText merge skillHow to define a skillsetHow to map enriched fieldsHow to pass images to custom skills  # Use numpy to convert the string to an image   jpg_as_np = np.\r\nfrombuffer(inputBytes, dtype=np.uint8)   # you now have an image to work with def base64EncodeImage(image):     is_success, im_buf_arr = cv2.imencode(\u0022.jpg\u0022, image)     byte_im = im_buf_arr.tobytes()     base64Bytes = base64.b64encode(byte_im)     base64String = base64Bytes.\r\ndecode(\u0027utf-8\u0027)     return base64String  base64String = base64EncodeImage(jpg_as_np)  result = {    \u0022$type\u0022: \u0022file\u0022,    \u0022data\u0022: base64String  } See alsoEnable caching for incrementalenrichment in Azure Cognitive SearchArticle•04/24/2023This article explains how to add caching to an enrichment pipeline so that you canmodify downstream enrichment steps without having to rebuild in full every time.\r\nBydefault, a skillset is stateless, and changing any part of its composition requires a fullrerun of the indexer. With an enrichment cache, the indexer can determine which partsof the document tree must be refreshed based on changes detected in the skillset orindexer definitions. Existing processed output is preserved and reused whereverpossible.Cached content is placed in Azure Storage using account information that you provide.The container, named ms-az-search-indexercache-\u003Calpha-numerc-string\u003E, is createdwhen you run the indexer. It should be considered an internal component managed byyour search service and must not be modified.If you\u0027re not familiar with setting up indexers, start with indexer overview and thencontinue on to skillsets to learn about enrichment pipelines. For more background onkey concepts, see incremental enrichment.Azure Storage is used to store cached enrichments. The storage account must begeneral purpose v2.\n"
}