{
  "Id": "732",
  "Title": "\u0022Implementing Search-As-You-Type Experience with Azure Search APIs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAfter a suggester is created, call one of the followingAPIs for a search-as-you-type experience:Suggestions REST APIAutocomplete REST APISuggestAsync methodAutocompleteAsync method    var searchFields = fieldBuilder.Build(typeof(Hotel));     var definition = new SearchIndex(indexName, searchFields);     var suggester = new SearchSuggester(\u0022sg\u0022, new[] { \u0022HotelName\u0022, \u0022Category\u0022, \u0022Address/City\u0022, \u0022Address/StateProvince\u0022 });     definition.\r\nSuggesters.Add(suggester);     indexClient.CreateOrUpdateIndex(definition); } Property referenceUse a suggesterIn a search application, client code should use a library like jQuery UI Autocomplete tocollect the partial query and provide the match. For more information about this task,see Add autocomplete or suggested results to client code.API usage is illustrated in the following call to the Autocomplete REST API. There are twotakeaways from this example. First, as with all queries, the operation is against thedocuments collection of an index and the query includes a \u0022search\u0022 parameter, which inthis case provides the partial query.\r\nSecond, you must add \u0022suggesterName\u0022 to therequest. If a suggester isn\u0027t defined in the index, a call to autocomplete or suggestionswill fail.HTTPAdd search to a web site (JavaScript) uses an open source Suggestions package forpartial term completion in the client app.Learn more about requests\\ formulation. POST /indexes/myxboxgames/docs/autocomplete?search\u0026api-version=2020-06-30 {   \u0022search\u0022: \u0022minecraf\u0022,   \u0022suggesterName\u0022: \u0022sg\u0022} Sample codeNext stepsAdd autocomplete and suggestions to client codeCreate an index for multiple languagesin Azure AI SearchArticle•11/15/2023A multilingual search application is one that provides a search experience in the user\u0027sown language.\n"
}