{
  "Id": "1544",
  "Title": "\u0022Implementing Azure Cognitive Search in Python: Key Concepts and Operations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfenviron[\u0022AZURE_SEARCH_SERVICE_ENDPOINT\u0022]index_name = os.environ[\u0022AZURE_SEARCH_INDEX_NAME\u0022]key = os.environ[\u0022AZURE_SEARCH_API_KEY\u0022]search_client = SearchClient(service_endpoint, index_name, AzureKeyCredential(key))Create a client using Azure Active Directory authenticationalternatively, you can pass those values to the ClientSecretCredential also inAzure.Identity.\r\nMake sure you use the right namespace for DefaultAzureCredential at the top of yoursource file:PythonAn Azure Cognitive Search service contains one or more indexes that provide persistentstorage of searchable data in the form of JSON documents. (If you\u0027re brand new tosearch, you can make a very rough analogy between indexes and database tables.) TheAzure.Search.Documents client library exposes operations on these resources throughtwo main client types.\r\nSearchClient helps with:Searching your indexed documents using rich queries and powerful datashapingAutocompleting partially typed search terms based on documents in the indexSuggesting the most likely matching text in documents as a user typesAdding, Updating or Deleting Documents documents from an indexSearchIndexClient allows you to:Create, delete, update, or configure a search indexDeclare custom synonym maps to expand or rewrite queriesMost of the SearchServiceClient functionality is not yet available in our currentpreviewSearchIndexerClient allows you to:Start indexers to automatically crawl data sourcesDefine AI powered Skillsets to transform and enrich your datafrom azure.\r\nidentity import DefaultAzureCredentialfrom azure.search.documents import SearchClientservice_endpoint = os.getenv(\u0022AZURE_SEARCH_SERVICE_ENDPOINT\u0022)index_name = os. getenv(\u0022AZURE_SEARCH_INDEX_NAME\u0022)credential = DefaultAzureCredential()search_client = SearchClient(service_endpoint, index_name, credential)Key conceptsAzure Cognitive Search provides two powerful features: Semantic Search and VectorSearch.Semantic Search enhances the quality of search results for text-based queries.\n"
}