{
  "Id": "1411",
  "Title": "\u0022Implementing Azure Role-Based Access Control for Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo both create and query an index, you\u0027ll need \u0022SearchIndex Data Reader\u0022 and \u0022Search Index Data Contributor\u0022.2. Go to Tools \u003E Options \u003E Azure Service Authentication to choose your Azuresign-on account.You should now be able to run the project from Visual Studio on your local system,using role-based access control for authorization.\r\nUse Azure role-based access control in Azure Cognitive SearchAuthorize access to Microsoft Entra web applications using the OAuth 2.0 codegrant flowIntegrating with Microsoft Entra IDAzure custom roles// Create a SearchIndexClient to send create/delete index commandsSearchIndexClient adminClient = new SearchIndexClient(serviceEndpoint, new DefaultAzureCredential());// Create a SearchClient to load and query documentsSearchClient srchclient = new SearchClient(serviceEndpoint, indexName, new DefaultAzureCredential());Local testing７ NoteThe Azure.Identity documentation has more details aboutDefaultAzureCredential and using Microsoft Entra authentication with theAzure SDK for .NET.\r\nDefaultAzureCredential is intended to simplify gettingstarted with the SDK by handling common scenarios with reasonable defaultbehaviors. Developers who want more control or whose scenario isn\u0027t servedby the default settings should use other credential types.See alsoConfigure an IP firewall for Azure AISearchArticle•11/15/2023Azure AI Search supports IP rules for inbound access through a firewall, similar to the IPrules you\u0027ll find in an Azure virtual network security group.\r\nBy applying IP rules, you canrestrict search service access to an approved set of machines and cloud services. Accessto data stored in your search service from the approved sets of machines and serviceswill still require the caller to present a valid authorization token. You can set IP rules in the Azure portal, as described in this article, or use theManagement REST API, Azure PowerShell, or Azure CLI.A search service at the Basic tier or higher1. Sign in to Azure portal and go to your Azure AI Search service page.2. Select Networking on the left navigation pane.3. Set Public Network Access to Selected Networks. If your connectivity is set toDisabled, you can only access your search service via a private endpoint.７ NoteTo access a search service protected by an IP firewall through the portal, allowaccess from a specific client and the portal IP address.\n"
}