{
  "Id": "1173",
  "Title": "\u0022Implementing Search-As-You-Type APIs with Azure Search Cognitive Index\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPOST /indexes/myxboxgames/docs/autocomplete?search\u0026api-version=2020-06-30{  \u0022search\u0022: \u0022minecraf\u0022,  \u0022suggesterName\u0022: \u0022sg\u0022}APIs for search-as-you-typeStructure a responseResponses are shaped by the parameters on the request:For Autocomplete, set the autocompleteMode to determine whether textcompletion occurs on one or two terms.\r\nFor Suggestions, set $select to return fields containing unique or differentiatingvalues, such as names and description. Avoid fields that contain duplicate values(such as a category or city).The following additional parameters apply to both autocomplete and suggestions, butare perhaps more necessary for suggestions, especially when a suggester includesmultiple fields.ParameterUsagesearchFieldsConstrain the query to specific fields.$filterApply match criteria on the result set ($filter=Category eq \u0027ActionAdventure\u0027).$topLimit the results to a specific number ($top=5).\r\nAuto-filling a query term or dropping down a list of matching links requires userinteraction code, typically JavaScript, that can consume requests from external sources,such as autocomplete or suggestion queries against an Azure Search Cognitive index.Although you could write this code natively, it\u0027s much easier to use functions fromexisting JavaScript library, such as one of the following.\r\nAutocomplete widget (jQuery UI) appears in the Suggestion code snippet. Youcan create a search box, and then reference it in a JavaScript function that uses theAutocomplete widget. Properties on the widget set the source (an autocomplete orsuggestions function), minimum length of input characters before action is taken,and positioning. XDSoft Autocomplete plug-in appears in the Autocomplete code snippet.suggestions appears in the JavaScript tutorial and code sample.Use these libraries in the client to create a search box supporting both suggestions andautocomplete. Inputs collected in the search box can then be paired with suggestionsand autocomplete actions on the search service.Add user interaction codeThis section walks you through an implementation of suggested results, starting withthe search box definition. It also shows how and script that invokes the first JavaScriptautocomplete library referenced in this article.\n"
}