{
  "Id": "228",
  "Title": "\u0022Implementing Sorting and Indexing with Azure AI Search in ASP.NET Core\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfresultList = await _searchClient.SearchAsync\u003CHotel\u003E(model.searchText, options).ConfigureAwait(false);     return View(\u0022Index\u0022, model); }Sort results private async Task\u003CActionResult\u003E RunQueryAsync(SearchData model) {     InitSearch();     var options = new SearchOptions()2. Run the application. Results are sorted by \u0022Rating\u0022 in descending order.\r\nFor more information about sorting, see OData $orderby syntax in Azure AI Search.In this tutorial, you created an ASP.NET Core (MVC) project that connected to a searchservice and called Search APIs for server-side filtering and sorting.If you want to explore client-side code that responds to user actions, consider adding aReact template to your solution:     {         IncludeTotalCount = true,     };     options.\r\nOrderBy.Add(\u0022Rating desc\u0022);     options.Select.Add(\u0022HotelName\u0022);     options.Select.Add(\u0022Category\u0022);     options.Select.Add(\u0022Rating\u0022);     options.Select.Add(\u0022Tags\u0022);     options.Select.Add(\u0022Address/City\u0022);     options.Select.Add(\u0022Address/StateProvince\u0022);     options.\r\nSelect.Add(\u0022Description\u0022);     model.resultList = await _searchClient.SearchAsync\u003CHotel\u003E(model.searchText, options).ConfigureAwait(false);     return View(\u0022Index\u0022, model); }Next stepsC# Tutorial: Add search to a website with .\r\nNETTutorial: Optimize indexing with thepush APIArticle•11/15/2023Azure AI Search supports two basic approaches for importing data into a search index:pushing your data into the index programmatically, or pointing an Azure AI Searchindexer at a supported data source to pull in the data.This tutorial describes how to efficiently index data using the push model by batchingrequests and using an exponential backoff retry strategy. You can download and run thesample application. This article explains the key aspects of the application and factorsto consider when indexing data.This tutorial uses C# and the .NET SDK to perform the following tasks:If you don\u0027t have an Azure subscription, create a free account before you begin.The following services and tools are required for this tutorial.\n"
}