{
  "Id": "1174",
  "Title": "\u0022Implementing Autocomplete and Suggestions in JavaScript Search Box\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfXDSoft Autocomplete plug-in appears in the Autocomplete code snippet.suggestions appears in the JavaScript tutorial and code sample.Use these libraries in the client to create a search box supporting both suggestions andautocomplete. Inputs collected in the search box can then be paired with suggestionsand autocomplete actions on the search service.Add user interaction codeThis section walks you through an implementation of suggested results, starting withthe search box definition. It also shows how and script that invokes the first JavaScriptautocomplete library referenced in this article.\r\nAssuming the jQuery UI Autocomplete library and an MVC project in C#, you coulddefine the search box using JavaScript in the Index.cshtml file. The library adds thesearch-as-you-type interaction to the search box by making asynchronous calls to theMVC controller to retrieve suggestions.In Index.cshtml under the folder \\Views\\Home, a line to create a search box might be asfollows:HTMLThis example is a simple input text box with a class for styling, an ID to be referenced byJavaScript, and placeholder text.Within the same file, embed JavaScript that references the search box.\r\nThe followingfunction calls the Suggest API, which requests suggested matching documents based onpartial term inputs:JavaScriptThe source tells the jQuery UI Autocomplete function where to get the list of items toshow under the search box. Since this project is an MVC project, it calls the Suggestfunction in HomeController.cs that contains the logic for returning query suggestions. SuggestionsCreate a search box\u003Cinput class=\u0022searchBox\u0022 type=\u0022text\u0022 id=\u0022searchbox1\u0022 placeholder=\u0022search\u0022\u003E$(function () {    $(\u0022#searchbox1\u0022).autocomplete({        source: \u0022/home/suggest?highlights=false\u0026fuzzy=false\u0026\u0022,        minLength: 3,        position: {            my: \u0022left top\u0022,            at: \u0022left-23 bottom\u002B10\u0022        }    });});This function also passes a few parameters to control highlights, fuzzy matching, andterm.\n"
}