{
  "Id": "1509",
  "Title": "\u0022Implementing Azure Cognitive Search in Java: Client Library Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure Cognitive Search client library forJava - version 11.6.0Article•11/14/2023This is the Java client library for Azure Cognitive Search. Azure Cognitive Search serviceis a search-as-a-service cloud solution that gives developers APIs and tools for adding arich search experience over private, heterogeneous content in web, mobile, andenterprise applications.\r\nThe Azure Cognitive Search service is well suited for the following application scenarios:Consolidate varied content types into a single searchable index. To populate anindex, you can push JSON documents that contain your content, or if your data isalready in Azure, create an indexer to pull in data automatically.Attach skillsets to an indexer to create searchable content from images and largetext documents. A skillset leverages AI from Cognitive Services for built-in OCR,entity recognition, key phrase extraction, language detection, text translation, andsentiment analysis. You can also add custom skills to integrate external processingof your content during data ingestion.\r\nIn a search client application, implement query logic and user experiences similarto commercial web search engines.Use the Azure Cognitive Search client library to:Submit queries for simple and advanced query forms that include fuzzy search,wildcard search, regular expressions.Implement filtered queries for faceted navigation, geospatial search, or to narrowresults based on filter criteria.Create and manage search indexes.Upload and update documents in the search index.Create and manage indexers that pull data from Azure into an index.Create and manage skillsets that add AI enrichment to data ingestion. Create and manage analyzers for advanced text analysis or multi-lingual content.Optimize results through scoring profiles to factor in business logic or freshness.Source code | Package (Maven) | API reference documentation| Productdocumentation | SamplesGetting startedPlease include the azure-sdk-bom to your project to take dependency on the GeneralAvailability (GA) version of the library. In the following snippet, replace the{bom_version_to_target} placeholder with the version number. To learn more about theBOM, see the AZURE SDK BOM README.XMLand then include the direct dependency in the dependencies section without the versiontag.\n"
}