{
  "Id": "1458",
  "Title": "\u0022Implementing Customer-Managed Key Encryption in Azure Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIfmore protection is needed, you can supplement default encryption with anotherencryption layer using keys that you create and manage in Azure Key Vault.This article walks you through the steps of setting up customer-managed key (CMK) or\u0022bring-your-own-key\u0022 (BYOK) encryption.\r\nHere are some points to keep in mind:CMK encryption is enacted on individual objects. If you require CMK across yoursearch service, set an enforcement policy.CMK encryption depends on Azure Key Vault. You can create your own encryptionkeys and store them in a key vault, or you can use Azure Key Vault APIs to generateencryption keys.\r\nCMK encryption becomes operational when an object is created. You can\u0027t encryptobjects that already exist. CMK encryption occurs whenever an object is saved todisk, either data at rest for long-term storage or temporary data for short-termstorage. With CMK, the disk never sees unencrypted data.Objects that can be encrypted include indexes, synonym lists, indexers, data sources,and skillsets.\r\nEncryption is computationally expensive to decrypt so only sensitivecontent is encrypted.Encryption is performed over the following content:All content within indexes and synonym lists, including descriptions.７ NoteIf an index is CMK encrypted, it is only accessible if the search service has accessthe key.\r\nIf access to the key is revoked, the index is unusable and the service cannotbe scaled until the index is deleted or access to the key is restored.CMK encrypted objectsFor indexers, data sources, and skillsets, only those fields that store connectionstrings, descriptions, keys, and user inputs are encrypted. For example, skillsetshave Cognitive Services keys, and some skills accept user inputs, such as customentities. In both cases, keys and user inputs into skills are encrypted.When you introduce CMK encryption, you\u0027re encrypting content twice. For the objectsand fields noted in the previous section, content is first encrypted with your CMK, andsecondly with the Microsoft-managed key.\n"
}