{
  "Id": "541",
  "Title": "\u0022Implementing Security Trimming and Data Residency in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe following table describes twoapproaches for trimming search results of unauthorized content.ApproachDescriptionSecurity trimmingbased on identityDocuments the basic workflow for implementing user identity accesscontrol. It covers adding security identifiers to an index, and thenRestricting access to indexesRestricting access to documentsApproachDescriptionfiltersexplains filtering against that field to trim results of prohibited content.Security trimmingbased on MicrosoftEntra identitiesThis article expands on the previous article, providing steps forretrieving identities from Microsoft Entra ID, one of the free servicesin the Azure cloud platform.\r\nWhen you set up a search service, you choose a location or region that determineswhere customer data is stored and processed. Azure AI Search won\u0027t store customerdata outside of your specified region unless you configure a feature that has adependency on another Azure resource, and that resource is provisioned in a differentregion.Currently, the only external resource that a search service writes customer data to isAzure Storage. The storage account is one that you provide, and it could be in anyregion. A search service will write to Azure Storage if you use any of the followingfeatures: enrichment cache, debug session, knowledge store.\r\nObject names will be stored and processed outside of your selected region or location.Customers shouldn\u0027t place any sensitive data in name fields or create applicationsdesigned to store sensitive data in these fields. This data appears in the telemetry logsused by Microsoft to provide support for the service. Object names include names ofindexes, indexers, data sources, skillsets, resources, containers, and key vault store.Telemetry logs are retained for one and a half years. During that period, Microsoft mightaccess and reference object names under the following conditions:Diagnose an issue, improve a feature, or fix a bug. In this scenario, data access isinternal only, with no third-party access.During support, this information might be used to provide quick resolution toissues and escalate product team if neededAt the storage layer, data encryption is built in for all service-managed content saved todisk, including indexes, synonym maps, and the definitions of indexers, data sources,Data residencyExceptions to data residency commitmentsData protectionand skillsets. Service-managed encryption applies to both long-term data storage andtemporary data storage.Optionally, you can add customer-managed keys (CMK) for supplemental encryption ofindexed content for double encryption of data at rest.\n"
}