{
  "Id": "968",
  "Title": "\u0022Implementing Data Deletion Detection Policies in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfearlier history items        ]    }Indexing new and changed documentsHTTPWhen graph data is deleted, you might want to delete its corresponding document fromthe search index as well. The purpose of a data deletion detection policy is to efficientlyidentify deleted data items and delete the full document from the index.\r\nThe datadeletion detection policy isn\u0027t meant to delete partial document information. Currently,the only supported policy is the Soft Delete policy (deletion is marked with a flag ofsome sort), which is specified in the data source definition as follows:HTTPThe following example creates a data source with a soft-deletion policy:HTTP\u0022dataChangeDetectionPolicy\u0022: {    \u0022@odata.\r\ntype\u0022: \u0022#Microsoft.Azure.Search.HighWaterMarkChangeDetectionPolicy\u0022,\u0022  highWaterMarkColumnName\u0022: \u0022_ts\u0022},Indexing deleted documents\u0022dataDeletionDetectionPolicy\u0022\u0022: {    \u0022@odata.type\u0022 : \u0022#Microsoft.Azure.Search.SoftDeleteColumnDeletionDetectionPolicy\u0022,    \u0022softDeleteColumnName\u0022 : \u0022the property that specifies whether a document was deleted\u0022,    \u0022softDeleteMarkerValue\u0022 : \u0022the value that identifies a document as deleted\u0022}POST https://[service name].search.windows.\r\nnet/datasources?api-version=2020-06-30-PreviewContent-Type: application/jsonapi-key: [Search service admin key]{    \u0022name\u0022: \u0022[my-cosmosdb-gremlin-ds]\u0022,    \u0022type\u0022: \u0022cosmosdb\u0022,    \u0022credentials\u0022: {        \u0022connectionString\u0022: \u0022AccountEndpoint=https://[cosmos-account-name].documents.azure. com;AccountKey=[cosmos-account-key];Database=[cosmos-database-name];ApiKind=Gremlin\u0022    },    \u0022container\u0022: { \u0022name\u0022: \u0022[my-cosmos-collection]\u0022 },    \u0022dataChangeDetectionPolicy\u0022: {        \u0022@odata.type\u0022: Even if you enable deletion detection policy, deleting complex (Edm.ComplexType) fieldsfrom the index is not supported. This policy requires that the \u0027active\u0027 column in theGremlin database to be of type integer, string or boolean.\n"
}