{
  "Id": "1474",
  "Title": "\u0022Implementing Security Filters for Azure AI Search Results\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor more information about using Azure Key or configuring customer managedencryption:Quickstart: Set and retrieve a secret from Azure Key Vault using PowerShellConfigure customer-managed keys for data encryption in Azure Cognitive Search$uri= \u0027https://\u003CYOUR-SEARCH-SERVICE\u003E.search.windows.net/synonyms?api-version=2020-06-30\u0026$select=name\u0027 Invoke-RestMethod -Uri $uri -Headers $headers | ConvertTo-Json $uri= \u0027https://\u003CYOUR-SEARCH-SERVICE\u003E.\r\nsearch.windows.net/synonyms/\u003CYOUR-SYNONYM-MAP-NAME\u003E?api-version=2020-06-30\u0027 Invoke-RestMethod -Uri $uri -Headers $headers | ConvertTo-Json Next stepsSecurity filters for trimming results inAzure AI SearchArticle•11/15/2023Azure AI Search doesn\u0027t provide document-level permissions and can\u0027t vary searchresults from within the same index by user permissions.\r\nAs a workaround, you can createa filter that trims search results based on a string containing a group or user identity.This article describes a pattern for security filtering that includes following steps:Although Azure AI Search doesn\u0027t integrate with security subsystems for access tocontent within an index, many customers who have document-level securityrequirements have found that filters can meet their needs. In Azure AI Search, a security filter is a regular OData filter that includes or excludes asearch result based on a matching value, except that in a security filter, the criteria is astring consisting of a security principal. There\u0027s no authentication or authorizationthrough the security principal. The principal is just a string, used in a filter expression, toinclude or exclude a document from the search results.There are several ways to achieve security filtering. One way is through a complicateddisjunction of equality expressions: for example, Id eq \u0027id1\u0027 or Id eq \u0027id2\u0027, and soforth.\n"
}