{
  "Id": "1541",
  "Title": "\u0022Implementing Azure Cognitive Search for Advanced Search Applications\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe Azure Cognitive Search service is well suited for the following application scenarios:Consolidate varied content types into a single searchable index. To populate anindex, you can push JSON documents that contain your content, or if your data isalready in Azure, create an indexer to pull in data automatically.\r\nAttach skillsets to an indexer to create searchable content from images and largetext documents. A skillset leverages AI from Cognitive Services for built-in OCR,entity recognition, key phrase extraction, language detection, text translation, andsentiment analysis. You can also add custom skills to integrate external processingof your content during data ingestion.In a search client application, implement query logic and user experiences similarto commercial web search engines.Use the Azure.Search.Documents client library to:Submit queries for simple and advanced query forms that include fuzzy search,wildcard search, regular expressions.\r\nImplement filtered queries for faceted navigation, geospatial search, or to narrowresults based on filter criteria.Create and manage search indexes.Upload and update documents in the search index.Create and manage indexers that pull data from Azure into an index.Create and manage skillsets that add AI enrichment to data ingestion.\r\nCreate and manage analyzers for advanced text analysis or multi-lingual content.Optimize results through scoring profiles to factor in business logic or freshness.Source code | Package (PyPI) | Package (Conda) | API reference documentation |Product documentation | SamplesGetting startedInstall the packageInstall the Azure Cognitive Search client library for Python with pip:BashPython 3. 7 or later is required to use this package.You need an Azure subscription and an Azure Cognitive Search service to usethis package.To create a new search service, you can use the Azure portal, Azure PowerShell, or theAzure CLI.PowershellSee choosing a pricing tier for more information about available options.To interact with the Search service, you\u0027ll need to create an instance of the appropriateclient class: SearchClient for searching indexed documents, SearchIndexClient formanaging indexes, or SearchIndexerClient for crawling data sources and loading searchdocuments into an index. To instantiate a client object, you\u0027ll need an endpoint and anAPI key.\n"
}