{
  "Id": "38",
  "Title": "\u0022Implementing Search Functionality in C# with Azure Search Client\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfGetSearchClient(indexName); // Load documents Console.WriteLine(\u0022{0}\u0022, \u0022Uploading documents...\\n\u0022); UploadDocuments(ingesterClient);// Wait 2 seconds for indexing to complete before starting queries (for demo and console-app purposes only)Console.WriteLine(\u0022Waiting for indexing...\\n\u0022);System.Threading.Thread.\r\nSleep(2000);Search an indexThis section adds two pieces of functionality: query logic, and results. For queries,use the Search method. This method takes search text (the query string) and otheroptions.The SearchResults class represents the results.1. In Program.cs, create a WriteDocuments method that prints search results tothe console.C#2. Create a RunQueries method to execute queries and return results. Results areHotel objects. This sample shows the method signature and the first query.This query demonstrates the Select parameter that lets you compose theresult using selected fields from the document.\r\nC#// Write search results to consoleprivate static void WriteDocuments(SearchResults\u003CHotel\u003E searchResults){    foreach (SearchResult\u003CHotel\u003E result in searchResults.GetResults())    {        Console.WriteLine(result.Document);    }    Console.WriteLine();}private static void WriteDocuments(AutocompleteResults autoResults){    foreach (AutocompleteItem result in autoResults.\r\nResults)    {        Console.WriteLine(result.Text);    }    Console.WriteLine();}// Run queries, use WriteDocuments to print outputprivate static void RunQueries(SearchClient srchclient){    SearchOptions options;    SearchResults\u003CHotel\u003E response;    // Query 1    Console.WriteLine(\u0022Query #1: Search on empty term \u0027*\u0027 to return all documents, showing a subset of fields. ..\\n\u0022);3. In the second query, search on a term, add a filter that selects documentswhere Rating is greater than 4, and then sort by Rating in descending order.Filter is a boolean expression that is evaluated over IsFilterable fields in anindex. Filter queries either include or exclude values.\n"
}