{
  "Id": "986",
  "Title": "\u0022Implementing Incremental Indexing with Azure Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo enable incremental indexing, set the \u0022dataChangeDetectionPolicy\u0022 property in yourdata source definition. This property tells the indexer which change tracking mechanismis used on your table or view.For Azure SQL indexers, there are two change detection policies:\u0022SqlIntegratedChangeTrackingPolicy\u0022 (applies to tables only)\u0022HighWaterMarkChangeDetectionPolicy\u0022 (works for tables and views)We recommend using \u0022SqlIntegratedChangeTrackingPolicy\u0022 for its efficiency and itsability to identify deleted rows.Database requirements:            \u0022endTime\u0022:\u00222022-02-21T00:36:47.\r\n752Z\u0022,            \u0022errors\u0022:[],            \u0022itemsProcessed\u0022:1599501,            \u0022itemsFailed\u0022:0,            \u0022initialTrackingState\u0022:null,            \u0022finalTrackingState\u0022:null        },        \u0022executionHistory\u0022:        [            {                \u0022status\u0022:\u0022success\u0022,                \u0022errorMessage\u0022:null,                \u0022startTime\u0022:\u00222022-02-21T00:23:24.\r\n957Z\u0022,                \u0022endTime\u0022:\u00222022-02-21T00:36:47.752Z\u0022,                \u0022errors\u0022:[],                \u0022itemsProcessed\u0022:1599501,                \u0022itemsFailed\u0022:0,                \u0022initialTrackingState\u0022:null,                \u0022finalTrackingState\u0022:null            },            ...\r\nearlier history items        ]    }Indexing new, changed, and deleted rowsSQL Integrated Change Tracking PolicySQL Server 2012 SP3 and later, if you\u0027re using SQL Server on Azure VMsAzure SQL Database or SQL Managed InstanceTables only (no views)On the database, enable change tracking for the tableNo composite primary key (a primary key containing more than one column) onthe tableNo clustered indexes on the table. As a workaround, any clustered index wouldhave to be dropped and re-created as nonclustered index, however, performancemay be affected in the source compared to having a clustered indexChange detection policies are added to data source definitions.\n"
}