{
  "Id": "1304",
  "Title": "\u0022Implementing Semantic Ranking in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfConfigure semantic ranking so that you can test out semantic ranking on your content.Next stepsConfigure semantic ranking and returncaptions in search resultsArticle•11/15/2023In this article, learn how to invoke a semantic ranking over a result set, promoting themost semantically relevant results to the top of the stack.\r\nYou can also get semanticcaptions, with highlights over the most relevant terms and phrases, and semanticanswers.To use semantic ranking:Add a semantic configuration to an indexAdd parameters to a query requestA search service on Basic, Standard tier (S1, S2, S3), or Storage Optimized tier (L1,L2), subject to region availability.\r\nSemantic ranking enabled on your search service.An existing search index with rich text content. Semantic ranking applies to text(non-vector) fields and works best on content that is informational or descriptive.Review semantic ranking if you need an introduction to the feature.Choose a search client that supports semantic ranking. Here are some options:Azure portal (Search explorer), recommended for initial exploration.Prerequisites７ NoteCaptions and answers are extracted verbatim from text in the search document. Thesemantic subsystem uses machine reading comprehension to recognize contenthaving the characteristics of a caption or answer, but doesn\u0027t compose newsentences or phrases.\r\nFor this reason, content that includes explanations ordefinitions work best for semantic ranking. If you want chat-style interaction withgenerated responses, see Retrieval Augmented Generation (RAG).1 - Choose a clientPostman app using REST APIs. See this Quickstart for help with setting up RESTcalls.Azure.Search.Documents in the Azure SDK for . NET.Azure.Search.Documents in the Azure SDK for Python.azure-search-documents in the Azure SDK for Java.@azure/search-documents in the Azure SDK for JavaScript.A semantic configuration is a section in your index that establishes field inputs forsemantic ranking. You can add or update a semantic configuration at any time, norebuild necessary.\nIf you create multiple configurations, you can specify a default. Atquery time, specify a semantic configuration on a query request, or leave it blank to usethe default.A semantic configuration has a name and the following properties:PropertyCharacteristicsTitle fieldA short string, ideally under 25 words.\n"
}