{
  "Id": "47",
  "Title": "\u0022Implementing Vector Search in Azure AI Search: A Quickstart Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTutorial: Add search to web appsQuickstart: Vector search using RESTAPIsArticle•11/15/2023Get started with vector search in Azure AI Search using the 2023-11-01 REST APIs thatcreate, load, and query a search index.Search indexes can have vector fields in the fields collection.\r\nWhen querying the searchindex, you can build vector-only queries, or create hybrid queries that target vectorfields and textual fields configured for filters, sorts, facets, and semantic ranking.Postman appAn Azure subscription. Create one for free.Azure AI Search, in any region and on any tier. Most existing services supportvector search.\r\nFor a small subset of services created prior to January 2019, an indexcontaining vector fields will fail on creation. In this situation, a new service must becreated.For the optional semantic ranking shown in the last example, your search servicemust be Basic tier or higher, with semantic ranking enabled.\r\nSample Postman collection, with requests targeting the 2023-11-01 API versionof Azure AI Search.Optional. The Postman collection includes a Generate Embedding request that cangenerate vectors from text. The collection provides a ready-to-use vector, but ifyou want to replace it, provide an Azure OpenAI endpoint with a deployment oftext-embedding-ada-002.\r\nThe step for generating a custom embedding is theonly step that requires an Azure OpenAI endpoint, Azure OpenAI key, modeldeployment name, and API version in the collection variables.７ NoteLooking for built-in data chunking and vectorization? Try the Import andvectorize data wizard instead.PrerequisitesSample data consists of text and vector descriptions for seven fictitious hotels. Textual data is used for keyword search, semantic ranking, and capabilities thatdepend on text (filters, facets, and sorting).Vector data (text embeddings) is used for vector search. Currently, Azure AI Searchdoesn\u0027t generate vectors for you. For this quickstart, vector data was generatedseparately and copied into the \u0022Upload Documents\u0022 request and into the queryrequests.\n"
}