{
  "Id": "1193",
  "Title": "\u0022Implementing Spell Correction in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe speller parameter is supported for all text (non-vector) query types.A search service at the Basic tier or higher, in any region.An existing search index with content in a supported language.A query request that has speller=lexicon and queryLanguage set to a supportedlanguage. Spell check works on strings passed in the search parameter. It\u0027s notsupported for filters, fuzzy search, wildcard search, regular expressions, or vectorqueries.Use a search client that supports preview APIs on the query request.\r\nFor REST, you canuse Postman, another web client, or code that you\u0027ve modified to make REST calls to thepreview APIs. You can also use beta releases of the Azure SDKs.Client libraryVersionsREST APIVersions 2020-06-30-Preview and later. The current version is 2023-10-01-PreviewAzure SDK for .NETversion 11.5.\r\n0-beta.5Azure SDK for Javaversion 11.6.0-beta.5Azure SDK forJavaScriptversion 11.3.0-beta.8Azure SDK for Pythonversion 11.4.0b3） ImportantSpell correction is in public preview under supplemental terms of use. It\u0027savailable through the Azure portal, preview REST APIs, and beta versions of AzureSDK libraries.\r\nPrerequisitesThe following example uses the built-in hotels-sample index to demonstrate spellcorrection on a simple text query. Without spell correction, the query returns zeroresults. With correction, the query returns one result for Johnson\u0027s family-orientedresort. HTTPSpelling correction occurs on individual query terms that undergo text analysis, which iswhy you can use the speller parameter with some Lucene queries, but not others.Incompatible query forms that bypass text analysis include: wildcard, regex, fuzzyCompatible query forms include: fielded search, proximity, term boostingThis example uses fielded search over the Category field, with full Lucene syntax, and amisspelled query term.\nBy including speller, the typo in \u0022Suiite\u0022 is corrected and thequery succeeds.HTTPSpell correction with simple searchPOST https://[service name].search.windows.\n"
}