{
  "Id": "701",
  "Title": "\u0022Implementing Vectorization in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe content of all fields, including vector fields, is returned as plain text.As a next step, we recommend Query vector data in a search index.Code samples in the azure-search-vector repository demonstrate end-to-endworkflows that include schema definition, vectorization, indexing, and queries.\r\nThere\u0027s demo code for Python, C#, and JavaScript.Next stepsConfigure a vectorizer in a search indexArticle•11/15/2023A vectorizer is a component of a search index that specifies a vectorization agent, suchas a deployed embedding model on Azure OpenAI that converts text to vectors.\r\nYou candefine a vectorizer once, and then reference it in the vector profile assigned to a vectorfield.A vectorizer is used during indexing and queries. It allows the search service to handlechunking and coding on your behalf.You can use the Import and vectorize data wizard, the 2023-10-01-Preview REST APIs,or any Azure beta SDK package that\u0027s been updated to provide this feature.\r\nA deployed embedding model on Azure OpenAI, or a custom skill that wraps anembedding model.Permissions to upload a payload to the embedding model. The connection to avectorizer is specified in the skillset. If you\u0027re using Azure OpenAI, the caller musthave Cognitive Services OpenAI User permissions.\r\nA supported data source and a data source definition for your indexer.A skillset that performs data chunking and vectorization of those chunks. You canomit a skillset if you only want integrated vectorization at query time, or if youdon\u0027t need chunking or index projections during indexing. This article assumes youalready know how to create a skillset. An index that specifies vector and non-vector fields. This article assumes youalready know how to create a vector index and covers just the steps for addingvectorizers and field assignments.An indexer that drives the pipeline.） ImportantThis feature is in public preview under Supplemental Terms of Use.\n"
}