{
  "Id": "1464",
  "Title": "\u0022Implementing EncryptionKey Property in Azure Search Service Objects\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe portal doesn\u0027t allowencryption properties on object creation.1. Call the Create APIs to specify the encryptionKey property:Create IndexCreate Synonym MapCreate IndexerCreate Data SourceCreate Skillset.2. Insert the encryptionKey construct into the object definition. This property is afirst-level property, on the same level as name and description.\r\nThe following[REST examples(#rest-examples) show property placement. If you\u0027re using thesame vault, key, and version, you can paste in the same \u0022encryptionKey\u0022 constructinto each object definition.\r\nThe first example shows an \u0022encryptionKey\u0022 for a search service that connectsusing a managed identity:JSONThe second example includes \u0022accessCredentials\u0022, necessary if you registered anapplication in Azure AD:JSON5 - Encrypt content{   \u0022encryptionKey\u0022: {     \u0022keyVaultUri\u0022: \u0022https://demokeyvault.\r\nvault.azure.net\u0022,     \u0022keyVaultKeyName\u0022: \u0022myEncryptionKey\u0022,     \u0022keyVaultKeyVersion\u0022: \u0022eaab6a663d59439ebb95ce2fe7d5f660\u0022   } } {   \u0022encryptionKey\u0022: {     \u0022keyVaultUri\u0022: \u0022https://demokeyvault.\r\nvault.azure.net\u0022,     \u0022keyVaultKeyName\u0022: \u0022myEncryptionKey\u0022,     \u0022keyVaultKeyVersion\u0022: \u0022eaab6a663d59439ebb95ce2fe7d5f660\u0022,     \u0022accessCredentials\u0022: {       \u0022applicationId\u0022: \u002200000000-0000-0000-0000-000000000000\u0022, Once you create the encrypted object on the search service, you can use it as you wouldany other object of its type. Encryption is transparent to the user and developer.Azure policies help to enforce organizational standards and to assess compliance at-scale. Azure Cognitive Search has an optional built-in policy for service-wide CMKenforcement.In this section, you\u0027ll set the policy that defines a CMK standard for your search service.\n"
}