{
  "Id": "731",
  "Title": "\u0022Implementing Suggesters and Autocomplete in Azure Search Using .NET\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf] } Create using .NETprivate static void CreateIndex(string indexName, SearchIndexClient indexClient) {     FieldBuilder fieldBuilder = new FieldBuilder(); PropertyDescriptionnameSpecified in the suggester definition, but also called on an Autocomplete orSuggestions request.sourceFieldsSpecified in the suggester definition.\r\nIt\u0027s a list of one or more fields in the indexthat are the source of the content for suggestions. Fields must be of typeEdm.String. If an analyzer is specified on the field, it must be a named lexicalanalyzer from this list (not a custom analyzer).  As a best practice, specify only those fields that lend themselves to an expectedand appropriate response, whether it\u0027s a completed string in a search bar or adropdown list.\r\nA hotel name is a good candidate because it has precision. Verbose fields likedescriptions and comments are too dense. Similarly, repetitive fields, such ascategories and tags, are less effective. In the examples, we include \u0022category\u0022anyway to demonstrate that you can include multiple fields.\r\nsearchModeREST-only parameter, but also visible in the portal. This parameter isn\u0027t available inthe .NET SDK. It indicates the strategy used to search for candidate phrases. Theonly mode currently supported is analyzingInfixMatching, which currently matcheson the beginning of a term.A suggester is used in a query. After a suggester is created, call one of the followingAPIs for a search-as-you-type experience:Suggestions REST APIAutocomplete REST APISuggestAsync methodAutocompleteAsync method    var searchFields = fieldBuilder.Build(typeof(Hotel));     var definition = new SearchIndex(indexName, searchFields);     var suggester = new SearchSuggester(\u0022sg\u0022, new[] { \u0022HotelName\u0022, \u0022Category\u0022, \u0022Address/City\u0022, \u0022Address/StateProvince\u0022 });     definition.\n"
}