{
  "Id": "1178",
  "Title": "\u0022Implementing Search-as-You-Type Experience with Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfkeydown(function (evt) {        if (evt.keyCode === 9 /* TAB */ \u0026\u0026 currentSuggestion2) {            $(\u0022#searchbox1\u0022).val(currentSuggestion2);            return false;        } else if (evt.keyCode === 27 /* ESC */) {            currentSuggestion2 = \u0022\u0022;            $(\u0022#searchbox1\u0022).\r\nval(\u0022\u0022);        }    });});Autocomplete functionpublic async Task\u003CActionResult\u003E AutoCompleteAsync(string term){    InitSearch();The Autocomplete function takes the search term input. The method creates anAutoCompleteParameters object. The result is then converted to JSON so it can beshown in the client.The following tutorial demonstrates a search-as-you-type experience.\r\n// Setup the autocomplete parameters.    var ap = new AutocompleteOptions()    {        Mode = AutocompleteMode.OneTermWithContext,        Size = 6    };    var autocompleteResult = await _searchClient.AutocompleteAsync(term, \u0022sg\u0022, ap).ConfigureAwait(false);    // Convert the autocompleteResult results to a list that can be displayed in the client.\r\nList\u003Cstring\u003E autocomplete = autocompleteResult.Value.Results.Select(x =\u003E x.Text).ToList();    return new JsonResult(autocomplete);}Next stepsAdd search to a web site (JavaScript)Use the \u0022simple\u0022 search syntax in AzureCognitive SearchArticle•06/11/2023In Azure Cognitive Search, the simple query syntax invokes the default query parser forfull text search.\r\nThe parser is fast and handles common scenarios, including full textsearch, filtered and faceted search, and prefix search. This article uses examples toillustrate simple syntax usage in a Search Documents (REST API) request.The following queries are based on the hotels-sample-index, which you can create byfollowing the instructions in this quickstart. Example queries are articulated using the REST API and POST requests. You can pasteand run them in Postman or another web client.Request headers must have the following values:KeyValueContent-Typeapplication/jsonapi-key\u003Cyour-search-service-api-key\u003E, either query or admin keyURI parameters must include your search service endpoint with the index name, docscollections, search command, and API version, similar to the following example:HTTPRequest body should be formed as valid JSON:７ NoteAn alternative query syntax is Full Lucene, supporting more complex querystructures, such as fuzzy and wildcard search.\n"
}