{
  "Id": "1351",
  "Title": "\u0022Implementing Search Traffic Analytics with Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfErrorMessage == null) ? \u0022none\u0022 : result.ErrorMessage;         Console.WriteLine(\u0022ErrorMessage: {0}\u0022, errorMsg);         Console.WriteLine(\u0022 Document Errors: {0}, Warnings: {1}\\n\u0022, result.Errors.Count, result.Warnings.Count);     }     catch (Exception e)     {         // Handle exception     } } Indexer has run 18 times.\r\nIndexer Status: Running Latest run   Run Status: Success   Total Documents: 7, Failed: 0   StartTime: 11:29:31 PM, EndTime: 11:29:31 PM, Elapsed: 00:00:00.\r\n2560000   ErrorMessage: none   Document Errors: 0, Warnings: 0Next stepsGetIndexerStatus (REST API)IndexerStatusIndexerExecutionStatusIndexerExecutionResultCollect telemetry data for search trafficanalyticsArticle•05/26/2023Search traffic analytics is a pattern for collecting telemetry about user interactions withyour Azure Cognitive Search application, such as user-initiated click events andkeyboard inputs.\r\nUsing this information, you can determine the effectiveness of yoursearch solution, including popular search terms, clickthrough rate, and which queryinputs yield zero results.\r\nThis pattern takes a dependency on Application Insights (a feature of Azure Monitor) tocollect user data. It requires that you add instrumentation to your client code, asdescribed in this article. Finally, you will need a reporting mechanism to analyze thedata. We recommend Power BI, but you can use the Application Dashboard or any toolthat connects to Application Insights.To have useful metrics for search traffic analytics, it\u0027s necessary to log some signals fromthe users of your search application. These signals signify content that users areinterested in and that they consider relevant. For search traffic analytics, these include:User-generated search events: Only search queries initiated by a user areinteresting. Other search requests, such as those used to populate facets orretrieve internal information, are not important. Be sure to only instrument user-initiated events to avoid skew or bias in your results.\n"
}