{
  "Id": "1519",
  "Title": "\u0022Implementing Azure Search with Java: Indexing and Querying Techniques\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfsetSearchable(true),        new SearchField(\u0022city\u0022, SearchFieldDataType.STRING)            .setSearchable(true)            .setFilterable(true)            .setFacetable(true)            .setSortable(true),        new SearchField(\u0022stateProvince\u0022, SearchFieldDataType.STRING)            .setSearchable(true)            .setFilterable(true)            .\r\nsetFacetable(true)            .setSortable(true),        new SearchField(\u0022country\u0022, SearchFieldDataType.STRING)            .setSearchable(true)            .setFilterable(true)            .setFacetable(true)            .setSortable(true),        new SearchField(\u0022postalCode\u0022, SearchFieldDataType.STRING)            .setSearchable(true)            .\r\nsetFilterable(true)            .setFacetable(true)            .setSortable(true)    ));// Prepare suggester.SearchSuggester suggester = new SearchSuggester(\u0022sg\u0022, Collections.singletonList(\u0022hotelName\u0022));// Prepare SearchIndex with index name and search fields.SearchIndex index = new SearchIndex(\u0022hotels\u0022).setFields(searchFieldList).\r\nsetSuggesters(suggester);In addition to querying for documents using keywords and optional filters, you canretrieve a specific document from your index if you already know the key. You could getthe key from a query, for example, and want to show more information about it ornavigate your customer to that document.\r\nJavaYou can Upload, Merge, MergeOrUpload, and Delete multiple documents from an indexin a single batched request. There are a few special rules for merging to be aware of.JavaThe request will throw IndexBatchException by default if any of the individual actionsfail, and you can use findFailedActionsToRetry to retry on failed documents. There\u0027salso a throwOnAnyError option, and you can set it to false to get a successful responsewith an IndexDocumentsResult for inspection.The examples so far have been using synchronous APIs, but we provide full support forasync APIs as well. You\u0027ll need to use SearchAsyncClient.Java// Create an indexSEARCH_INDEX_CLIENT.\n"
}