{
  "Id": "1306",
  "Title": "\u0022Implementing Semantic Ranking in Azure AI Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf2. Open an index.3. Select Semantic Configurations and then select Add Semantic Configuration.The New Semantic Configuration page opens with options for selecting a titlefield, content fields, and keyword fields. Make sure to list content fields andkeyword fields in priority order.Select OK to save the changes.Several query capabilities in Azure AI Search bypass relevance scoring or are otherwiseincompatible with semantic ranking. If your query logic includes the following features,you can\u0027t semantically rank your results:A query with search=* or an empty search string, such as pure filter-only query,won\u0027t work because there is nothing to measure semantic relevance against.\r\nThe TipTo see an example of creating a semantic configuration and using it to issue asemantic query, check out the semantic ranking Postman sample.3 - Avoid features that bypass relevancescoringquery must provide terms or phrases that can be assessed during processing.A query composed in the full Lucene syntax (queryType=full) is incompatible withsemantic ranking (queryType=semantic).\r\nThe semantic model doesn\u0027t support thefull Lucene syntax.Sorting (orderBy clauses) on specific fields overrides search scores and a semanticscore. Given that the semantic score is supposed to provide the ranking, adding anorderby clause results in an HTTP 400 error if you apply semantic ranking overordered results. In this step, add parameters to the query request. To be successful, your query should befull text search (using the search parameter to pass in a string), and the index shouldcontain text fields with rich semantic content and a semantic configuration.Search explorer has been updated to include options for semantic ranking.1. Sign in to the Azure portal.2. Open your search index and select Search explorer.3. There are two ways to specify the query, JSON or options. Using JSON, youcan paste definitions into the query editor:4 - Set up the queryAzure portal4.\n"
}