{
  "Id": "1406",
  "Title": "\u0022Implementing Role-Based Access Control for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn the left-navigation pane, select Keys.{ \u0022properties\u0022: {     \u0022roleName\u0022: \u0022search index data explorer\u0022,     \u0022description\u0022: \u0022\u0022,     \u0022assignableScopes\u0022: [         \u0022/subscriptions/a5b1ca8b-bab3-4c26-aebe-4cf7ec4791a0/resourceGroups/heidist-free-search-svc/providers/Microsoft.Search/searchServices/demo-search-svc\u0022     ],     \u0022permissions\u0022: [         {             \u0022actions\u0022: [                 \u0022Microsoft.\r\nSearch/operations/read\u0022,                 \u0022Microsoft.Search/searchServices/indexes/read\u0022             ],             \u0022notActions\u0022: [],             \u0022dataActions\u0022: [                 \u0022Microsoft.Search/searchServices/indexes/documents/read\u0022             ],             \u0022notDataActions\u0022: []         }     ]   } }Disable API key authenticationPortal3.\r\nSelect Role-based access control.The change is effective immediately, but wait a few seconds before testing.Assuming you have permission to assign roles as a member of Owner, serviceadministrator, or co-administrator, you can use portal features to test role-basedaccess.Conditional Access is a tool in Microsoft Entra ID used to enforce organizational policies.By using Conditional Access policies, you can apply the right access controls whenneeded to keep your organization secure. When accessing an Azure AI Search serviceusing role-based access control, Conditional Access can enforce organizational policies.\r\nTo enable a Conditional Access policy for Azure AI Search, follow the below steps:1. Sign in to the Azure portal.2. Search for Microsoft Entra Conditional Access.3. Select Policies.4. Select \u002B New policy.5. In the Cloud apps or actions section of the policy, add Azure AI Search as a cloudapp depending on how you want to set up your policy.6. Update the remaining parameters of the policy. For example, specify which usersand groups this policy applies to.7. Save the policy.Conditional Access） ImportantIf your search service has a managed identity assigned to it, the specific searchservice will show up as a cloud app that can be included or excluded as part of theConditional Access policy.\n"
}