{
  "Id": "1443",
  "Title": "\u0022Implementing Shared Private Links in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCognitive Search makes outbound calls to other Azure PaaS resources in the followingscenarios:Indexer connection requests to supported data sourcesIndexer (skillset) connections to Azure Storage for caching enrichments or writingto a knowledge storeEncryption key requests to Azure Key VaultCustom skill requests to Azure Functions or similar resourceIn service-to-service communications, Search typically sends a request over a publicinternet connection.\r\nHowever, if your data, key vault, or function should be accessedthrough a private endpoint, you can create a shared private link.A shared private link is:Created using Azure Cognitive Search tooling, APIs, or SDKs７ NoteIf you\u0027re setting up a private indexer connection to a SQL Managed Instance, seethis article instead.\r\nWhen to use a shared private linkApproved by the Azure PaaS resource ownerUsed internally by Search on a private connection to a specific Azure resourceOnly your search service can use the private links that it creates, and there can be onlyone shared private link created on your service for each resource and sub-resourcecombination.\r\nOnce you set up the private link, it\u0027s used automatically whenever Search connects tothat PaaS resource. You don\u0027t need to modify the connection string or alter the clientyou\u0027re using to issue the requests, although the device used for the connection mustconnect using an authorized IP in the Azure PaaS resource\u0027s firewall.\r\nWhen evaluating shared private links for your scenario, remember these constraints.Several of the resource types used in a shared private link are in preview. If you\u0027reconnecting to a preview resource (Azure Database for MySQL, Azure Functions, orAzure SQL Managed Instance), use a preview version of the Management REST APIto create the shared private link. These versions include 2020-08-01-preview or2021-04-01-preview.Indexer execution must use the private execution environment that\u0027s specific toyour search service. Private endpoint connections aren\u0027t supported from the multi-tenant environment. The configuration setting for this requirement is covered inthis article.An Azure Cognitive Search at the Basic tier or higher.\n"
}