{
  "Id": "1288",
  "Title": "\u0022Implementing BM25 Similarity in Azure AI Search: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure.Search.BM25Similarity.Once an index exists with a \u0022similarity\u0022 property, you can switch betweenBM25Similarity or ClassicSimilarity.The following links describe the Similarity property in the Azure SDKs.Client librarySimilarity property.NETSearchIndex.SimilarityJavaSearchIndex.setSimilarityJavaScriptSearchIndex.\r\nSimilarityPythonsimilarity property on SearchIndexYou can also use the REST API. The following example creates a new index with the\u0022similarity\u0022 property set to BM25:Enable BM25 scoring on older servicesREST exampleHTTPRelevance and scoring in Azure AI SearchREST API ReferenceAdd scoring profiles to your indexCreate Index APIAzure AI Search .\r\nNET SDKPUT [service-name].search.windows.net/indexes/[index name]?api-version=2020-06-30{    \u0022name\u0022: \u0022indexName\u0022,    \u0022fields\u0022: [        {            \u0022name\u0022: \u0022id\u0022,            \u0022type\u0022: \u0022Edm.String\u0022,            \u0022key\u0022: true        },        {            \u0022name\u0022: \u0022name\u0022,            \u0022type\u0022: \u0022Edm.\r\nString\u0022,            \u0022searchable\u0022: true,            \u0022analyzer\u0022: \u0022en.lucene\u0022        },        ...    ],    \u0022similarity\u0022: {        \u0022@odata.type\u0022: \u0022#Microsoft.Azure.Search.BM25Similarity\u0022    }}See alsoAdd scoring profiles to boost searchscoresArticle•11/06/2023In this article, you\u0027ll learn how to define a scoring profile.\r\nA scoring profile is critera forboosting a search score based on parameters that you provide. For example, you mightwant matches found in a \u0022tags\u0022 field to be more relevant than the same match found in\u0022descriptions\u0022. Criteria can be a weighted field (such as the \u0022tags\u0022 example) or afunction. Scoring profiles are defined in a search index and invoked on non-vector fields in queryrequests. You can create multiple profiles and then modify query logic to choose whichone is used.A scoring profile is named object defined in an index schema. A profile can becomposed of weighted fields, functions, and parameters.The following definition shows a simple profile named \u0022geo\u0022.\n"
}