{
  "Id": "1176",
  "Title": "\u0022Implementing Azure Cognitive Search in a .NET Application: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor more information aboutthe .NET SDK, see How to use Azure Cognitive Search from a .NET Application.The InitSearch method creates an authenticated HTTP index client to the AzureCognitive Search service. Properties on the SuggestOptions class determine which fieldsare searched and returned in the results, the number of matches, and whether fuzzymatching is used.\r\nFor autocomplete, fuzzy matching is limited to one edit distance (one omitted ormisplaced character). Note that fuzzy matching in autocomplete queries can sometimesEnable fuzzy matchingsource: \u0022/home/suggest?highlights=false\u0026fuzzy=true\u0026\u0022,Enable highlightingsource: \u0022/home/suggest?highlights=true\u0026fuzzy=true\u0026\u0022,Suggest functionproduce unexpected results depending on index size and how it\u0027s sharded. For moreinformation, see partition and sharding concepts.C#The SuggestAsync function takes two parameters that determine whether hit highlightsare returned or fuzzy matching is used in addition to the search term input.\r\nUp to eightmatches can be included in suggested results. The method creates a SuggestOptionsobject, which is then passed to the Suggest API. The result is then converted to JSON soit can be shown in the client.So far, the search UX code has been centered on suggestions.\r\nThe next code blockshows autocomplete, using the XDSoft jQuery UI Autocomplete function, passing in apublic async Task\u003CActionResult\u003E SuggestAsync(bool highlights, bool fuzzy, string term){    InitSearch();    var options = new SuggestOptions()    {        UseFuzzyMatching = fuzzy,        Size = 8,    };    if (highlights)    {        options.HighlightPreTag = \u0022\u003Cb\u003E\u0022;        options. HighlightPostTag = \u0022\u003C/b\u003E\u0022;    }    // Only one suggester can be specified per index.    // The suggester for the Hotels index enables autocomplete/suggestions on the HotelName field only.    // During indexing, HotelNames are indexed in patterns that support autocomplete and suggested results.    var suggestResult = await _searchClient.\n"
}