{
  "Id": "1175",
  "Title": "\u0022Implementing Advanced Search Functionality with Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSuggestionsCreate a search box\u003Cinput class=\u0022searchBox\u0022 type=\u0022text\u0022 id=\u0022searchbox1\u0022 placeholder=\u0022search\u0022\u003E$(function () {    $(\u0022#searchbox1\u0022).autocomplete({        source: \u0022/home/suggest?highlights=false\u0026fuzzy=false\u0026\u0022,        minLength: 3,        position: {            my: \u0022left top\u0022,            at: \u0022left-23 bottom\u002B10\u0022        }    });});This function also passes a few parameters to control highlights, fuzzy matching, andterm.\r\nThe autocomplete JavaScript API adds the term parameter.The minLength: 3 ensures that recommendations will only be shown when there are atleast three characters in the search box.Fuzzy search allows you to get results based on close matches even if the user misspellsa word in the search box. The edit distance is 1, which means there can be a maximumdiscrepancy of one character between the user input and a match.JavaScriptHighlighting applies font style to the characters in the result that correspond to theinput. For example, if the partial input is \u0022micro\u0022, the result would appear as microsoft,microscope, and so forth.\r\nHighlighting is based on the HighlightPreTag andHighlightPostTag parameters, defined inline with the Suggestion function.JavaScriptIf you are using C# and an MVC application, HomeController.cs file under theControllers directory is where you might create a class for suggested results. In .NET, aSuggest function is based on the SuggestAsync method. For more information aboutthe .NET SDK, see How to use Azure Cognitive Search from a .NET Application.The InitSearch method creates an authenticated HTTP index client to the AzureCognitive Search service. Properties on the SuggestOptions class determine which fieldsare searched and returned in the results, the number of matches, and whether fuzzymatching is used.\n"
}