{
  "Id": "1706",
  "Title": "\u0022Implementing Key Phrase Extraction in Azure Search Using JSON\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe key phrases are returned inorder of importance.Consider a SQL record that has the following fields:JSONThen your skill definition might look like this:JSONSkill inputsSkill outputsSample definition{    \u0022content\u0022: \u0022Glaciers are huge rivers of ice that ooze their way over land, powered by gravity and their own sheer weight.\r\nThey accumulate ice from snowfall and lose it through melting. As global temperatures have risen, many of the world’s glaciers have already started to shrink and retreat. Continued warming could see many iconic landscapes – from the Canadian Rockies to the Mount Everest region of the Himalayas – lose almost all their glaciers by the end of the century.\r\n\u0022,    \u0022language\u0022: \u0022en\u0022}For the previous example, the output of your skill is written to a new node in theenriched tree called \u0022document/myKeyPhrases\u0022 since that is the targetName that wespecified. If you don’t specify a targetName, then it would be \u0022document/keyPhrases\u0022.JSONYou can use \u0022document/myKeyPhrases\u0022 as input into other skills, or as a source of anoutput field mapping. {    \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Text.\r\nKeyPhraseExtractionSkill\u0022,    \u0022inputs\u0022: [      {        \u0022name\u0022: \u0022text\u0022,        \u0022source\u0022: \u0022/document/content\u0022      },      {        \u0022name\u0022: \u0022languageCode\u0022,        \u0022source\u0022: \u0022/document/language\u0022       }    ],    \u0022outputs\u0022: [      {        \u0022name\u0022: \u0022keyPhrases\u0022,        \u0022targetName\u0022: \u0022myKeyPhrases\u0022      }    ]  }Sample outputdocument/myKeyPhrases[  \u0022world’s glaciers\u0022,   \u0022huge rivers of ice\u0022,   \u0022Canadian Rockies\u0022,   \u0022iconic landscapes\u0022,  \u0022Mount Everest region\u0022,  \u0022Continued warming\u0022]WarningsIf you provide an unsupported language code, a warning is generated and key phrasesaren\u0027t extracted.\n"
}