{
  "Id": "82",
  "Title": "\u0022Implementing Suggestions and Managing Resources in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can see how field selections are used, and how \u0022Show Field Name\u0022 isused to include or exclude labeling within the suggestion.Suggestions refer to automated query prompts that are attached to the search box.Cognitive Search supports two: autocompletion of a partially entered search term, andsuggestions for a dropdown list of potential matching documents based.\r\nThe wizard supports suggestions, and the fields that can provide suggested results arederived from a Suggesters construct in the index:JSON1. In the wizard, select the Suggestions tab at the top of the page. You\u0027ll see a list ofall fields that are designated in the index schema as suggestion providers.2. Accept the current selection and continue to the next page.\r\nAdd suggestions  \u0022suggesters\u0022: [     {       \u0022name\u0022: \u0022sg\u0022,       \u0022searchMode\u0022: \u0022analyzingInfixMatching\u0022,       \u0022sourceFields\u0022: [        \u0022number\u0022,         \u0022street\u0022,         \u0022city\u0022,         \u0022region\u0022,         \u0022postCode\u0022,         \u0022tags\u0022       ] 1. Select Create demo app at the bottom of the page to generate the HTML file.\r\n2. When prompted, select Download your app to download the file.3. Open the file and click the Search button. This action executes a query, which canbe an empty query (*) that returns an arbitrary result set. The page should looksimilar to the following screenshot. Enter a term and use filters to narrow results. The underlying index is composed of fictitious, generated data that has been duplicatedacross documents, and descriptions sometimes don\u0027t match the image. You can expect amore cohesive experience when you create an app based on your own indexes.When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created. Resources left running cancost you money. You can delete resources individually or delete the resource group todelete the entire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.\n"
}