{
  "Id": "1282",
  "Title": "\u0022Implementing Fuzzy Search and Hit Highlighting in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfProvide the query string where each term is followed by a tilde (~) operator at theend of each whole term (search=\u003Cstring\u003E~). An expansion graph is created forevery term in the query input.Include an optional parameter, a number between 0 and 2 (default), if you want tospecify the edit distance (~1). For example, \u0022blue~\u0022 or \u0022blue~1\u0022 would return\u0022blue\u0022, \u0022blues\u0022, and \u0022glue\u0022.\r\nHow to invoke fuzzy searchPOST https://[service name].search.windows.net/indexes/hotels-sample-index/docs/search?api-version=2020-06-30 {     \u0022search\u0022: \u0022seatle~ waterfront~ view~ hotle~\u0022,     \u0022queryType\u0022: \u0022full\u0022,     \u0022searchMode\u0022: \u0022any\u0022,     \u0022searchFields\u0022: \u0022HotelName, Description\u0022,     \u0022select\u0022: \u0022HotelName, Description, Address/City,\u0022,     \u0022count\u0022: \u0022true\u0022 } Optionally, you can improve query performance by scoping the request to specific fields.\r\nUse the searchFields parameter to specify which fields to search. You can also use theselect property to specify which fields are returned in the query response.For simple testing, we recommend Search explorer or Postman for iterating over a queryexpression. Both tools are interactive, which means you can quickly step throughmultiple variants of a term and evaluate the responses that come back.When results are ambiguous, hit highlighting can help you identify the match in theresponse.Assume the following string exists in a \u0022Description\u0022 field in a search document: \u0022Testqueries with special characters, plus strings for MSFT, SQL and Java.\u0022Start with a fuzzy search on \u0022special\u0022 and add hit highlighting to the Description field:ConsoleIn the response, because you added hit highlighting, formatting is applied to \u0022special\u0022as the matching term.\n"
}