{
  "Id": "1254",
  "Title": "\u0022Implementing Semantic Answers in Azure AI Search: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf..\u0022, then it\u0027s unlikely an answer is returned.Prerequisites７ NoteStarting in 2021-04-30-Preview, in Create or Update Index (Preview) requests, a\u0022semanticConfiguration\u0022 is required for specifying input fields for semanticranking.A semantic answer is a substructure of a semantic query response.\r\nIt consists of one ormore verbatim passages from a search document, formulated as an answer to a querythat looks like a question. To return an answer, phrases or sentences must exist in asearch document that have the language characteristics of an answer, and the queryitself must be posed as a question.Azure AI Search uses a machine reading comprehension model to recognize and pickthe best answer.\r\nThe model produces a set of potential answers from the availablecontent, and when it reaches a high enough confidence level, it proposes one as ananswer.Answers are returned as an independent, top-level object in the query response payloadthat you can choose to render on search pages, along side search results.\r\nStructurally,it\u0027s an array element within the response consisting of text, a document key, and aconfidence score.To return a semantic answer, the query must have the semantic \u0022queryType\u0022,\u0022queryLanguage\u0022, \u0022semanticConfiguration\u0022, and the \u0022answers\u0022 parameters. Specifyingthese parameters doesn\u0027t guarantee an answer, but the request must include them foranswer processing to occur.JSONA query string must not be null and should be formulated as question.\u0022queryType\u0022 must be set to \u0022semantic.\u0022queryLanguage\u0022 must be one of the values from the supported languages list(REST API). What is a semantic answer?Formulate a REST query for \u0022answers\u0022{    \u0022search\u0022: \u0022how do clouds form\u0022,    \u0022queryType\u0022: \u0022semantic\u0022,    \u0022queryLanguage\u0022: \u0022en-us\u0022,    \u0022semanticConfiguration\u0022: \u0022my-semantic-config\u0022,    \u0022answers\u0022: \u0022extractive|count-3\u0022,    \u0022captions\u0022: \u0022extractive|highlight-true\u0022,    \u0022count\u0022: \u0022true\u0022}A \u0022semanticConfiguration\u0022 determines which string fields provide tokens to theextraction model.\n"
}