{
  "Id": "134",
  "Title": "\u0022Implementing Azure AI Search for Book Catalog Website\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe optional -out parameter allows you to specify an output file for the plan.Using the -out parameter ensures that the plan you reviewed is exactly whatis applied.To read more about persisting execution plans and security, see the securitywarning section.2. Run terraform apply to apply the execution plan.\r\nConsoleTroubleshoot common problems when using Terraform on Azure                       --resource-group $resource_group_nameClean up resourcesterraform plan -destroy -out main.destroy.tfplanterraform apply main.destroy.tfplanTroubleshoot Terraform on AzureNext stepsCreate an Azure AI Search index using the Azure portal1 - Overview of adding search to awebsite with .\r\nNETArticle•11/17/2023This tutorial builds a website to search through a catalog of books and then deploys thewebsite to an Azure Static Web App.This sample website provides access to a catalog of 10,000 books. A user can search thecatalog by entering text in the search bar. While the user enters text, the website usesthe search index\u0027s suggest feature to complete the text.\r\nOnce the query finishes, the listof books is displayed with a portion of the details. A user can select a book to see all thedetails, stored in the search index, of the book.The search experience includes:Search – provides search functionality for the application.Suggest – provides suggestions as the user is typing in the search bar.\r\nFacets and filters - provides a faceted navigation structure that filters by author orlanguage.Paginated results - provides paging controls for scrolling through results.What does the sample do?Document Lookup – looks up a document by ID to retrieve all of its contents forthe details page. The sample code includes the following:AppPurposeGitHubRepositoryLocationClientReact app (presentation layer) to display books, withsearch. It calls the Azure Function app./search-website-functions-v4/clientServerAzure .NET Function app (business layer) - calls theAzure AI Search API using .NET SDK/search-website-functions-v4/apiBulkinsert.NET file to create the index and add documents to it.\n"
}