{
  "Id": "1086",
  "Title": "\u0022Implementing Custom Skills with Azure Functions and Bing Entity Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTheexample uses an Azure Function to wrap the Bing Entity Search API so that itimplements the custom skill interface.Read about custom skill interface article if you aren\u0027t familiar with the input/outputinterface that a custom skill should implement.Create a Bing Search v7 resource through the Azure Portal. A free tier is availableand sufficient for this example.Install Visual Studio 2019 or later, including the Azure development workload.Although this example uses an Azure Function to host a web API, it isn\u0027t required. Aslong as you meet the interface requirements for a cognitive skill, the approach you takeis immaterial.\r\nAzure Functions, however, make it easy to create a custom skill.1. In Visual Studio, select New \u003E Project from the File menu.2. In the New Project dialog, select Azure Functions as the template and select Next.Type a name for your project, and select Create.\r\nThe function app name must bevalid as a C# namespace, so don\u0027t use underscores, hyphens, or any other non-alphanumeric characters.3. Select the type to be HTTP Trigger4. For Storage Account, you may select None, as you won\u0027t need any storage for thisfunction.5. Select Create to create the function project and HTTP triggered function. PrerequisitesCreate an Azure FunctionCreate a function appVisual Studio creates a project and in it a class that contains boilerplate code for thechosen function type. The FunctionName attribute on the method sets the name of thefunction. The HttpTrigger attribute specifies that the function is triggered by an HTTPrequest.Now, replace all of the content of the file Function1.cs with the following code:C#Modify the code to call the Bing Entity Search Serviceusing System; using System.Collections.Generic;using System.IO; using System.Linq; using System.Net.Http; using System.Threading.Tasks; using Microsoft.AspNetCore.\n"
}