{
  "Id": "92",
  "Title": "\u0022Implementing Azure Cognitive Search for Hotel Reviews Enrichment and Indexing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can use this resource because the number of records in HotelReviews-Free.csv is 19 and this free resource allows up to 20 transactions a day.2. Expand Add enrichments.3. For Skillset name, enter \u0022hotel-reviews-ss\u0022.4. For Source data field, select reviews_text.5. For Enrichment granularity level, select Pages (5000 characters chunks).6.\r\nFor Text Cognitive Skills, select the following skills:Extract key phrasesTranslate textStep 2: Add skillsLanguage detectionDetect sentimentYour page should look like the following screenshot:7. Scroll down and expand Save enrichments to knowledge store.8. Select Choose an existing connection and then select an Azure Storage account.The Containers page appears so that you can create a container for projections.We recommend adopting a prefix naming convention, such as \u0022kstore-hotel-reviews\u0022 to distinguish between source content and knowledge store content.9. Returning to the Import data wizard, select the following Azure table projections.The wizard always offers the Documents projection.\r\nOther projections are offereddepending on the skills you select (such as Key phrases), or the enrichmentgranularity (Pages):DocumentsPagesKey phrasesThe following screenshot shows the table projection selections in the wizard.10. Continue to the next page.In this wizard step, configure an index for optional full-text search queries.\r\nYou don\u0027tneed a search index for a knowledge store, but the indexer requires one in order to run.In this step, the wizard samples your data source to infer fields and data types. You onlyneed to select the attributes for your desired behavior. For example, the Retrievableattribute allows the search service to return a field value, while the Searchable attributeenables full text search on the field. 1. For Index name, enter \u0022hotel-reviews-idx\u0022.2. For attributes, accept the default selections: Retrievable and Searchable for thenew fields that the pipeline is creating.Your index should look similar to the following image. Because the list is long, notall fields are visible in the image.\n"
}