{
  "Id": "780",
  "Title": "\u0022Implementing Synonyms in Azure Search Using Multiple Languages\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNET) and Add Synonyms using C#SynonymMap class (Python)SynonymMap interface (JavaScript)SynonymMap class (Java)Create synonymsPOST /synonymmaps?api-version=2020-06-30 {     \u0022name\u0022: \u0022geo-synonyms\u0022,     \u0022format\u0022: \u0022solr\u0022,     \u0022synonyms\u0022: \u0022         USA, United States, United States of America\\n         Washington, Wash., WA =\u003E WA\\n\u0022 } Mapping rules adhere to the open-source synonym filter specification of Apache Solr,described in this document: SynonymFilter.\r\nThe solr format supports two kinds ofrules:equivalency (where terms are equal substitutes in the query)explicit mappings (where terms are mapped to one explicit term prior to querying)Each rule must be delimited by the new line character (\\n). You can define up to 5,000rules per synonym map in a free service and 20,000 rules per map in other tiers.\r\nEachrule can have up to 20 expansions (or items in a rule). For more information, seeSynonym limits.Query parsers will lower-case any upper or mixed case terms, but if you want topreserve special characters in the string, such as a comma or dash, add the appropriateescape characters when creating the synonym map.\r\nRules for equivalent terms are comma-delimited within the same rule. In the firstexample, a query on USA will expand to USA OR \u0022United States\u0022 OR \u0022United States ofAmerica\u0022. Notice that if you want to match on a phrase, the query itself must be aquote-enclosed phrase query.In the equivalence case, a query for dog will expand the query to also include puppy andcanine. JSONRules for an explicit mapping are denoted by an arrow =\u003E. When specified, a termsequence of a search query that matches the left-hand side of =\u003E will be replaced withDefine rulesEquivalency rules{ \u0022format\u0022: \u0022solr\u0022, \u0022synonyms\u0022: \u0022     USA, United States, United States of America\\n     dog, puppy, canine\\n     coffee, latte, cup of joe, java\\n\u0022 } Explicit mappingthe alternatives on the right-hand side at query time.\n"
}