{
  "Id": "279",
  "Title": "\u0022Implementing Azure AI Search with Key Vault Encryption and Full Text Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure AI Search on any tier or region.Azure Storage, Standard performance (general-purpose v2)Blobs encrypted with a customer-managed key. See Tutorial: Encrypt and decryptblobs using Azure Key Vault if you need to create sample data.Azure Key Vault in the same subscription as Azure AI Search.\r\nThe key vault musthave soft-delete and purge protection enabled.Postman appDefine a pipeline that decrypts the documents and extracts text from them.＂Define an index to store the output.＂Execute the pipeline to create and load the index.＂Explore results using full text search and a rich query syntax.＂PrerequisitesCustom skill deployment creates an Azure Function app and an Azure Storage account.\r\nSince these resources are created for you, they aren\u0027t listed as a prerequisite. Whenyou\u0027re finished with this tutorial, remember to clean up the resources so that you aren\u0027tbilled for services you\u0027re not using.This example uses the sample DecryptBlobFile project from the Azure Search PowerSkills GitHub repository.\r\nIn this section, you will deploy the skill to an Azure Functionso that it can be used in a skillset. A built-in deployment script creates an AzureFunction resource named starting with psdbf-function-app- and loads the skill. You\u0027ll beprompted to provide a subscription and resource group.\r\nBe sure to choose the samesubscription that your Azure Key Vault instance lives in.Operationally, the DecryptBlobFile skill takes the URL and SAS token for each blob asinputs, and it outputs the downloaded, decrypted file using the file reference contractthat Azure AI Search expects. Recall that DecryptBlobFile needs the encryption key toperform the decryption. As part of setup, you\u0027ll also create an access policy that grantsDecryptBlobFile function access to the encryption key in Azure Key Vault.1. Click the Deploy to Azure button found on the DecryptBlobFile landing page,which will open the provided Resource Manager template within the Azure portal.2.\n"
}