{
  "Id": "1207",
  "Title": "\u0022Implementing Faceted Navigation in Azure Cognitive Search Applications\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf5 on the vertical axis means prefiltering is 50%slower, 1.0 means prefiltering and post filtering are equivalent.The horizontal axis represents the filtering rate, or the percentage of candidatedocuments after applying the filter. For example, 1.00% means that one percent of thesearch corpus was selected by the filter criteria.\r\nAdd faceted navigation to a search appArticle•08/08/2023Faceted navigation is used for self-directed drilldown filtering on query results in asearch app, where your application offers form controls for scoping search to groups ofdocuments (for example, categories or brands), and Azure Cognitive Search provides thedata structures and filters to back the experience.\r\nIn this article, learn the basic steps for creating a faceted navigation structure in AzureCognitive Search.Code in the presentation layer does the heavy lifting in a faceted navigation experience.The demos and samples listed at the end of this article provide working code that showsyou how to bring everything together.Facets are dynamic and returned on a query. A search response brings with it all of thefacet categories used to navigate the documents in the result. The query executes first,and then facets are pulled from the current results and assembled into a facetednavigation structure.\r\nIn Cognitive Search, facets are one layer deep and can\u0027t be hierarchical. If you aren\u0027tfamiliar with faceted navigation structures, the following example shows one on the left.Counts indicate the number of matches for each facet. The same document can berepresented in multiple facets. Set field attributes in the index＂Structure the request and response＂Add navigation controls and filters in the presentation layer＂Faceted navigation in a search pageFacets can help you find what you\u0027re looking for, while ensuring that you don\u0027t get zeroresults. As a developer, facets let you expose the most useful search criteria fornavigating your search index.\n"
}