{
  "Id": "987",
  "Title": "\u0022Implementing Change Detection Policies in Azure Search Datasources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAs a workaround, any clustered index wouldhave to be dropped and re-created as nonclustered index, however, performancemay be affected in the source compared to having a clustered indexChange detection policies are added to data source definitions.\r\nTo use this policy, createor update your data source like this:HTTPWhen using SQL integrated change tracking policy, don\u0027t specify a separate datadeletion detection policy. The SQL integrated change tracking policy has built-insupport for identifying deleted rows. However, for the deleted rows to be detectedautomatically, the document key in your search index must be the same as the primarykey in the SQL table.\r\nPOST https://myservice.search.windows.net/datasources?api-version=2020-06-30Content-Type: application/jsonapi-key: admin-key    {        \u0022name\u0022 : \u0022myazuresqldatasource\u0022,        \u0022type\u0022 : \u0022azuresql\u0022,        \u0022credentials\u0022 : { \u0022connectionString\u0022 : \u0022connection string\u0022 },        \u0022container\u0022 : { \u0022name\u0022 : \u0022table name\u0022 },        \u0022dataChangeDetectionPolicy\u0022 : {            \u0022@odata.type\u0022 : \u0022#Microsoft.Azure.\r\nSearch.SqlIntegratedChangeTrackingPolicy\u0022    }７ NoteWhen using TRUNCATE TABLE to remove a large number of rows from a SQL table,the indexer needs to be reset to reset the change tracking state to pick up rowdeletions.High Water Mark Change Detection policyThis change detection policy relies on a \u0022high water mark\u0022 column in your table or viewthat captures the version or time when a row was last updated.\r\nIf you\u0027re using a view,you must use a high water mark policy.The high water mark column must meet the following requirements:All inserts specify a value for the column.All updates to an item also change the value of the column. The value of this column increases with each insert or update.Queries with the following WHERE and ORDER BY clauses can be executedefficiently: WHERE [High Water Mark Column] \u003E [Current High Water Mark Value]ORDER BY [High Water Mark Column]Change detection policies are added to data source definitions. To use this policy, createor update your data source like this:HTTP７ NoteWe strongly recommend using the rowversion data type for the high water markcolumn. If any other data type is used, change tracking isn\u0027t guaranteed to captureall changes in the presence of transactions executing concurrently with an indexerquery.\n"
}