{
  "Id": "1499",
  "Title": "\u0022Implementing Azure Cognitive Search in ASP.NET Core Applications\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAddSearchClient(Configuration.GetSection(\u0022SearchClient\u0022));    });    services.AddControllers();}{    \u0022SearchClient\u0022: {You\u0027ll also need to provide your resource key to authenticate the client, but youshouldn\u0027t be putting that information in the configuration. Instead, when indevelopment, use User-Secrets. Add the following to secrets.json:JSONWhen running in production, it\u0027s preferable to use environment variables:Or use other secure ways of storing secrets like Azure Key Vault.For more details about Dependency Injection in ASP.NET Core apps, see Dependencyinjection with the Azure SDK for .NET.\r\nAn Azure Cognitive Search service contains one or more indexes that provide persistentstorage of searchable data in the form of JSON documents. (If you\u0027re brand new tosearch, you can make a very rough analogy between indexes and database tables.) TheAzure.Search.Documents client library exposes operations on these resources throughthree main client types.\r\nSearchClient helps with:Searching your indexed documents using rich queries and powerful datashapingAutocompleting partially typed search terms based on documents in the indexSuggesting the most likely matching text in documents as a user typesAdding, Updating or Deleting Documents documents from an indexSearchIndexClient allows you to:      \u0022endpoint\u0022: \u0022https://\u003Cresource-name\u003E. search.windows.net\u0022,      \u0022indexname\u0022: \u0022nycjobs\u0022    }}{    \u0022SearchClient\u0022: {      \u0022credential\u0022: { \u0022key\u0022: \u0022\u003Cyou resource key\u003E\u0022 }    }}SEARCH__CREDENTIAL__KEY=\u0022...\u0022Key conceptsCreate, delete, update, or configure a search indexDeclare custom synonym maps to expand or rewrite queriesSearchIndexerClient allows you to:Create indexers to automatically crawl data sourcesDefine AI powered Skillsets to transform and enrich your dataAzure Cognitive Search provides two powerful features:Semantic search enhances the quality of search results for text-based queries.\n"
}