{
  "Id": "887",
  "Title": "\u0022Indexer Limits and Output Field Mapping: Best Practices and Solutions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRow \u0027X\u0027 in table \u0027Y\u0027 has stringproperty \u0027Z\u0027 which was too long.Indexers limit how much text can be extracted from any one document. This limitdepends on the pricing tier: 32,000 characters for Free tier, 64,000 for Basic, 4 million forStandard, 8 million for Standard S2, and 16 million for Standard S3.\r\nText that wastruncated won\u0027t be indexed. To avoid this warning, try breaking apart documents withlarge amounts of text into multiple, smaller documents.For more information, see Indexer limits.Output field mappings that reference non-existent/null data will produce warnings foreach document and result in an empty index field.\r\nTo work around this issue, double-check your output field-mapping source paths for possible typos, or set a default valueusing the Conditional skill. See Output field mapping for details.ReasonDetails/ExampleResolutionCannotiterateovernon-array\u0022Cannot iterate over non-array/document/normalized_images/0/imageCelebrities/0/detail/celebrities.\u0022This erroroccurswhen theoutput isn\u0027tan array.\r\nIfyou thinkthe outputshould bean array,check theindicatedoutputsource fieldpath forerrors. Forexample,you mighthave amissing orextra * inthe sourcefield name.It\u0027s alsoWarning: Truncated extracted text to XcharactersWarning: Could not map output field \u0027X\u0027 tosearch indexReasonDetails/ExampleResolutionpossiblethat theinput tothis skill isnull,resulting inan emptyarray. Findsimilardetails inSkill Inputwas Invalidsection.Unabletoselect0 innon-array\u0022Unable to select 0 in non-array /document/pages.\u0022This couldhappen ifthe skillsoutputdoesn\u0027tproduce anarray andthe outputsource fieldname hasarray indexor * in itspath.Doublecheck thepathsprovided inthe outputsource fieldnames andthe fieldvalue fortheindicatedfield name.Find similardetails inSkill Inputwas Invalidsection.Data change detection policies have specific requirements for the columns they use todetect change. One of these requirements is that this column is updated every time thesource item is changed.\n"
}