{
  "Id": "866",
  "Title": "\u0022Indexing Best Practices and Common Pitfalls in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis condition canoccur when indexing blobs and \u0022parsingMode\u0022 is set to jsonArray and jsonLines.Due to documents processed multiple times.PUT https://[service name].search.windows.net/indexers/[indexer name]?api-version=2020-06-30 Content-Type: application/json api-key: [admin key] {   ...\r\nother parts of indexer definition   \u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022dataToExtract\u0022 : \u0022contentAndMetadata\u0022 } } } Missing content from Azure Cosmos DBIndexer reflects a different document countthan data source or indexIndexers use a conservative buffering strategy to ensure that every new and changeddocument in the data source is picked up during indexing.\r\nIn certain situations, thesebuffers can overlap, causing an indexer to index a document two or more timesresulting in the processed documents count to be more than actual number ofdocuments in the data source. This behavior does not affect the data stored in theindex, such as duplicating documents, only that it may take longer to reach eventualconsistency.\r\nThis condition can be especially prevalent if any of the following criteria aretrue:On-demand indexer requests are issued in quick successionThe data source\u0027s topology includes multiple replicas and partitions (one suchexample is discussed here)The data source is an Azure SQL database and the column chosen as \u0022high watermark\u0022 is of type datetime2Indexers are not intended to be invoked multiple times in quick succession. If you needupdates quickly, the supported approach is to push updates to the index whilesimultaneously updating the data source. For on-demand processing, we recommendthat you pace your requests in five-minute intervals or more, and run the indexer on aschedule.Conditions under which a document is processed twice is explained in the followingtimeline that notes each action and counter action. The following timeline illustrates theissue:Timeline(hh:mm:ss)EventIndexerHighWaterMarkComment00:01:00Write doc1 to data sourcewith eventual consistencynullDocument timestamp is 00:01:00.\n"
}