{
  "Id": "255",
  "Title": "\u0022Indexing JSON Data from Azure Blob Storage: A Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfClean up resourcesNext stepsConfigure a SQL Database indexerTutorial: Index JSON blobs from AzureStorage using RESTArticle•11/15/2023Azure AI Search can index JSON documents and arrays in Azure Blob Storage using anindexer that knows how to read semi-structured data. Semi-structured data containstags or markings which separate content within the data.\r\nIt splits the difference betweenunstructured data, which must be fully indexed, and formally structured data thatadheres to a data model, such as a relational database schema, that can be indexed on aper-field basis.This tutorial uses Postman and the Search REST APIs to perform the following tasks:If you don\u0027t have an Azure subscription, create a free account before you begin.\r\nAzure StoragePostman appCreate or find an existing search serviceClinical-trials-json.zip contains the data used in this tutorial. Download and unzip thisfile to its own folder. Data originates from clinicaltrials.gov, converted to JSON for thistutorial.\r\nConfigure an Azure AI Search data source for an Azure blob container＂Create an Azure AI Search index to contain searchable content＂Configure and run an indexer to read the container and extract searchable contentfrom Azure Blob Storage＂Search the index you just created＂Prerequisites７ NoteYou can use the free service for this tutorial. A free search service limits you to threeindexes, three indexers, and three data sources. This tutorial creates one of each.Before starting, make sure you have room on your service to accept the newresources.Download filesThis tutorial uses Azure AI Search for indexing and queries, and Azure Blob Storage toprovide the data.If possible, create both in the same region and resource group for proximity andmanageability. In practice, your Azure Storage account can be in any region.1. Sign in to the Azure portal and click \u002B Create Resource.2. Search for storage account and select Microsoft\u0027s Storage Account offering.3. In the Basics tab, the following items are required. Accept the defaults foreverything else.Resource group.\n"
}