{
  "Id": "792",
  "Title": "\u0022Indexing and Data Preparation Techniques for Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen you run an indexer, it connects to your data source,retrieves the data from the container or folder, optionally serializes it into JSON beforepassing it to the search engine for indexing. This section describes the requirements ofincoming data for text-based indexing.\r\nIndexer example for skills-based indexing{  \u0022name\u0022: (required) String that uniquely identifies the indexer,  \u0022dataSourceName\u0022: (required) String, provides raw content that will be enriched,  \u0022targetIndexName\u0022: (required) String, name of an existing index,  \u0022skillsetName\u0022 : (required for AI enrichment) String, name of an existing skillset,  \u0022cache\u0022:  {    \u0022storageConnectionString\u0022 :\r\n(required if you enable the cache) Connection string to a blob container,    \u0022enableReprocessing\u0022: true    },  \u0022parameters\u0022: { },  \u0022fieldMappings\u0022: (optional) Maps fields in the underlying data source to fields in an index,  \u0022outputFieldMappings\u0022 : (required) Maps skill outputs to fields in an index,}Prepare external dataSourcedataTasksJSONdocumentsMake sure the structure or shape of incoming data corresponds to the schema ofyour search index.\r\nMost search indexes are fairly flat, where the fields collectionconsists of fields at the same level. However, hierarchical or nested structures arepossible through complex fields and collections.RelationalProvide it as a flattened row set, where each row becomes a full or partial searchdocument in the index.\r\nTo flatten relational data into a row set, you should create a SQL view, or build aquery that returns parent and child records in the same row. For example, the built-in hotels sample dataset is an SQL database that has 50 records (one for eachhotel), linked to room records in a related table. The query that flattens thecollective data into a row set embeds all of the room information in JSONdocuments in each hotel record. The embedded room information is a generatedby a query that uses a FOR JSON AUTO clause.You can learn more about this technique in define a query that returns embeddedJSON. This is just one example; you can find other approaches that produce thesame result.\n"
}