{
  "Id": "961",
  "Title": "\u0022Indexing Workflow for Azure Cosmos DB with Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis article supplements Create an indexer with information that\u0027s specific to CosmosDB. It uses the REST APIs to demonstrate a three-part workflow common to all indexers:create a data source, create an index, create an indexer. Data extraction occurs whenyou submit the Create Indexer request.Because terminology can be confusing, it\u0027s worth noting that Azure Cosmos DB indexingand Azure AI Search indexing are different operations.\r\nIndexing in Azure AI Searchcreates and loads a search index on your search service.Register for the preview to provide feedback and get help with any issues youencounter.An Azure Cosmos DB account, database, container, and items. Use the same regionfor both Azure AI Search and Azure Cosmos DB for lower latency and to avoidbandwidth charges.An automatic indexing policy on the Azure Cosmos DB collection, set toConsistent. This is the default configuration. Lazy indexing isn\u0027t recommended andmay result in missing data.Read permissions.\r\nA \u0022full access\u0022 connection string includes a key that grantsaccess to the content, but if you\u0027re using Azure roles, make sure the search servicemanaged identity has Cosmos DB Account Reader Role permissions.） ImportantThe Azure Cosmos DB for Apache Gremlin indexer is currently in public previewunder Supplemental Terms of Use.\r\nCurrently, there is no SDK support.PrerequisitesA REST client, such as Postman, to send REST calls that create the data source,index, and indexer.The data source definition specifies the data to index, credentials, and policies foridentifying changes in the data. A data source is defined as an independent resource sothat it can be used by multiple indexers. For this call, specify a preview REST API version (2020-06-30-Preview or 2021-04-30-Preview) to create a data source that connects via an Azure Cosmos DB for ApacheGremlin.1. Create or update a data source to set its definition:HTTP2. Set \u0022type\u0022 to \u0022cosmosdb\u0022 (required).3. Set \u0022credentials\u0022 to a connection string. The next section describes the supportedformats.\n"
}