{
  "Id": "830",
  "Title": "\u0022Indexing CSV Blobs and Files in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022id,datePublished,tags\u0022 } } } Next stepsIndex CSV blobs and files usingdelimitedText parsing modeArticle•10/04/2022Applies to: Blob indexers, File indexersIn Azure Cognitive Search, both blob indexers and file indexers support a delimitedTextparsing mode for CSV files that treats each line in the CSV as a separate searchdocument.\r\nFor example, given the following comma-delimited text, the delimitedTextparsing mode would result in two documents in the search index:textWithout the delimitedText parsing mode, the entire contents of the CSV file would betreated as one search document.\r\nWhenever you\u0027re creating multiple search documents from a single blob, be sure toreview Indexing blobs to produce multiple search documents to understand howdocument key assignments work. The blob indexer is capable of finding or generatingvalues that uniquely define each new document.\r\nSpecifically, it can create a transitoryAzureSearch_DocumentKey that generated when a blob is parsed into smaller parts, wherethe value is then used as the search document\u0027s key in the index.To index CSV blobs, create or update an indexer definition with the delimitedTextparsing mode on a Create Indexer request:HTTPid, datePublished, tags 1, 2016-01-12, \u0022azure-search,azure,cloud\u0022 2, 2016-07-07, \u0022cloud,mobile\u0022 Setting up CSV indexing{   \u0022name\u0022 : \u0022my-csv-indexer\u0022,   . .. other indexer properties   \u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022parsingMode\u0022 : \u0022delimitedText\u0022, \u0022firstLineContainsHeaders\u0022 : true } } } firstLineContainsHeaders indicates that the first (non-blank) line of each blob containsheaders. If blobs don\u0027t contain an initial header line, the headers should be specified inthe indexer configuration:HTTPYou can customize the delimiter character using the delimitedTextDelimiterconfiguration setting. For example:HTTPPutting it all together, here are the complete payload examples.\n"
}