{
  "Id": "740",
  "Title": "\u0022Indexing Complex Types in Azure Search: Best Practices and Guidelines\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022,   \u0022Tags\u0022: [\u0022Free wifi\u0022, \u0022on-site parking\u0022, \u0022indoor pool\u0022, \u0022continental breakfast\u0022],   \u0022Address\u0022: {     \u0022StreetAddress\u0022: \u0022677 5th Ave\u0022,     \u0022City\u0022: \u0022New York\u0022,    \u0022StateProvince\u0022: \u0022NY\u0022   },   \u0022Rooms\u0022: [     {       \u0022Description\u0022: \u0022Budget Room, 1 Queen Bed (Cityside)\u0022,       \u0022RoomNumber\u0022: 1105,       \u0022BaseRate\u0022: 96.\r\n99,     },     {       \u0022Description\u0022: \u0022Deluxe Room, 2 Double Beds (City View)\u0022,       \u0022Type\u0022: \u0022Deluxe Room\u0022,       \u0022BaseRate\u0022: 150.99,     }     . . .   ] } Indexing complex typesThis limit applies only to complex collections, and not complex types (like Address) orstring collections (like Tags).As with any index definition, you can use the portal, REST API, or .\r\nNET SDK to create aschema that includes complex types.Other Azure SDKs provide samples in Python, Java, and JavaScript.1. Sign in to Azure portal.2. On the search service Overview page, select the Indexes tab.3. Open an existing index or create a new index.4. Select the Fields tab, and then select Add field.\r\nAn empty field is added. Ifyou\u0027re working with an existing fields collection, scroll down to set up thefield.5. Give the field a name and set the type to either Edm.ComplexType orCollection(Edm.ComplexType).6. Select the ellipses on the far right, and then select either Add field or Addsubfield, and then assign attributes. All of the reindexing rules that apply to fields in general still apply to complex fields.Restating a few of the main rules here, adding a field to a complex type doesn\u0027t requirean index rebuild, but most modifications do.You can add new sub-fields to a complex field at any time without the need for an indexrebuild. For example, adding \u0022ZipCode\u0022 to Address or \u0022Amenities\u0022 to Rooms is allowed,just like adding a top-level field to an index. Existing documents have a null value fornew fields until you explicitly populate those fields by updating your data.\n"
}