{
  "Id": "899",
  "Title": "\u0022Indexing and Searching Blob Metadata in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf blobs are whole files, you canpotentially parse them into multiple search documents. For example, you can parse rowsin a CSV file to create one search document per row.Blob metadata can also be indexed, and that\u0027s helpful if you think any of the standard orcustom metadata properties will be useful in filters and queries.\r\nUser-specified metadata properties are extracted verbatim. To receive the values, youmust define field in the search index of type Edm.String, with same name as themetadata key of the blob. For example, if a blob has a metadata key of Sensitivity withvalue High, you should define a field named Sensitivity in your search index and it willbe populated with the value High.\r\nStandard blob metadata properties can be extracted into similarly named and typedfields, as listed below. The blob indexer automatically creates internal field mappings forIndexing blob metadatathese blob metadata properties, converting the original hyphenated name (\u0022metadata-storage-name\u0022) to an underscored equivalent name (\u0022metadata_storage_name\u0022).\r\nYou still have to add the underscored fields to the index definition, but you can omitfield mappings because the indexer will make the association automatically.metadata_storage_name (Edm.String) - the file name of the blob. For example, ifyou have a blob /my-container/my-folder/subfolder/resume.pdf, the value of thisfield is resume.\r\npdf.metadata_storage_path (Edm.String) - the full URI of the blob, including thestorage account. For example, https://myaccount.blob.core.windows.net/my-container/my-folder/subfolder/resume.pdfmetadata_storage_content_type (Edm.String) - content type as specified by thecode you used to upload the blob. For example, application/octet-stream.metadata_storage_last_modified (Edm.DateTimeOffset) - last modified timestampfor the blob. Azure Cognitive Search uses this timestamp to identify changedblobs, to avoid reindexing everything after the initial indexing.metadata_storage_size (Edm.Int64) - blob size in bytes.metadata_storage_content_md5 (Edm.String) - MD5 hash of the blob content, ifavailable.metadata_storage_sas_token (Edm.String) - A temporary SAS token that can beused by custom skills to get access to the blob. This token shouldn\u0027t be stored forlater use as it might expire.\n"
}