{
  "Id": "923",
  "Title": "\u0022Indexing Compound Documents and Azure File Data Sources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA compound or embedded document (such as a ZIP archive, a Word document withembedded Outlook email containing attachments, or an .MSG file with attachments) isalso indexed as a single document. For example, all images extracted from theattachments of an .MSG file will be returned in the normalized_images field. If you haveimages, consider adding AI enrichment to get more search utility from that content.Textual content of a document is extracted into a string field named \u0022content\u0022.\r\nYou canalso extract standard and user-defined metadata.The data source definition specifies the data to index, credentials, and policies foridentifying changes in the data. A data source is defined as an independent resource sothat it can be used by multiple indexers.1.\r\nCreate or update a data source to set its definition, using a preview API version2020-06-30-Preview or 2021-04-30-Preview for \u0022type\u0022: \u0022azurefile\u0022.JSONHow Azure Files are indexedDefine the data source{     \u0022name\u0022 : \u0022my-file-datasource\u0022, 2. Set \u0022type\u0022 to \u0022azurefile\u0022 (required).3. Set \u0022credentials\u0022 to an Azure Storage connection string. The next section describesthe supported formats.4.\r\nSet \u0022container\u0022 to the root file share, and use \u0022query\u0022 to specify any subfolders.A data source definition can also include soft deletion policies, if you want the indexerto delete a search document when the source document is flagged for deletion.Indexers can connect to a file share using the following connections. Full access storage account connection string{ \u0022connectionString\u0022 : \u0022DefaultEndpointsProtocol=https;AccountName=\u003Cyour storageaccount\u003E;AccountKey=\u003Cyour account key\u003E;\u0022 }You can get the connection string from the Storage account page in Azure portal by selectingAccess keys in the left navigation pane. Make sure to select a full connection string and not just akey.\n"
}