{
  "Id": "912",
  "Title": "\u0022Indexing and Enriching Documents in Azure Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor example, you can parse rowsin a CSV file to create one search document per row.A compound or embedded document (such as a ZIP archive, a Word document withembedded Outlook email containing attachments, or an .MSG file with attachments) isalso indexed as a single document. For example, all images extracted from theattachments of an .\r\nMSG file will be returned in the normalized_images field. If you haveimages, consider adding AI enrichment to get more search utility from that content.Textual content of a document is extracted into a string field named \u0022content\u0022. You canalso extract standard and user-defined metadata.Blob metadata can also be indexed, and that\u0027s helpful if you think any of the standard orcustom metadata properties will be useful in filters and queries.User-specified metadata properties are extracted verbatim. To receive the values, youmust define field in the search index of type Edm.String, with same name as themetadata key of the blob.\r\nFor example, if a blob has a metadata key of Sensitivity withvalue High, you should define a field named Sensitivity in your search index and it willbe populated with the value High.Indexing blob metadataStandard blob metadata properties can be extracted into similarly named and typedfields, as listed below.\r\nThe blob indexer automatically creates internal field mappings forthese blob metadata properties, converting the original hyphenated name (\u0022metadata-storage-name\u0022) to an underscored equivalent name (\u0022metadata_storage_name\u0022).You still have to add the underscored fields to the index definition, but you can omitfield mappings because the indexer will make the association automatically.metadata_storage_name (Edm. String) - the file name of the blob. For example, ifyou have a blob /my-container/my-folder/subfolder/resume.pdf, the value of thisfield is resume.pdf.metadata_storage_path (Edm.String) - the full URI of the blob, including thestorage account. For example, https://myaccount.blob.core.windows.net/my-container/my-folder/subfolder/resume.pdfmetadata_storage_content_type (Edm.String) - content type as specified by thecode you used to upload the blob. For example, application/octet-stream.metadata_storage_last_modified (Edm.DateTimeOffset) - last modified timestampfor the blob.\n"
}