{
  "Id": "387",
  "Title": "\u0022Indexing Basics: How Terms Are Analyzed and Retrieved in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022How terms are indexedTo understand retrieval, it helps to know a few basics about indexing. The unit of storageis an inverted index, one for each searchable field. Within an inverted index is a sortedlist of all terms from all documents. Each term maps to the list of documents in which itoccurs, as evident in the example below.\r\nTo produce the terms in an inverted index, the search engine performs lexical analysisover the content of documents, similar to what happens during query processing:1. Text inputs are passed to an analyzer, lower-cased, stripped of punctuation, and soforth, depending on the analyzer configuration.2. Tokens are the output of lexical analysis.\r\n3. Terms are added to the index.It\u0027s common, but not required, to use the same analyzers for search and indexingoperations so that query terms look more like terms inside the index.\r\nInverted index for example documentsReturning to our example, for the title field, the inverted index looks like this:TermDocument listatman1beach2hotel1, 3        },        {            \u0022id\u0022: \u00224\u0022,            \u0022title\u0022: \u0022Ocean Retreat\u0022,            \u0022description\u0022: \u0022Quiet and secluded\u0022        }    ]}７ NoteAzure Cognitive Search lets you specify different analyzers for indexing and searchvia additional indexAnalyzer and searchAnalyzer field parameters.\r\nIf unspecified,the analyzer set with the analyzer property is used for both indexing andsearching.TermDocument listocean4playa3resort3retreat4In the title field, only hotel shows up in two documents: 1, 3. For the description field, the index is as follows:TermDocument listair3and4beach1conditioned3comfortable3distance1island2kauaʻi2located2north2ocean1, 2, 3of2on2quiet4rooms1, 3secluded4shore2spacious1TermDocument listthe1, 2to1view1, 2, 3walking1with3Matching query terms against indexed termsGiven the inverted indices above, let’s return to the sample query and see how matchingdocuments are found for our example query.\n"
}