{
  "Id": "1029",
  "Title": "\u0022Interactive Debugging and Testing in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA debug session is a cached indexer and skillset execution, scoped to a singledocument, that you can use to edit and test your changes interactively. If you\u0027reunfamiliar with how a debug session works, see Debug sessions in Azure AI Search. Topractice a debug workflow with a sample document, see Tutorial: Debug sessions.An existing enrichment pipeline, including a data source, a skillset, an indexer, andan index.\r\nA Contributor role assignment in the search service.An Azure Storage account, used to save session state.A Storage Blob Data Contributor role assignment in Azure Storage.If the Azure Storage account is behind a firewall, configure it to allow Searchservice access.A Debug Session works with all generally available indexer data sources and mostpreview data sources. The following list notes the exceptions:Azure Cosmos DB for MongoDB is currently not supported.For the Azure Cosmos DB for NoSQL, if a row fails during index and there\u0027s nocorresponding metadata, the debug session might not pick the correct row.\r\nFor the SQL API of Azure Cosmos DB, if a partitioned collection was previouslynon-partitioned, a Debug Session won\u0027t find the document.Debug sessions doesn\u0027t currently support connections using a managed identity orprivate endpoints to custom skills.PrerequisitesLimitations1. Sign in to the Azure portal and find your search service.2.\r\nIn the Overview page of your search service, select the Debug Sessions tab.3. Select \u002B New Debug Session.4. In Debug session name, provide a name that will help you remember whichskillset, indexer, and data source the debug session is about.5. In Storage connection, find a general-purpose storage account for caching thedebug session. You\u0027ll be prompted to select and optionally create a blob containerin Blob Storage or Azure Data Lake Storage Gen2. You can reuse the samecontainer for all subsequent debug sessions you create. A helpful container namemight be \u0022cognitive-search-debug-sessions\u0022.6. In Indexer template, select the indexer that drives the skillset you want to debug.\n"
}