{
  "Id": "890",
  "Title": "\u0022Integrating Azure Blob Storage with Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThese wordsmay result in truncated and/or unreliablemodel predictions.Error: Cannot write more bytes to the bufferthan the configured maximum buffer sizeSearch over Azure Blob Storage contentArticle•11/15/2023Searching across the variety of content types stored in Azure Blob Storage can be adifficult problem to solve, but Azure AI Search provides deep integration at the contentlayer, extracting and inferring textual information, which can then be queried in a searchindex.In this article, review the basic workflow for extracting content and metadata from blobsand sending it to a search index in Azure AI Search. The resulting index can be queriedusing full text search.\r\nOptionally, you can send processed blob content to a knowledgestore for non-search scenarios.Azure AI Search is a standalone search service that supports indexing and queryworkloads over user-defined indexes that contain your remote searchable contenthosted in the cloud. Co-locating your searchable content with the query engine isnecessary for performance, returning results at a speed users have come to expect fromsearch queries.Azure AI Search integrates with Azure Blob Storage at the indexing layer, importing yourblob content as search documents that are indexed into inverted indexes and otherquery structures that support free-form text queries and filter expressions.\r\nBecause yourblob content is indexed into a search index, you can use the full range of query featuresin Azure AI Search to find information in your blob content.Inputs are your blobs, in a single container, in Azure Blob Storage. Blobs can be almostany kind of text data. If your blobs contain images, you can add AI enrichment to createand extract text from images.Output is always an Azure AI Search index, used for fast text search, retrieval, andexploration in client applications. In between is the indexing pipeline architecture itself.The pipeline is based on the indexer feature, discussed further on in this article. ７ NoteAlready familiar with the workflow and composition? Configure a blob indexer isyour next step.What it means to add full text search to blobdataOnce the index is created and populated, it exists independently of your blob container,but you can rerun indexing operations to refresh your index based on changeddocuments. Timestamp information on individual blobs is used for change detection.You can opt for either scheduled execution or on-demand indexing as the refreshmechanism.You need Azure AI Search, Azure Blob Storage, and a client. Azure AI Search is typicallyone of several components in a solution, where your application code issues query APIrequests and handles the response.\n"
}