{
  "Id": "1481",
  "Title": "\u0022Integrating Microsoft Entra ID with Azure Search: A Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYour application must also be registered with Microsoft Entra ID as a multi-tenant app,as described in the following procedure.This step integrates your application with Microsoft Entra ID for the purpose ofaccepting sign-ins of user and group accounts. If you aren\u0027t a tenant admin in yourorganization, you might need to create a new tenant to perform the following steps.1. In Azure portal, find the Microsoft Entra tenant.2.\r\nOn the left, under Manage, select App registrations, and then select Newregistration.Create Microsoft Entra groups and users＂Associate the user with the group you have created＂Cache the new groups＂Index documents with associated groups＂Issue a search request with group identifiers filter＂PrerequisitesRegister your application with Microsoft Entra ID3.\r\nGive the registration a name, perhaps a name that\u0027s similar to the searchapplication name. Select Register.4. Once the app registration is created, copy the Application (client) ID. You\u0027ll need toprovide this string to your application.If you\u0027re stepping through the DotNetHowToSecurityTrimming, paste this valueinto the app.\r\nconfig file.Repeat for the Tenant ID.5. On the left, select API permissions and then select Add a permission.6. Select Microsoft Graph and then select Delegated permissions.7. Search for and then add the following delegated permissions:Directory.ReadWrite.AllGroup.ReadWrite.AllUser.ReadWrite.\r\nAllMicrosoft Graph provides an API that allows programmatic access to MicrosoftEntra ID through a REST API. The code sample for this walkthrough uses thepermissions to call the Microsoft Graph API for creating groups, users, andassociations. The APIs are also used to cache group identifiers for faster filtering.8. Select Grant admin consent for tenant to complete the consent process. If you\u0027re adding search to an established application, you might have existing user andgroup identifiers in Microsoft Entra ID. In this case, you can skip the next three steps.However, if you don\u0027t have existing users, you can use Microsoft Graph APIs to createthe security principals. The following code snippets demonstrate how to generateidentifiers, which become data values for the security field in your Azure AI Search index.Create users and groupsIn our hypothetical college admissions application, this would be the security identifiersfor admissions staff.User and group membership might be very fluid, especially in large organizations.\n"
}