{
  "Id": "510",
  "Title": "\u0022Integrated Vectorization in Azure Search: Components and Checklist\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor indexing, integrated vectorization requires:An indexer retrieving data from a supported data source.A skillset that calls the Text Split skill to chunk the data, and eitherAzureOpenAIEmbedding skill or a custom skill to vectorize the data.One or more indexes to receive the chunked and vectorized content.\r\nFor queries:A vectorizer defined in the index schema, assigned to a vector field, and usedautomatically at query time to convert a text query to a vector.Vector conversions are one-way: text-to-vector. There\u0027s no vector-to-text conversion forqueries or results (for example, you can\u0027t convert a vector result to a human-readablestring).The following diagram shows the components of integrated vectorization.\r\n） ImportantThis feature is in public preview under Supplemental Terms of Use. The 2023-10-01-Preview REST API supports this feature.Component diagramHere\u0027s a checklist of the components responsible for integrated vectorization:A supported data source for indexer-based indexing.An index that specifies vector fields, and a vectorizer definition assigned to vectorfields.\r\nA skillset providing a Text Split skill for data chunking, and a skill for vectorization(either the AzureOpenAiEmbedding skill or a custom skill pointing to an externalembedding model).Optionally, index projections (also defined in a skillset) to push chunked data to asecondary indexAn embedding model, deployed on Azure OpenAI or available through an HTTPendpoint.An indexer for driving the process end-to-end. An indexer also specifies aschedule, field mappings, and properties for change detection.This checklist focuses on integrated vectorization, but your solution isn\u0027t limited to thislist. You can add more skills for AI enrichment, create a knowledge store, add semanticranking, add relevance tuning, and other query features.Integrated vectorization availability is based on the embedding model. If you\u0027re usingAzure OpenAI, check regional availability.If you\u0027re using a custom skill and an Azure hosting mechanism (such as an Azurefunction app, Azure Web App, and Azure Kubernetes), check the product by regionAvailability and pricingpage for feature availability.\n"
}