{
  "Id": "1040",
  "Title": "\u0022Integrating Custom Skills into Azure Cognitive Search: Tips and Techniques\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSkills.Custom.WebApiSkill\u0022,     \u0022description\u0022: \u0022Fictitious skill that gets the most common string from an array of strings\u0022,     \u0022uri\u0022: \u0022http://names.azurewebsites.\r\nnet/api/MostCommonString\u0022,     \u0022context\u0022 : \u0022/document\u0022,     \u0022inputs\u0022: [       {         \u0022name\u0022: \u0022strings\u0022,         \u0022source\u0022: \u0022/document/people/*/lastname\u0022       }     ],     \u0022outputs\u0022: [       {         \u0022name\u0022: \u0022mostcommon\u0022,         \u0022targetName\u0022: \u0022common-lastname\u0022       }     ]   } If you\u0027re having trouble with specifying skill inputs, these tips might help you moveforward:Run the Import data wizard over your data to review the skillset definitions andfield mappings that the wizard generates.\r\nStart a debug session on a skillset to view the structure of an enriched document.You can edit the paths and other parts of the skill definition, and then run the skillto validate your changes.\r\nSkill context and input annotation languageHow to integrate a custom skill into an enrichment pipelineHow to define a skillsetCreate Skillset (REST)How to map enriched fields to an indexTips for annotation path troubleshootingSee alsoMap enriched output to fields in asearch index in Azure Cognitive SearchArticle•10/12/2022This article explains how to set up output field mappings that determine a data pathbetween in-memory data structures created during skill processing, and target fields in asearch index. An output field mapping is defined in an indexer and has the followingelements:JSONIn contrast with a fieldMappings definition that maps a path between two physical datastructures, an outputFieldMappings definition maps in-memory data to fields in a searchindex.Output field mappings are required if your indexer has an attached skillset that createsnew information, such as text translation or key phrase extraction. During indexerexecution, AI-generated information exists in memory only. To persist this information ina search index, you\u0027ll need to tell the indexer where to send the data.\n"
}