{
  "Id": "175",
  "Title": "\u0022Integrating Azure Cognitive Search with JavaScript: Deployment and Cleanup\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf the path to the Azure function code (api_location) isn\u0027t correct in the YML file,the application loads but won\u0027t call any of the functions that provide integrationwith Cognitive Search. Revisit the workaround in the deployment section for helpwith correcting the path.To clean up the resources created in this tutorial, delete the resource group.1. In Visual Studio Code, open the Activity bar, and select the Azure icon.2. In the Side bar, right-click on your Azure subscription under the Resource Groupsarea and find the resource group you created for this tutorial.3.\r\nRight-click the resource group name then select Delete. This deletes both theSearch and Static Web Apps resources.4. If you no longer want the GitHub fork of the sample, remember to delete that onGitHub. Go to your fork\u0027s Settings then delete the fork.\r\nExplore the JavaScript search codeClean up resourcesNext steps4 - Explore the JavaScript search codeArticle•09/18/2023In the previous lessons, you added search to a static web app. This lesson highlights theessential steps that establish integration. If you\u0027re looking for a cheat sheet on how tointegrate search into your JavaScript app, this article explains what you need to know.\r\nThe source code is available in the azure-search-javascript-samples GitHub repository.The Function app uses the Azure SDK for Cognitive Search:NPM: @azure/search-documentsReference Documentation: Client LibraryThe Function app authenticates through the SDK to the cloud-based Cognitive SearchAPI using your resource name, API key, and index name. The secrets are stored in thestatic web app settings and pulled in to the function as environment variables.JavaScriptThe Search API takes a search term and searches across the documents in the searchindex, returning a list of matches.Azure SDK @azure/search-documentsConfigure secrets in a configuration fileconst CONFIG = {    SearchIndexName: process.\n"
}