{
  "Id": "509",
  "Title": "\u0022Integrated Vectorization in Azure AI Search: A Preview Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf},        {          \u0022name\u0022: \u0022LanguageCode\u0022,          \u0022source\u0022: \u0022/document/Language\u0022        },        {          \u0022name\u0022: \u0022Page\u0022,          \u0022source\u0022: \u0022/document/reviews_text/pages/*\u0022        },        {          \u0022name\u0022: \u0022keyphrase\u0022,          \u0022sourceContext\u0022: \u0022/document/reviews_text/pages/*/Keyphrases/*\u0022,          \u0022inputs\u0022: [            {              \u0022name\u0022: \u0022Keyphrases\u0022,              \u0022source\u0022:\r\n\u0022/document/reviews_text/pages/*/Keyphrases/*\u0022            }          ]        }      ]    }  ],  \u0022outputs\u0022: [    {      \u0022name\u0022: \u0022output\u0022,      \u0022targetName\u0022: \u0022tableprojection\u0022    }  ]}Next stepsCreate your first skillsetIntegrated data chunking andembedding in Azure AI SearchArticle•11/15/2023Integrated vectorization adds data chunking and text-to-vector embedding to skills inindexer-based indexing.\r\nIt also adds text-to-vector conversions to queries.This capability is preview-only. In the generally available version of vector search and inprevious preview versions, data chunking and vectorization rely on external componentsfor chunking and vectors, and your application code must handle and coordinate eachstep.\r\nIn this preview, chunking and vectorization are built into indexing through skillsand indexers. You can set up a skillset that chunks data using the Text Split skill, andthen call an embedding model using either the AzureOpenAIEmbedding skill or acustom skill. Any vectorizers used during indexing can also be called on queries toconvert text to vectors. For indexing, integrated vectorization requires:An indexer retrieving data from a supported data source.A skillset that calls the Text Split skill to chunk the data, and eitherAzureOpenAIEmbedding skill or a custom skill to vectorize the data.One or more indexes to receive the chunked and vectorized content.\n"
}