{
  "Id": "512",
  "Title": "\u0022Integrated Vectorization in Azure AI Search: Best Practices and Scenarios\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor query-only vectorization:1. Add a vectorizer to an index. It should be the same embedding model used togenerate vectors in the index.７ NoteSome older search services created before January 1, 2019 are deployed oninfrastructure that doesn\u0027t support vector workloads.\r\nIf you try to add a vector fieldto a schema and get an error, it\u0027s a result of outdated services. In this situation, youmust create a new search service to try out the vector feature.What scenarios can integrated vectorizationsupport?When to use integrated vectorizationHow to use integrated vectorization2. Assign the vectorizer to the vector field.3. Formulate a vector query that specifies the text string to vectorize.A more common scenario - data chunking and vectorization during indexing:1. Create a data source connection to a supported data source for indexer-basedindexing.2.\r\nCreate a skillset that calls Text Split skill for chunking andAzureOpenAIEmbeddingModel or a custom skill to vectorize the chunks.3. Create an index that specifies a vectorizer for query time, and assign it to vectorfields.4. Create an indexer to drive everything, from data retrieval, to skillset execution,through indexing.\r\nOptionally, create secondary indexes for advanced scenarios where chunked content isin one index, and non-chunked in another index. Chunked indexes (or secondaryindexes) are useful for RAG apps.Make sure you know the Azure OpenAI quotas and limits for embedding models. AzureAI Search has retry policies, but if the quota is exhausted, retries fail. Azure OpenAI token-per-minute limits are per model, per subscription. Keep this inmind if you\u0027re using an embedding model for both query and indexing workloads. Ifpossible, follow best practices. Have an embedding model for each workload, and try todeploy them in different subscriptions.On Azure AI Search, remember there are service limits by tier and workloads.\n"
}