{
  "Id": "373",
  "Title": "\u0022JavaScript Code Samples for Azure AI Search Functionality\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfJavaScript samples for Azure AI SearchArticle•11/15/2023Learn about the JavaScript code samples that demonstrate the functionality andworkflow of an Azure AI Search solution. These samples use the Azure AI Search clientlibrary for the Azure SDK for JavaScript, which you can explore through the followinglinks.TargetLinkPackagedownloadwww.\r\nnpmjs.com/package/@azure/search-documentsAPI reference@azure/search-documentsAPI test casesgithub.com/Azure/azure-sdk-for-js/tree/main/sdk/search/search-documents/testSource codegithub.com/Azure/azure-sdk-for-js/tree/main/sdk/search/search-documentsCode samples from the Azure SDK development team demonstrate API usage.\r\nYou canfind these samples in azure-sdk-for-js/tree/main/sdk/search/search-documents/samples on GitHub.SamplesDescriptionindexesDemonstrates how to create, update, get, list, and delete searchindexes. This sample category also includes a service statisticsample.\r\ndataSourceConnections (forindexers)Demonstrates how to create, update, get, list, and delete indexerdata sources, required for indexer-based indexing of supportedAzure data sources.indexersDemonstrates how to create, update, get, list, reset, and deleteindexers.skillSetDemonstrates how to create, update, get, list, and delete skillsetsthat are attached indexers, and that perform AI-basedenrichment during indexing.\r\nSDK samplesJavaScript SDK samplesSamplesDescriptionsynonymMapsDemonstrates how to create, update, get, list, and deletesynonym maps.VectorSearchDemonstrates how to generate vectors and send a vector query.SamplesDescriptionindexesDemonstrates how to create, update, get, list, and delete searchindexes. This sample category also includes a service statisticsample.dataSourceConnections (forindexers)Demonstrates how to create, update, get, list, and delete indexerdata sources, required for indexer-based indexing of supportedAzure data sources.indexersDemonstrates how to create, update, get, list, reset, and deleteindexers.\n"
}