{
  "Id": "1520",
  "Title": "\u0022Java Client Library for Azure Cognitive Search: Usage Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThere\u0027salso a throwOnAnyError option, and you can set it to false to get a successful responsewith an IndexDocumentsResult for inspection.The examples so far have been using synchronous APIs, but we provide full support forasync APIs as well. You\u0027ll need to use SearchAsyncClient.Java// Create an indexSEARCH_INDEX_CLIENT.\r\ncreateIndex(index);Retrieving a specific document from your indexHotel hotel = SEARCH_CLIENT.getDocument(\u00221\u0022, Hotel.class);System.out.printf(\u0022This is hotelId %s, and this is hotel name %s.%n\u0022, hotel.getId(), hotel.getName());Adding documents to your indexIndexDocumentsBatch\u003CHotel\u003E batch = new IndexDocumentsBatch\u003C\u003E();batch.addUploadActions(Collections.singletonList(new Hotel().\r\nsetId(\u0022783\u0022).setName(\u0022Upload Inn\u0022)));batch.addMergeActions(Collections.singletonList(new Hotel().setId(\u002212\u0022).setName(\u0022Renovated Ranch\u0022)));SEARCH_CLIENT.indexDocuments(batch);Async APIsTo authenticate in a National Cloud, you will need to make the following additions toyour client configuration:Set the AuthorityHost in the credential options or via the AZURE_AUTHORITY_HOSTenvironment variableSet the audience in SearchClientBuilder, SearchIndexClientBuilder, orSearchIndexerClientBuilderJavaSee our troubleshooting guide for details on how to diagnose various failurescenarios.\r\nWhen you interact with Azure Cognitive Search using this Java client library, errorsreturned by the service correspond to the same HTTP status codes returned for RESTAPI requests. For example, the service will return a 404 error if you try to retrieve adocument that doesn\u0027t exist in your index.SEARCH_ASYNC_CLIENT.search(\u0022luxury\u0022)    .subscribe(result -\u003E {        Hotel hotel = result. getDocument(Hotel.class);        System.out.printf(\u0022This is hotelId %s, and this is hotel name %s.%n\u0022, hotel.getId(), hotel.getName());    });Authenticate in a National Cloud// Create a SearchClient that will authenticate through AAD in the China national cloud.SearchClient searchClient = new SearchClientBuilder()    .endpoint(ENDPOINT)    .indexName(INDEX_NAME)    .\n"
}