{
  "Id": "1758",
  "Title": "\u0022JSON Output Structure for Web API with Enrichments\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfJSON{     \u0022values\u0022: [       {         \u0022recordId\u0022: \u00220\u0022,         \u0022data\u0022:            {              \u0022text\u0022: \u0022Este es un contrato en Inglés\u0022,              \u0022language\u0022: \u0022es\u0022,              \u0022phraseList\u0022: [\u0022Este\u0022, \u0022Inglés\u0022]            }       },       {         \u0022recordId\u0022: \u00221\u0022,         \u0022data\u0022:            {              \u0022text\u0022: \u0022Hello world\u0022,              \u0022language\u0022: \u0022en\u0022,              \u0022phraseList\u0022: [\u0022Hi\u0022]            }       },       {         \u0022recordId\u0022:\r\n\u00222\u0022,         \u0022data\u0022:            {              \u0022text\u0022: \u0022Hello world, Hi world\u0022,              \u0022language\u0022: \u0022en\u0022,              \u0022phraseList\u0022: [\u0022world\u0022]            }       },       {         \u0022recordId\u0022: \u00223\u0022,         \u0022data\u0022:            {              \u0022text\u0022: \u0022Test\u0022,              \u0022language\u0022: \u0022es\u0022,              \u0022phraseList\u0022: []            }       }     ] } Sample output JSON structureThe \u0022output\u0022 corresponds to the response returned from your Web API.\r\nThe Web APIshould only return a JSON payload (verified by looking at the Content-Type responseheader) and should satisfy the following constraints:There should be a top-level entity called values which should be an array ofobjects.The number of objects in the array should be the same as the number of objectssent to the Web API.Each object should have:A recordId property.\r\nA data property, which is an object where the fields are enrichments matchingthe \u0022names\u0022 in the output and whose value is considered the enrichment.An errors property, an array listing any errors encountered that will be addedto the indexer execution history. This property is required, but can have a nullvalue.A warnings property, an array listing any warnings encountered that will beadded to the indexer execution history. This property is required, but can have anull value.The ordering of objects in the values in either the request or response isn\u0027timportant. However, the recordId is used for correlation so any record in theresponse containing a recordId which was not part of the original request to theWeb API will be discarded.\n"
}