{
  "Id": "1705",
  "Title": "\u0022Key Phrase Extraction in Azure Search: Usage and Parameters\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis capability is useful if you need to quickly identify the main talking points in therecord. For example, given input text \u0022The food was delicious and there were wonderfulstaff\u0022, the service returns \u0022food\u0022 and \u0022wonderful staff\u0022.Microsoft.Skills.Text.KeyPhraseExtractionSkillThe maximum size of a record should be 50,000 characters as measured byString.Length.\r\nIf you need to break up your data before sending it to the key phraseextractor, consider using the Text Split skill. If you do use a text split skill, set the pagelength to 5000 for the best performance.Parameters are case-sensitive.InputsDescriptiondefaultLanguageCode(Optional) The language code to apply to documents that don\u0027t specifylanguage explicitly.\r\nIf the default language code isn\u0027t specified, English(en) is used as the default language code.See the full list of supported languages.maxKeyPhraseCount(Optional) The maximum number of key phrases to produce.７ NoteThis skill is bound to Azure AI services and requires a billable resource fortransactions that exceed 20 documents per indexer per day.\r\nExecution of built-inskills is charged at the existing Azure AI services pay-as-you go price.@odata.typeData limitsSkill parametersInputsDescriptionmodelVersion(Optional) Specifies the version of the model to use when calling the keyphrase API. It defaults to the latest available when not specified. Werecommend you don\u0027t specify this value unless it\u0027s necessary.InputDescriptiontextThe text to be analyzed.languageCodeA string indicating the language of the records. If this parameter isn\u0027t specified,the default language code is used to analyze the records.See the full list of supported languages.OutputDescriptionkeyPhrasesA list of key phrases extracted from the input text. The key phrases are returned inorder of importance.Consider a SQL record that has the following fields:JSONThen your skill definition might look like this:JSONSkill inputsSkill outputsSample definition{    \u0022content\u0022: \u0022Glaciers are huge rivers of ice that ooze their way over land, powered by gravity and their own sheer weight.\n"
}