{
  "Id": "1223",
  "Title": "\u0022Lambda Expressions and Filter Rules in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis structure of Boolean expressions is calledDisjunctive Normal Form (DNF), otherwise known as \u0022ORs of ANDs\u0022. Conversely,lambda expressions for all for these data types must be in Conjunctive Normal Form(CNF), otherwise known as \u0022ANDs of ORs\u0022. Azure AI Search allows such rangecomparisons because it can execute them using inverted indexes efficiently, just like itcan do fast term lookup for strings.\r\nIn summary, here are the rules of thumb for what\u0027s allowed in a lambda expression:Inside any, positive checks are always allowed, like equality, range comparisons,geo.intersects, or geo.distance compared with lt or le (think of \u0022closeness\u0022 asbeing like equality when it comes to checking distance).Inside any, or is always allowed. You can use and only for data types that canexpress range checks, and only if you use ORs of ANDs (DNF).\r\nInside all, the rules are reversed -- only negative checks are allowed, you can useand always, and you can use or only for range checks expressed as ANDs of ORs(CNF).In practice, these are the types of filters you\u0027re most likely to use anyway. It\u0027s still helpfulto understand the boundaries of what\u0027s possible though.For specific examples of which kinds of filters are allowed and which aren\u0027t, see How towrite valid collection filters.\r\nTroubleshooting OData collection filters in Azure AI SearchFilters in Azure AI SearchOData expression language overview for Azure AI SearchOData expression syntax reference for Azure AI SearchSearch Documents (Azure AI Search REST API)Next stepsTroubleshooting OData collection filtersin Azure AI SearchArticle•11/15/2023To filter on collection fields in Azure AI Search, you can use the any and all operatorstogether with lambda expressions. A lambda expression is a sub-filter that is applied toeach element of a collection.Not every feature of filter expressions is available inside a lambda expression. Whichfeatures are available differs depending on the data type of the collection field that youwant to filter. This can result in an error if you try to use a feature in a lambda expressionthat isn\u0027t supported in that context. If you\u0027re encountering such errors while trying towrite a complex filter over collection fields, this article will help you troubleshoot theproblem.\n"
}