{
  "Id": "1708",
  "Title": "\u0022Language Detection Skill: Parameters, Inputs, and Outputs Explained\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you need to break up your data before sending it to the languagedetection skill, you can use the Text Split skill.Parameters are case-sensitive.InputsDescriptiondefaultCountryHint(Optional) An ISO 3166-1 alpha-2 two letter country code can be providedto use as a hint to the language detection model if it can\u0027t disambiguate７ NoteThis skill is bound to Azure AI services and requires a billable resource fortransactions that exceed 20 documents per indexer per day.\r\nExecution of built-inskills is charged at the existing Azure AI services pay-as-you go price.@odata.typeData limitsSkill parametersInputsDescriptionthe language.\r\nSpecifically, the defaultCountryHint parameter is used withdocuments that don\u0027t specify the countryHint input explicitly.modelVersion(Optional) Specifies the version of the model to use when calling languagedetection. It defaults to the latest available when not specified. Werecommend you don\u0027t specify this value unless it\u0027s necessary.Parameters are case-sensitive.InputsDescriptiontextThe text to be analyzed.\r\ncountryHintAn ISO 3166-1 alpha-2 two letter country code to use as a hint to the languagedetection model if it can\u0027t disambiguate the language.OutputNameDescriptionlanguageCodeThe ISO 6391 language code for the language identified. For example, \u0022en\u0022.languageNameThe name of language. For example, \u0022English\u0022.scoreA value between 0 and 1. The likelihood that language is correctly identified.\r\nThescore can be lower than 1 if the sentence has mixed languages.JSONSkill inputsSkill outputsSample definition {    \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Text. LanguageDetectionSkill\u0022,    \u0022inputs\u0022: [      {        \u0022name\u0022: \u0022text\u0022,        \u0022source\u0022: \u0022/document/text\u0022      },      {        \u0022name\u0022: \u0022countryHint\u0022,        \u0022source\u0022: \u0022/document/countryHint\u0022JSON      }    ],    \u0022outputs\u0022: [      {        \u0022name\u0022: \u0022languageCode\u0022,        \u0022targetName\u0022: \u0022myLanguageCode\u0022      },      {        \u0022name\u0022:\n"
}