{
  "Id": "1707",
  "Title": "\u0022Language Detection and Key Phrase Extraction in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022myKeyPhrases\u0022      }    ]  }Sample outputdocument/myKeyPhrases[  \u0022world’s glaciers\u0022,   \u0022huge rivers of ice\u0022,   \u0022Canadian Rockies\u0022,   \u0022iconic landscapes\u0022,  \u0022Mount Everest region\u0022,  \u0022Continued warming\u0022]WarningsIf you provide an unsupported language code, a warning is generated and key phrasesaren\u0027t extracted.\r\nIf your text is empty, a warning is produced. If your text is larger than50,000 characters, only the first 50,000 characters are analyzed and a warning is issued.Built-in skillsHow to define a skillsetHow to define output fields mappingsSee alsoLanguage detection cognitive skillArticle•11/15/2023The Language Detection skill detects the language of input text and reports a singlelanguage code for every document submitted on the request.\r\nThe language code ispaired with a score indicating the strength of the analysis. This skill uses the machinelearning models provided in Azure AI Language.This capability is especially useful when you need to provide the language of the text asinput to other skills (for example, the Sentiment Analysis skill or Text Split skill).See supported languages for Language Detection. If you have content expressed in anunsupported language, the response is (Unknown).Microsoft.Skills.Text.LanguageDetectionSkillThe maximum size of a record should be 50,000 characters as measured byString.Length. If you need to break up your data before sending it to the languagedetection skill, you can use the Text Split skill.Parameters are case-sensitive.InputsDescriptiondefaultCountryHint(Optional) An ISO 3166-1 alpha-2 two letter country code can be providedto use as a hint to the language detection model if it can\u0027t disambiguate７ NoteThis skill is bound to Azure AI services and requires a billable resource fortransactions that exceed 20 documents per indexer per day.\n"
}