{
  "Id": "735",
  "Title": "\u0022Language Analysis and Field Constraints in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe \u0022analyzer\u0022 property on a field definition is used to set the language analyzer. It willbe used for both indexing and query execution.JSON TipText translation is built into the Import data wizard. If you have a supported datasource with text you\u0027d like to translate, you can step through the wizard to try outthe language detection and translation functionality before writing any code.Define fields for content in different languagesAn intermediate step is building and populating the index before formulating a query.We mention this step here for completeness. One way to determine index availability isby checking the indexes list in the portal.\r\nParameters on the query are used to limit search to specific fields and then trim theresults of any fields not helpful to your scenario.ParametersPurposesearchFieldsLimits full text search to the list of named fields.$selectTrims the response to include only the fields you specify. By default, all retrievablefields are returned.\r\nThe $select parameter lets you choose which ones to return.Given a goal of constraining search to fields containing French strings, you would usesearchFields to target the query at fields containing strings in that language.Specifying the analyzer on a query request isn\u0027t necessary. A language analyzer on thefield definition will always be used during query processing.\r\nFor queries that specifymultiple fields invoking different language analyzers, the terms or phrases will beprocessed independently by the assigned analyzers for each field.{  \u0022name\u0022: \u0022hotels-sample-index\u0022,  \u0022fields\u0022: [    {      \u0022name\u0022: \u0022Description\u0022,      \u0022type\u0022: \u0022Edm.String\u0022,      \u0022retrievable\u0022: true,      \u0022searchable\u0022: true,      \u0022analyzer\u0022: \u0022en. microsoft\u0022    },    {      \u0022name\u0022: \u0022Description_fr\u0022,      \u0022type\u0022: \u0022Edm.String\u0022,      \u0022retrievable\u0022: true,      \u0022searchable\u0022: true,      \u0022analyzer\u0022: \u0022fr.microsoft\u0022    },Build and load an indexConstrain the query and trim resultsBy default, a search returns all fields that are marked as retrievable.\n"
}