{
  "Id": "1195",
  "Title": "\u0022Language Considerations for Semantic Ranking in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHTTPValid values for queryLanguage can be found in the following table, copied from the listof supported languages (REST API reference).LanguagequeryLanguageEnglish [EN]EN, EN-US (default)Spanish [ES]ES, ES-ES (default)French [FR]FR, FR-FR (default)German [DE]DE, DE-DE (default)Dutch [NL]NL, NL-BE, NL-NL (default)Spell correction with semantic rankingPOST https://[service name].search.windows.\r\nnet/indexes/hotels-sample-index/docs/search?\r\napi-version=2020-06-30-Preview     {    \u0022search\u0022: \u0022hisotoric hotell wiht great restrant nad wiifi\u0022,    \u0022queryType\u0022: \u0022semantic\u0022,    \u0022speller\u0022: \u0022lexicon\u0022,    \u0022queryLanguage\u0022: \u0022en-us\u0022,    \u0022searchFields\u0022: \u0022HotelName,Tags,Description\u0022,    \u0022select\u0022: \u0022HotelId,HotelName,Description,Category,Tags\u0022,    \u0022count\u0022: true}Supported languages７ NotePreviously, while semantic ranking was in public preview, the queryLanguageparameter was also used for semantic ranking.\r\nSemantic ranking is now language-agnostic.Language analyzer considerationsIndexes that contain non-English content often use language analyzers on non-Englishfields to apply the linguistic rules of the native language.\r\nWhen adding spell check to content that also undergoes language analysis, you canachieve better results using the same language for each indexing and query processingstep. For example, if a field\u0027s content was indexed using the \u0022fr.microsoft\u0022 languageanalyzer, then queries and spell check should all use a French lexicon or language libraryof some form. To recap how language libraries are used in Azure AI Search:Language analyzers can be invoked during indexing and query execution, and areeither Apache Lucene (for example, \u0022de.lucene\u0022) or Microsoft (\u0022de.microsoft).Language lexicons invoked during spell check are specified using one of thelanguage codes in the supported language table.\n"
}