{
  "Id": "465",
  "Title": "\u0022Limitations and Workflow of Azure AI Search Import Data Wizard\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAI enrichment, as exposed in the portal, is limited to a subset of built-in skills.A knowledge store, which can be created by the wizard, is limited to a few defaultprojections and uses a default naming convention. If you want to customize namesor projections, you\u0027ll need to create the knowledge store through REST API or theSDKs.\r\nPublic access to all networks must be enabled on the supported data source whilethe wizard is used, since the portal won\u0027t be able to access the data source duringsetup if public access is disabled. This means that if your data source has a firewallenabled or you have set a shared private link, you must disable them, run theImport Data wizard and then enable it after wizard setup is completed.\r\nIf this isn\u0027tan option, you can create Azure AI Search data source, indexer, skillset and indexthrough REST API or the SDKs.The wizard is organized into four main steps:1. Connect to a supported Azure data source.2. Create an index schema, inferred by sampling source data.3. Optionally, add AI enrichments to extract or generate content and structure. Inputsfor creating a knowledge store are collected in this step.4. Run the wizard to create objects, load data, set a schedule and other configurationoptions.The workflow is a pipeline, so it\u0027s one way.\r\nYou can\u0027t use the wizard to edit any of theobjects that were created, but you can use other portal tools, such as the index orindexer designer or the JSON editors, for allowed updates.WorkflowThe Import data wizard connects to an external supported data source using theinternal logic provided by Azure AI Search indexers, which are equipped to sample thesource, read metadata, crack documents to read content and structure, and serializecontents as JSON for subsequent import to Azure AI Search. You can paste in a connection to a supported data source in a different subscription orregion, but the Choose an existing connection picker is scoped to the activesubscription.Not all preview data sources are guaranteed to be available in the wizard.\n"
}