{
  "Id": "132",
  "Title": "\u0022Managing Azure Resources with Terraform: Configuration and Execution\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfsku)    error_message = \u0022The sku must be one of the following values: free, basic, standard, standard2, standard3, storage_optimized_l1, storage_optimized_l2.\u0022  }}variable \u0022replica_count\u0022 {  type        = number  description = \u0022Replicas distribute search workloads across the service. You need at least two replicas to support high availability of query workloads (not applicable to the free tier).\r\n\u0022  default     = 1  validation {    condition     = var.replica_count \u003E= 1 \u0026\u0026 var.replica_count \u003C= 12    error_message = \u0022The replica_count must be between 1 and 12.\u0022  }}Run terraform init to initialize the Terraform deployment. This command downloadsthe Azure provider required to manage your Azure resources.\r\nConsoleKey points:The -upgrade parameter upgrades the necessary provider plugins to the newestversion that complies with the configuration\u0027s version constraints.Run terraform plan to create an execution plan.ConsoleKey points:The terraform plan command creates an execution plan, but doesn\u0027t execute it.Instead, it determines what actions are necessary to create the configurationspecified in your configuration files. This pattern allows you to verify whether theexecution plan matches your expectations before making any changes to actualresources.The optional -out parameter allows you to specify an output file for the plan.\r\nUsing the -out parameter ensures that the plan you reviewed is exactly what isvariable \u0022partition_count\u0022 {  type        = number  description = \u0022Partitions allow for scaling of document count as well as faster indexing by sharding your index over multiple search units.\u0022  default     = 1  validation {    condition     = contains([1, 2, 3, 4, 6, 12], var. partition_count)    error_message = \u0022The partition_count must be one of the following values: 1, 2, 3, 4, 6, 12.\u0022  }}Initialize Terraformterraform init -upgradeCreate a Terraform execution planterraform plan -out main.tfplanapplied.To read more about persisting execution plans and security, see the securitywarning section.\n"
}