{
  "Id": "1392",
  "Title": "\u0022Managing Azure Cognitive Search: Configuration, Disabling Features, and Next Steps\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearch/searchServices/{{search-service-name}}?api-version=2021-04-01-preview { Although semantic search isn\u0027t enabled by default, you could lock down the feature atthe service level.HTTPAzure Cognitive Search writes to external data sources when updating a knowledgestore, saving debug session state, or caching enrichments.\r\nThe following exampledisables these workloads at the service level.HTTP  \u0022properties\u0022: {     \u0022encryptionWithCmk\u0022: {       \u0022enforcement\u0022: \u0022Enabled\u0022,       \u0022encryptionComplianceStatus\u0022: \u0022Compliant\u0022     },   } } (preview) Disable semantic searchPATCH https://management.azure.com/subscriptions/{{subscriptionId}}/resourcegroups/{{resource-group}}/providers/Microsoft.\r\nSearch/searchServices/{{search-service-name}}?api-version=2021-04-01-Preview {   \u0022properties\u0022: {     \u0022semanticSearch\u0022: \u0022disabled\u0022   } } (preview) Disable workloads that push data toexternal resourcesPATCH https://management.azure.com/subscriptions/{{subscriptionId}}/resourcegroups/{{resource-group}}/providers/Microsoft.\r\nSearch/searchServices/{{search-service-name}}?api-version=2021-04-01-preview {   \u0022properties\u0022: {     \u0022disabledDataExfiltrationOptions\u0022: [       \u0022All\u0022     ]   } } After a search service is configured, next steps include create an index or query an indexusing the portal, REST APIs, or the .NET SDK.\r\nCreate an Azure Cognitive Search index in the Azure portalSet up an indexer to load data from other servicesQuery an Azure Cognitive Search index using Search explorer in the Azure portalHow to use Azure Cognitive Search in .NETNext stepsMove your Azure Cognitive Searchservice to another Azure regionArticle•07/18/2023Occasionally, customers ask about moving a search service to another region. Currently,there is no built-in mechanism or tooling to help with that task, but this article can helpyou understand the manual steps for recreating indexes and other objects on a newsearch service in a different region.Ensure that the services and features that your account uses are supported in thetarget region.\n"
}