{
  "Id": "802",
  "Title": "\u0022Managing Document Processing in Azure Search: Best Practices and APIs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRemember to follow up with Run Indexer to invoke actual processing.The Reset Documents API accepts a list of document keys so that you can refreshspecific documents. If specified, the reset parameters become the sole determinant ofwhat gets processed, regardless of other changes in the underlying data. For example, if20 blobs were added or updated since the last indexer run, but you only reset onedocument, only that document is processed.On a per-document basis, all fields in that search document are refreshed with valuesfrom the data source. You can\u0027t pick and choose which fields to refresh.\r\nIf the document is enriched through a skillset and has cached data, the skillset isinvoked for just the specified documents, and the cache is updated for the reprocesseddocuments.When you\u0027re testing this API for the first time, the following APIs can help you validateand test the behaviors:1.\r\nCall Get Indexer Status with API version api-version=2020-06-30-Preview or later,to check reset status and execution status. You can find information about thePOST /skillsets/[skillset name]/resetskills?api-version=2020-06-30-Preview {     \u0022skillNames\u0022 : [         \u0022#1\u0022,         \u0022#5\u0022,         \u0022#6\u0022     ] } How to reset docs (preview)reset request at the end of the status response.2.\r\nCall Reset Documents with API version api-version=2020-06-30-Preview or later, tospecify which documents to process.HTTPThe document keys provided in the request are values from the search index,which can be different from the corresponding fields in the data source. Ifyou\u0027re unsure of the key value, send a query to return the value.You can useselect to return just the document key field. For blobs that are parsed into multiple search documents (whereparsingMode is set to jsonLines or jsonArrays, or delimitedText), thedocument key is generated by the indexer and might be unknown to you. Inthis scenario, a query for the document key to return the correct value.3. Call Run Indexer (any API version) to process the documents you specified.\n"
}