{
  "Id": "608",
  "Title": "\u0022Managing Azure Search: Replicas, Partitions, and Scaling Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor more information on how additional replicas impactquery processing, see Ordering results.Add or reduce replicas and partitions2. Under Settings, open the Scale page to modify replicas and partitions.The following screenshot shows a Basic Standard provisioned with one replica andpartition. The formula at the bottom indicates how many search units are beingused (1).\r\nIf the unit price was $100 (not a real price), the monthly cost of runningthis service would be $100 on average.3. Use the slider to increase or decrease the number of partitions. Select Save.This example adds a second replica and partition. Notice the search unit count; it\u0027snow four because the billing formula is replicas multiplied by partitions (2 x 2).\r\nDoubling capacity more than doubles the cost of running the service. If the searchunit cost was $100, the new monthly bill would now be $400.For the current per unit costs of each tier, visit the Pricing page.4. After saving, you can check notifications to confirm the action succeeded.Changes in capacity can take anywhere from 15 minutes up to several hours tocomplete.\r\nYou can\u0027t cancel once the process has started and there\u0027s no real-timemonitoring for replica and partition adjustments. However, the following messageremains visible while changes are underway.Upon receipt of a scale request, the search service:1. Checks whether the request is valid.2.\r\nStarts backing up data and system information.3. Checks whether the service is already in a provisioning state (currently adding oreliminating either replicas or partitions).4. Starts provisioning.Scaling a service can take as little as 15 minutes or well over an hour, depending on thesize of the service and the scope of the request. Backup can take several minutes,depending on the amount of data and number of partitions and replicas.７ NoteAfter a service is provisioned, it cannot be upgraded to a higher tier. You mustcreate a search service at the new tier and reload your indexes. See Create anAzure Cognitive Search service in the portal for help with service provisioning.\n"
}