{
  "Id": "21",
  "Title": "\u0022Managing and Integrating Azure AI Search Services: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can also write code that builds andrefreshes an index, or runs indexers programmatically or by script.Not always. The REST API is always the first to implement new features in preview APIversions, and the generally available versions support all programmatic operations. Theclient libraries in Azure SDKs will pick up new features over time, but are released ontheir own schedule.\r\nAlthough the REST APIs are first out with newest features, the Azure SDKs provide morecoding support, and are recommended over REST unless a required feature isunavailable.You can\u0027t pause a search service. In Azure AI Search, computing resources are allocatedwhen the service is created.\r\nIt\u0027s not possible to release and reclaim those resources on-demand.Service tier, name, and region are fixed for the lifetime of the service.As long as you follow the checklist before moving resources and make sure each step iscompleted, there shouldn\u0027t be any downtime.\r\nHow do I integrate search into my solution?Is there functional parity across the various APIs?Can I pause the service and stop billing?Can I upgrade, downgrade, rename or move theservice?If I migrate my search service to anothersubscription or resource group, should I expectany downtime?IndexingWhat does \u0022indexing\u0022 mean in Azure AI Search?It refers to the ingestion, parsing, and storing of textual content and tokens thatpopulate a search index. Indexing creates inverted indexes and other physical datastructures that support information retrieval.There\u0027s no native support for index management. Search indexes are considereddownstream data structures, accepting content from other data sources that collectoperational data. As such, there\u0027s no built-in support for backing up and restoringindexes because the expectation is that you would rebuild an index from source data ifyou deleted it, or wanted to move it.However, if you want to move an index between search services, you can try the index-backup-restore sample code in this Azure AI Search .NET sample repo.\n"
}