{
  "Id": "1409",
  "Title": "\u0022Managing Access Control in Azure Cognitive Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzureCognitive Search has various built-in roles. You can also create a custom role.It\u0027s a best practice to grant minimum permissions. If your application only needs tohandle queries, you should assign the Search Index Data Reader role. Alternatively, if itneeds both read and write access on a search index, you should use the Search IndexData Contributor role.\r\n1. Sign in to the Azure portal.2. Navigate to your search service.3. Select Access control (IAM) in the left navigation pane.4. Select \u002B Add \u003E Add role assignment.Assign a role to the managed identity5. Select an applicable role:OwnerContributorReaderSearch Service ContributorSearch Index Data ContributorSearch Index Data ReaderFor more information on the available roles, see Built-in roles used in Search.6. On the Members tab, select the managed identity that you want to give access toyour search service.7. On the Review \u002B assign tab, select Review \u002B assign to assign the role.\r\nYou can assign multiple roles, such as Search Service Contributor and Search Index DataContributor, if your application needs comprehensive access to the search services,objects, and content.You can also assign roles using PowerShell.７ NoteThe Owner, Contributor, Reader, and Search Service Contributor roles don\u0027tgive you access to the data within a search index, so you can\u0027t query a searchindex or index data using those roles.\r\nFor data access to a search index, youneed either the Search Index Data Contributor or Search Index Data Readerrole.Once you have a managed identity and a role assignment on the search service, you\u0027reready to add code to your application to authenticate the security principal and acquirean OAuth 2. 0 token.Use the following client libraries for role-based access control:azure.search.documents (Azure SDK for .NET) version 11.4azure-search-documents (Azure SDK for Java) version 11.5.6azure/search-documents (Azure SDK for JavaScript) version 11.3.1azure.search.documents (Azure SDK for Python) version 11.3The following instructions reference an existing C# sample to demonstrate the codechanges.\n"
}