{
  "Id": "797",
  "Title": "\u0022Managing Indexer Execution and High Water Marks in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe marker is never exposed in the API, but internally theindexer keeps track of where it stopped. When indexing resumes, either through ascheduled run or an on-demand invocation, the indexer references the high water markso that it can pick up where it left off.\r\nIf you need to clear the high water mark to reindex in full, you can use Reset Indexer. Formore selective reindexing, use Reset Skills or Reset Documents. Through the reset APIs,you can clear internal state, and also flush the cache if you enabled incrementalenrichment. For more background and comparison of each reset option, see Run orreset indexers, skills, and documents.\r\nIndex data from Azure Blob StorageIndex data from Azure SQL databaseIndex data from Azure Data Lake Storage Gen2Index data from Azure Table StorageIndex data from Azure Cosmos DBNext stepsRun or reset indexers, skills, ordocumentsArticle•12/08/2022In Azure Cognitive Search, there are several ways to run an indexer:Run when creating or updating an indexer, assuming it\u0027s not created in \u0022disabled\u0022mode.\r\nRun on a schedule to invoke execution at regular intervals.Run on demand, with or without a \u0022reset\u0022.This article explains how to run indexers on demand, with and without a reset. It alsodescribes indexer execution, duration, and concurrency.You can run multiple indexers at one time, but each indexer itself is single-instance.Starting a new instance while the indexer is already in execution produces this error:\u0022Failed to run indexer \u0022\u003Cindexer name\u003E\u0022 error: \u0022Another indexer invocation iscurrently in progress; concurrent invocations are not allowed.\u0022An indexer job runs in a managed execution environment. Currently, there are twoenvironments. You can\u0027t control or configure which environment is used. AzureCognitive Search determines the environment based on job composition and the abilityof the service to move an indexer job onto a content processor (some security featuresblock the multi-tenant environment).Indexer execution environments include:A private execution environment that runs on search nodes, specific to your searchservice.A multi-tenant environment with content processors, managed and secured byMicrosoft at no extra cost. This environment is used to offload computationallyintensive processing, leaving service-specific resources available for routineoperations.\n"
}