{
  "Id": "633",
  "Title": "\u0022Managing Azure Search Service API Versions and SDKs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSometimes, but not always, theseupdates require a new version of the API to preserve backward compatibility. Publishinga new version allows you to control when and how you integrate search service updatesin your code.As a rule, the REST APIs and libraries are versioned only when necessary, since it caninvolve some effort to upgrade your code to use a new API version.\r\nA new version isneeded only if some aspect of the API has changed in a way that breaks backwardcompatibility. Such changes can happen because of fixes to existing features, or becauseof new features that change existing API surface area.See Azure SDK lifecycle and support policy for more information about thedeprecation path.\r\nSome API versions are discontinued and will be rejected by a search service:2015-02-282015-02-28-Preview2014-07-31-Preview2014-10-20-PreviewAll SDKs are based on REST API versions. If a REST version is discontinued, any SDKthat\u0027s based on it is also discontinued. All Azure AI Search .NET SDKs older than 3.0.0-rcare now discontinued.\r\nSupport for the above-listed versions was discontinued on October 15, 2020. If you havecode that uses a discontinued version, you can migrate existing code to a newer RESTAPI version or to a newer Azure SDK.REST APILinkSearch Service (data plane)See API versions in REST API referenceManagement (control plane)See API versions in REST API referenceUnsupported versionsREST APIsThe following table provides links to more recent SDK versions.\r\nSDK versionStatusDescriptionAzure.Search.Documents 11ActiveNew client library from the Azure .NET SDKteam, initially released July 2020. See theChange Log for information about minorreleases.Microsoft.Azure.Search 10RetiredReleased May 2019. This is the last version ofthe Microsoft.Azure.Search package and it\u0027snow deprecated. It\u0027s succeeded byAzure.Search.Documents.Microsoft.Azure.Management.Search4.0.0ActiveTargets the Management REST api-version=2020-08-01.Microsoft.Azure.Management.Search3.0.0RetiredTargets the Management REST api-version=2015-08-19.\n"
}