{
  "Id": "1003",
  "Title": "\u0022Managing Client Secrets and Data Sources in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSelect Certificates \u0026 Secrets from the menu on the left, then Client secrets, then New client secret.In the menu that pops up, enter a description for the new client secret. Adjust the expiration date if necessary. If the secretexpires, it needs to be recreated and the indexer needs to be updated with the new secret.\r\nThe new client secret appears in the secret list. Once you navigate away from the page, the secret is no longer be visible, so copyit using the copy button and save it in a secure location.A data source specifies which data to index, credentials, and policies to efficiently identify changes in the data (new, modified, or deletedrows).\r\nA data source can be used by multiple indexers in the same search service.For SharePoint indexing, the data source must have the following required properties:Step 4: Create data source） ImportantStarting in this section, use the preview REST API for the remaining steps. We recommend the latest preview API, 2023-10-01-preview.\r\nIf you’re not familiar with the Azure AI Search REST API, we suggest taking a look at this Quickstart.name is the unique name of the data source within your search service.type must be \u0022sharepoint\u0022. This value is case-sensitive.credentials provide the SharePoint endpoint and the Microsoft Entra application (client) ID.\r\nAn example SharePoint endpoint ishttps://microsoft.sharepoint.com/teams/MySharePointSite. You can get the endpoint by navigating to the home page of yourSharePoint site and copying the URL from the browser.container specifies which document library to index. Properties control which documents are indexed.To create a data source, call Create Data Source (preview). HTTPThe format of the connection string changes based on whether the indexer is using delegated API permissions or application APIpermissionsDelegated API permissions connection string formatSharePointOnlineEndpoint=[SharePoint site url];ApplicationId=[Azure AD App ID];TenantId=[SharePoint site tenant id]Application API permissions connection string formatSharePointOnlineEndpoint=[SharePoint site url];ApplicationId=[Azure AD App ID];ApplicationSecret=[Azure AD App clientsecret];TenantId=[SharePoint site tenant id]The index specifies the fields in a document, attributes, and other constructs that shape the search experience.\n"
}