{
  "Id": "1379",
  "Title": "\u0022Managing Azure Search Services: Configuration and Security Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearch/searchServices\u0022}az search service delete removes the service and its data.Azure CLIDepending on your security requirements, you may want to create a search service withan IP firewall configured. To do so, pass the Public IP (v4) addresses or CIDR ranges tothe ip-rules argument as shown below. Rules should be separated by a comma (,) orsemicolon (;).Azure CLIIn some cases, such as when using managed identity to connect to a data source, youwill need to turn on system assigned managed identity. This is done by adding --identity-type SystemAssigned to the command.\r\nAzure CLIaz search service delete --name \u003Cservice-name\u003E \\                         --resource-group  \u003Csearch-service-resource-group-name\u003E \\Create a service with IP rulesaz search service create \\    --name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --sku Standard \\    --partition-count 1 \\    --replica-count 1 \\    --ip-rules \u002255.5.63.73;52.228.215.197;101.37.221.\r\n205\u0022Create a service with a system assigned managed identityaz search service create \\    --name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --sku Standard \\    --partition-count 1 \\    --replica-count 1 \\    --identity-type SystemAssignedCreate a service with a private endpointPrivate Endpoints for Azure AI Search allow a client on a virtual network to securelyaccess data in a search index over a Private Link. The private endpoint uses an IP addressfrom the virtual network address space for your search service. Network traffic betweenthe client and the search service traverses over the virtual network and a private link onthe Microsoft backbone network, eliminating exposure from the public internet. Formore details, please refer to the documentation on creating a private endpoint for AzureAI SearchThe following example shows how to create a search service with a private endpoint.\nFirst, deploy a search service with PublicNetworkAccess set to Disabled.Azure CLINext, create a virtual network and the private endpoint.\n"
}