{
  "Id": "1395",
  "Title": "\u0022Managing API Keys and Authentication in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDeleting theservice automatically deletes all content associated with the service.The following links can help you locate more information when completing the stepsoutlined above.Azure Cognitive Search pricing and regionsChoose a tierCreate a search serviceLoad search documentsEnable loggingDiscard or clean upNext stepsConnect to Cognitive Search using keyauthenticationArticle•05/14/2023Cognitive Search offers key-based authentication that you can use on connections toyour search service. An API key is a unique string composed of 52 randomly generatednumbers and letters. A request made to a search service endpoint will be accepted ifboth the request and the API key are valid.\r\nThere are two kinds of keys used for authenticating a request:TypePermission levelMaximumHow createdAdminFull access (read-write)for all contentoperations2 Two admin keys, referred to as primary andsecondary keys in the portal, are generatedwhen the service is created and can beindividually regenerated on demand.\r\nQueryRead-only access,scoped to thedocuments collection ofa search index50One query key is generated with the service.More can be created on demand by a searchservice administrator. Having two allows you to roll over one key while using the second key for continuedaccess to the service.Visually, there\u0027s no distinction between an admin key or query key.\r\nBoth keys are stringscomposed of 52 randomly generated alpha-numeric characters. If you lose track of whattype of key is specified in your application, you can check the key values in the portal.７ NoteA quick note about how \u0022key\u0022 terminology is used in Cognitive Search. An \u0022APIkey\u0022, which is described in this article, refers to a GUID used for authenticating arequest. A separate term, \u0022document key\u0022, refers to a unique string in your indexedcontent that\u0027s used to uniquely identify documents in a search index.Types of API keys11Use API keys on connectionsAPI keys are used for data plane (content) requests, such as creating or accessing anindex or any other request that\u0027s represented in the Search REST APIs.\n"
}