{
  "Id": "284",
  "Title": "\u0022Managing Encrypted Data and Resources in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis message appears because blob indexing on the Free tier has a 32Klimit on character extraction. You won\u0027t see this message for this data set on higher tiers.Review and run each request3 - Monitor indexingAfter indexer execution is finished, you can run some queries to verify that the data hasbeen successfully decrypted and indexed. Navigate to your Azure AI Search service inthe portal, and use the search explorer to run queries over the indexed data.When you\u0027re working in your own subscription, at the end of a project, it\u0027s a good ideato remove the resources that you no longer need. Resources left running can cost youmoney.\r\nYou can delete resources individually or delete the resource group to delete theentire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.Now that you have successfully indexed encrypted files, you can iterate on this pipelineby adding more cognitive skills.\r\nThis will allow you to enrich and gain additional insightsto your data.If you are working with doubly encrypted data, you might want to investigate the indexencryption features available in Azure AI Search. Although the indexer needs decrypteddata for indexing purposes, once the index exists, it can be encrypted in a search indexusing a customer-managed key.\r\nThis will ensure that your data is always encryptedwhen at rest. For more information, see Configure customer-managed keys for dataencryption in Azure AI Search.4 - SearchClean up resourcesNext stepsTutorial: Use . NET and AI to generatesearchable content from Azure blobsArticle•09/13/2023If you have unstructured text or images in Azure Blob Storage, an AI enrichment pipelinein Azure Cognitive Search can extract information and create new content for full-textsearch or knowledge mining scenarios.In this C# tutorial, you learn how to:If you don\u0027t have an Azure subscription, open a free account before you begin.This tutorial uses C# and the Azure.Search.\n"
}