{
  "Id": "493",
  "Title": "\u0022Managing Enrichment Caching in Azure Search: Best Practices and Configuration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPhysically, the cache is stored in a blob container in your Azure Storage account, one perindexer. Each indexer is assigned a unique and immutable cache identifier thatcorresponds to the container it is using.The cache is created when you specify the \u0022cache\u0022 property and run the indexer. Onlyenriched content can be cached.\r\nIf your indexer does not have an attached skillset, thencaching does not apply.The following example illustrates an indexer with caching enabled. See Enableenrichment caching for full instructions. Notice that when adding the cache property,use preview API version, 2020-06-30-Preview or later, on the request.JSON） ImportantThis feature is in public preview under supplemental terms of use.\r\nThe previewREST API supports this feature.Cache configurationThe lifecycle of the cache is managed by the indexer. If an indexer is deleted, its cache isalso deleted. If the \u0022cache\u0022 property on the indexer is set to null or the connection stringis changed, the existing cache is deleted on the next indexer run.While incremental enrichment is designed to detect and respond to changes with nointervention on your part, there are parameters you can use to invoke specific behaviors:Prioritize new documentsBypass skillset checksBypass data source checksForce skillset evaluationThe \u0022cache\u0022 property includes an \u0022enableReprocessing\u0022 parameter. It\u0027s used to controlprocessing over incoming documents already represented in the cache. When true(default), documents already in the cache are reprocessed when you rerun the indexer,assuming your skill update affects that doc.When false, existing documents are not reprocessed, effectively prioritizing new,incoming content over existing content. You should only set \u0022enableReprocessing\u0022 tofalse on a temporary basis. Having \u0022enableReprocessing\u0022 set to true most of the timeensures that all documents, both new and existing, are valid per the current skillsetdefinition.POST https://[search service name].search.windows.\n"
}