{
  "Id": "543",
  "Title": "\u0022Managing Encryption and Keys in Azure AI Search Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfContent (indexes andsynonym maps) anddefinitions (indexers,data sources, skillsets),on data disks andtemporary disksserver-sideencryptioncustomer-managedkeysAzure Key VaultAvailable on billabletiers, in specificregions, for contentcreated after August1, 2020.Content (indexes andsynonym maps) ondata disksserver-sidefullencryptioncustomer-managedkeysAzure Key VaultAvailable on billabletiers, in all regions,on search servicesafter May 13, 2021.\r\nContent (indexes andsynonym maps) ondata disks andtemporary disksData in transitData at restService-managed keysService-managed encryption is a Microsoft-internal operation that uses 256-bit AESencryption. It occurs automatically on all indexing, including on incremental updatesto indexes that aren\u0027t fully encrypted (created before January 2018).Service-managed encryption applies to all content on long-term and short-termstorage.Customer-managed keys require another billable service, Azure Key Vault, which can bein a different region, but under the same subscription, as Azure AI Search.\r\nCMK support was rolled out in two phases. If you created your search service during thefirst phase, CMK encryption was restricted to long-term storage and specific regions.Services created in the second phase, after May 2021, can use CMK encryption in anyregion. As part of the second wave rollout, content is CMK-encrypted on both long-termand short-term storage.\r\nFor more information about CMK support, see full doubleencryption.Enabling CMK encryption will increase index size and degrade query performance. Basedon observations to date, you can expect to see an increase of 30-60 percent in querytimes, although actual performance will vary depending on the index definition andtypes of queries. Because of the negative performance impact, we recommend that youonly enable this feature on indexes that really require it. For more information, seeConfigure customer-managed encryption keys in Azure AI Search.Reliance on API key-based authentication means that you should have a plan forregenerating the admin key at regular intervals, per Azure security best practices. Thereare a maximum of two admin keys per search service. For more information aboutsecuring and managing API keys, see Create and manage api-keys.Azure AI Search doesn\u0027t log user identities so you can\u0027t refer to logs for informationabout a specific user.\n"
}