{
  "Id": "1367",
  "Title": "\u0022Managing Azure Search Services with PowerShell: Best Practices and Tips\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure PowerShellNew-AzSearchService -ResourceGroupName \u003Cresource-group-name\u003E -Name \u003Csearch-service-name\u003E -Sku \u0022Standard\u0022 -Location \u0022West US\u0022 -PartitionCount 3 -ReplicaCount 3 -HostingMode DefaultResourceGroupName : demo-westusName              : my-demo-searchappId                : /subscriptions/\u003Calphanumeric-subscription-ID\u003E/demo-westus/providers/Microsoft.\r\nSearch/searchServices/my-demo-searchappLocation          : West USSku               : StandardReplicaCount      : 3PartitionCount    : 3HostingMode       : DefaultTagsRemove-AzSearchService -ResourceGroupName \u003Cresource-group-name\u003E -Name \u003Csearch-service-name\u003EConfirmAre you sure you want to remove Search Service \u0027pstestazuresearch01\u0027?[Y] Yes  [N] No  [S] Suspend  [?] Help (default is \u0022Y\u0022): yCreate a service with IP rules$ipRules = @([pscustomobject]@{Value=\u002255.\r\n5.63.73\u0022},[pscustomobject]@{Value=\u002252.228.215.197\u0022},[pscustomobject]@{Value=\u0022101.37.221.\r\n205\u0022})In some cases, such as when using managed identity to connect to a data source, youwill need to turn on system assigned managed identity. This is done by adding -IdentityType SystemAssigned to the command.Azure PowerShellTo create an S3HD service, a combination of -Sku and -HostingMode is used. Set -Sku toStandard3 and -HostingMode to HighDensity.Azure PowerShellPrivate Endpoints for Azure AI Search allow a client on a virtual network to securelyaccess data in a search index over a Private Link. The private endpoint uses an IP addressfrom the virtual network address space for your search service. Network traffic between New-AzSearchService -ResourceGroupName \u003Cresource-group-name\u003E \u0060                      -Name \u003Csearch-service-name\u003E \u0060                      -Sku Standard \u0060                      -Location \u0022West US\u0022 \u0060                      -PartitionCount 3 -ReplicaCount 3 \u0060                      -HostingMode Default \u0060                      -IPRuleList $ipRulesCreate a service with a system assigned managed identityNew-AzSearchService -ResourceGroupName \u003Cresource-group-name\u003E \u0060                      -Name \u003Csearch-service-name\u003E \u0060                      -Sku Standard \u0060                      -Location \u0022West US\u0022 \u0060\n"
}