{
  "Id": "1110",
  "Title": "\u0022Managing Azure AI Search Service and Knowledge Store Tables\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you get errors, recheck your variables and make sure that the search servicehas room for the new index, indexer, data source, and skillset (the free tier is limited tothree of each).In the Azure portal, go to the Azure AI Search service\u0027s Overview page. Select theIndexers tab, and then select hotels-reviews-ixr. Within a minute or two, status shouldprogress from \u0022In progress\u0022 to \u0022Success\u0022 with zero errors and warnings.\r\nIn the Azure portal, switch to your Azure Storage account and use Storage Browser toview the new tables. You should see six tables, one for each projection defined in theskillset.Each table is generated with the IDs necessary for cross-linking the tables in queries.When you open a table, scroll past these fields to view the content fields added by thepipeline.In this walkthrough, the knowledge store is composed of a various tables showingdifferent ways of shaping and structuring a table.\r\nTables one through three use output        { \u0022sourceFieldName\u0022: \u0022/document/Language\u0022, \u0022targetFieldName\u0022: \u0022Language\u0022 },        { \u0022sourceFieldName\u0022: \u0022/document/reviews_text/pages/*/Sentiment\u0022, \u0022targetFieldName\u0022: \u0022Sentiment\u0022 }    ]}Check statusCheck tables in Azure portalfrom a Shaper skill to determine the columns and rows.\r\nTables four through six arecreated from inline shaping instructions, embedded within the projection itself. You canuse either approach to achieve the same outcome.TableDescriptionhotelReviews1DocumentContains fields carried forward from the CSV, such asreviews_date and reviews_text.hotelReviews2PagesContains enriched fields created by the skillset, such assentiment score and translated text. hotelReviews3KeyPhrasesContains a long list of just the key phrases.hotelReviews4InlineProjectionDocumentAlternative to the first table, using inline shapinginstead of the Shaper skill to shape data for theprojection.hotelReviews5InlineProjectionPagesAlternative to the second table, using inline shaping.\n"
}