{
  "Id": "1413",
  "Title": "\u0022Managing Azure Search Service: IP Address Authorization and Access\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen requests originate from IP addresses that aren\u0027t in the allowed list, a generic 403Forbidden response is returned with no other details.When IP rules are configured, some features of the Azure portal are disabled. You\u0027ll beable to view and manage service level information, but portal access to indexes,indexers, and other top-level resources is restricted. You can restore portal access to thefull range of search service operations by allowing access from the portal IP address andyour client IP address.To get the portal\u0027s IP address, perform nslookup (or ping) onstamp2.ext.search.windows.net, which is the domain of the traffic manager.\r\nForRejected requestsAllow access from the Azure portal IP addressnslookup, the IP address is visible in the \u0022Non-authoritative answer\u0022 portion of theresponse.In the following example, the IP address that you should copy is \u002252.252.175.48\u0022.BashServices in different regions connect to different traffic managers.\r\nRegardless of thedomain name, the IP address returned from the ping is the correct one to use whendefining an inbound firewall rule for the Azure portal in your region.For ping, the request will time out, but the IP address will be visible in the response. Forexample, in the message \u0022Pinging azsyrie.northcentralus.cloudapp.azure.com[52.252.175.\r\n48]\u0022, the IP address is \u002252.252.175.48\u0022.Providing IP addresses for clients ensures that the request isn\u0027t rejected outright, but forsuccessful access to content and operations, authorization is also necessary. Use one ofthe following methodologies to authenticate your request:Key-based authentication, where an admin or query API key is provided on therequestRole-based authorization, where the caller is a member of a security role on asearch service, and the registered app presents an OAuth token from MicrosoftEntra ID.If your client application is a static Web app on Azure, learn how to determine its IPrange for inclusion in a search service IP firewall rule.\n"
}