{
  "Id": "133",
  "Title": "\u0022Managing Azure AI Search Service with Terraform: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfpartition_count)    error_message = \u0022The partition_count must be one of the following values: 1, 2, 3, 4, 6, 12.\u0022  }}Initialize Terraformterraform init -upgradeCreate a Terraform execution planterraform plan -out main.tfplanapplied.To read more about persisting execution plans and security, see the securitywarning section.\r\nRun terraform apply to apply the execution plan to your cloud infrastructure.ConsoleKey points:The example terraform apply command assumes you previously ran terraformplan -out main.tfplan.If you specified a different filename for the -out parameter, use that samefilename in the call to terraform apply.\r\nIf you didn\u0027t use the -out parameter, call terraform apply without any parameters.1. Get the Azure resource name in which the Azure AI Search service was created.Console2. Get the Azure AI Search service name.Console3. Run az search service show to show the Azure AI Search service you created in thisarticle.Azure CLIApply a Terraform execution planterraform apply main.\r\ntfplanVerify the resultsresource_group_name=$(terraform output -raw resource_group_name)azurerm_search_service_name=$(terraform output -raw azurerm_search_service_name)az search service show --name $azurerm_search_service_name \\When you no longer need the resources created via Terraform, do the following steps:1. Run terraform plan and specify the destroy flag.\r\nConsoleKey points:The terraform plan command creates an execution plan, but doesn\u0027t executeit. Instead, it determines what actions are necessary to create theconfiguration specified in your configuration files. This pattern allows you toverify whether the execution plan matches your expectations before makingany changes to actual resources. The optional -out parameter allows you to specify an output file for the plan.Using the -out parameter ensures that the plan you reviewed is exactly whatis applied.To read more about persisting execution plans and security, see the securitywarning section.2. Run terraform apply to apply the execution plan.\n"
}