{
  "Id": "1463",
  "Title": "\u0022Managing Key Vault Access and Permissions for Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis policy gives the applicationyou registered with Active Directory permission to use your customer-managed key.Access permissions could be revoked at any given time. Once revoked, any searchservice index or synonym map that uses that key vault will become unusable. Restoringkey vault access permissions at a later time will restore index\\synonym map access. Formore information, see Secure access to a key vault.System-managed identity4 - Grant permissions1. Still in the Azure portal, open your key vault Overview page.2. Select the Access policies on the left, and select \u002B Create to start the Create anaccess policy wizard.3.\r\nOn the Permissions page, select Get for Key permissions, Secret permissions, andCertificate Permissions. Select Unwrap Key and Wrap Key for ** cryptographicoperations on the key.4. Select Next.5. On the Principle page, find and select the security principal used by the searchservice to access the encryption key.\r\nThis will either be the system-managed oruser-managed identity of the search service, or the registered application.6. Select Next and Create.） ImportantEncrypted content in Azure Cognitive Search is configured to use a specific AzureKey Vault key with a specific version. If you change the key or version, the index orsynonym map must be updated to use it before you delete the previous one.\r\nFailing to do so will render the index or synonym map unusable. You won\u0027t be ableto decrypt the content if the key is lost.Encryption keys are added when you create an object. To add a customer-managed keyon an index, synonym map, indexer, data source, or skillset, use the Search REST API oran Azure SDK to create an object that has encryption enabled. The portal doesn\u0027t allowencryption properties on object creation.1. Call the Create APIs to specify the encryptionKey property:Create IndexCreate Synonym MapCreate IndexerCreate Data SourceCreate Skillset.2. Insert the encryptionKey construct into the object definition. This property is afirst-level property, on the same level as name and description.\nThe following[REST examples(#rest-examples) show property placement. If you\u0027re using thesame vault, key, and version, you can paste in the same \u0022encryptionKey\u0022 constructinto each object definition.\n"
}