{
  "Id": "841",
  "Title": "\u0022Managing Azure Blob Storage and Indexing with Managed Identities\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStorage/storageAccounts/[storage account name]/;\u0022     },    \u0022container\u0022 : {         \u0022name\u0022 : \u0022my-container\u0022, \u0022query\u0022 : \u0022\u003Coptional-virtual-directory-name\u003E\u0022     }}   User-assigned managed identity (preview)First, the format of the \u0022credentials\u0022 property is a ResourceId that has no accountkey or password.\r\nThe ResourceId must include the subscription ID of the storageaccount, the resource group of the storage account, and the storage accountname. This format is the same format as the system-assigned managed identity.Second, you\u0027ll add an \u0022identity\u0022 property that contains the collection of user-assigned managed identities.\r\nOnly one user-assigned managed identity should beprovided when creating the data source. Set it to type \u0022userAssignedIdentities\u0022.Here\u0027s an example of how to create an indexer data source object using the previewCreate or Update Data Source REST API:HTTPThe index specifies the fields in a document, attributes, and other constructs that shapethe search experience.\r\nHere\u0027s a Create Index REST API call with a searchable content field to store the textextracted from blobs:POST https://[service name].search.windows.net/datasources?api-version=2021-04-30-previewContent-Type: application/jsonapi-key: [admin key]{    \u0022name\u0022 : \u0022blob-datasource\u0022,    \u0022type\u0022 : \u0022azureblob\u0022,    \u0022credentials\u0022 : {         \u0022connectionString\u0022 : \u0022ResourceId=/subscriptions/[subscription ID]/resourceGroups/[resource group name]/providers/Microsoft.\r\nStorage/storageAccounts/[storage account name]/;\u0022     },    \u0022container\u0022 : {         \u0022name\u0022 : \u0022my-container\u0022, \u0022query\u0022 : \u0022\u003Coptional-virtual-directory-name\u003E\u0022     },    \u0022identity\u0022 : {         \u0022@odata.type\u0022: \u0022#Microsoft.Azure.Search. DataUserAssignedIdentity\u0022,        \u0022userAssignedIdentity\u0022 : \u0022/subscriptions/[subscription ID]/resourcegroups/[resource group name]/providers/Microsoft.ManagedIdentity/userAssignedIdentities/[managed identity name]\u0022     }}   Create the indexHTTPAn indexer connects a data source with a target search index, and provides a scheduleto automate the data refresh.\n"
}