{
  "Id": "1386",
  "Title": "\u0022Managing Azure AI Search with REST APIs and Azure CLI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStorage/storageAccounts/myBlobStorage\u0022  \\    --request-message \u0022Please approve\u0022 az search shared-private-link-resource list \\    --service-name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E id = (az storage account show -n myBlobStorage --query \u0022privateEndpointConnections[0].\r\nid\u0022)az network private-endpoint-connection approve --id $idaz search shared-private-link-resource delete \\    --name \u003Cspl-name\u003E \\    --service-name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E Build an index, query an index using the portal, REST APIs, or the .NET SDK.\r\nCreate an Azure AI Search index in the Azure portalSet up an indexer to load data from other servicesQuery an Azure AI Search index using Search explorer in the Azure portalHow to use Azure AI Search in .NETNext stepsManage your Azure Cognitive Searchservice with REST APIsArticle•05/14/2023In this article, learn how to create and configure an Azure Cognitive Search service usingthe Management REST APIs.\r\nOnly the Management REST APIs are guaranteed to provideearly access to preview features.The Management REST API is available in stable and preview versions. Be sure to set apreview API version if you\u0027re accessing preview features.All of the Management REST APIs have examples. If a task isn\u0027t covered in this article,see the API reference instead.An Azure subscription - Create one for free.Postman or another REST client that sends HTTP requests.Azure CLI used to set up a security principle for the client. You must have owner oradministrator permissions to create a security principle. Management REST API calls are authenticated through Azure Active Directory (AzureAD). You\u0027ll need a security principal for your REST client, along with permissions tocreate and configure a resource. This section explains how to create a security principaland assign a role.\n"
}