{
  "Id": "1384",
  "Title": "\u0022Managing Azure AI Search Capacity and Resources: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf youhave a temporary need for additional processing power, you can increase replicas andaz search admin-key renew \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --service-name \u003Csearch-service-name\u003E \\    --key-kind primary{  \u0022primaryKey\u0022: \u003Calphanumeric-guid\u003E,  \u0022secondaryKey\u0022: \u003Calphanumeric-guid\u003E  }Create or delete query keysaz search query-key create \\    --name myQueryKey \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --service-name \u003Csearch-service-name\u003EScale replicas and partitionspartitions to handle the workload.\r\nThe monitoring area in the Overview portal page hastiles on query latency, queries per second, and throttling, indicating whether currentcapacity is adequate.It can take a while to add or remove resourcing. Adjustments to capacity occur in thebackground, allowing existing workloads to continue. Additional capacity is used forincoming requests as soon as it\u0027s ready, with no additional configuration required.Removing capacity can be disruptive. Stopping all indexing and indexer jobs prior toreducing capacity is recommended to avoid dropped requests.\r\nIf that isn\u0027t feasible, youmight consider reducing capacity incrementally, one replica and partition at a time, untilyour new target levels are reached.Once you submit the command, there is no way to terminate it midway through. You willhave to wait until the command is finished before revising the counts.Azure CLIIn addition to updating replica and partition counts, you can also update ip-rules,public-access, and identity-type.Private endpoints of secured resources that are created through Azure AI Search APIsare referred to as shared private link resources. This is because you\u0027re \u0022sharing\u0022 access toa resource, such as a storage account, that has been integrated with the Azure PrivateLink service.If you\u0027re using an indexer to index data in Azure AI Search, and your data source is on aprivate network, you can create an outbound private endpoint connection to reach thedata.\n"
}