{
  "Id": "534",
  "Title": "\u0022Managing Document Changes and Deletions in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf a parent document is changed such that there are new projected child documents thatweren\u0027t there before (an example would be if one or more pages worth of text wereadded to the document), those new child documents are added next time the indexerruns.\r\nIn both of these cases, all projected documents are updated to have a new hash value intheir key, regardless of if their particular content was updated.If a parent document is changed such that a child document generated by indexprojections no longer exists (an example would be if a text is shortened so there arefewer chunks than before), the corresponding child document in the search index isdeleted.\r\nThe remaining child documents also get their key updated to include a newhash value, even if their content didn\u0027t otherwise change.If a parent document is completely deleted from the datasource, the correspondingchild documents only get deleted if the deletion is detected by adataDeletionDetectionPolicy defined on the datasource definition.\r\nIf you don\u0027t have adataDeletionDetectionPolicy configured and need to delete a parent document fromthe datasource, then you should manually delete the child documents if they\u0027re nolonger wanted.Changes or additionsDeletionsSecurity overview for Azure AI SearchArticle•11/15/2023This article describes the security features in Azure AI Search that protect data andoperations.An Azure AI Search service is hosted on Azure and is typically accessed by clientapplications over public network connections. While that pattern is predominant, it\u0027s notthe only traffic pattern that you need to care about.\r\nUnderstanding all points of entry aswell as outbound traffic is necessary background for securing your development andproduction environments. Azure AI Search has three basic network traffic patterns:Inbound requests made by a client to the search service (the predominant pattern)Outbound requests issued by the search service to other services on Azure andelsewhereInternal service-to-service requests over the secure Microsoft backbone networkInbound requests that target a search service endpoint can be characterized as:Create or manage indexes, indexers, data sources, skillsets, and synonym mapsTrigger indexer or skillset executionLoad or query an indexYou can review the REST APIs to understand the full range of inbound requests that arehandled by a search service.\n"
}