{
  "Id": "1126",
  "Title": "\u0022Managing Projections and Output in Azure Search and Storage\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf there are multiple images, they\u0027ll be placed together in thesame folder. File projections can\u0027t share the same container as object projections andneed to be projected into a different container.The following example projects all normalized images extracted from the documentnode of an enriched document, into a container called myImages.JSONYou can process projections by following these steps:1. Set the knowledge store\u0027s storageConnectionString property to a valid V2 generalpurpose storage account connection string.2. Update the skillset by issuing a PUT request with your projection definition in thebody of the skillset.3. Run the indexer to put the skillset into execution.\r\n4. Monitor indexer execution to check progress and catch any errors.5. Use Azure portal to verify object creation in Azure Storage.6. If you\u0027re projecting tables, import them into Power BI for table manipulation andvisualization. In most cases, Power BI will auto-discover the relationships amongtables.\r\n\u0022projections\u0022: [     {         \u0022tables\u0022: [ ],         \u0022objects\u0022: [ ],         \u0022files\u0022: [             {                 \u0022storageContainer\u0022: \u0022myImages\u0022,                 \u0022source\u0022: \u0022/document/normalized_images/*\u0022             }         ]     } ] Test projectionsCommon issuesOmitting any of the following steps can result in unexpected outcomes.\r\nCheck for thefollowing conditions if your output doesn\u0027t look right.String enrichments aren\u0027t shaped into valid JSON. When strings are enriched, forexample merged_content enriched with key phrases, the enriched property isrepresented as a child of merged_content within the enrichment tree. The defaultrepresentation isn\u0027t well-formed JSON. At projection time, make sure to transformthe enrichment into a valid JSON object with a name and a value. Using a Shaperskill or defining inline shapes will help resolve this issue.Omission of /* at the end of a source path. If the source of a projection is/document/projectionShape/keyPhrases, the key phrases array is projected as asingle object/row. Instead, set the source path to/document/projectionShape/keyPhrases/* to yield a single row or object for each ofthe key phrases.Path syntax errors. Path selectors are case-sensitive and can lead to missing inputwarnings if you don\u0027t use the exact case for the selector.The next step walks you through shaping and projection of output from a rich skillset. Ifyour skillset is complex, the following article provides examples of both shapes andprojections.\n"
}