{
  "Id": "1366",
  "Title": "\u0022Managing Azure Search Services with Azure PowerShell Commands\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf8.0      If you have an older version of the package, update the module to get the latestfunctionality.Azure PowerShellAfter Az.Search is imported and you know the resource group containing your searchservice, run Get-AzSearchService to return the service definition, including name, region,tier, and replica and partition counts. For this command, provide the resource groupthat contains the search service.Azure PowerShellResults should look similar to the following output.New-AzSearchService is used to create a new search service.Azure PowerShellAz.Search                                                             Cmdlet          Set-AzSearchSharedPrivateLinkResource              0.\r\n8.0      Az.Search   Update-Module -Name Az.SearchGet search service informationGet-AzSearchService -ResourceGroupName \u003Cresource-group-name\u003EName              : my-demo-searchappResourceGroupName : demo-westusResourceType      : Microsoft.\r\nSearch/searchServicesLocation          : West USSku               : StandardReplicaCount      : 1PartitionCount    : 1HostingMode       : DefaultResourceId        : /subscriptions/\u003Calphanumeric-subscription-ID\u003E/resourceGroups/demo-westus/providers/Microsoft.Search/searchServices/my-demo-searchappCreate or delete a serviceResults should look similar to the following output.Azure PowerShellRemove-AzSearchService is used to delete a service and its data.\r\nAzure PowerShellYou\u0027ll be asked to confirm the action.Azure PowerShellDepending on your security requirements, you may want to create a search service withan IP firewall configured. To do so, first define the IP Rules and then pass them to theIPRuleList parameter as shown below. Azure PowerShellNew-AzSearchService -ResourceGroupName \u003Cresource-group-name\u003E -Name \u003Csearch-service-name\u003E -Sku \u0022Standard\u0022 -Location \u0022West US\u0022 -PartitionCount 3 -ReplicaCount 3 -HostingMode DefaultResourceGroupName : demo-westusName              : my-demo-searchappId                : /subscriptions/\u003Calphanumeric-subscription-ID\u003E/demo-westus/providers/Microsoft.\n"
}