{
  "Id": "1552",
  "Title": "\u0022Managing Azure Search Private Endpoint and Link Resources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCoreGAaz search private-endpoint-connectionManage Azure Search private endpoint connections.CoreGAaz search private-endpoint-connectiondeleteDisconnects the private endpoint connection anddeletes it from the search service.CoreGAaz search private-endpoint-connectionlistGets a list of all private endpoint connections in thegiven service.CoreGAaz search private-endpoint-connectionshowGets the details of the private endpoint connection tothe search service in the given resource group.CoreGAaz search private-endpoint-connectionupdateUpdate an existing private endpoint connection in aSearch service in the given resource group.CoreGAaz search private-link-resourceManage Azure Search private link resources.\r\nCoreGAaz search private-link-resource listGets a list of all supported private link resource typesfor the given service.CoreGAaz search query-keyManage Azure Search query keys.CoreGAaz search query-keycreateGenerates a new query key for the specified searchservice.CoreGACommandsNameDescriptionTypeStatusaz search query-keydeleteDeletes the specified query key.\r\nCoreGAaz search query-keylistReturns the list of query API keys for the given AzureCognitive Search service.CoreGAaz search serviceManage Azure Search services.CoreGAaz search servicecreateCreate a search service in the given resource group. Ifthe search service already exists, all properties will beupdated with the given values. CoreGAaz search servicedeleteDelete a search service in the given resource group,along with its associated resources.CoreGAaz search service listGets a list of all Search services in the given resourcegroup.CoreGAaz search service showGet the search service with the given name in the givenresource group.CoreGAaz search serviceupdateUpdate a search service in the given resource group. Ifthe search service already exists, all properties will beupdated with the given values.CoreGAaz search service waitPlace the CLI in a waiting state until a condition is met.CoreGAaz search shared-private-link-resourceManage Azure Search shared private link resources.\n"
}