{
  "Id": "1015",
  "Title": "\u0022Managing Azure AI Multi-Service Resources for Workload Optimization\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor larger and more frequent workloads,you should attach a billable Azure AI multi-service resource.A multi-service resource references a subset of \u0022Azure AI services\u0022 as the offering, ratherthan individual services, with access granted through a single API key.\r\nThis key isspecified in a skillset and allows Microsoft to charge you for using these services:Azure AI Vision for image analysis and optical character recognition (OCR)Azure AI Language for language detection, entity recognition, sentiment analysis,and key phrase extractionAzure AI Speech for speech to text and text to speechAzure AI Translator for machine text translationYou can use the Azure portal, REST API, or an Azure SDK to attach a billable resource toa skillset.\r\nIf you leave the property unspecified, your search service attempts to use the freeenrichments available to your indexer on a daily basis. Execution of billable skills stops at20 transactions per indexer invocation and a \u0022Time Out\u0022 message appears in indexerexecution history.\r\n1. Sign in to the Azure portal. TipAzure provides infrastructure for you to monitor billing and budgets. For moreinformation about monitoring Azure AI services, see Plan and manage costs forAzure AI services.Set the resource keyAzure portal2. Create an Azure AI multi-service resource in the same region as your searchservice.3.\r\nAdd the key to a skillset definition:If using the Import data wizard, enter the key in the second step, \u0022Add AIenrichments\u0022.If adding the key to a new or existing skillset, provide the key in theAzure AI services tab.Enrichments are a billable feature. If you no longer need to call Azure AI services, followthese instructions to remove the multi-region key and prevent use of the externalresource. Without the key, the skillset reverts to the default allocation of 20 freetransactions per indexer, per day. Execution of billable skills stops at 20 transactions anda \u0022Time Out\u0022 message appears in indexer execution history when the allocation is usedup.Remove the keyAzure portal1.\n"
}