{
  "Id": "782",
  "Title": "\u0022Managing Synonym Maps in Azure Search: Best Practices and Examples\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe following example shows an example of how to escape a character with a backslash:JSONSince the backslash is itself a special character in other languages like JSON and C#,you\u0027ll probably need to double-escape it. For example, the JSON sent to the REST APIfor the above synonym map would look like this:{ \u0022format\u0022: \u0022solr\u0022, \u0022synonyms\u0022: \u0022     Washington, Wash., WA =\u003E WA\\n    California, Calif.\r\n, CA =\u003E CA\\n\u0022 } Escaping special characters{ \u0022format\u0022: \u0022solr\u0022, \u0022synonyms\u0022: \u0022WA\\, USA, WA, Washington\\n\u0022 } JSONAs mentioned previously, you can create or update a synonym map without disruptingquery and indexing workloads. A synonym map is a standalone object (like indexes ordata sources), and as long as no field is using it, updates won\u0027t cause indexing or queriesto fail.\r\nHowever, once you add a synonym map to a field definition, if you then delete asynonym map, any query that includes the fields in question will fail with a 404 error.Creating, updating, and deleting a synonym map is always a whole-document operation,meaning that you can\u0027t update or delete parts of the synonym map incrementally.Updating even a single rule requires a reload.After uploading a synonym map, you can enable the synonyms on fields of the typeEdm.String or Collection(Edm.String), on fields having \u0022searchable\u0022:true. As noted, afield definition can use only one synonym map. HTTP{ \u0022format\u0022:\u0022solr\u0022, \u0022synonyms\u0022: \u0022WA\\\\, USA, WA, Washington\u0022 } Upload and manage synonym mapsAssign synonyms to fieldsPOST /indexes?api-version=2020-06-30 {     \u0022name\u0022:\u0022hotels-sample-index\u0022,    \u0022fields\u0022:[         {             \u0022name\u0022:\u0022description\u0022,            \u0022type\u0022:\u0022Edm.String\u0022,             \u0022searchable\u0022:true,             \u0022synonymMaps\u0022:[             \u0022en-synonyms\u0022             ]         },         {             \u0022name\u0022:\u0022description_fr\u0022,             \u0022type\u0022:\u0022Edm.\n"
}