{
  "Id": "587",
  "Title": "\u0022Managing Azure AI Search Service Tiers and Capacity Estimation\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAll services are initially provisioned at one SU, but you can increase the SUs byadding either partitions or replicas to handle larger workloads. For more information, see How toestimate costs of a search service.There is no built-in support to upgrade or downgrade tiers. If you want to switch to a different tier, theapproach is:Create a new search service at the new tier.\r\nDeploy your search content onto the new service. Follow this checklist to make sure you have all ofthe content.Delete the old search service once you\u0027re sure it\u0027s no longer needed.Partition size and speedBilling rates100permonth.\r\nIfyoukeepthesearchserviceatitsinitialcapacityofonepartitionandonereplica,then300(Tier upgrade or downgradeFor large indexes that you don\u0027t want to rebuild from scratch, consider using the backup and restoresample to move them.The best way to choose a pricing tier is to start with a least-cost tier, and then allow experience andtesting inform your decision to keep the service or create a new one at a higher tier.\r\nFor next steps, werecommend that you create a search service at a tier that can accommodate the level of testing youpropose to do, and then review the following guidance for recommendations on estimating cost andcapacity.Create a search serviceEstimate costsEstimate capacityNext stepsService limits in Azure AI SearchArticle•11/16/2023Maximum limits on storage, workloads, and quantities of indexes and other objects depend onwhether you provision Azure AI Search at Free, Basic, Standard, or Storage Optimized pricingtiers.Free is a multi-tenant shared service that comes with your Azure subscription. Basic provides dedicated computing resources for production workloads at a smallerscale, but shares some networking infrastructure with other tenants.Standard runs on dedicated machines with more storage and processing capacity at everylevel. Standard comes in four levels: S1, S2, S3, and S3 HD. S3 High Density (S3 HD) isengineered for multi-tenancy and large quantities of small indexes (three thousandindexes per service).\n"
}