{
  "Id": "1428",
  "Title": "\u0022Managing and Troubleshooting Azure Shared Private Link Resources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf so, it initiates an Azure Resource Manager delete operation to removethe resource.3. Search queries for the completion of the operation (which usually takes a fewminutes). At this point, the shared private link resource would have a provisioningstate of \u0022Deleting\u0022.4. Once the operation completes successfully, the backing private endpoint and anyassociated DNS mappings are removed. The resource won\u0027t show up as part of Listoperation and attempting a Get operation on this resource will result in a 404 NotFound.Updating a shared private link resourceDeleting a shared private link resourceSome common errors that occur during the deletion phase are listed below.\r\nFailureTypeDescriptionResolutionResourceis in non-terminalstateA shared private link resource that\u0027s not in a terminal state(Succeeded or Failed) can\u0027t be deleted. It\u0027s possible (rare) for ashared private link resource to be stuck in a non-terminal statefor up to 8 hours.Wait until theresource hasreached a terminalstate and retry thedelete request.Deleteoperationfailed witherror\u0022Conflict\u0022The Azure Resource Manager operation to delete a sharedprivate link resource reaches out to the resource provider ofthe target resource specified in privateLinkResourceId (\u0022targetRP\u0022) before it can remove the private endpoint and DNSmappings.\r\nCustomers can utilize Azure resource locks toprevent any changes to their resources. When Azure ResourceManager reaches out to the target RP, it requires the target RPto modify the state of the target resource (to remove detailsabout the private endpoint from its metadata). When thetarget resource has a lock configured on it (or its resourcegroup/subscription), the Azure Resource Manager operationfails with a \u0022Conflict\u0022 (and appropriate details). The sharedprivate link resource won\u0027t be deleted.Customers shouldremove the lock onthe target resourcebefore retrying thedeletion operation. Note: This problemcan also occurwhen customerstry to delete asearch service withshared private linkresources thatpoint to \u0022locked\u0022target resourcesDeleteoperationfailedThe asynchronous Azure Resource Manager delete operationcan fail in rare cases. When this operation fails, querying thestate of the asynchronous operation will present customerswith an error message and appropriate details.\n"
}