{
  "Id": "898",
  "Title": "\u0022Managing Document-Level Permissions and Blob Indexing in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor example, you might want toADLS Gen2 implements an access control model that supports both Azure role-based access control (Azure RBAC) and POSIX-like access control lists (ACLs) at theblob level. Azure Cognitive Search does not support document-level permissions.All users have the same level of access to all searchable and retrievable content inthe index. If document-level permissions are an application requirement, considersecurity trimming as a potential solution.Supported document formatsDetermine which blobs to indexexclude image or audio files that don\u0027t provide searchable text. This capability iscontrolled through configuration settings in the indexer.Include or exclude arbitrary blobs.\r\nIf you want to skip a specific blob for whateverreason, you can add the following metadata properties and values to blobs in BlobStorage. When an indexer encounters this property, it skips the blob or its contentin the indexing run.Property namePropertyvalueExplanation\u0022AzureSearch_Skip\u0022\u0022true\u0022Instructs the blob indexer to completely skip theblob.\r\nNeither metadata nor content extraction isattempted. This is useful when a particular blobfails repeatedly and interrupts the indexingprocess.\u0022AzureSearch_SkipContent\u0022\u0022true\u0022Skips content and extracts just the metadata. thisis equivalent to the \u0022dataToExtract\u0022 :\u0022allMetadata\u0022 setting described in configurationsettings , just scoped to a particular blob.\r\nIf you don\u0027t set up inclusion or exclusion criteria, the indexer will report an ineligibleblob as an error and move on. If enough errors occur, processing might stop. You canspecify error tolerance in the indexer configuration settings.An indexer typically creates one search document per blob, where the text content andmetadata are captured as searchable fields in an index. If blobs are whole files, you canpotentially parse them into multiple search documents. For example, you can parse rowsin a CSV file to create one search document per row.Blob metadata can also be indexed, and that\u0027s helpful if you think any of the standard orcustom metadata properties will be useful in filters and queries.\n"
}