{
  "Id": "611",
  "Title": "\u0022Managing Costs and Billing for Azure AI Search Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHow Azure Cognitive Search shards an index is an implementation detail,subject to change in future releases. Although the number is 12 today, youshouldn\u0027t expect that number to always be 12 in the future.Next stepsManage costsPlan and manage costs of an Azure AISearch serviceArticle•11/15/2023This article explains the billing model and billable events of Azure AI Search, andprovides direction for managing the costs.As a first step, estimate your baseline costs by using the Azure pricing calculator.Alternatively, estimated costs and tier comparisons can also be found in the Select apricing tier page when creating a service.\r\nAzure provides built-in cost management that cuts across service boundaries to provideinclusive cost monitoring and the ability to set budgets and define alerts. The costs ofrunning a search service will vary depending on capacity and which features you use.After you create your search service, optimize capacity so that you pay only for what youneed.\r\nAzure AI Search runs on Azure infrastructure that accrues costs when you deploy newresources. It\u0027s important to understand that there could be other additionalinfrastructure costs that might accrue.When you create or use Search resources, you\u0027re charged for the following meters:You\u0027re charged an hourly rate based on the pricing tier of your search service,prorated to the hour.\r\nThe charge is applied per the number of search units (SU) allocated to the service.Search units are units of capacity. Total SU is the product of replicas and partitions(R x P = SU) used by your service.Billing is based on capacity (SUs) and the costs of running premium features, such as AIenrichment, Semantic ranking, and Private endpoints. Meters associated with premiumfeatures are listed in the following table.Understand the billing modelHow you\u0027re charged for Azure AI SearchMeterUnitImage extraction(AI enrichment) Per 1000 images. See the pricing page.Custom EntityLookup skill (AIenrichment) Per 1000 text records.\nSee the pricing pageBuilt-in skills (AIenrichment) Number of transactions, billed at the same rate as if you had performed thetask by calling Azure AI services directly. You can process 20 documents perindexer per day for free. Larger or more frequent workloads require a multi-resource Azure AI services key.\n"
}