{
  "Id": "1471",
  "Title": "\u0022Managing Azure Key Vault Keys for Cognitive Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf2. Create a new key in key vault, but leave the original key available.3. Update the encryptionKey properties on an index or synonym map to use the newvalues. Only objects that were originally created with this property can be updatedto use a different value.4. Disable or delete the previous key in the key vault.\r\nMonitor key access to verify thenew key is being used.For performance reasons, the search service caches the key for up to several hours. Ifyou disable or delete the key without providing a new one, queries will continue to workon a temporary basis until the cache expires. However, once the search service can nolonger decrypt content, you\u0027ll get this message: \u0022Access forbidden. The query key usedmight have been revoked - please retry.\u0022If you\u0027re unfamiliar with Azure security architecture, review the Azure Securitydocumentation, and in particular, this article:details (for example, updating the key version).\r\nWhen changing to a new Key Vaultkey or a new key version, any search index or synonym map that uses the key mustfirst be updated to use the new key\\version before deleting the previouskey\\version. Failing to do so will render the index or synonym map unusable, as itwon\u0027t be able to decrypt the content once key access is lost.\r\nAlthough restoring keyvault access permissions at a later time will restore content access.Work with encrypted contentNext stepsData encryption-at-restFind encrypted objects and informationArticle•03/10/2023In Azure Cognitive Search, customer-managed encryption keys are created, stored, andmanaged in Azure Key Vault. If you need to determine whether an object is encrypted,or what key name or version was used in Azure Key Vault, use the REST API or an AzureSDK to retrieve the encryptionKey property from the object definition in your searchservice.Objects that aren\u0027t encrypted with a customer-managed key will have an emptyencryptionKey property. Otherwise, you might see a definition similar to the followingexample.JSONThe encryptionKey construct is the same for all encrypted objects. It\u0027s a first-levelproperty, on the same level as the object name and description.Before you can retrieve object definitions from a search service, you\u0027ll need to providean admin API key.\n"
}