{
  "Id": "120",
  "Title": "\u0022Managing Azure AI Search: Hotel Data Query Examples\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfscore\u0022:  0.009068266,                  \u0022HotelId\u0022:  \u00223\u0022,                  \u0022HotelName\u0022:  \u0022Triple Landscape Hotel\u0022,                  \u0022Description\u0022:  \u0022The Hotel stands out for its gastronomic excellence under the management of William Dough, who advises on and oversees all of the Hotel\\u0027s restaurant services.\r\n\u0022,                  \u0022Category\u0022:  \u0022Resort and Spa\u0022,                  \u0022Tags\u0022:  \u0022air conditioning bar continental breakfast\u0022,                  \u0022ParkingIncluded\u0022:  true,                  \u0022LastRenovationDate\u0022:  \u00222015-09-20T00:00:00Z\u0022,                  \u0022Rating\u0022:  4.8,                  \u0022Address\u0022:  \u0022@{StreetAddress=3393 Peachtree Rd; City=Atlanta; StateProvince=GA; PostalCode=30326; Country=USA}\u0022              },            .\r\n. . # Query example 1# Search the entire index for the terms \u0027restaurant\u0027 and \u0027wifi\u0027# Return only the HotelName, Description, and Tags fields$url = \u0027https://\u003CYOUR-SEARCH-SERVICE\u003E.search.windows.net/indexes/hotels-When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created.\r\nResources left running cancost you money. You can delete resources individually or delete the resource group todelete the entire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.\r\nIf you are using a free service, remember that you are limited to three indexes, indexers,and data sources. You can delete individual items in the portal to stay under the limit.In this quickstart, you used PowerShell to step through the basic workflow for creatingand accessing content in Azure AI Search. With the concepts in mind, we recommendmoving on to more advanced scenarios, such as indexing from Azure data sources;quickstart/docs?api-version=2020-06-30\u0026search=restaurant wifi\u0026$count=true\u0026$select=HotelName,Description,Tags\u0027# Query example 2 # Apply a filter to the index to find hotels rated 4 or higher# Returns the HotelName and Rating.\n"
}