{
  "Id": "692",
  "Title": "\u0022Managing Indexes and Aliases in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPUT is required for updates as describedin Create or Update Alias (REST preview).HTTPAfter you make the update to the alias, requests will automatically start to be routed tothe new index.\r\nDrop and rebuild an index in Azure AI Searchindex that has been mapped or recently was mapped to the alias.Swap indexesPUT /aliases/my-alias?api-version=2021-04-30-preview{    \u0022name\u0022: \u0022my-alias\u0022,    \u0022indexes\u0022: [\u0022hotel-samples-index2\u0022]}７ NoteAn update to an alias may take up to 10 seconds to propagate through the systemso you should wait at least 10 seconds before deleting the index that the alias waspreviously mapped to.\r\nSee alsoAdd vector fields to a search indexArticle•11/27/2023In Azure AI Search, vector data is indexed as vector fields in a search index.\r\nFollow these steps to index vector data:This article applies to the generally available, non-preview version of vector search,which assumes your application code calls external resources for chunking andencoding.Azure AI Search, in any region and on any tier. Most existing services supportvector search. For services created prior to January 2019, there\u0027s a small subset thatsupport vector search.\r\nIf an index containing vector fields fails to be created orupdated, this is an indicator. In this situation, a new service must be created.Pre-existing vector embeddings in your source documents. Azure AI Searchdoesn\u0027t generate vectors in the generally available version of vector search. Werecommend Azure OpenAI embedding models but you can use any model forvectorization. For more information, see Generate embeddings.You should know the dimensions limit of the model used to create theembeddings and how similarity is computed. In Azure OpenAI, for text-embedding-ada-002, the length of the numerical vector is 1536. Similarity iscomputed using cosine.You should be familiar with creating an index.\n"
}