{
  "Id": "855",
  "Title": "\u0022Managing Permissions for Azure Cognitive Search and SQL Managed Instance\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn the T-SQL window, copy the following commands and include the bracketsaround your search service name. Click on Execute.SQLIf you later change the search service system identity after assigning permissions, youmust remove the role membership and remove the user in the SQL database, thenrepeat the permission assignment.\r\nRemoving the role membership and user can beaccomplished by running the following commands:CREATE USER [insert your search service name here or user-assigned managed identity name] FROM EXTERNAL PROVIDER;EXEC sp_addrolemember \u0027db_datareader\u0027, [insert your search service name here or user-assigned managed identity name];SQLIn this step, you\u0027ll give your Azure Cognitive Search service permission to read data fromyour SQL Managed Instance.\r\n1. In the Azure portal, navigate to your SQL Managed Instance page.2. Select Access control (IAM).3. Select Add then Add role assignment.4. Select Reader role.5. Leave Assign access to as Microsoft Entra user, group, or service principal.6. If you\u0027re using a system-assigned managed identity, search for your search service,then select it. If you\u0027re using a user-assigned managed identity, search for thename of the user-assigned managed identity, then select it. Select Save.\r\nsp_droprolemember \u0027db_datareader\u0027, [insert your search service name or user-assigned managed identity name];DROP USER IF EXISTS [insert your search service name or user-assigned managed identity name];2 - Add a role assignmentExample for SQL Managed Instance using a system-assigned managed identity:Create the data source and provide a system-assigned managed identity. The REST API, Azure portal, and the .NET SDK support system-assigned managedidentity.When you\u0027re connecting with a system-assigned managed identity, the only change tothe data source definition is the format of the \u0022credentials\u0022 property. You\u0027ll provide an3 - Create the data sourceSystem-assigned managed identityInitial Catalog or Database name and a ResourceId that has no account key orpassword.\n"
}