{
  "Id": "1361",
  "Title": "\u0022Managing Azure Search: Resource Logging and Security Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you opt in for resource logging, you\u0027ll specify durable storage over which you\u0027ll havefull control over data retention and data access through Kusto queries. For moreinformation on how to set up resource logging in Cognitive Search, see Collect andanalyze log data.Internally, Microsoft collects telemetry data about your service and the platform.\r\nIt\u0027sstored internally in Microsoft data centers and made globally available to Microsoftsupport engineers when you open a support ticket.MonitoringdataRetentionActivity logs90 days on a rolling schedulePlatformmetrics93 days on a rolling schedule, except that portal visualization is limited to a 30day windowResource logsUser-managedTelemetryOne and a half yearsData collection and retention７ NoteSee the \u0022Data residency\u0022 section of the security overview article for moreinformation about data location and privacy.Administrator permissionsWhen you open the search service overview page, the Azure role assigned to youraccount determines what portal content is available to you.\r\nThe overview page at thebeginning of the article shows the portal content available to an Owner or Contributor.Azure roles used for service administration include:OwnerContributor (same as Owner, minus the ability to assign roles)Reader (provides access to service information in the Essentials section and in theMonitoring tab)By default, all search services start with at least one Owner. Owners, serviceadministrators, and co-administrators have permission to create other administratorsand other role assignments.Also by default, search services start with API keys for content-related tasks that anOwner or Contributor might perform in the portal. However, it\u0027s possible to turn off APIkey authentication and use Azure role-based access control exclusively. If you turn offAPI keys, be sure to set up data access role assignments so that all features in the portalremain operational.Review monitoring capabilities available in the portalAutomate with PowerShell or Azure CLIReview security features to protect content and operationsEnable resource logging to monitor query and indexing workloads TipBy default, any owner or administrator can create or delete services. To preventaccidental deletions, you can lock resources.\n"
}