{
  "Id": "1494",
  "Title": "\u0022Managing Azure AI Search: REST API, Permissions, and Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo fully administer your service programmatically, you work with two APIs: theManagement REST API of Azure AI Search documented here, plus the common AzureResource Manager REST API. The Resource Manager API is used for general-purposeoperations that aren\u0027t service specific, such as querying subscription data, listing geo-locations, and so forth.REST API docs are now versioned. When you open an API reference page, select the APIversion from the dropdown filter.Administration rights are conveyed through built-in roles in Microsoft Entra ID:Owner or Contributor assignments are required for most tasks.\r\nReader role has limited access to service information (GET operations, except forAPI keys which require Owner or Contributor permissions).Versioned API docsPermissions and access controlFor more information, see Use role-based access controls in Azure AI Search.A best practice is to assign roles to groups rather than individual users.\r\nAn Azuresubscription owner or global administrator manages these assignments. For moreinformation, see Assign Microsoft Entra roles to groups.When setting up the connection, start with the Resource Manager endpointhttps://management.azure.com and then add the subscription ID, provider(Microsoft.Search), and API version. Operations are specified in the body of the request.\r\nA fully specified endpoint has the following components:HTTPThe following clients are commonly used to call the management REST APIs:ClientInstructions and examplesAzure PowerShell using the Az.Search moduleManage Azure AI Search using Azure PowerShellAzure Command-Line Interface (CLI)Manage Azure AI Search using the Azure CLIPostmanManage Azure AI Search using RESTYou can also manage a search service using the Azure portal. The REST APIs are foundational to Azure AI Search, and any changes to theprogramming model are reflected in the REST APIs first.Alternatives include the following Azure SDKs, which are independently updated onseparate release schedules:Microsoft Azure AI Search management client library for .\n"
}