{
  "Id": "959",
  "Title": "\u0022Managing Data Change and Deletion Policies in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf957Z\u0022,                 \u0022endTime\u0022:\u00222022-02-21T00:36:47.752Z\u0022,                 \u0022errors\u0022:[],                 \u0022itemsProcessed\u0022:1599501,                 \u0022itemsFailed\u0022:0,                 \u0022initialTrackingState\u0022:null,                 \u0022finalTrackingState\u0022:null             },             .\r\n.. earlier history items         ]     } Indexing new and changed documentsis used on your data.For Azure Cosmos DB indexers, the only supported policy is theHighWaterMarkChangeDetectionPolicy using the _ts (timestamp) property provided byAzure Cosmos DB.The following example shows a data source definition with a change detection policy:HTTPWhen rows are deleted from the collection, you normally want to delete those rowsfrom the search index as well. The purpose of a data deletion detection policy is toefficiently identify deleted data items.\r\nCurrently, the only supported policy is the SoftDelete policy (deletion is marked with a flag of some sort), which is specified in the datasource definition as follows:HTTPIf you\u0027re using a custom query, make sure that the property referenced bysoftDeleteColumnName is projected by the query.The following example creates a data source with a soft-deletion policy:HTTP\u0022dataChangeDetectionPolicy\u0022: {     \u0022@odata.type\u0022: \u0022#Microsoft.Azure.\r\nSearch.HighWaterMarkChangeDetectionPolicy\u0022, \u0022  highWaterMarkColumnName\u0022: \u0022_ts\u0022 }, Indexing deleted documents\u0022dataDeletionDetectionPolicy\u0022\u0022: {     \u0022@odata.type\u0022 : \u0022#Microsoft.Azure.Search.SoftDeleteColumnDeletionDetectionPolicy\u0022,     \u0022softDeleteColumnName\u0022 : \u0022the property that specifies whether a document was deleted\u0022,     \u0022softDeleteMarkerValue\u0022 : \u0022the value that identifies a document as deleted\u0022 } POST https://[service name]. search.windows.net/datasources?api-version=2020-06-30 Content-Type: application/json api-key: [Search service admin key] You can now control how you run the indexer, monitor status, or schedule indexerexecution.\n"
}