{
  "Id": "449",
  "Title": "\u0022Managing Index Size and Attributes in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can monitor index size in the Indexes tab in the Azure portal, or by issuing a GETINDEX request against your search service. You can also issue a Service Statistics requestand check the value of storage size.The size of an index is determined by:Quantity and composition of your documentsAttributes on individual fieldsIndex configuration (specifically, whether you include suggesters)Document composition and quantity are determined by what you choose to import.Remember that a search index should only contain searchable content. If source dataincludes binary fields, omit those fields unless you\u0027re using AI enrichment to crack andanalyze the content to create text searchable information.\r\nField attributes determine behaviors. To support those behaviors, the indexing processcreates the necessary data structures. For example, \u0022searchable\u0022 invokes full text search,which scans inverted indices for the tokenized term. In contrast, a \u0022filterable\u0022 or\u0022sortable\u0022 attribute supports iteration over unmodified strings. The example in the nextsection shows variations in index size based on the selected attributes.Suggesters are constructs that support type-ahead or autocomplete queries. As such,when you include a suggester, the indexing process creates the data structures７ NoteThe APIs you use to build an index have varying default behaviors.\r\nFor the RESTAPIs, most attributes are enabled by default (for example, \u0022searchable\u0022 and\u0022retrievable\u0022 are true for string fields) and you often only need to set them if youwant to turn them off. For the .NET SDK, the opposite is true. On any property youdo not explicitly set, the default is to disable the corresponding search behaviorunless you specifically enable it. Physical structure and sizenecessary for verbatim character matches. Suggesters are implemented at the field level,so choose only those fields that are reasonable for type-ahead.The following screenshot illustrates index storage patterns resulting from variouscombinations of attributes.\n"
}