{
  "Id": "278",
  "Title": "\u0022Managing Azure Resources and Indexing Encrypted Documents Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can also use the portal to delete indexes, indexers, and data sources.When you\u0027re working in your own subscription, at the end of a project, it\u0027s a good ideato remove the resources that you no longer need. Resources left running can cost youmoney. You can delete resources individually or delete the resource group to delete theentire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.Now that you\u0027re familiar with the concept of ingesting data from multiple sources, let\u0027stake a closer look at indexer configuration, starting with Azure Cosmos DB.\r\nReset and rerunClean up resourcesNext stepsConfigure an Azure Cosmos DB indexerTutorial: Index and enrich encryptedblobs for full-text search in Azure AISearchArticle•11/15/2023This tutorial shows you how to use Azure AI Search to index documents that have beenpreviously encrypted with a customer-managed key in Azure Blob Storage.\r\nNormally, an indexer can\u0027t extract content from encrypted files because it doesn\u0027t haveaccess to the customer-managed encryption key in Azure Key Vault. However, byleveraging the DecryptBlobFile custom skill, followed by the Document Extraction skill,you can provide controlled access to the key to decrypt the files and then extractcontent from them.\r\nThis unlocks the ability to index and enrich these documentswithout compromising the encryption status of your stored documents.Starting with previously encrypted whole documents (unstructured text) such as PDF,HTML, DOCX, and PPTX in Azure Blob Storage, this tutorial uses Postman and the SearchREST APIs to perform the following tasks:If you don\u0027t have an Azure subscription, open a free account before you begin. Azure AI Search on any tier or region.Azure Storage, Standard performance (general-purpose v2)Blobs encrypted with a customer-managed key. See Tutorial: Encrypt and decryptblobs using Azure Key Vault if you need to create sample data.Azure Key Vault in the same subscription as Azure AI Search.\n"
}