{
  "Id": "783",
  "Title": "\u0022Managing Synonym Maps in Azure Search: Best Practices and Implementation\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHTTP{ \u0022format\u0022:\u0022solr\u0022, \u0022synonyms\u0022: \u0022WA\\\\, USA, WA, Washington\u0022 } Upload and manage synonym mapsAssign synonyms to fieldsPOST /indexes?api-version=2020-06-30 {     \u0022name\u0022:\u0022hotels-sample-index\u0022,    \u0022fields\u0022:[         {             \u0022name\u0022:\u0022description\u0022,            \u0022type\u0022:\u0022Edm.String\u0022,             \u0022searchable\u0022:true,             \u0022synonymMaps\u0022:[             \u0022en-synonyms\u0022             ]         },         {             \u0022name\u0022:\u0022description_fr\u0022,             \u0022type\u0022:\u0022Edm.\r\nString\u0022,             \u0022searchable\u0022:true,             \u0022analyzer\u0022:\u0022fr.microsoft\u0022,             \u0022synonymMaps\u0022:[             \u0022fr-synonyms\u0022 Adding synonyms doesn\u0027t impose new requirements on query construction. You canissue term and phrase queries just as you did before the addition of synonyms.\r\nThe onlydifference is that if a query term exists in the synonym map, the query engine will eitherexpand or rewrite the term or phrase, depending on the rule.Synonyms are a query expansion technique that supplements the contents of an indexwith equivalent terms, but only for fields that have a synonym assignment.\r\nIf a field-scoped query excludes a synonym-enabled field, you won\u0027t see matches from thesynonym map.For synonym-enabled fields, synonyms are subject to the same text analysis as theassociated field. For example, if a field is analyzed using the standard Lucene analyzer,synonym terms will also be subject to the standard Lucene analyzer at query time. If youwant to preserve punctuation, such as periods or dashes, in the synonym term, apply acontent-preserving analyzer on the field.Internally, the synonyms feature rewrites the original query with synonyms with the ORoperator. For this reason, hit highlighting and scoring profiles treat the original term andsynonyms as equivalent.\n"
}