{
  "Id": "1432",
  "Title": "\u0022Managing Azure Search Identities and Connections: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfScenarioSystem managedidentityUser-assigned managedidentity (preview)Indexer connections to supported Azuredata sources YesYesAzure Key Vault for customer-managedkeysYesYesDebug sessions (hosted in AzureStorage) YesNoPrerequisitesSupported scenarios11ScenarioSystem managedidentityUser-assigned managedidentity (preview)Enrichment cache (hosted in AzureStorage)  YesYesKnowledge Store (hosted in AzureStorage) YesYesCustom skills (hosted in AzureFunctions or equivalent)YesYes For connectivity between search and storage, your network security configurationimposes constraints on which type of managed identity you can use.\r\nOnly a systemmanaged identity can be used for a same-region connection to storage via the trustedservice exception or resource instance rule.\r\nSee Access to a network-protected storageaccount for details. One method for specifying an enrichment cache is in the Import data wizard. Currently,the wizard doesn\u0027t accept a managed identity connection string for enrichment cache.However, after the wizard completes, you can update the connection string in theindexer JSON definition to specify either a system or user-assigned managed identity,and then rerun the indexer.When a system-assigned managed identity is enabled, Azure creates an identity for yoursearch service that can be used to authenticate to other Azure services within the sametenant and subscription.\r\nYou can then use this identity in Azure role-based accesscontrol (Azure RBAC) assignments that allow access to data during indexing.A system-assigned managed identity is unique to your search service and bound to theservice for its lifetime.1. Sign in to Azure portal and find your search service.2. Under Settings, select Identity.3. On the System assigned tab, under Status, select On. 4. Select Save.1,2112Create a system managed identityAzure portalAfter saving, you\u0027ll see an object identifier that\u0027s been assigned to your searchservice.A user-assigned managed identity is a resource on Azure. It\u0027s useful if you need moregranularity in role assignments because you can create separate identities for differentapplications and scenarios.\nCreate a user-assigned managed identity(preview)） ImportantThis feature is in public preview under supplemental terms of use. User-assignedmanaged identities aren\u0027t currently supported for connections to a network-1. Sign in to Azure portal2. Select \u002B Create a resource.3.\n"
}