{
  "Id": "1381",
  "Title": "\u0022Managing Private Endpoints in Azure CLI: Complete Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure CLIFor more information on creating private endpoints in Azure CLI, see this Private LinkQuickstartIn addition to creating a private endpoint connection, you can also show, update, anddelete the connection.\r\nTo retrieve a private endpoint connection and to see its status, use az search private-endpoint-connection show.\r\nAzure CLIaz network private-endpoint create \\    --name \u003Cprivate-endpoint-name\u003E \\    --resource-group \u003Cprivate-endpoint-resource-group-name\u003E \\    --vnet-name \u003Cvirtual-network-name\u003E \\    --subnet \u003Csubnet-name\u003E \\    --private-connection-resource-id $id \\    --group-id searchService \\    --connection-name \u003Cprivate-link-connection-name\u003E  ## Create private DNS zoneaz network private-dns zone create \\    --resource-group \u003Cprivate-dns-resource-group-name\u003E \\    --name \u0022privatelink.search.windows.\r\nnet\u0022## Create DNS network linkaz network private-dns link vnet create \\    --resource-group \u003Cprivate-dns-resource-group-name\u003E \\    --zone-name \u0022privatelink.search.windows.net\u0022 \\    --name \u0022myLink\u0022 \\    --virtual-network \u003Cvirtual-network-name\u003E \\    --registration-enabled false## Create DNS zone groupaz network private-endpoint dns-zone-group create \\   --resource-group \u003Cprivate-endpoint-resource-group-name\u003E\\   --endpoint-name \u003Cprivate-endpoint-name\u003E \\   --name \u0022myZoneGroup\u0022 \\   --private-dns-zone \u0022privatelink.\r\nsearch.windows.net\u0022 \\   --zone-name \u0022searchServiceZone\u0022Manage private endpoint connectionsaz search private-endpoint-connection show \\    --name \u003Cpe-connection-name\u003E \\To update the connection, use az search private-endpoint-connection update. Thefollowing example sets a private endpoint connection to rejected:Azure CLITo delete the private endpoint connection, use az search private-endpoint-connectiondelete.Azure CLITo roll over admin API keys, use az search admin-key renew. Two admin keys arecreated with each service for authenticated access. Keys are required on every request.Both admin keys are functionally equivalent, granting full write access to a search servicewith the ability to retrieve any information, or create and delete any object. Two keysexist so that you can use one while replacing the other.\n"
}