{
  "Id": "448",
  "Title": "\u0022Managing Indexes and Fields in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022sortable\u0022By default the system sorts results by score, but you can configure sort based onfields in the documents. Fields of type Collection(Edm.String) can\u0027t be \u0022sortable\u0022.\u0022facetable\u0022Typically used in a presentation of search results that includes a hit count bycategory (for example, hotels in a specific city).\r\nThis option can\u0027t be used with fieldsof type Edm.GeographyPoint. Fields of type Edm.String that are filterable,\u0022sortable\u0022, or \u0022facetable\u0022 can be at most 32 kilobytes in length. For details, seeCreate Index (REST API).\u0022key\u0022Unique identifier for documents within the index. Exactly one field must be chosenas the key field and it must be of type Edm.\r\nString.\u0022retrievable\u0022Determines whether the field can be returned in a search result. This is useful whenyou want to use a field (such as profit margin) as a filter, sorting, or scoringmechanism, but don\u0027t want the field to be visible to the end user. This attributemust be true for key fields.\r\nAlthough you can add new fields at any time, existing field definitions are locked in forthe lifetime of the index. For this reason, developers typically use the portal for creatingsimple indexes, testing ideas, or using the portal pages to look up a setting. FrequentField attributesiteration over an index design is more efficient if you follow a code-based approach sothat you can rebuild the index easily.\r\nIn Azure Cognitive Search, the physical structure of an index is largely an internalimplementation. You can access its schema, query its content, monitor its size, andmanage capacity, but the clusters themselves (indices, shards, and other files andfolders) are managed internally by Microsoft. You can monitor index size in the Indexes tab in the Azure portal, or by issuing a GETINDEX request against your search service. You can also issue a Service Statistics requestand check the value of storage size.The size of an index is determined by:Quantity and composition of your documentsAttributes on individual fieldsIndex configuration (specifically, whether you include suggesters)Document composition and quantity are determined by what you choose to import.Remember that a search index should only contain searchable content. If source dataincludes binary fields, omit those fields unless you\u0027re using AI enrichment to crack andanalyze the content to create text searchable information.\n"
}