{
  "Id": "283",
  "Title": "\u0022Managing Encrypted Blob Data in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfdatasource-nameLeave as encrypted-blobs-ds.VariableWhere to get itindex-nameLeave as encrypted-blobs-idx.skillset-nameLeave as encrypted-blobs-ss.indexer-nameLeave as encrypted-blobs-ixr.In this section, you\u0027ll issue four HTTP requests:PUT request to create the index: This search index holds the data that Azure AISearch uses and returns.\r\nPOST request to create the data source: This data source specifies the connectionto your storage account containing the encrypted blob files.PUT request to create the skillset: The skillset specifies the custom skill definitionfor the Azure Function that will decrypt the blob file data, and aDocumentExtractionSkill to extract the text from each document after it has beendecrypted.PUT request to create the indexer: Running the indexer retrieves the blobs, appliesthe skillset, and indexes and stores the results. You must run this request last. Thecustom skill in the skillset invokes the decryption logic.\r\nTo issue the requests, in Postman, select the tab for the requests and select Send foreach of them.Indexing and enrichment commence as soon as you submit the Create Indexer request.Depending on how many documents are in your storage account, indexing can take awhile.\r\nTo find out whether the indexer is still running, use the Get Indexer Status requestprovided as part of the Postman collection and review the response to learn whether theindexer is running, or to view error and warning information.If you are using the Free tier, the following message is expected: \u0022Could not extractcontent or metadata from your document. Truncated extracted text to \u002732768\u0027characters\u0022. This message appears because blob indexing on the Free tier has a 32Klimit on character extraction. You won\u0027t see this message for this data set on higher tiers.Review and run each request3 - Monitor indexingAfter indexer execution is finished, you can run some queries to verify that the data hasbeen successfully decrypted and indexed. Navigate to your Azure AI Search service inthe portal, and use the search explorer to run queries over the indexed data.When you\u0027re working in your own subscription, at the end of a project, it\u0027s a good ideato remove the resources that you no longer need. Resources left running can cost youmoney.\n"
}