{
  "Id": "689",
  "Title": "\u0022Managing Index Aliases in Azure AI Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAlternatively, you can create an index alias that serves as a stable reference in yourapplication code. Instead of updating your code, you can update an index alias to pointto newer index versions.To minimize churn in the design process, the following table describes which elementsare fixed and flexible in the schema.\r\nChanging a fixed element requires an index rebuild,whereas flexible elements can be changed at any time without impacting the physicalimplementation.ElementCan be updated?NameNoKeyNoField names and typesNoField attributes(searchable, filterable,facetable, sortable)NoField attribute(retrievable)YesAnalyzerYou can add and modify custom analyzers in the index.\r\nRegardinganalyzer assignments on string fields, you can only modifysearchAnalyzer. All other assignments and modifications require arebuild.Allowed updates on existing indexesElementCan be updated?Scoring profilesYesSuggestersNocross-origin remotescripting (CORS)YesEncryptionYesUse the following links to become familiar with loading an index with data, or extendingan index with a synonyms map.\r\nData import overviewAdd, Update or Delete Documents (REST)Synonym mapsNext stepsCreate an index alias in Azure AI SearchArticle•11/15/2023In Azure AI Search, an index alias is a secondary name that can be used to refer to anindex for querying, indexing, and other operations. You can create an alias that maps toa search index and substitute the alias name in places where you would otherwisereference an index name. An alias adds flexibility if you need to change which index yourapplication is pointing to. Instead of updating the references in your application, youcan just update the mapping for your alias.The main goal of index aliases is to make it easier to manage your production indexes.For example, if you need to make a change to your index definition, such as editing afield or adding a new analyzer, you\u0027ll have to create a new search index because allsearch indexes are immutable.\n"
}