{
  "Id": "1496",
  "Title": "\u0022Managing Azure Cognitive Search: Queries, Indexes, and Enrichment\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUse the Azure.Search.Documents client library to:Submit queries for simple and advanced query forms that include fuzzy search,wildcard search, regular expressions.Implement filtered queries for faceted navigation, geospatial search, or to narrowresults based on filter criteria.Create and manage search indexes.Upload and update documents in the search index.\r\nCreate and manage indexers that pull data from Azure into an index.Create and manage skillsets that add AI enrichment to data ingestion.Create and manage analyzers for advanced text analysis or multi-lingual content.Optimize results through scoring profiles to factor in business logic or freshness.\r\nSource code | Package (NuGet) | API reference documentation | REST APIdocumentation | Product documentation | SamplesGetting startedInstall the packageInstall the Azure Cognitive Search client library for .NET with NuGet:.NET CLIYou need an Azure subscription and a search service to use this package.To create a new search service, you can use the Azure portal, Azure PowerShell, or theAzure CLI.\r\nHere\u0027s an example using the Azure CLI to create a free instance for gettingstarted:PowershellSee choosing a pricing tier for more information about available options.To interact with the Search service, you\u0027ll need to create an instance of the appropriateclient class: SearchClient for searching indexed documents, SearchIndexClient formanaging indexes, or SearchIndexerClient for crawling data sources and loading searchdocuments into an index. To instantiate a client object, you\u0027ll need an endpoint and APIkey. You can refer to the documentation for more information on supportedauthenticating approaches with the Search service. You can get the endpoint and an API key from the Search service in the Azure Portal.Please refer the documentation for instructions on how to get an API key.Alternatively, you can use the following Azure CLI command to retrieve the API key fromthe Search service:Powershelldotnet add package Azure.Search.\n"
}