{
  "Id": "845",
  "Title": "\u0022Managing Azure Data Sources with Managed Identities: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe REST API, Azure portal, and the .NET SDK support using a system-assignedmanaged identity.When you\u0027re connecting with a system-assigned managed identity, the only change tothe data source definition is the format of the \u0022credentials\u0022 property. You\u0027ll provide thedatabase name and a ResourceId that has no account key or password. The ResourceIdmust include the subscription ID of Azure Cosmos DB, the resource group, and theAzure Cosmos DB account name.For SQL collections, the connection string doesn\u0027t require \u0022ApiKind\u0022.For SQL collections add \u0022IdentityAuthType=AccessToken\u0022 if RBAC is enforced asthe only authentication method.\r\nIt is not applicable for MongoDB and Gremlincollections.For MongoDB collections, add \u0022ApiKind=MongoDb\u0022 to the connection string anduse a preview REST API.For Gremlin graphs, add \u0022ApiKind=Gremlin\u0022 to the connection string and use apreview REST API.Here\u0027s an example of how to create a data source to index data from a storage accountusing the Create Data Source REST API and a managed identity connection string.\r\nTheCreate the data sourceSystem-assigned managed identitymanaged identity connection string format is the same for the REST API, .NET SDK, andthe Azure portal.HTTPThe 2021-04-30-preview REST API supports connections based on a user-assignedmanaged identity. When you\u0027re connecting with a user-assigned managed identity,there are two changes to the data source definition:First, the format of the \u0022credentials\u0022 property is the database name and aResourceId that has no account key or password. The ResourceId must include thesubscription ID of Azure Cosmos DB, the resource group, and the Azure CosmosDB account name.For SQL collections, the connection string doesn\u0027t require \u0022ApiKind\u0022.For SQL collections add \u0022IdentityAuthType=AccessToken\u0022 if RBAC is enforced asthe only authentication method. It is not applicable for MongoDB and Gremlincollections.\n"
}