{
  "Id": "1016",
  "Title": "\u0022Managing Azure AI Service Keys and Billing for Skillsets\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWithout the key, the skillset reverts to the default allocation of 20 freetransactions per indexer, per day. Execution of billable skills stops at 20 transactions anda \u0022Time Out\u0022 message appears in indexer execution history when the allocation is usedup.Remove the keyAzure portal1.\r\nSign in to the Azure portal and open the search service Overview page.2. Under Skillsets, select the skillset containing the key you want to remove.3. Scroll to the end of the file.4. Remove the key from the JSON and save the skillset.Key-based billing applies when API calls to Azure AI services resources exceed 20 APIcalls per indexer, per day.\r\nThe key is used for billing, but not for enrichment operations\u0027 connections. Forconnections, a search service connects over the internal network to an Azure AI servicesresource that\u0027s colocated in the same physical region. Most regions that offer Azure AISearch also offer other Azure AI services such as Language. If you attempt AI enrichmentin a region that doesn\u0027t have both services, you\u0027ll see this message: \u0022Provided key isn\u0027t avalid CognitiveServices type key for the region of your search service.\u0022Currently, billing for built-in skills requires a public connection from Azure AI Search toanother Azure AI service. Disabling public network access breaks billing. If disablingpublic networks is a requirement, you can configure a Custom Web API skillimplemented with an Azure Function that supports private endpoints and add the AzureAI services resource to the same VNET. In this way, you can call Azure AI servicesresource directly from the custom skill using private endpoints.Custom Entity Lookup is metered by Azure AI Search, not Azure AI services, but itrequires an Azure AI multi-service resource key to unlock transactions beyond 20 perindexer, per day. For this skill only, the resource key unblocks the number oftransactions, but is unrelated to billing.\n"
}