{
  "Id": "1017",
  "Title": "\u0022Managing Billing and Access for Azure AI Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDisabling public network access breaks billing. If disablingpublic networks is a requirement, you can configure a Custom Web API skillimplemented with an Azure Function that supports private endpoints and add the AzureAI services resource to the same VNET. In this way, you can call Azure AI servicesresource directly from the custom skill using private endpoints.Custom Entity Lookup is metered by Azure AI Search, not Azure AI services, but itrequires an Azure AI multi-service resource key to unlock transactions beyond 20 perindexer, per day. For this skill only, the resource key unblocks the number oftransactions, but is unrelated to billing.\r\nAI enrichment offers a small quantity of free processing of billable enrichments so thatyou can complete short exercises without having to attach an Azure AI multi-serviceresource. Free enrichments are 20 documents per day, per indexer. You can reset theindexer to reset the counter if you want to repeat an exercise.Some enrichments are always free:How the key is used７ NoteSome built-in skills are based on non-regional Azure AI services (for example, theText Translation Skill). Using a non-regional skill means that your request might beserviced in a region other than the Azure AI Search region.\r\nFor more information onnon-regional services, see the Azure AI services product by region page.Key requirements special casesFree enrichmentsUtility skills that don\u0027t call Azure AI services (namely, Conditional, DocumentExtraction, Shaper, Text Merge, and Text Split skills) aren\u0027t billable.Text extraction from PDF documents and other application files is nonbillable. Textextraction occurs during the document cracking phase and isn\u0027t technically anenrichment, but it occurs during AI enrichment and is thus noted here.During AI enrichment, Azure AI Search calls the Azure AI services APIs for built-in skillsthat are based on Azure AI Vision, Translator, and Azure AI Language.\n"
}