{
  "Id": "536",
  "Title": "\u0022Managing Azure Search Connections and Security Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027re using custom skills, custom skills connect to an external Azure function orapp to run external code that\u0027s hosted off-service. The request for externalprocessing is sent during skillset execution.If you\u0027re using integrated vectorization, the search service connects to AzureOpenAI and a deployed embedding model, or it goes through a custom skill toconnect to an embedding model that you provide. The search service sends text toembedding models for vectorization during indexing or query execution.If you\u0027re using customer-managed keys, the service connects to an external AzureKey Vault for a customer-managed key used to encrypt and decrypt sensitive data.\r\nOutbound connections can be made using a resource\u0027s full access connection string thatincludes a key or a database login, or a managed identity if you\u0027re using Microsoft EntraID and role-based access.For Azure resources behind a firewall, create inbound rules that admit search servicerequests.\r\nFor Azure resources protected by Azure Private Link, create a shared private link that anindexer uses to make its connection.If Azure Storage and Azure AI Search are in the same region, network traffic is routedthrough a private IP address and occurs over the Microsoft backbone network. Becauseprivate IP addresses are used, you can\u0027t configure IP firewalls or a private endpoint fornetwork security. Configure same-region connections using either of the following approaches:Trusted service exceptionOutbound trafficException for same-region search and storage servicesResource instance rulesInternal requests are secured and managed by Microsoft. You can\u0027t configure or controlthese connections. If you\u0027re locking down network access, no action on your part isrequired because internal traffic isn\u0027t customer-configurable.Internal traffic consists of:Service-to-service calls for tasks like authentication and authorization throughMicrosoft Entra ID, resource logging sent to Azure Monitor, and private endpointconnections that utilize Azure Private Link.Requests made to Azure AI services APIs for built-in skills.\n"
}