{
  "Id": "1524",
  "Title": "\u0022Managing Azure Search Services: Setup, Authentication, and Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfjsLatest versions of Safari, Chrome, Edge, and Firefox.See our support policy for more details.An Azure subscriptionA Search serviceTo create a new search service, you can use the Azure portal, Azure PowerShell, or theAzure CLI. Here\u0027s an example using the Azure CLI to create a free instance for gettingstarted:PowershellSee choosing a pricing tier for more information about available options.All requests to a search service need an API key that was generated specifically for yourservice. The API key is the sole mechanism for authenticating access to your searchservice endpoint.\r\nYou can obtain your api-key from the Azure portal or via the Azure CLI:Getting startedInstall the @azure/search-documents packagenpm install @azure/search-documentsCurrently supported environmentsPrerequisitesaz search service create --name \u003Cmysearch\u003E --resource-group \u003Cmysearch-rg\u003E --sku free --location westusAuthenticate the clientPowerShellAlternatively, you can get the endpoint and Admin Key from the resource information inthe Azure Portal.\r\nThere are two types of keys used to access your search service: admin (read-write) andquery (read-only) keys. Restricting access and operations in client apps is essential tosafeguarding the search assets on your service. Always use a query key rather than anadmin key for any query originating from a client app.\r\nNote: The example Azure CLI snippet above retrieves an admin key so it\u0027s easier to getstarted exploring APIs, but it should be managed carefully. Once you have an api-key, you can use it as follows:JavaScriptTo authenticate in a National Cloud, you will need to make the following additions toyour client configuration:az search admin-key show --resource-group \u003Cyour-resource-group-name\u003E --service-name \u003Cyour-resource-name\u003Econst {  SearchClient,  SearchIndexClient,  SearchIndexerClient,  AzureKeyCredential,} = require(\u0022@azure/search-documents\u0022);// To query and manipulate documentsconst searchClient = new SearchClient(  \u0022\u003Cendpoint\u003E\u0022,  \u0022\u003CindexName\u003E\u0022,  new AzureKeyCredential(\u0022\u003CapiKey\u003E\u0022));\n"
}