{
  "Id": "1423",
  "Title": "\u0022Managing Shared Private Links in Azure Cognitive Search Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSql/managedInstance2020-08-01-PreviewIn addition, the specified groupId needs to be valid for the specified resource type.For example, groupId \u0022blob\u0022 is valid for type \u0022Microsoft.Storage/storageAccounts\u0022,it can\u0027t be used with any other resource type. For a given search management APIversion, customers can find out the supported groupId and resource type detailsby utilizing the List supported API.Quota limit enforcement: Search services have quotas imposed on the distinctnumber of shared private link resources that can be created and the number ofvarious target resource types that are being used (based on groupId).\r\nThese aredocumented in the Shared private link resource limits section of the AzureCognitive Search service limits page.A search service initiates the request to create a shared private link, but Azure ResourceManager performs the actual work. You can check the deployment\u0027s status in the portalor by query, and address any errors that might occur.\r\nShared private link resources that have failed Azure Resource Manager deployment willshow up in List and Get API calls, but will have a \u0022Provisioning State\u0022 of Failed. Oncethe reason of the Azure Resource Manager deployment failure has been ascertained,delete the Failed resource and re-create it after applying the appropriate resolutionfrom the following table. Deployment failurereasonDescriptionResolutionDeployment failuresDeployment failurereasonDescriptionResolution\u0022LinkedAuthorizationFailed\u0022The error message states that the client haspermission to create the shared private linkon the search service, but doesn\u0027t havepermission to perform action\u0027privateEndpointConnectionApproval/action\u0027on the linked scope.Re-check the privatelink ID in the requestto make sure there areno errors or omissionsin the URI. If AzureCognitive Search andthe Azure PaaSresource are indifferent subscriptions,and if you\u0027re usingREST or a commandline interface, makesure that the activeAzure account is forthe Azure PaaSresource.\n"
}