{
  "Id": "1461",
  "Title": "\u0022Managing Encryption Keys in Azure Key Vault: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can also use AzureSDKs. Portal support for adding a key to indexes or synonym maps isn\u0027t supported.Key Vault tips1 - Enable purge protectionTo prevent data loss caused by accidental Key Vault key deletions, soft-delete and purgeprotection must be enabled on the key vault.\r\nSoft-delete is enabled by default, so you\u0027llonly encounter issues if you purposely disabled it. Purge protection isn\u0027t enabled bydefault, but it\u0027s required for customer-managed key encryption in Cognitive Search.You can set both properties using the portal, PowerShell, or Azure CLI commands.1. Sign in to Azure portal and open your key vault overview page.2.\r\nOn the Overview page under Essentials, enable Soft-delete and Purgeprotection.Skip key generation if you already have a key in Azure Key Vault that you want to use,but collect the key identifier. You\u0027ll need this information when creating an encryptedobject.1. Sign in to Azure portal and open your key vault overview page.2.\r\nSelect Keys on the left, and then select \u002B Generate/Import.3. In the Create a key pane, from the list of Options, choose the method that youwant to use to create a key. You can Generate a new key, Upload an existing key,or use Restore Backup to select a backup of a key.4. Enter a Name for your key, and optionally select other key properties.5.\r\nSelect Create to start the deployment.6. Select the key, select the current version, and then make a note of the keyidentifier. It\u0027s composed of the key value Uri, the key name, and the key version.You\u0027ll need the identifier to define an encrypted index in Azure Cognitive Search.Azure portal2 - Create a key in Key VaultYou have several options for accessing the encryption key at run time. The simplestapproach is to retrieve the key using the managed identity and permissions of yoursearch service. You can use either a system or user-managed identity. Doing so allowsyou to omit the steps for application registration and application secrets, and simplifiesthe encryption key definition.\n"
}