{
  "Id": "1027",
  "Title": "\u0022Managing Azure Search Output and Custom Skills Integration Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen referring to the node in a downstream step (forexample, in key phrase extraction), you would use the path\u0022/document/orgs/*/companyDescription\u0022 to do so.JSON    }]Add a custom skillAlthough skill output can be optionally cached for reuse purposes, it\u0027s usually temporaryand exists only while skill execution is in progress.\r\nTo send output to a field in a search index, create an output field mapping in anindexer.To send output to a knowledge store, create a projection.To send output to a downstream skill, reference the output by its node name, suchas \u0022/document/organization\u0022, in the downstream skill\u0027s input source property. SeeReference an annotation for examples.Assemble a representative sample of your content in Blob Storage or anothersupported data source and run the Import data wizard.The wizard automates several steps that can be challenging the first time around. Itdefines the skillset, index, and indexer, including field mappings and output fieldmappings.\r\nIt will also define projections in a knowledge store if you\u0027re using one.{  \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Custom.WebApiSkill\u0022,  \u0022description\u0022: \u0022This skill calls an Azure function, which in turn calls custom code\u0022,  \u0022uri\u0022: \u0022https://indexer-e2e-webskill.azurewebsites.\r\nnet/api/InvokeCode?\r\ncode=foo\u0022,  \u0022httpHeaders\u0022: {      \u0022Ocp-Apim-Subscription-Key\u0022: \u0022foobar\u0022  },  \u0022context\u0022: \u0022/document/orgs/*\u0022,  \u0022inputs\u0022: [    {      \u0022name\u0022: \u0022query\u0022,      \u0022source\u0022: \u0022/document/orgs/*\u0022    }  ],  \u0022outputs\u0022: [    {      \u0022name\u0022: \u0022description\u0022,      \u0022targetName\u0022: \u0022companyDescription\u0022    }  ]}Send output to a destinationTips for a first skillsetFor some skills, such as OCR or image analysis, the wizard adds utility skills thatmerge the image and text content that was separated during document cracking.\n"
}