{
  "Id": "22",
  "Title": "\u0022Managing Indexes and Vector Search in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIndexing creates inverted indexes and other physical datastructures that support information retrieval.There\u0027s no native support for index management. Search indexes are considereddownstream data structures, accepting content from other data sources that collectoperational data. As such, there\u0027s no built-in support for backing up and restoringindexes because the expectation is that you would rebuild an index from source data ifyou deleted it, or wanted to move it.However, if you want to move an index between search services, you can try the index-backup-restore sample code in this Azure AI Search .NET sample repo.\r\nNo, if you delete an Azure AI Search index or service, it can\u0027t be recovered. When youdelete a search service, all indexes in the service are deleted permanently.If you\u0027re using the search indexer for Azure SQL Database, there are no restrictions onthe use of primary or secondary replicas as a data source when building an index fromscratch.\r\nHowever, refreshing an index with incremental updates (based on changedrecords) requires the primary replica. This requirement comes from SQL Database, whichguarantees change tracking on primary replicas only. If you try using secondary replicasfor an index refresh workload, there\u0027s no guarantee you get all of the data.\r\nVector search is a technique that finds the most similar documents by comparing theirvector representations. Since the goal of a vector representation is to capture theessential characteristics of an item in a numerical format, it can capture abstractconcepts and identify matches even if there are no explicit matches based on keywordsor tags. When a user performs a search, the query is summarized into a vectorrepresentation and the vector search engine identifies the most similar documents. ToCan I move, backup, and restore indexes?Can I restore my index or service once it\u0027sdeleted?Can I index from SQL Database replicas?VectorsWhat is vector search?improve efficiency on large databases, vector search often provides the approximatenearest neighbors for a query vector.\n"
}