{
  "Id": "89",
  "Title": "\u0022Managing Azure AI Search Resources and Knowledge Store Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFinally, you learned that can verify content by querying the index. In the end, what AzureAI Search provides is a searchable index, which you can query using either the simple orfully extended query syntax. An index containing enriched fields is like any other. If youwant to incorporate standard or custom analyzers, scoring profiles, synonyms, facetednavigation, geo-search, or any other Azure AI Search feature, you can certainly do so.When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created. Resources left running cancost you money.\r\nYou can delete resources individually or delete the resource group todelete the entire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.If you use a free service, remember that you\u0027re limited to three indexes, indexers, anddata sources. You can delete individual items in the portal to stay under the limit.You can create skillsets using the portal, .NET SDK, or REST API. To further yourknowledge, try the REST API using Postman and more sample data.\r\nClean up resourcesNext stepsTutorial: Extract text and structure from JSON blobs using REST APIsQuickstart: Create a knowledge store inthe Azure portalArticle•06/30/2023In this quickstart, you create a knowledge store that serves as a repository for outputgenerated from an AI enrichment pipeline in Azure Cognitive Search. A knowledge storemakes generated content available in Azure Storage for workloads other than search. First, you set up some sample data in Azure Storage. Next, you run the Import datawizard to create an enrichment pipeline that also generates a knowledge store. Theknowledge store contains original source content pulled from the data source (customerreviews of a hotel), plus AI-generated content that includes a sentiment label, keyphrase extraction, and text translation of non-English customer comments.\n"
}