{
  "Id": "322",
  "Title": "\u0022Managing Azure Resources and AI Enrichment Pipelines: A Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen you\u0027re working in your own subscription, at the end of a project, it\u0027s a good ideato remove the resources that you no longer need. Resources left running can cost youmoney. You can delete resources individually or delete the resource group to delete theentire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.Now that you\u0027re familiar with all of the objects in an AI enrichment pipeline, let\u0027s take acloser look at skillset definitions and individual skills.DELETE https://[YOUR-SERVICE-NAME].search.windows.\r\nnet/indexers/cog-search-demo-idxr?api-version=2020-06-30TakeawaysClean up resourcesNext stepsHow to create a skillsetTutorial: Use Python and AI to generatesearchable content from Azure blobsArticle•11/15/2023If you have unstructured text or images in Azure Blob Storage, an AI enrichment pipelinein Azure AI Search can extract information and create new content for full-text search orknowledge mining scenarios.\r\nIn this Python tutorial, you learn how to:If you don\u0027t have an Azure subscription, open a free account before you begin.This tutorial uses Python and the Search REST APIs to create a data source, index,indexer, and skillset.The indexer retrieves sample data in a blob container that\u0027s specified in the data sourceobject, and sends all enriched content to a search index.\r\nThe skillset is attached to the indexer. It uses built-in skills from Microsoft to find andextract information. Steps in the pipeline include Optical Character Recognition (OCR)on images, language detection on text, key phrase extraction, and entity recognition(organizations). New information created by the pipeline is stored in new fields in anindex. Once the index is populated, you can use the fields in queries, facets, and filters.Visual Studio Code with the Python extension and Python 3.7 or laterAzure StorageAzure AI SearchSet up a development environment＂Define a pipeline that uses OCR, language detection, and entity and key phraserecognition.＂Execute the pipeline to invoke transformations, and to create and load a searchindex.\n"
}