{
  "Id": "1512",
  "Title": "\u0022Managing Access and Operations in Azure Cognitive Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis allows for easieraccess when exploring APIs, but it should be managed carefully.There are two types of keys used to access your search service: admin (read-write)and query (read-only) keys. Restricting access and operations in client apps isessential to safeguarding the search assets on your service. Always use a query keyrather than an admin key for any query originating from a client app.The SDK provides three clients.SearchIndexClient for CRUD operations on indexes and synonym maps.SearchIndexerClient for CRUD operations on indexers, data sources, and skillsets.\r\nSearchClient for all document operations.To create a SearchIndexClient/SearchIndexAsyncClient, you will need the values of theAzure Cognitive Search service URL endpoint and admin key.JavaorJavaTo create a SearchIndexerClient/SearchIndexerAsyncClient, you will need the values ofthe Azure Cognitive Search service URL endpoint and admin key.JavaCreate a SearchIndexClientSearchIndexClient searchIndexClient = new SearchIndexClientBuilder()    .endpoint(ENDPOINT)    .credential(new AzureKeyCredential(API_KEY))    .buildClient();SearchIndexAsyncClient searchIndexAsyncClient = new SearchIndexClientBuilder()    .\r\nendpoint(ENDPOINT)    .credential(new AzureKeyCredential(API_KEY))    .buildAsyncClient();Create a SearchIndexerClientSearchIndexerClient searchIndexerClient = new SearchIndexerClientBuilder()    .endpoint(ENDPOINT)orJavaOnce you have the values of the Azure Cognitive Search service URL endpoint andadmin key, you can create the SearchClient/SearchAsyncClient with an existing indexname:JavaorJavaYou can also create a SearchClient, SearchIndexClient, or SearchIndexerClient usingAzure Active Directory (AAD) authentication. Your user or service principal must beassigned the \u0022Search Index Data Reader\u0022 role. Using the DefaultAzureCredential youcan authenticate a service using Managed Identity or a service principal, authenticate asa developer working on an application, and more all without changing code. Please refer    .credential(new AzureKeyCredential(API_KEY))    .buildClient();SearchIndexerAsyncClient searchIndexerAsyncClient = new SearchIndexerClientBuilder()    .\n"
}