{
  "Id": "1373",
  "Title": "\u0022Managing Azure Search Resources with PowerShell Commands\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf that isn\u0027t feasible, youmight consider reducing capacity incrementally, one replica and partition at a time, untilyour new target levels are reached.Primary                    Secondary-------                    ---------\u003Calphanumeric-guid\u003E        \u003Calphanumeric-guid\u003E  Create or delete query keysNew-AzSearchQueryKey -ResourceGroupName \u003Csearch-service-resource-group-name\u003E -ServiceName \u003Csearch-service-name\u003E -Name \u003Cquery-key-name\u003E Scale replicas and partitionsOnce you submit the command, there is no way to terminate it midway through. You willhave to wait until the command is finished before revising the counts.\r\nAzure PowerShellResults should look similar to the following output.Private endpoints of secured resources that are created through Azure AI Search APIsare referred to as shared private link resources. This is because you\u0027re \u0022sharing\u0022 access toa resource, such as a storage account, that has been integrated with the Azure PrivateLink service.If you\u0027re using an indexer to index data in Azure AI Search, and your data source is on aprivate network, you can create an outbound private endpoint connection to reach thedata.A full list of the Azure Resources for which you can create outbound private endpointsfrom Azure AI Search can be found here along with the related Group ID values.\r\nNew-AzSearchSharedPrivateLinkResource is used to create the shared private linkresource. Keep in mind that some configuration may be required for the data sourcebefore running this command. Azure PowerShellSet-AzSearchService -ResourceGroupName \u003Csearch-service-resource-group-name\u003E -Name \u003Csearch-service-name\u003E -PartitionCount 6 -ReplicaCount 6ResourceGroupName : demo-westusName              : my-demo-searchappLocation          : West USSku               : StandardReplicaCount      : 6PartitionCount    : 6HostingMode       : DefaultId                : /subscriptions/65a1016d-0f67-45d2-b838-b8f373d6d52e/resourceGroups/demo-westus/providers/Microsoft.\n"
}