{
  "Id": "347",
  "Title": "\u0022Managing Resources and Custom Analyzers in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.If you\u0027re using a free service, remember that you\u0027re limited to three indexes, indexers,and data sources. You can delete individual items in the portal to stay under the limit.This tutorial touched on various aspects of skillset definition and processing.\r\nTo learnmore about concepts and workflows, refer to the following articles:How to map skillset output fields to fields in a search indexSkillsets in Azure Cognitive SearchHow to configure caching for incremental enrichmentNext stepsTutorial: Create a custom analyzer forphone numbersArticle•11/28/2023Analyzers are a key component in any search solution.\r\nTo improve the quality of searchresults, it\u0027s important to understand how analyzers work and impact these results.In some cases, like with a free text field, simply selecting the correct language analyzerwill improve search results. However, some scenarios such as accurately searchingphone numbers, URLs, or emails may require the use of custom analyzers.This tutorial uses Postman and Azure AI Search\u0027s REST APIs to:The following services and tools are required for this tutorial.Postman appCreate or find an existing search serviceSource code for this tutorial is in the custom-analyzers folder in the Azure-Samples/azure-search-postman-samples GitHub repository.\r\nTo complete this tutorial, you\u0027ll need an Azure AI Search service, which you can create inthe portal. You can use the Free tier to complete this walkthrough.For the next step, you\u0027ll need to know the name of your search service and its API Key. Ifyou\u0027re unsure how to find those items, check out this REST quickstart. Show how analyzers work＂Define a custom analyzer for searching phone numbers＂Test how the custom analyzer tokenizes text＂Create separate analyzers for indexing and searching to further improve results＂PrerequisitesDownload files1 - Create an Azure AI Search service2 - Set up PostmanNext, start Postman and import the collection you downloaded from Azure-Samples/azure-search-postman-samples.\n"
}