{
  "Id": "527",
  "Title": "\u0022Managing Azure Storage Projections for Data Consistency and Consumption\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAs sourcedata is updated and reindexed, projections are updated with the results of theenrichments, ensuring your projections are eventually consistent with the data in yourdata source. However, projections are also independently stored in Azure Storage.\r\nTheywill not be deleted when the indexer or the search service itself is deleted.After the indexer is run, connect to projections and consume the data in other apps andworkloads.Use Azure portal to verify object creation and content in Azure Storage.Use Power BI for data exploration. This tool works best when the data is in AzureTable Storage.\r\nWithin Power BI, you can manipulate data into new tables that areeasier to query and analyze.Use enriched data in blob container in a data science pipeline. For example, youcan load the data from blobs into a Pandas DataFrame.Finally, if you need to export your data from the knowledge store, Azure DataFactory has connectors to export the data and land it in the database of yourchoice.\r\n\u0022source\u0022: \u0022/document/reviews_text\u0022         },          {           \u0022name\u0022: \u0022reviews_title\u0022,           \u0022source\u0022: \u0022/document/reviews_title\u0022         },         {           \u0022name\u0022: \u0022reviews_username\u0022,           \u0022source\u0022: \u0022/document/reviews_username\u0022         },     ],     \u0022outputs\u0022: [       {         \u0022name\u0022: \u0022output\u0022,         \u0022targetName\u0022: \u0022mytableprojection\u0022       }     ] } Projection lifecycleConsume in appsRecall that projections are exclusive to knowledge stores, and are not used to structure asearch index.\r\n1. In Azure Storage, get a connection string from Access Keys and verify the accountis StorageV2 (general purpose V2).2. While in Azure Storage, familiarize yourself with existing content in containers andtables so that you choose non-conflicting names for the projections. A knowledgestore is a loose collection of tables and containers. Consider adopting a namingconvention to keep track of related objects.3.\n"
}