{
  "Id": "623",
  "Title": "\u0022Managing Azure Cognitive Search: Best Practices and Migration Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you don\u0027t use indexers, you would use your application code to push objects and datato different search services in parallel. For more information, see Keep data synchronizedacross multiple services.７ NoteIf both the storage account and the search service are in the same region, networktraffic between search and storage uses a private IP address and occurs over theMicrosoft backbone network.\r\nBecause private IP addresses are used, you can\u0027tconfigure IP firewalls or a private endpoint for network security. Instead, use thetrusted service exception as an alternative when both services are in the sameregion.About service outages and catastrophic eventsBack up and restore alternativesA business continuity strategy for the data layer usually includes a restore-from-backupstep. Because Azure AI Search isn\u0027t a primary data storage solution, Microsoft doesn\u0027tprovide a formal mechanism for self-service backup and restore. However, you can usethe index-backup-restore sample code in this Azure AI Search .\r\nNET sample repo toback up your index definition and snapshot to a series of JSON files, and then use thesefiles to restore the index, if needed. This tool can also move indexes between servicetiers.Otherwise, your application code used for creating and populating an index is the defacto restore option if you delete an index by mistake.\r\nTo rebuild an index, you woulddelete it (assuming it exists), recreate the index in the service, and reload by retrievingdata from your primary data store.Review Service limits to learn more about the pricing tiers and services limits foreach one.Review Plan for capacity to learn more about partition and replica combinations. Review Case Study: Use Cognitive Search to Support Complex AI Scenarios formore configuration guidance.Next stepsMigrate Azure Cognitive Search toavailability zone supportArticle•02/24/2023This guide describes how to migrate Azure Cognitive Search from non-availability zonesupport to availability support.Azure Cognitive Search services can take advantage of availability support in regionsthat support availability zones. Services with two or more replicas in these regionscreated after availability support was enabled can automatically utilize availability zones.Each replica will be placed in a different availability zone within the region.\n"
}