{
  "Id": "515",
  "Title": "\u0022Managing Debug Sessions in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe name of the generated container has a prefix of\u0022ms-az-cognitive-search-debugsession\u0022. The prefix is required because it mitigates thechance of accidentally exporting session data to another container in your account.A cached copy of the enriched document and skillset is loaded into the visual editor sothat you can inspect the content and metadata of the enriched document, with theability to check each document node and edit any aspect of the skillset definition. Anychanges made within the session are cached. Those changes will not affect thepublished skillset unless you commit them. Committing changes will overwrite theproduction skillset.\r\nIf the enrichment pipeline does not have any errors, a debug session can be used toincrementally enrich a document, test and validate each change before committing thechanges.You can rerun a debug session using the Start button, or cancel an in-progress sessionusing the Cancel button.How a debug session worksManaging the Debug Session stateThe visual editor is organized into tabs and panes. This section introduces thecomponents of the visual editor.The Skill Graph provides a visual hierarchy of the skillset and its order of execution fromtop to bottom. Skills that are dependent upon the output of other skills are positionedlower in the graph.\r\nSkills at the same level in the hierarchy can execute in parallel. Colorcoded labels of skills in the graph indicate the types of skills that are being executed inthe skillset (TEXT or VISION).Selecting a skill in the graph will display the details of that instance of the skill in theright pane, including its definition, errors or warnings, and execution history. The SkillGraph is where you will select which skill to debug or enhance. The details pane to theright is where you edit and explore.When you select an object in the Skill Graph, the adjacent pane provides interactivework areas in a tabbed layout. An illustration of the details pane can be found in theprevious screenshot.\n"
}