{
  "Id": "1383",
  "Title": "\u0022Managing Azure AI Search: Keys, Scaling, and Operations Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022Rejected\u0022 \\    --actions-required \u0022Please fix XYZ\u0022az search private-endpoint-connection delete \\    --name \u003Cpe-connection-name\u003E \\    --service-name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E Regenerate admin keysValues for the API keys are generated by the service.\r\nYou cannot provide a custom keyfor Azure AI Search to use.\r\nSimilarly, there is no user-defined name for admin API-keys.References to the key are fixed strings, either primary or secondary.Azure CLIResults should look similar to the following output. Both keys are returned even thoughyou only change one at a time.To create query API keys for read-only access from client apps to an Azure AI Searchindex, use az search query-key create.\r\nQuery keys are used to authenticate to a specificindex for the purpose of retrieving search results. Query keys do not grant read-onlyaccess to other items on the service, such as an index, data source, or indexer.You cannot provide a key for Azure AI Search to use.\r\nAPI keys are generated by theservice.Azure CLITo increase or decrease replicas and partitions use az search service update. Increasingreplicas or partitions adds to your bill, which has both fixed and variable charges. If youhave a temporary need for additional processing power, you can increase replicas andaz search admin-key renew \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --service-name \u003Csearch-service-name\u003E \\    --key-kind primary{  \u0022primaryKey\u0022: \u003Calphanumeric-guid\u003E,  \u0022secondaryKey\u0022: \u003Calphanumeric-guid\u003E  }Create or delete query keysaz search query-key create \\    --name myQueryKey \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --service-name \u003Csearch-service-name\u003EScale replicas and partitionspartitions to handle the workload.\n"
}