{
  "Id": "457",
  "Title": "\u0022Managing Deleted Documents and Index Size in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAs new documents are indexed and theinternal vector index grows, the system cleans up these deleted documents and reclaimsthe resources. This means you\u0027ll likely observe a lag between deleting documents andthe underlying resources being freed.We refer to this as the \u0022deleted documents ratio\u0022. Since the deleted documents ratiodepends on the indexing characteristics of your service, there\u0027s no universal heuristic toestimate this parameter, and there\u0027s no API or script that returns the ratio in effect foryour service. We observe that half of our customers have a deleted documents ratio lessthan 10%.\r\nIf you tend to perform high-frequency deletions or updates, then you mightobserve a higher deleted documents ratio.This is another factor impacting the size of your vector index. Unfortunately, we don\u0027thave a mechanism to surface your current deleted documents ratio.\r\nTo estimate the total size of your vector index, use the following calculation:(raw_size) * (1 \u002B algorithm_overhead (in percent)) * (1 \u002B deleted_docs_ratio (inpercent))For example, to calculate the raw_size, let\u0027s assume you\u0027re using a popular AzureOpenAI model, text-embedding-ada-002 with 1,536 dimensions. This means onedocument would consume 1,536 Edm.Single (floats), or 6,144 bytes since eachEdm.Single is 4 bytes.\r\n1,000 documents with a single, 1,536-dimensional vector fieldwould consume in total 1000 docs x 1536 floats/doc = 1,536,000 floats, or 6,144,000bytes.If you have multiple vector fields, you need to perform this calculation for each vectorfield within your index and add them all together. For example, 1,000 documents withtwo 1,536-dimensional vector fields, consume 1000 docs x 2 fields x 1536 floats/doc x 4bytes/float = 12,288,000 bytes.Overhead from deleting or updating documents withinthe indexEstimating the total size for your data inmemoryTo obtain the vector index size, multiply this raw_size by the algorithm overhead anddeleted document ratio.\n"
}