{
  "Id": "1376",
  "Title": "\u0022Managing Azure Search Services with Azure CLI: A Quick Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPreview administration features are typically not available in the az search module. Ifyou want to use a preview feature, use the Management REST API and a preview APIversion.Use the Bash environment in Azure Cloud Shell. For more information, seeQuickstart for Bash in Azure Cloud Shell.\r\nList search services in a subscription＂Return service information＂Create or delete a service＂Create a service with a private endpoint＂Regenerate admin API-keys＂Create or delete query api-keys＂Scale up or down with replicas and partitions＂Create a shared private link resource＂PrerequisitesIf you prefer to run CLI reference commands locally, install the Azure CLI.\r\nIf you\u0027rerunning on Windows or macOS, consider running Azure CLI in a Docker container.For more information, see How to run the Azure CLI in a Docker container.If you\u0027re using a local installation, sign in to the Azure CLI by using the az logincommand. To finish the authentication process, follow the steps displayed inyour terminal.\r\nFor other sign-in options, see Sign in with the Azure CLI.When you\u0027re prompted, install the Azure CLI extension on first use. For moreinformation about extensions, see Use extensions with the Azure CLI.Run az version to find the version and dependent libraries that are installed. Toupgrade to the latest version, run az upgrade. The following commands are from az resource, returning information about existingresources and services already provisioned in your subscription. If you don\u0027t know howmany search services are already created, these commands return that information,saving you a trip to the portal.The first command returns all search services.Azure CLIFrom the list of services, return information about a specific resource.Azure CLIYou can view information on the subgroups and commands available in az search fromwithin the CLI. Alternatively, you can review the documentation.To view the subgroups available within az search, run the following command.\n"
}