{
  "Id": "907",
  "Title": "\u0022Managing Indexer Errors in Azure Search: Troubleshooting and Solutions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf752Z\u0022,             \u0022errors\u0022:[],             \u0022itemsProcessed\u0022:1599501, Execution history contains up to 50 of the most recently completed executions, whichare sorted in the reverse chronological order so that the latest execution comes first.Errors that commonly occur during indexing include unsupported content types, missingcontent, or oversized blobs.By default, the blob indexer stops as soon as it encounters a blob with an unsupportedcontent type (for example, an audio file). You could use the\u0022excludedFileNameExtensions\u0022 parameter to skip certain content types. However, youmight want to indexing to proceed even if errors occur, and then debug individualdocuments later.\r\nFor more information about indexer errors, see Indexertroubleshooting guidance and Indexer errors and warnings.There are five indexer properties that control the indexer\u0027s response when errors occur.HTTP            \u0022itemsFailed\u0022:0,             \u0022initialTrackingState\u0022:null,             \u0022finalTrackingState\u0022:null         },         \u0022executionHistory\u0022:         [             {                 \u0022status\u0022:\u0022success\u0022,                 \u0022errorMessage\u0022:null,                 \u0022startTime\u0022:\u00222022-02-21T00:23:24.\r\n957Z\u0022,                 \u0022endTime\u0022:\u00222022-02-21T00:36:47.752Z\u0022,                 \u0022errors\u0022:[],                 \u0022itemsProcessed\u0022:1599501,                 \u0022itemsFailed\u0022:0,                 \u0022initialTrackingState\u0022:null,                 \u0022finalTrackingState\u0022:null             },             .\r\n.\r\n.\r\nearlier history items         ]     } Handle errorsPUT /indexers/[indexer name]? api-version=2020-06-30 {   \u0022parameters\u0022 : {      \u0022maxFailedItems\u0022 : 10,      \u0022maxFailedItemsPerBatch\u0022 : 10,     \u0022configuration\u0022 : {          \u0022failOnUnsupportedContentType\u0022 : false,          \u0022failOnUnprocessableDocument\u0022 : false,         \u0022indexStorageMetadataOnlyForOversizedDocuments\u0022: false ParameterValidvaluesDescription\u0022maxFailedItems\u0022-1, nullor 0,positiveintegerContinue indexing if errorshappen at any point ofprocessing, either while parsingblobs or while addingdocuments to an index.\n"
}