{
  "Id": "1781",
  "Title": "\u0022Managing Azure AI Services and Sentiment Analysis in Documents\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you need to break up your data before sending it to the sentiment analyzer, use theText Split skill.） ImportantThe Sentiment skill (v2) (Microsoft.Skills.Text.SentimentSkill) is now discontinuedreplaced by Microsoft.Skills.Text.V3.SentimentSkill. Follow the recommendationsin Deprecated Azure AI Search skills to migrate to a supported skill.\r\n７ NoteAs you expand scope by increasing the frequency of processing, adding moredocuments, or adding more AI algorithms, you will need to attach a billable AzureAI services resource. Charges accrue when calling APIs in Azure AI services, and forimage extraction as part of the document-cracking stage in Azure AI Search.\r\nThereare no charges for text extraction from documents.Execution of built-in skills is charged at the existing Azure AI services pay-as-yougo price. Image extraction pricing is described on the Azure AI Search pricingpage.@odata.typeData limitsSkill parametersParameters are case-sensitive.Parameter NameDescriptiondefaultLanguageCode(optional) The language code to apply to documents that don\u0027t specifylanguage explicitly.See the full list of supported languages.Input NameDescriptiontextThe text to be analyzed.languageCode(Optional) A string indicating the language of the records.\r\nIf this parameter is notspecified, the default value is \u0022en\u0022.See the full list of supported languages.OutputNameDescriptionscoreA value between 0 and 1 that represents the sentiment of the analyzed text. Valuesclose to 0 have negative sentiment, close to 0.5 have neutral sentiment, and valuesclose to 1 have positive sentiment.JSONSkill inputsSkill outputsSample definition{    \u0022@odata. type\u0022: \u0022#Microsoft.Skills.Text.SentimentSkill\u0022,    \u0022inputs\u0022: [        {            \u0022name\u0022: \u0022text\u0022,            \u0022source\u0022: \u0022/document/content\u0022        },        {            \u0022name\u0022: \u0022languageCode\u0022,            \u0022source\u0022: \u0022/document/languagecode\u0022        }    ],    \u0022outputs\u0022: [        {            \u0022name\u0022: \u0022score\u0022,JSONJSONIf your text is empty, a warning is generated and no sentiment score is returned.\n"
}