{
  "Id": "460",
  "Title": "\u0022Managing Data Import and Indexing in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor an introduction to the push APIs, see:Quickstart: Full text search using the Azure SDKsC# Tutorial: Optimize indexing with the push APIREST Quickstart: Create an Azure AI Search index using PowerShellYou can control the type of indexing action on a per-document basis, specifyingwhether the document should be uploaded in full, merged with existing documentcontent, or deleted.\r\nWhether you use the REST API or an SDK, the following document operations aresupported for data import:Upload, similar to an \u0022upsert\u0022 where the document is inserted if it is new, andupdated or replaced if it exists. If the document is missing values that the indexrequires, the document field\u0027s value is set to null.\r\nmerge updates a document that already exists, and fails a document that cannotbe found. Merge replaces existing values. For this reason, be sure to check forcollection fields that contain multiple values, such as fields of typeCollection(Edm.String). For example, if a tags field starts with a value of[\u0022budget\u0022] and you execute a merge with [\u0022economy\u0022, \u0022pool\u0022], the final value ofthe tags field is [\u0022economy\u0022, \u0022pool\u0022].\r\nIt won\u0027t be [\u0022budget\u0022, \u0022economy\u0022, \u0022pool\u0022].mergeOrUpload behaves like merge if the document exists, and upload if thedocument is new.delete removes the entire document from the index. If you want to remove anindividual field, use merge instead, setting the field in question to null.\r\nThe pull model crawls a supported data source and automatically uploads the data intoyour index. In Azure AI Search, this capability is implemented through indexers, currentlyavailable for these platforms:Azure Blob storageIndexing actions: upload, merge, mergeOrUpload, deletePulling data into an indexAzure Table storageAzure Data Lake Storage Gen2Azure Files (preview)Azure Cosmos DBAzure SQL Database, SQL Managed Instance, and SQL Server on Azure VMsSharePoint in Microsoft 365 (preview)Indexers connect an index to a data source (usually a table, view, or equivalentstructure), and map source fields to equivalent fields in the index.\n"
}