{
  "Id": "337",
  "Title": "\u0022Managing Azure Cognitive Search Resources: Cleanup and Debugging Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou also learned how to checkthe indexer status and what objects must be deleted before rerunning a pipeline.# delete the skillsetr = requests.delete(endpoint \u002B \u0022/skillsets/\u0022 \u002B skillset_name,                    headers=headers, params=params)pprint(json.dumps(r.json(), indent=1))TakeawaysWhen you\u0027re working in your own subscription, at the end of a project, it\u0027s a good ideato remove the resources that you no longer need.\r\nResources left running can cost youmoney. You can delete resources individually or delete the resource group to delete theentire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.\r\nNow that you\u0027re familiar with all of the objects in an AI enrichment pipeline, let\u0027s take acloser look at skillset definitions and individual skills.Clean up resourcesNext stepsHow to create a skillsetTutorial: Debug a skillset using DebugSessionsArticle•10/09/2023Skillsets coordinate a series of actions that analyze or transform content, where theoutput of one skill becomes the input of another. When inputs depend on outputs,mistakes in skillset definitions and field associations can result in missed operations anddata.Debug sessions is a tool in the Azure portal provides a holistic visualization of a skillset. Using this tool, you can drill down to specific steps to easily see where an action mightbe falling down.In this article, use Debug sessions to find and fix missing inputs and outputs. Thetutorial is all-inclusive. It provides sample data, a Postman collection that createsobjects, and instructions for debugging problems in the skillset.Before you begin, have the following prerequisites in place:An active subscription. Create an account for free.Azure Cognitive Search. Create a service or find an existing service under yourcurrent subscription. You can use a free service for this tutorial.\n"
}