{
  "Id": "1314",
  "Title": "\u0022Managing Query Throttling and Indexing Latency in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOne potential reason for your search service to throttle requests is due to the sheernumber of queries being performed where volume is captured as queries per second(QPS) or queries per minute (QPM). As your search service receives more QPS, it willtypically take longer and longer to respond to those queries until it can no longer keepup, as which it will send back a throttling 503 HTTP response.\r\nThe following Kusto query shows query volume as measured in QPM, along withaverage duration of a query in milliseconds (AvgDurationMS) and the average numberof documents (AvgDocCountReturned) returned in each one.KustoQuery ratesAzureDiagnostics| where OperationName == \u0022Query.\r\nSearch\u0022 and TimeGenerated \u003E ago(1d)| extend MinuteOfDay = substring(TimeGenerated, 0, 16) | project MinuteOfDay, DurationMs, Documents_d, IndexName_s| summarize QPM=count(), AvgDuractionMs=avg(DurationMs), AvgDocCountReturned=avg(Documents_d)  by MinuteOfDay| order by MinuteOfDay desc | render timechartAn important factor to consider when looking at performance is that indexing uses thesame resources as search queries.\r\nIf you\u0027re indexing a large amount of content, you canexpect to see latency grow as the service tries to accommodate both workloads.If queries are slowing down, look at the timing of indexing activity to see if it coincideswith query degradation.\r\nFor example, perhaps an indexer is running a daily or hourly jobthat correlates with the decreased performance of the search queries.This section provides a set of queries that can help you visualize the search and indexingrates. For these examples, the time range is set in the query. Be sure to indicate Set inquery when running the queries in Azure portal.  TipTo reveal the data behind this chart, remove the line | render timechart and thenrerun the query.Impact of indexing on queriesIn the below query, an interval size of 1 minute is used to show the average latency ofthe search queries. From the chart, we can see that the average latency was low until5:45pm and lasted until 5:53pm.\n"
}