{
  "Id": "671",
  "Title": "\u0022Managing Azure Search Services in C# .NET Applications\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor existing services,you must set parameters to use the new algorithm.Ordered results for null values have changed in this version, with null valuesappearing first if the sort is asc and last if the sort is desc. If you wrote code tohandle how null values are sorted, you should review and potentially remove thatcode if it\u0027s no longer necessary.\r\nDue to these behavior changes, it\u0027s likely that there are slight variations in rankedresults.How to use Azure.Search.Documents in a C# .NET ApplicationTutorial: Add search to web appsAzure.Search.Documents packageSamples on GitHubAzure.Search.Document API referenceBreaking changesNext stepsUpgrade versions of the Azure Search.NET Management SDKArticle•09/18/2023This article points you to libraries in the Azure SDK for .NET for managing a searchservice. These libraries provide the APIs used to create, configure, and delete searchservices. They also provide APIS used to adjust capacity, manage API keys, and configurenetwork security.\r\nManagement SDKs target a specific version of the Management REST API. Release notesfor each library indicate which REST API version is the target for each package. For moreinformation about concepts and operations, see Search Management (REST).The following table lists the client libraries used to provision a search service.NamespaceVersionStatusChange logAzure.ResourceManager.SearchPackage versionsCurrentRelease notesMicrosoft.Azure.Management.SearchPackage versionsDeprecatedRelease notes1. Review the client library change list for insight into the scope of changes.2. In your application code, delete the reference toMicrosoft.Azure.Management.Search and its dependencies.3.\r\nAdd a reference for Azure.ResourceManager.Search using either the NuGet PackageManager Console or by right-clicking on your project references and selecting\u0022Manage NuGet Packages...\u0022 in Visual Studio.4. Once NuGet has downloaded the new packages and their dependencies, replacethe API calls. VersionsChecklist for upgradeNext stepsIf you encounter problems, the best forum for posting questions is Stack Overflow. Ifyou find a bug, you can file an issue in the Azure .NET SDK GitHub repository. Makesure to label your issue title with search.Upgrade to the latest REST API in AzureAI SearchArticle•11/28/2023Use this article to migrate data plane calls to newer stable versions of the Search RESTAPI.\n"
}