{
  "Id": "75",
  "Title": "\u0022Managing Azure Resources and Integrated Vectorization: A Quickstart Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can find and manage resources for your service in the Azure portal under Allresources or Resource groups in the left pane.If you use a free service, remember that the limit is three indexes, indexers, and datasources. You can delete individual items in the Azure portal to stay under the limit.Try an Azure portal wizard to generate a ready-to-use web app that runs in a browser.Use this wizard on the small index you created in this quickstart, or use one of the built-in sample data sets for a richer search experience.\r\nClean up resourcesNext stepsCreate a demo app in the portalQuickstart: Integrated vectorization(preview)Article•11/30/2023Get started with integrated vectorization using the Import and vectorize data wizard inthe Azure portal.In this preview version of the wizard:Source data is blob only, using the default parsing mode (one search documentper blob).Index schema is non-configurable.\r\nSource fields include content (chunked andvectorized), metadata_storage_name for title, and a metadata_storage_path for thedocument key.Vectorization is Azure OpenAI only, using the HNSW algorithm with defaults.Chunking is non-configurable. The effective settings are:JSONAn Azure subscription. Create one for free.Azure AI Search, in any region and on any tier.\r\nMost existing services supportvector search. For a small subset of services created prior to January 2019, an indexcontaining vector fields will fail on creation. In this situation, a new service must becreated.） ImportantImport and vectorize data wizard is in public preview under Supplemental Termsof Use. It targets the 2023-10-01-Preview REST API. textSplitMode: \u0022pages\u0022,maximumPageLength: 2000,pageOverlapLength: 500PrerequisitesAzure OpenAI endpoint with a deployment of text-embedding-ada-002 and anAPI key or Cognitive Services OpenAI User permissions to upload data. You canonly choose one vectorizer in this preview, and the vectorizer must be AzureOpenAI.\n"
}