{
  "Id": "1559",
  "Title": "\u0022Managing Security for Azure Cognitive Search Services: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure Cognitive Search service This template creates an Azure CognitiveSearch serviceAzure Cognitive Search service with privateendpoint This template creates an Azure CognitiveSearch service with a private endpoint.Quickstart templatesAzure Policy built-in definitions forAzure Cognitive SearchArticle•12/04/2023This page is an index of Azure Policy built-in policy definitions for Azure CognitiveSearch. For additional Azure Policy built-ins for other services, see Azure Policy built-indefinitions.The name of each built-in policy definition links to the policy definition in th Azureportal.\r\nUse the link in the Version column to view the source on the Azure Policy GitHubrepo.NameDescriptionEffect(s)VersionAzure CognitiveSearch serviceshould use a SKUthat supportsprivate linkWith supported SKUs of Azure CognitiveSearch, Azure Private Link lets you connectyour virtual network to Azure serviceswithout a public IP address at the source ordestination.\r\nThe private link platformhandles the connectivity between theconsumer and services over the Azurebackbone network. By mapping privateendpoints to your Search service, dataleakage risks are reduced. Learn more at:https://aka.ms/azure-cognitive-search/inbound-private-endpoints.Audit, Deny,Disabled1.0.\r\n0Azure CognitiveSearch servicesshould disablepublic networkaccessDisabling public network access improvessecurity by ensuring that your AzureCognitive Search service is not exposed onthe public internet. Creating privateendpoints can limit exposure of yourSearch service. Learn more at:https://aka.ms/azure-cognitive-search/inbound-private-endpoints.Audit, Deny,Disabled1. 0.0Azure CognitiveSearch servicesshould have localDisabling local authentication methodsimproves security by ensuring that AzureCognitive Search services exclusivelyAudit, Deny,Disabled1.0.0Azure Cognitive SearchﾉExpand table(Azure portal)(GitHub)NameDescriptionEffect(s)Versionauthenticationmethods disabledrequire Azure Active Directory identities forauthentication.\n"
}