{
  "Id": "94",
  "Title": "\u0022Managing Azure AI Search Resources and Enriched Fields Quickstart\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022hotelReviewssPages\u0022 contains enriched fields created over each page thatwas split from the document. In this skillset and data source, page-levelenrichments consisting of sentiment labels and translated text. A pages table(or a sentences table if you specify that particular level of granularity) iscreated when you choose \u0022pages\u0022 granularity in the skillset definition.\r\nAll of these tables contain ID columns to support table relationships in other tools andapps. When you open a table, scroll past these fields to view the content fields added bythe pipeline.In this quickstart, the table for \u0022hotelReviewssPages\u0022 should look similar to the followingscreenshot:When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created.\r\nResources left running cancost you money. You can delete resources individually or delete the resource group todelete the entire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.\r\nIf you\u0027re using a free service, remember that you\u0027re limited to three indexes, indexers,and data sources. You can delete individual items in the portal to stay under the limit.Clean upNow that you\u0027ve been introduced to a knowledge store, take a closer look at each stepby switching over to the REST API walkthrough. Tasks that the wizard handled internallyare explained in the REST walkthrough. TipIf you want to repeat this exercise or try a different AI enrichment walkthrough,delete the hotel-reviews-idxr indexer and the related objects to recreate them.Deleting the indexer resets the free daily transaction counter to zero. Next stepsCreate a knowledge store using REST and PostmanQuickstart: Use Search explorer to runqueries in the Azure portalArticle•11/15/2023In this quickstart, learn how to use Search explorer, a built-in query tool in the Azureportal used for running queries against a search index in Azure AI Search. Use it to test aquery or filter expression, or confirm whether content exists in the index.This quickstart uses an existing index to demonstrate Search explorer.Before you begin, have the following prerequisites in place:An Azure account with an active subscription. Create an account for free.An Azure AI Search service.\n"
}