{
  "Id": "1435",
  "Title": "\u0022Managing Azure Search Service Identity and Connection Strings\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWrite to anenrichment cacheAdd Storage Blob Data ContributorSave debug sessionstateAdd Storage Blob Data Contributor5. On the Members page, select Managed Identity.6. Select members. In the Select managed identity page, choose your subscriptionand then filter by service type, and then select the service. Only those services thathave a managed identity will be available to select.7. Select Review \u002B assign.Once a managed identity is defined for the search service and given a role assignment,outbound connections can be modified to use the unique resource ID of the otherAzure resource.\r\nHere are some examples of connection strings for various scenarios.Blob data source (system):An indexer data source includes a \u0022credentials\u0022 property that determines how theconnection is made to the data source. The following example shows a connectionstring specifying the unique resource ID of a storage account. Azure AD will authenticatethe request using the system managed identity of the search service. Notice that theconnection string doesn\u0027t include a container. In a data source definition, a containername is specified in the \u0022container\u0022 property (not shown), not the connection string.\r\nJSONBlob data source (user):A search request to Azure Storage can also be made under a user-assigned managedidentity, currently in preview. The search service user identity is specified in the \u0022identity\u0022property. You can use either the portal or the REST API preview version 2021-04-30-Preview to set the identity. JSONConnection string examples\u0022credentials\u0022: {     \u0022connectionString\u0022: \u0022ResourceId=/subscriptions/{subscription-ID}/resourceGroups/{resource-group-name}/providers/Microsoft.Storage/storageAccounts/{storage-account-name};\u0022     } \u0022credentials\u0022: {     \u0022connectionString\u0022: \u0022ResourceId=/subscriptions/{subscription-ID}/resourceGroups/{resource-group-name}/providers/Microsoft.Storage/storageAccounts/{storage-account-name};\u0022     },   .\n"
}