{
  "Id": "27",
  "Title": "\u0022Managing Customer Data and Access in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhere does Azure AI Search store customerdata?Does Azure AI Search send customer data toother services for processing?Can I control access to search results based onuser identity?Can I control access to operations based on useridentity?Can I use the Azure portal to view and managesearch content if the search service is behind anIP firewall or a private endpoint?Next stepsStack Overflow: Azure AI SearchHow full text search works in Azure AI SearchWhat is Azure AI Search?Quickstart: Full text search using theAzure SDKsArticle•06/11/2023Learn how to use the Azure.\r\nSearch.Documents client library in an Azure SDK to create,load, and query a search index using sample data for full text search. Full text searchuses Apache Lucene for indexing and queries, and a BM25 ranking algorithm for scoringresults.This quickstart has steps for the following SDKs:Azure SDK for .NETAzure SDK for PythonAzure SDK for JavaAzure SDK for JavaScriptAn Azure account with an active subscription. Create an account for free.An Azure AI Search service. Create a service if you don\u0027t have one.\r\nYou can use afree tier for this quickstart.An API key and service endpoint:Sign in to the Azure portal and find your search service.In Overview, copy the URL and save it to Notepad for a later step. An exampleendpoint might look like https://mydemo.search.windows.net.In Keys, copy and save an admin key for full rights to create and delete objects.\r\nThere are two interchangeable primary and secondary keys. Choose either one.PrerequisitesChoose a programming language for the next step. The Azure.Search.Documents clientlibraries are available in Azure SDKs for .NET, Python, Java, and JavaScript.Build a console application using the Azure.Search. Documents client library tocreate, load, and query a search index. Alternatively, you can download the sourcecode to start with a finished project or follow these steps to create your own.1. Start Visual Studio and create a new project for a console app.2. In Tools \u003E NuGet Package Manager, select Manage NuGet Packages forSolution....3. Select Browse.4.\n"
}