{
  "Id": "1364",
  "Title": "\u0022Managing Azure Subscriptions and Resources with PowerShell Commands\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure PowerShellIf you hold multiple Azure subscriptions, set your Azure subscription. To see a list of yourcurrent subscriptions, run this command.Azure PowerShell$PSVersionTable.PSVersionLoad Azure PowerShellGet-InstalledModule -Name AzImport-Module -Name AzConnect to Azure with a browser sign-in tokenConnect-AzAccountGet-AzSubscription | sort SubscriptionName | Select SubscriptionNameTo specify the subscription, run the following command.\r\nIn the following example, thesubscription name is ContosoSubscription.Azure PowerShellThe following commands are from Az.Resources, returning information about existingresources and services already provisioned in your subscription. If you don\u0027t know howmany search services are already created, these commands return that information,saving you a trip to the portal.The first command returns all search services.Azure PowerShellFrom the list of services, return information about a specific resource.Azure PowerShellResults should look similar to the following output.Commands from Az.Search are not available until you load the module.\r\nAzure PowerShellSelect-AzSubscription -SubscriptionName ContosoSubscriptionList services in a subscriptionGet-AzResource -ResourceType Microsoft.Search/searchServices | ftGet-AzResource -ResourceName \u003Cservice-name\u003EName              : my-demo-searchappResourceGroupName : demo-westusResourceType      : Microsoft.Search/searchServicesLocation          : westusResourceId        : /subscriptions/\u003Calphanumeric-subscription-ID\u003E/resourceGroups/demo-westus/providers/Microsoft.Search/searchServices/my-demo-searchappImport Az.SearchAs a verification step, return a list of commands provided in the module.Azure PowerShellResults should look similar to the following output. Install-Module -Name Az.Search -Scope CurrentUserList all Az.Search commandsGet-Command -Module Az.SearchCommandType     Name                                               Version    Source                                                                -----------     ----                                               -------    ------                                                                Cmdlet          Get-AzSearchAdminKeyPair                           0.8.0      Az.Search                                                             Cmdlet          Get-AzSearchPrivateEndpointConnection              0.8.0      Az.\n"
}