{
  "Id": "306",
  "Title": "\u0022Managing Azure AI Enrichment Pipelines: Skillset Definitions and Cleanup\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFinally, you learned how to test results and reset the system for further iterations. Youlearned that issuing queries against the index returns the output created by the enrichedindexing pipeline. You also learned how to check indexer status, and which objects todelete before rerunning a pipeline.\r\nWhen you\u0027re working in your own subscription, at the end of a project, it\u0027s a good ideato remove the resources that you no longer need. Resources left running can cost youmoney. You can delete resources individually or delete the resource group to delete theentire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.\r\nNow that you\u0027re familiar with all of the objects in an AI enrichment pipeline, let\u0027s take acloser look at skillset definitions and individual skills.Clean up resourcesNext stepsHow to create a skillsetTutorial: Use REST and AI to generatesearchable content from Azure blobsArticle•11/15/2023If you have unstructured text or images in Azure Blob Storage, an AI enrichment pipelinecan extract information and create new content for full-text search or knowledge miningscenarios.In this REST tutorial, you\u0027ll learn how to:If you don\u0027t have an Azure subscription, open a free account before you begin.\r\nThis tutorial uses Postman and the Azure AI Search REST APIs to create a data source,index, indexer, and skillset.The indexer connects to Azure Blob Storage and retrieves the content, which you mustload in advance. The indexer then invokes a skillset for specialized processing, andingests the enriched content into a search index. The skillset is attached to an indexer. It uses built-in skills from Microsoft to find andextract information. Steps in the pipeline include Optical Character Recognition (OCR)on images, language detection, key phrase extraction, and entity recognition(organizations, locations, people). New information created by the pipeline is stored innew fields in an index.\n"
}