{
  "Id": "1387",
  "Title": "\u0022Managing Azure Search: Creating and Configuring Security Principals\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfManagement REST API calls are authenticated through Azure Active Directory (AzureAD). You\u0027ll need a security principal for your REST client, along with permissions tocreate and configure a resource. This section explains how to create a security principaland assign a role.\r\nList search services＂Create or update a service＂Enable Azure role-based access control for data plane＂(preview) Enforce a customer-managed key policy＂(preview) Disable semantic search＂(preview) Disable workloads that push data to external resources＂PrerequisitesCreate a security principal７ Note1. Open a command shell for Azure CLI. If you don\u0027t have Azure CLI installed, you canopen Create a service principal, select Try It.\r\n2. Sign in to your Azure subscription.Azure CLI3. First, get your subscription ID. In the console, enter the following command:Azure CLI4. Create a resource group for your security principal, specifying a location and name.This example uses the West US region.Azure CLI5. Create the service principal, replacing the placeholder values with valid values.\r\nYou\u0027ll need a descriptive security principal name, subscription ID, resource groupname.Notice that the security principal has \u0022owner\u0022 permissions, necessary for creatingor updating an Azure resource. If you\u0027re managing an existing search service, usecontributor or \u0022Search Service Contributor\u0022 (quote enclosed) instead.\r\nAzure CLIA successful response includes \u0022appId\u0022, \u0022password\u0022, and \u0022tenant\u0022. You\u0027ll use thesevalues for the variables \u0022clientId\u0022, \u0022clientSecret\u0022, and \u0022tenant\u0022 in the next section.The following steps are borrowed from the Azure REST APIs with Postman blogpost. az login az account show --query id -o tsv az group create -l westus -n MyResourceGroup az ad sp create-for-rbac --name mySecurityPrincipalName \\                          --role owner \\                          --scopes /subscriptions/mySubscriptionID/resourceGroups/myResourceGroupName The following steps are from this blog post if you need more detail.1. Start a new Postman collection and edit its properties.\n"
}