{
  "Id": "1492",
  "Title": "\u0022Managing Authentication and Access Control in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThisobject is maintained independently from search indexes. Once uploaded, you canpoint any searchable field to the synonym map (one per field).You can use key-based authentication or role-based through Microsoft Entra ID.Key-based authentication relies on API keys that are generated for the searchservice. Having a valid key establishes trust, on a per request basis, between theapplication sending the request and the service that handles it.\r\nYou can use anAdmin API key for read-write operations or a Query API key for read access to thedocuments collection of a search index.Microsoft Entra ID authentication and role-based access control requires that youhave an established tenant in Microsoft Entra ID, with security principals and roleassignments.\r\nMembers of the following roles have data plane access. You cancreate custom roles if the built-in roles are insufficient.RoleAccessSearch ServiceContributorAccess to objects, but no access to index content. This role can\u0027t query asearch index or add, remove, or update documents in a search index.This role is for administrators who need to manage objects, but withoutthe ability to view or access object data.Search DataIndexContributorRead-write access to index content. This role is for developers or indexowners who need to import, refresh, or query the documents collectionof an index.\r\nSearch DataIndex ReaderRead access to index content. This role is for apps and users who runqueries.When using roles on the connection, your client app presents a bearer token in theauthorization header. See Authorize access to a search app using Microsoft Entra ID forhelp with setting this up.You can disable key-based authentication or role-based authentication. If you disablerole-based authentication, some built-in roles will still have access. See Microsoft EntraID authentication and role-based access control for Azure AI Search for details.The APIs documented in this section provide access to operations on search data, suchas index creation and population, document upload, and queries.\n"
}