{
  "Id": "271",
  "Title": "\u0022Managing Data Sources and Indexing in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIt often requires some up-front planning to identify a meaningful document key for yourindex, and make sure it exists in both data sources. In this demo, the HotelId key foreach hotel in Azure Cosmos DB is also present in the rooms JSON blobs in Blob storage.Azure AI Search indexers can use field mappings to rename and even reformat datafields during the indexing process, so that source data can be directed to the correctindex field. For example, in Azure Cosmos DB, the hotel identifier is called HotelId. Butin the JSON blob files for the hotel rooms, the hotel identifier is named Id.\r\nThe programhandles this discrepancy by mapping the Id field from the blobs to the HotelId keyfield in the indexer.Once the data and configuration settings are in place, the sample program in/v11/AzureSearchMultipleDataSources.sln should be ready to build and run.This simple C#/.\r\nNET console app performs the following tasks:Creates a new index based on the data structure of the C# Hotel class (which alsoreferences the Address and Room classes).Creates a new data source and an indexer that maps Azure Cosmos DB data toindex fields. These are both objects in Azure AI Search.Runs the indexer to load Hotel data from Azure Cosmos DB.\r\nCreates a second data source and an indexer that maps JSON blob data to indexfields.Runs the second indexer to load Rooms data from Blob storage.Before running the program, take a minute to study the code and the index and indexerdefinitions for this sample. The relevant code is in two files:Hotel. cs contains the schema that defines the index７ NoteIn most cases, auto-generated document keys, such as those created by default bysome indexers, do not make good document keys for combined indexes. In generalyou will want to use a meaningful, unique key value that already exists in, or can beeasily added to, your data sources.4 - Explore the codeProgram.\n"
}