{
  "Id": "609",
  "Title": "\u0022Managing Azure Cognitive Search Service: Provisioning, Scaling, and Backups\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBackup can take several minutes,depending on the amount of data and number of partitions and replicas.７ NoteAfter a service is provisioned, it cannot be upgraded to a higher tier. You mustcreate a search service at the new tier and reload your indexes. See Create anAzure Cognitive Search service in the portal for help with service provisioning.\r\nHow scale requests are handledThe above steps aren\u0027t entirely consecutive. For example, the system starts provisioningwhen it can safely do so, which could be while backup is winding down.The error message \u0022Service update operations aren\u0027t allowed at this time because we\u0027reprocessing a previous request\u0022 is caused by repeating a request to scale down or upwhen the service is already processing a previous request.Resolve this error by checking service status to verify provisioning status:1. Use the Management REST API, Azure PowerShell, or Azure CLI to get servicestatus.2. Call Get Service (REST) or equivalent for PowerShell or the CLI.3.\r\nCheck the response for \u0022provisioningState\u0022: \u0022provisioning\u0022If status is \u0022Provisioning\u0022, wait for the request to complete. Status should be either\u0022Succeeded\u0022 or \u0022Failed\u0022 before another request is attempted. There\u0027s no status forbackup. Backup is an internal operation and it\u0027s unlikely to be a factor in any disruptionof a scale exercise.\r\nIf your search service appears to be stalled in a provisioning state, check for orphanedindexes that are unusable, with zero query volumes and no index updates. An unusableindex can block changes to service capacity. In particular, look for indexes that are CMK-encrypted, whose keys are no longer valid. You should either delete the index or restorethe keys to bring the index back online and unblock your scale operation. A Basic service can have exactly one partition and up to three replicas, for a maximumlimit of three SUs. The only adjustable resource is replicas. You need a minimum of tworeplicas for high availability on queries.All Standard and Storage Optimized search services can assume the followingcombinations of replicas and partitions, subject to the 36-SU limit allowed for thesetiers.\n"
}