{
  "Id": "645",
  "Title": "\u0022Managing Azure Search with C# and Azure SDK\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIfNotChanged(index));            Console.WriteLine(\u0022Updated the index successfully.\\n\u0022);            break;        }Try modifying other samples to exercise ETags or AccessCondition objects.search-dotnet-getting-started on GitHub. This repository includes the\u0022DotNetEtagsExplainer\u0022 project.azure-search-dotnet-samples on GitHub contains additional C# samples.\r\nCommon HTTP request and response headersHTTP status codes        catch (CloudException e) when (e.IsAccessConditionFailed())        {            Console.WriteLine($\u0022Index update failed : {e.Message}. Attempt({i}/{MaxNumTries}).\\n\u0022);        }    }}private static Index AddSynonymMapsToFields(Index index){    index.Fields.\r\nFirst(f =\u003E f.Name == \u0022category\u0022).SynonymMaps = new[] { \u0022desc-synonymmap\u0022 };    index.Fields.First(f =\u003E f.Name == \u0022tags\u0022).SynonymMaps = new[] { \u0022desc-synonymmap\u0022 };    return index;}Next stepsSee alsoHow to use Azure.Search.Documents ina C# .NET ApplicationArticle•10/18/2023This article explains how to create and manage search objects using C# and theAzure.\r\nSearch.Documents (version 11) client library in the Azure SDK for .NET.Azure SDK for .NET includes an Azure.Search.Documents client library from the AzureSDK team that is functionally equivalent to the previous client library,Microsoft.Azure.Search. Version 11 is more consistent in terms of Azureprogrammability. Some examples include AzureKeyCredential key authentication, andSystem.Text.Json.Serialization for JSON serialization.As with previous versions, you can use this library to:Create and manage search indexes, data sources, indexers, skillsets, and synonymmapsLoad and manage search documents in an indexExecute queries, all without having to deal with the details of HTTP and JSONInvoke and manage AI enrichment (skillsets) and outputsThe library is distributed as a single Azure.Search.Documents NuGet package, whichincludes all APIs used for programmatic access to a search service.\n"
}