{
  "Id": "1382",
  "Title": "\u0022Managing Private Endpoint Connections and Admin Keys in Azure CLI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThefollowing example sets a private endpoint connection to rejected:Azure CLITo delete the private endpoint connection, use az search private-endpoint-connectiondelete.Azure CLITo roll over admin API keys, use az search admin-key renew. Two admin keys arecreated with each service for authenticated access. Keys are required on every request.Both admin keys are functionally equivalent, granting full write access to a search servicewith the ability to retrieve any information, or create and delete any object. Two keysexist so that you can use one while replacing the other.\r\nYou can only regenerate one at a time, specified as either the primary or secondary key.For uninterrupted service, remember to update all client code to use a secondary keywhile rolling over the primary key. Avoid changing the keys while operations are inflight.As you might expect, if you regenerate keys without updating client code, requestsusing the old key will fail. Regenerating all new keys does not permanently lock you outof your service, and you can still access the service through the portal. After youregenerate primary and secondary keys, you can update client code to use the new keysand operations will resume accordingly.\r\n--service-name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E az search private-endpoint-connection show \\    --name \u003Cpe-connection-name\u003E \\    --service-name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E     --status Rejected \\    --description \u0022Rejected\u0022 \\    --actions-required \u0022Please fix XYZ\u0022az search private-endpoint-connection delete \\    --name \u003Cpe-connection-name\u003E \\    --service-name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E Regenerate admin keysValues for the API keys are generated by the service.\nYou cannot provide a custom keyfor Azure AI Search to use.\n"
}