{
  "Id": "1360",
  "Title": "\u0022Managing and Monitoring Azure Cognitive Search Services: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf3Tabbed pages in the center provide quick access to usage statistics, service health metrics,and access to all of the existing indexes, indexers, data sources, and skillsets.4Navigation links to other pages.Several aspects of a search service are determined when the service is provisioned andcan\u0027t be easily changed:Service nameService location Service tier  Although there are ARM and bicep templates for service deployment, moving contentis a manual job. Switching a tier requires creating a new service or filing a support ticket to request atier upgrade.\r\nService administration includes the following tasks:Adjust capacity by adding or removing replicas and partitionsManage API keys used for content accessManage Azure roles used for content and service accessConfigure IP firewall rules to restrict access by IP addressConfigure a private endpoint using Azure Private Link and a private virtual networkMonitor service health and operations: storage, query volumes, and latencyThere\u0027s feature parity across all modalities and languages except for previewmanagement features.\r\nIn general, preview management features are released throughthe Management REST API first. Programmatic support for service administration can befound in the following APIs and modules:Read-only service properties1212Management tasksManagement REST API referenceAz.\r\nSearch PowerShell moduleaz search Azure CLI moduleYou can also use the management client libraries in the Azure SDKs for .NET, Python,Java, and JavaScript.Because Azure Cognitive Search is a monitored resource, you can review the built-inactivity logs and platform metrics for insights into service operations. Activity logs andthe data used to report on platform metrics are retained for the periods described in thefollowing table. If you opt in for resource logging, you\u0027ll specify durable storage over which you\u0027ll havefull control over data retention and data access through Kusto queries. For moreinformation on how to set up resource logging in Cognitive Search, see Collect andanalyze log data.Internally, Microsoft collects telemetry data about your service and the platform.\n"
}