{
  "Id": "1370",
  "Title": "\u0022Managing Private Endpoint Connections in Azure Search with PowerShell\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfGet-AzSearchPrivateEndpointConnection is used to retrieve a private endpointconnection and to see its status.Azure PowerShellSet-AzSearchPrivateEndpointConnection is used to update the connection. Thefollowing example sets a private endpoint connection to rejected:Azure PowerShell## Create private dns zone$zone = New-AzPrivateDnsZone \u0060    -ResourceGroupName \u003Cprivate-dns-resource-group-name\u003E \u0060    -Name \u0022privatelink.\r\nsearch.windows.net\u0022## Create dns network link$link = New-AzPrivateDnsVirtualNetworkLink \u0060    -ResourceGroupName \u003Cprivate-dns-link-resource-group-name\u003E \u0060    -ZoneName \u0022privatelink.search.windows.net\u0022 \u0060    -Name \u0022myLink\u0022 \u0060    -VirtualNetworkId $virtualNetwork.\r\nId## Create DNS configuration $config = New-AzPrivateDnsZoneConfig \u0060    -Name \u0022privatelink.search.windows.net\u0022 \u0060    -PrivateDnsZoneId $zone.\r\nResourceId## Create DNS zone groupNew-AzPrivateDnsZoneGroup \u0060    -ResourceGroupName \u003Cprivate-dns-zone-resource-group-name\u003E \u0060    -PrivateEndpointName \u003Cprivate-endpoint-name\u003E \u0060    -Name \u0027myZoneGroup\u0027 \u0060    -PrivateDnsZoneConfig $configManage private endpoint connectionsGet-AzSearchPrivateEndpointConnection -ResourceGroupName \u003Csearch-service-resource-group-name\u003E -ServiceName \u003Csearch-service-name\u003ERemove-AzSearchPrivateEndpointConnection is used to delete the private endpointconnection. Azure PowerShellNew-AzSearchAdminKey is used to roll over admin API keys. Two admin keys arecreated with each service for authenticated access. Keys are required on every request.Both admin keys are functionally equivalent, granting full write access to a search servicewith the ability to retrieve any information, or create and delete any object. Two keysexist so that you can use one while replacing the other.You can only regenerate one at a time, specified as either the primary or secondary key.For uninterrupted service, remember to update all client code to use a secondary keywhile rolling over the primary key.\n"
}