{
  "Id": "1014",
  "Title": "\u0022Managing Errors and Oversized Documents in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo ignore this failure mode, set the failOnUnprocessableDocument configuration parameter to false:HTTPAzure AI Search limits the size of documents that are indexed. These limits are documented in Service Limits in Azure AI Search. Oversizeddocuments are treated as errors by default. However, you can still index storage metadata of oversized documents if you setindexStorageMetadataOnlyForOversizedDocuments configuration parameter to true:HTTPYou can also continue indexing if errors happen at any point of processing, either while parsing documents or while adding documents toan index.\r\nTo ignore a specific number of errors, set the maxFailedItems and maxFailedItemsPerBatch configuration parameters to thedesired values. For example:HTTPIndexers in Azure AI SearchContent metadata properties used in Azure AI SearchHandling errorsPUT https://[service name].search.windows.net/indexers/[indexer name]?api-version=2023-10-01-PreviewContent-Type: application/jsonapi-key: [admin key]{    .\r\n.. other parts of indexer definition    \u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022failOnUnsupportedContentType\u0022 : false } }}\u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022failOnUnprocessableDocument\u0022 : false } }\u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022indexStorageMetadataOnlyForOversizedDocuments\u0022 : true } }{    ...\r\nother parts of indexer definition    \u0022parameters\u0022 : { \u0022maxFailedItems\u0022 : 10, \u0022maxFailedItemsPerBatch\u0022 : 10 }}See alsoAttach an Azure AI multi-serviceresource to a skillset in Azure AI SearchArticle•11/15/2023When configuring an optional AI enrichment pipeline in Azure AI Search, you can enricha limited number of documents free of charge. For larger and more frequent workloads,you should attach a billable Azure AI multi-service resource.A multi-service resource references a subset of \u0022Azure AI services\u0022 as the offering, ratherthan individual services, with access granted through a single API key.\n"
}