{
  "Id": "1397",
  "Title": "\u0022Managing API Keys and Role Assignments in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBy default, the portal uses APIkeys to authenticate the request automatically. However, if you disable API keys andset up role assignments, the portal uses role assignments instead.In Cognitive Search, most tasks can be performed in Azure portal, including objectcreation, indexing through the Import data wizard, and queries through Searchexplorer.Portal７ NoteIt\u0027s considered a poor security practice to pass sensitive data such as an api-key inthe request URI. For this reason, Azure Cognitive Search only accepts a query key asan api-key in the query string. As a general rule, we recommend passing your api-key as a request header.\r\nPermissions for viewing and managing API keys are conveyed through role assignments.Members of the following roles can view and regenerate keys:OwnerContributorSearch Service ContributorAdministrator and co-administrator (classic)The following roles don\u0027t have access to API keys:ReaderSearch Index Data ContributorSearch Index Data ReaderYou can view and manage API keys in the Azure portal, or through PowerShell, AzureCLI, or REST API.\r\n1. Sign in to the Azure portal and find your search service.2. Under Settings, select Keys to view admin and query keys.Permissions to view or manage API keysFind existing keysPortalQuery keys are used for read-only access to documents within an index for operationstargeting a documents collection.\r\nSearch, filter, and suggestion queries are alloperations that take a query key. Any read-only operation that returns system data orobject definitions, such as an index definition or indexer status, requires an admin key.Restricting access and operations in client apps is essential to safeguarding the searchassets on your service. Always use a query key rather than an admin key for any queryoriginating from a client app.1. Sign in to the Azure portal and find your search service.2. Under Settings, select Keys to view API keys.3. Under Manage query keys, use the query key already generated for yourservice, or create new query keys.\n"
}