{
  "Id": "533",
  "Title": "\u0022Managing Index Projections and Key Values in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfEach time you run the indexer and skillset, the index projections are updated if theskillset or underlying source data has changed. Any changes picked up by the indexerare propagated through the enrichment process to the projections in the index,ensuring that your projected data is a current representation of content in theoriginating data source.Each index projection document contains a unique identifying key that the indexergenerates in order to ensure uniqueness and allow for change and deletion tracking towork correctly. This key contains the following segments:A random hash to guarantee uniqueness. This hash changes if the parentdocument is updated across indexer runs.\r\nThe parent document\u0027s key.The enrichment annotation path that identifies the context that that document wasgenerated from.For example, if you split a parent document with key value \u0022123\u0022 into four pages, andthen each of those pages is projected as its own document via index projections, the keyfor the third page of text would look something like \u002201f07abfe7ed_123_pages_2\u0022.\r\nIf theparent document is then updated to add a fifth page, the new key for the third pagemight, for example, be \u00229d800bdacc0e_123_pages_2\u0022, since the random hash valuechanges between indexer runs even though the rest of the projection data didn\u0027tchange.\r\nContent lifecycle７ NoteWhile you can manually edit the data in the projected documents using the indexpush API, any edits will be overwritten on the next pipeline invocation, assumingthe document in source data is updated.Projected key valueIf a parent document is changed such that the data within a projected index documentchanges (an example would be if a word was changed in a particular page but no netnew pages were added), the data in the target index for that particular projection isupdated to reflect that change. If a parent document is changed such that there are new projected child documents thatweren\u0027t there before (an example would be if one or more pages worth of text wereadded to the document), those new child documents are added next time the indexerruns.\n"
}