{
  "Id": "913",
  "Title": "\u0022Managing Azure Blob Metadata and Data Source Definitions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfString) - the file name of the blob. For example, ifyou have a blob /my-container/my-folder/subfolder/resume.pdf, the value of thisfield is resume.pdf.metadata_storage_path (Edm.String) - the full URI of the blob, including thestorage account. For example, https://myaccount.blob.core.windows.net/my-container/my-folder/subfolder/resume.pdfmetadata_storage_content_type (Edm.String) - content type as specified by thecode you used to upload the blob. For example, application/octet-stream.metadata_storage_last_modified (Edm.DateTimeOffset) - last modified timestampfor the blob.\r\nAzure Cognitive Search uses this timestamp to identify changedblobs, to avoid reindexing everything after the initial indexing.metadata_storage_size (Edm.Int64) - blob size in bytes.metadata_storage_content_md5 (Edm.String) - MD5 hash of the blob content, ifavailable.metadata_storage_sas_token (Edm.\r\nString) - A temporary SAS token that can beused by custom skills to get access to the blob. This token shouldn\u0027t be stored forlater use as it might expire.Lastly, any metadata properties specific to the document format of the blobs you\u0027reindexing can also be represented in the index schema. For more information aboutcontent-specific metadata, see Content metadata properties.\r\nIt\u0027s important to point out that you don\u0027t need to define fields for all of the aboveproperties in your search index - just capture the properties you need for yourapplication.Currently, indexing blob index tags is not supported by this indexer.Define the data sourceThe data source definition specifies the data to index, credentials, and policies foridentifying changes in the data. A data source is defined as an independent resource sothat it can be used by multiple indexers.1. Create or update a data source to set its definition:JSON2. Set \u0022type\u0022 to \u0022azureblob\u0022 (required).3. Set \u0022credentials\u0022 to an Azure Storage connection string. The next section describesthe supported formats.\n"
}