{
  "Id": "1403",
  "Title": "\u0022Managing Role Assignments and Access Control in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRemember that roles are cumulative and inheritedroles that are scoped to the subscription or resource group can\u0027t be deleted or deniedat the resource (search service) level.Make sure that you register your client application with Microsoft Entra ID and have roleassignments in place before testing access.1. Sign in to the Azure portal.2. Navigate to your search service.\r\n3. On the Overview page, select the Indexes tab:Test role assignmentsAzure portalContributors can view and create any object, but can\u0027t query an indexusing Search Explorer.Search Index Data Readers can use Search Explorer to query the index.You can use any API version to check for access.\r\nYou should be able tosend queries and view results, but you shouldn\u0027t be able to view theindex definition.Search Index Data Contributors can select New Index to create a newindex. Saving a new index verifies write access on the service.If you\u0027re already a Contributor or Owner of your search service, you can present a bearertoken for your user identity for authentication to Azure AI Search.\r\nThe followinginstructions explain how to set up a Postman collection to send requests as the currentuser.1. Get a bearer token for the current user:Azure CLI2. Start a new Postman collection and edit its properties. In the Variables tab, createthe following variable:VariableDescriptionbearerToken(copy-paste from get-access-token output on the command line)3.\r\nIn the Authorization tab, select Bearer Token as the type.4. In the Token field, specify the variable placeholder {{bearerToken}}.5. Save the collection.6. Send a request to confirm access. Here\u0027s one that queries the hotels-quickstartindex:HTTPTest as current useraz account get-access-token --scope https://search. azure.com/.defaultIn some scenarios, you may want to limit application\u0027s access to a single resource, suchas an index.The portal doesn\u0027t currently support role assignments at this level of granularity, but itcan be done with PowerShell or the Azure CLI.In PowerShell, use New-AzRoleAssignment, providing the Azure user or group name,and the scope of the assignment.\n"
}