{
  "Id": "451",
  "Title": "\u0022Managing Indexes in Cognitive Search: Best Practices and Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn Cognitive Search, you\u0027ll work with one index at a time, where all index-relatedoperations target a single index. There\u0027s no concept of related indexes or the joining ofindependent indexes for either indexing or querying.An index is continuously available, with no ability to pause or take it offline. Because it\u0027sdesigned for continuous operation, any updates to its content, or additions to the indexitself, happen in real time.\r\nAs a result, queries might temporarily return incompleteresults if a request coincides with a document update.Notice that query continuity exists for document operations (refreshing or deleting) andfor modifications that don\u0027t affect the existing structure and integrity of the currentindex (such as adding new fields).\r\nIf you need to make structural updates (changingexisting fields), those are typically managed using a drop-and-rebuild workflow in adevelopment environment, or by creating a new version of the index on productionservice.To avoid an index rebuild, some customers who are making small changes choose to\u0022version\u0022 a field by creating a new one that coexists alongside a previous version. Overtime, this leads to orphaned content in the form of obsolete fields or obsolete customanalyzer definitions, especially in a production index that is expensive to replicate. Youcan address these issues on planned updates to the index as part of index lifecyclemanagement.７ NoteWhen managing an index, be aware that there is no portal or API support formoving or copying an index. Instead, customers typically point their applicationdeployment solution at a different search service (if using the same index name), orrevise the name to create a copy on the current search service, and then build it.Index isolationContinuously availableEndpoint connection and securityAll indexing and query requests target an index. Endpoints are usually one of thefollowing:EndpointConnection and access control\u003Cyour-service\u003E.search.windows.\n"
}