{
  "Id": "1377",
  "Title": "\u0022Managing Azure Search Services with Azure CLI Commands\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe following commands are from az resource, returning information about existingresources and services already provisioned in your subscription. If you don\u0027t know howmany search services are already created, these commands return that information,saving you a trip to the portal.The first command returns all search services.Azure CLIFrom the list of services, return information about a specific resource.Azure CLIYou can view information on the subgroups and commands available in az search fromwithin the CLI. Alternatively, you can review the documentation.To view the subgroups available within az search, run the following command.\r\nAzure CLIList services in a subscriptionaz resource list --resource-type Microsoft.Search/searchServices --output tableaz resource list --name \u003Csearch-service-name\u003EList all az search commandsThe response should look similar to the following output.Within each subgroup, multiple commands are available. You can see the availablecommands for the service subgroup by running the following line.Azure CLIYou can also see the arguments available for a particular command.Azure CLIIf you know the resource group containing your search service, run az search serviceshow to return the service definition, including name, region, tier, and replica andpartition counts.\r\nFor this command, provide the resource group that contains the searchservice.az search --helpGroup    az search : Manage Azure Search services, admin keys and query keys.        WARNING: This command group is in preview and under development. Reference and support        levels: https://aka.ms/CLI_refstatusSubgroups:    admin-key                    : Manage Azure Search admin keys.\r\nprivate-endpoint-connection  : Manage Azure Search private endpoint connections.    private-link-resource        : Manage Azure Search private link resources.    query-key                    : Manage Azure Search query keys.    service                      : Manage Azure Search services.    shared-private-link-resource : Manage Azure Search shared private link resources. For more specific examples, use: az find \u0022az search\u0022az search service --helpaz search service create --helpGet search service informationAzure CLITo create a new search service, use the az search service create command.\n"
}