{
  "Id": "1565",
  "Title": "\u0022Managing Azure AI Search Resource Logs: Admin Key Regeneration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRegenerate AdminKeyA request to regenerate either the primary or secondary admin API key.Common entries include references to API keys - generic informational notifications likeGet Admin Key and Get Query keys. These activities indicate requests that were madeusing the admin key (create or delete objects) or query key, but do not show the requestitself. For information of this grain, you must configure resource logging.Alternatively, you might gain some insight through change history. In Azure portal,select the activity to open the detail page and then select \u0022Change history\u0022 forinformation about the underlying operation.\r\nFor more information on the schema of Activity Log entries, see Activity Log schema.The following schemas are in use by Azure AI Search. If you are building queries orcustom reports, the data structures that contain Azure AI Search resource logs conformto the schema below.For resource logs sent to blob storage, each blob has one root object called recordscontaining an array of log objects. Each blob contains records for all the operations thattook place during the same hour.All resource logs available through Azure Monitor share a common top-level schema.Azure AI Search supplements with additional properties and operations that are uniqueto a search service.\r\nThe following example illustrates a resource log that includes common properties(TimeGenerated, Resource, Category, and so forth) and search-specific propertiesActivity logsSchemasResource log schema(OperationName and OperationVersion).NameTypeDescription and exampleTimeGeneratedDatetimeTimestamp of the operation.\r\nFor example: 2021-12-07T00:00:43.6872559ZResourceStringResource ID. For example: /subscriptions/\u003Cyour-subscription-id\u003E/resourceGroups/\u003Cyour-resource-group-name\u003E/providers/Microsoft.Search/searchServices/\u003Cyour-search-service-name\u003ECategoryString\u0022OperationLogs\u0022. This value is a constant. OperationLogs is theonly category used for resource logs. OperationNameStringThe name of the operation (see the full list of operations below).An example is Query.SearchOperationVersionStringThe api-version used on the request. For example: 2020-06-30ResultTypeString\u0022Success\u0022. Other possible values: Success or FailureResultSignatureIntAn HTTP result code. For example: 200DurationMSIntDuration of the operation in milliseconds.PropertiesObjectObject containing operation-specific data. See the followingproperties schema table.The properties below are specific to Azure AI Search.NameTypeDescription and exampleDescription_sStringThe operation\u0027s endpoint.\n"
}