{
  "Id": "1134",
  "Title": "\u0022Managing Relationships and Projections in Power BI Data Modeling\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe outcome consists of separate but related tables that you can work with individually.In the example, projectionShape is the consolidated shape (or enrichment node). In theprojection definition, projectionShape is sliced into additional tables, which enables youto pull out parts of the shape, keyPhrases and Entities. In Power BI, this is useful asmultiple entities and keyPhrases are associated with each document, and you\u0027ll getmore insights if you can see entities and keyPhrases as categorized data.\r\nSlicing implicitly generates a relationship between the parent and child tables, using thegeneratedKeyName in the parent table to create a column with the same name in thechild table.The generatedKeyName and referenceKeyName properties are used to relate data acrosstables or even across projection types. Each row in the child table has a propertypointing back to the parent. The name of the column or property in the child is thereferenceKeyName from the parent. When the referenceKeyName isn\u0027t provided, theservice defaults it to the generatedKeyName from the parent.Power BI relies on these generated keys to discover relationships within the tables.\r\nIf youneed the column in the child table named differently, set the referenceKeyName propertyon the parent table. One example would be to set the generatedKeyName as ID on thetblDocument table and the referenceKeyName as DocumentID. This would result in thecolumn in the tblEntities and tblKeyPhrases tables containing the document ID beingnamed DocumentID.Slicing a table into multiple child tablesNaming relationshipsProjecting blob documentsObject projections are JSON representations of the enrichment tree that can be sourcedfrom any node. In comparison with table projections, object projections are simpler todefine and are used when projecting whole documents. Object projections are limited toa single projection in a container and can\u0027t be sliced.To define an object projection, use the objects array in the projections property.The source is the path to a node of the enrichment tree that is the root of theprojection. Although it isn\u0027t required, the node path is usually the output of a Shaperskill.\n"
}