{
  "Id": "598",
  "Title": "\u0022Managing Limits and Capacity in Azure AI Search Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf000 characters in a search clauseThe maximum number of clauses in search (expressions separated by AND or OR) is 1024Maximum search term size is 32,766 bytes (32 KB minus 2 bytes) of UTF-8 encoded textMaximum search term size is 1000 characters for prefix search and regex searchWildcard search and Regular expression search are limited to a maximum of 1000 stateswhen processed by Lucene.\r\nIn Azure AI Search, the body of a request is subject to an upper limit of 16 MB, imposing apractical limit on the contents of individual fields or collections that aren\u0027t otherwiseconstrained by theoretical limits (see Supported data types for more information about fieldcomposition and restrictions).Limits on query size and composition exist because unbounded queries can destabilize yoursearch service.\r\nTypically, such queries are created programmatically. If your applicationgenerates search queries programmatically, we recommend designing it in such a way that itdoesn\u0027t generate queries of unbounded size.Maximum 1000 documents returned per page of search resultsMaximum 100 suggestions returned per Suggest API requestAPI keys are used for service authentication.\r\nThere are two types. Admin keys are specified inthe request header and grant full read-write access to the service. Query keys are read-only,specified on the URL, and typically distributed to client applications.\r\nMaximum of 2 admin keys per serviceMaximum of 50 query keys per service11API response limitsAPI key limitsEstimate and manage capacity of asearch serviceArticle•03/16/2023Before you create a search service and lock in a specific pricing tier, take a few minutesto understand how capacity works and how you might adjust replicas and partitions toaccommodate workload fluctuation.In Azure Cognitive Search, capacity is based on replicas and partitions that can be scaledto your workload. Replicas are copies of the search engine. Partitions are units ofstorage. Each new search service starts with one each, but you can adjust each unitindependently to accommodate fluctuating workloads. Adding either unit is billable.The physical characteristics of replicas and partitions, such as processing speed and diskIO, vary by service tier. If you provisioned on Standard, replicas and partitions will befaster and larger than those of Basic.Changing capacity isn\u0027t instantaneous. It can take up to an hour to commission ordecommission partitions, especially on services with large amounts of data.\n"
}