{
  "Id": "1375",
  "Title": "\u0022Managing Azure AI Search with Azure CLI and REST APIs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStorage/storageAccounts/myBlobStorage -GroupId \u003Cgroup-id\u003E -RequestMessage \u0022Please approve\u0022 Get-AzSearchSharedPrivateLinkResource -ResourceGroupName \u003Csearch-service-resource-group-name\u003E -ServiceName \u003Csearch-service-name\u003E -Name \u003Cspl-name\u003EApprove-AzPrivateEndpointConnection \u0060    -Name \u003Cspl-name\u003E \u0060    -ServiceName \u003Csearch-service-name\u003E\r\n\u0060    -ResourceGroupName \u003Csearch-service-resource-group-name\u003E \u0060    -Description = \u0022Approved\u0022$job = Remove-AzSearchSharedPrivateLinkResource -ResourceGroupName \u003Csearch-service-resource-group-name\u003E -ServiceName \u003Csearch-service-name\u003E -Name \u003Cspl-name\u003E -Force -AsJob$job | Get-JobNext stepsHow to use Azure AI Search in .\r\nNETManage your Azure AI Search servicewith the Azure CLIArticle•11/15/2023You can run Azure CLI commands and scripts on Windows, macOS, Linux, or in AzureCloud Shell to create and configure Azure AI Search.\r\nThe az search module extends theAzure CLI with full parity to the Search Management REST APIs and the ability toperform the following tasks:Occasionally, questions are asked about tasks not on the above list.You cannot change a server name, region, or tier programmatically or in the portal.Dedicated resources are allocated when a service is created. As such, changing theunderlying hardware (location or node type) requires a new service.\r\nYou cannot use tools or APIs to transfer content, such as an index, from one service toanother. Within a service, programmatic creation of content is through Search ServiceREST API or an SDK such as Azure SDK for .NET. While there are no dedicatedcommands for content migration, you can write script that calls REST API or a clientlibrary to create and load indexes on a new service. Preview administration features are typically not available in the az search module. Ifyou want to use a preview feature, use the Management REST API and a preview APIversion.Use the Bash environment in Azure Cloud Shell. For more information, seeQuickstart for Bash in Azure Cloud Shell.\n"
}