{
  "Id": "453",
  "Title": "\u0022Managing Vector Index Size Limits in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCreate a search indexCreate an index aliasData import overviewAdd, Update or Delete Documents (REST)Next stepsVector index size limitArticle•11/17/2023When you index documents with vector fields, Azure AI Search constructs internal vectorindexes using the algorithm parameters that you specified for the field. Because AzureAI Search imposes limits on vector index size, it\u0027s important that you know how toretrieve metrics about the vector index size, and how to estimate the vector index sizerequirements for your use case.\r\nThe size of vector indexes is measured in bytes. The size constraints are based onmemory reserved for vector search, but also have implications for storage at the servicelevel. Size constraints vary by service tier (or SKU).The service enforces a vector index size quota based on the number of partitions inyour search service, where the quota per partition varies by tier and also by servicecreation date (see Vector index size limits in service limits).Each extra partition that you add to your service increases the available vector index sizequota.\r\nThis quota is a hard limit to ensure your service remains healthy. It also meansthat if vector size exceeds this limit, any further indexing requests result in failure. Youcan resume indexing once you free up available quota by either deleting some vectordocuments or by scaling up in partitions.The following table shows vector quotas by partition, and by service if all partitions arein use. This table is for newer search services created after July 1, 2023. For moreinformation, including limits for older search services and also limits on the approximatenumber of embeddings per partition, see Search service limits. TierPartitionsStorage(GB)Vector quota per partition(GB)Vector quota per service(GB)Basic1211S11225336S21210012144S31220036432L1121,00012144Key points about vector size limitsTierPartitionsStorage(GB)Vector quota per partition(GB)Vector quota per service(GB)L2122,00036432Key points:Storage quota is the physical storage available to the search service for all searchdata.\n"
}