{
  "Id": "972",
  "Title": "\u0022Managing Azure Search for MySQL: Key Requirements and Limitations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA primary key is required. If you\u0027re usinga view, it must have a high water mark column.Read permissions. A full access connection string includes a key that grants accessto the content, but if you\u0027re using Azure roles, make sure the search servicemanaged identity has Reader permissions on MySQL.\r\n） ImportantMySQL support is currently in public preview under Supplemental Terms of Use.Use a preview REST API (2020-06-30-preview or later) to index your content. Thereis currently no portal support.PrerequisitesA REST client, such as Postman, to send REST calls that create the data source,index, and indexer.You can also use the Azure SDK for .\r\nNET. You can\u0027t use the portal for indexercreation, but you can manage indexers and data sources once they\u0027re created.For more information, see Azure Database for MySQL.Currently, change tracking and deletion detection aren\u0027t working if the date ortimestamp is uniform for all rows. This limitation is a known issue to be addressed in anupdate to the preview. Until this issue is addressed, don’t add a skillset to the MySQLindexer.The preview doesn’t support geometry types and blobs.As noted, there’s no portal support for indexer creation, but a MySQL indexer and datasource can be managed in the portal once they exist. For example, you can edit thedefinitions, and reset, run, or schedule the indexer.The data source definition specifies the data to index, credentials, and policies foridentifying changes in the data. The data source is defined as an independent resourceso that it can be used by multiple indexers.1. Create or Update Data Source specifies the definition. Be sure to use a previewREST API version (2020-06-30-Preview or later) when creating the data source.HTTPPreview limitationsDefine the data sourcePOST https://[search service name].search.windows.\n"
}