{
  "Id": "19",
  "Title": "\u0022Managing Azure Search Services and SDKs: A Comprehensive Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfManagement REST API is for service creation and provisioningthrough Azure Resource Manager. You can also use this API tomanage keys and capacity.Azure SDK for .NETAzure.Search.Documents is for data plane operations, including alloperations related to indexing, queries, and AI enrichment. You canalso use this client library to retrieve system information andstatistics.Microsoft.Azure.Management.Search is for service creation andprovisioning through Azure Resource Manager. You can also usethis API to manage keys and capacity.Azure SDK for Javacom.azure.search.documents is for data plane operations,including all operations related to indexing, queries, and AIenrichment.\r\nYou can also use this client library to retrieve systeminformation and statistics.com.microsoft.azure.management.search is for service creationand provisioning through Azure Resource Manager. You can alsouse this API to manage keys and capacity.Azure SDK for Pythonazure-search-documents is for data plane operations, including alloperations related to indexing, queries, and AI enrichment. You canalso use this client library to retrieve system information andstatistics.azure-mgmt-search is for service creation and provisioningProgrammabilityCategory                           Featuresthrough Azure Resource Manager. You can also use this API tomanage keys and capacity.\r\nAzure SDK forJavaScript/TypeScriptazure/search-documents is for data plane operations, including alloperations related to indexing, queries, and AI enrichment. You canalso use this client library to retrieve system information andstatistics.azure/arm-search is for service creation and provisioning throughAzure Resource Manager. You can also use this API to manage keysand capacity. What\u0027s new in Azure AI SearchPreview features in Azure AI SearchSee alsoAzure AI Search Frequently AskedQuestionsFAQFind answers to commonly asked questions about Azure AI Search.Azure AI Search is a service on Azure that provides a dedicated search engine andpersistent storage of your searchable content for full text and vector search scenarios.\n"
}