{
  "Id": "1372",
  "Title": "\u0022Managing Azure AI Search: Query Keys and Scaling Resources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBoth keys are returned even thoughyou only change one at a time.\r\nNew-AzSearchQueryKey is used to create query API keys for read-only access fromclient apps to an Azure AI Search index. Query keys are used to authenticate to aspecific index for the purpose of retrieving search results. Query keys do not grant read-only access to other items on the service, such as an index, data source, or indexer.\r\nYou cannot provide a key for Azure AI Search to use. API keys are generated by theservice.Azure PowerShellSet-AzSearchService is used to increase or decrease replicas and partitions to readjustbillable resources within your service. Increasing replicas or partitions adds to your bill,which has both fixed and variable charges.\r\nIf you have a temporary need for additionalprocessing power, you can increase replicas and partitions to handle the workload. Themonitoring area in the Overview portal page has tiles on query latency, queries persecond, and throttling, indicating whether current capacity is adequate.It can take a while to add or remove resourcing. Adjustments to capacity occur in thebackground, allowing existing workloads to continue. Additional capacity is used forincoming requests as soon as it\u0027s ready, with no additional configuration required.Removing capacity can be disruptive. Stopping all indexing and indexer jobs prior toreducing capacity is recommended to avoid dropped requests. If that isn\u0027t feasible, youmight consider reducing capacity incrementally, one replica and partition at a time, untilyour new target levels are reached.Primary                    Secondary-------                    ---------\u003Calphanumeric-guid\u003E        \u003Calphanumeric-guid\u003E  Create or delete query keysNew-AzSearchQueryKey -ResourceGroupName \u003Csearch-service-resource-group-name\u003E -ServiceName \u003Csearch-service-name\u003E -Name \u003Cquery-key-name\u003E Scale replicas and partitionsOnce you submit the command, there is no way to terminate it midway through. You willhave to wait until the command is finished before revising the counts.\n"
}