{
  "Id": "1427",
  "Title": "\u0022Managing Azure Search Service Network Connectivity Changes and Shared Private Link Resources\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearch service network connectivity changestalled in an \u0022Updating\u0022 stateShared private link resource stalled in an\u0022Updating\u0022 or \u0022Incomplete\u0022 stateIf you observe that the shared private link resource hasn\u0027t transitioned to a terminalstate, wait for a few hours to ensure that it becomes Failed before you can delete it andre-create it.\r\nAlternatively, instead of waiting you can try to create another shared privatelink resource with a different name (keeping all other parameters the same).An existing shared private link resource can be updated using the Create or Update API.Search only allows for narrow updates to the shared private link resource - only therequest message can be modified via this API.It isn\u0027t possible to update any of the \u0022core\u0022 properties of an existing shared privatelink resource (such as privateLinkResourceId or groupId) and this will always beunsupported.\r\nIf any other property besides the request message needs to bechanged, we advise customers to delete and re-create the shared private linkresource.Attempt to update the request message of a shared private link resource is onlypossible if it has reached the provisioning state of Succeeded.Customers can delete an existing shared private link resource via the Delete API. Similarto the process of creation (or update), this is also an asynchronous operation with foursteps:1. You request a search service to delete the shared private link resource.2. The search service validates that the resource exists and is in a state valid fordeletion. If so, it initiates an Azure Resource Manager delete operation to removethe resource.3. Search queries for the completion of the operation (which usually takes a fewminutes). At this point, the shared private link resource would have a provisioningstate of \u0022Deleting\u0022.4. Once the operation completes successfully, the backing private endpoint and anyassociated DNS mappings are removed. The resource won\u0027t show up as part of Listoperation and attempting a Get operation on this resource will result in a 404 NotFound.Updating a shared private link resourceDeleting a shared private link resourceSome common errors that occur during the deletion phase are listed below.\n"
}