{
  "Id": "1",
  "Title": "\u0022Mastering Azure AI Search: Documentation and Implementation Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTell us about your PDF experience.Azure AI Search documentationInformation retrieval at scale for traditional and conversational search applications, withsecurity and options for AI enrichment and vectorization.\r\nAbout AI SearchｅOVERVIEWWhat is Azure AI Search?Vector searchIntegrated vectorization (preview)Retrieval Augmented Generation (RAG)Semantic rankingｄTRAININGLearning module10-minute quickstartsｆQUICKSTARTCreate a search serviceCreate a search indexCreate a vector indexCreate a demo appCreate a skillsetDevelop appsｇTUTORIALAdd search to web appsｃHOW-TO GUIDEDevelop in .NETDevelop in RESTｉREFERENCEAzure REST API ReferenceAzure SDK for .\r\nNETAzure SDK for PythonAzure SDK for JavaAzure SDK for JavaScriptIndex dataｅOVERVIEWWhat\u0027s a search index?Importing dataIndexer overviewｃHOW-TO GUIDEIndex from Azure Blob StorageIndex from Azure SQL DatabaseIndex from Azure Cosmos DBIndex any dataQuery dataｐCONCEPTQuery types and compositionQuery vector dataSimple syntax (default)Full Lucene syntaxｃHOW-TO GUIDECreate a simple queryCreate advanced queriesｉREFERENCEOData language referenceSearch Documents (REST)Enrich with AIｐCONCEPTWhat is AI enrichment?\r\nSkillsetsKnowledge storesWhat\u0027s Azure AI Search?Article•11/22/2023Azure AI Search (formerly known as \u0022Azure Cognitive Search\u0022) provides secureinformation retrieval at scale over user-owned content in traditional and conversationalsearch applications.\r\nInformation retrieval is foundational to any app that surfaces text and vectors. Commonscenarios include catalog or document search, data exploration, and increasingly chat-style search modalities over proprietary grounding data.\r\nWhen you create a searchservice, you\u0027ll work with the following capabilities: A search engine for full text and vector search over a search indexRich indexing, with integrated data chunking and vectorization (preview), lexicalanalysis for text, and optional AI enrichment for content extraction andtransformationRich query syntax for vector queries, text search, hybrid search, fuzzy search,autocomplete, geo-search and othersAzure scale, security, and reachAzure integration at the data layer, machine learning layer, Azure AI services andAzure OpenAIArchitecturally, a search service sits between the external data stores that contain yourun-indexed data, and your client app that sends query requests to a search index andhandles the response.\n"
}