{
  "Id": "88",
  "Title": "\u0022Mastering Azure AI Search: Skillsets, Indexers, and Querying Techniques\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfQuery in Search explorerHere\u0027s some JSON you can paste into the view:JSONYou\u0027ve now created your first skillset and learned the basic steps of skills-basedindexing.{\u0022search\u0022: \u0022\\\u0022Satya Nadella\\\u0022 \u002B\\\u0022Bill Gates\\\u0022 \u002B\\\u0022Steve Ballmer\\\u0022\u0022,\u0022count\u0022: true,\u0022select\u0022: \u0022content, people\u0022} TipQuery strings are case-sensitive so if you get an \u0022unknown field\u0022 message, checkFields or Index Definition (JSON) to verify name and case.\r\nTakeawaysSome key concepts that we hope you picked up include the dependencies. A skillset isbound to an indexer, and indexers are Azure and source-specific. Although thisquickstart uses Azure Blob Storage, other Azure data sources are possible.\r\nFor moreinformation, see Indexers in Azure AI Search.Another important concept is that skills operate over content types, and when workingwith heterogeneous content, some inputs are skipped. Also, large files or fields mightexceed the indexer limits of your service tier. It\u0027s normal to see warnings when theseevents occur.\r\nOutput is routed to a search index, and there\u0027s a mapping between name-value pairscreated during indexing and individual fields in your index. Internally, the wizard sets upan enrichment tree and defines a skillset, establishing the order of operations andgeneral flow. These steps are hidden in the wizard, but when you start writing code,these concepts become important. Finally, you learned that can verify content by querying the index. In the end, what AzureAI Search provides is a searchable index, which you can query using either the simple orfully extended query syntax. An index containing enriched fields is like any other. If youwant to incorporate standard or custom analyzers, scoring profiles, synonyms, facetednavigation, geo-search, or any other Azure AI Search feature, you can certainly do so.When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created. Resources left running cancost you money.\n"
}