{
  "Id": "1627",
  "Title": "\u0022Mastering OData Filters for Azure AI Search: Geo-spatial Functions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfodata-filter-exprFilters in Azure AI SearchOData expression language overview for Azure AI SearchOData expression syntax reference for Azure AI SearchSearch Documents (Azure AI Search REST API)    not search.ismatch(\u0027luxury\u0027)    search.ismatchscoring(\u0027\u0022ocean view\u0022\u0027, \u0027Rooms/Description,HotelName\u0027) or Rating eq 5    search.\r\nismatch(\u0027\u0022hotel airport\u0022~5\u0027, \u0027Description\u0027, \u0027full\u0027, \u0027any\u0027) and Rooms/any(room: not room/SmokingAllowed)    search.ismatch(\u0027lux*\u0027, \u0027Description\u0027)Next stepsOData geo-spatial functions in Azure AISearch - geo.distance andgeo.intersectsArticle•11/15/2023Azure AI Search supports geo-spatial queries in OData filter expressions via thegeo.distance and geo.intersects functions.\r\nThe geo.distance function returns thedistance in kilometers between two points, one being a field or range variable, and onebeing a constant passed as part of the filter. The geo.intersects function returns true ifa given point is within a given polygon, where the point is a field or range variable andthe polygon is specified as a constant passed as part of the filter.\r\nThe geo.distance function can also be used in the $orderby parameter to sort searchresults by distance from a given point. The syntax for geo.distance in $orderby is thesame as it is in $filter. When using geo.distance in $orderby, the field to which itapplies must be of type Edm.GeographyPoint and it must also be sortable. The following EBNF (Extended Backus-Naur Form) defines the grammar of thegeo.distance and geo.intersects functions, as well as the geo-spatial values on whichthey operate:７ NoteWhen using geo.distance in the $orderby parameter, the field you pass to thefunction must contain only a single geo-point. In other words, it must be of typeEdm.GeographyPoint and not Collection(Edm.\n"
}