{
  "Id": "1218",
  "Title": "\u0022Mastering Collection Filters in Azure AI Search: Advanced Techniques\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearch term: \u0022cloud computing\u0022Content type   Internal specification (254)   Video (10)A facet-only search experienceValidate inputs at query-timeDemos and samplesAdd search to web apps (React)NYCJobs sample code and demo (Ajax)Understanding OData collection filtersin Azure AI SearchArticle•11/15/2023To filter on collection fields in Azure AI Search, you can use the any and all operatorstogether with lambda expressions.\r\nLambda expressions are Boolean expressions thatrefer to a range variable. The any and all operators are analogous to a for loop inmost programming languages, with the range variable taking the role of loop variable,and the lambda expression as the body of the loop.\r\nThe range variable takes on the\u0022current\u0022 value of the collection during iteration of the loop.At least that\u0027s how it works conceptually. In reality, Azure AI Search implements filters ina very different way to how for loops work. Ideally, this difference would be invisible toyou, but in certain situations it isn\u0027t.\r\nThe end result is that there are rules you have tofollow when writing lambda expressions.This article explains why the rules for collection filters exist by exploring how Azure AISearch executes these filters. If you\u0027re writing advanced filters with complex lambdaexpressions, you may find this article helpful in building your understanding of what\u0027spossible in filters and why. For information on what the rules for collection filters are, including examples, seeTroubleshooting OData collection filters in Azure AI Search.There are three underlying reasons why not all filter features are supported for all typesof collections:1. Only certain operators are supported for certain data types. For example, it doesn\u0027tmake sense to compare the Boolean values true and false using lt, gt, and soon.2. Azure AI Search doesn\u0027t support correlated search on fields of typeCollection(Edm.ComplexType).3. Azure AI Search uses inverted indexes to execute filters over all types of data,including collections.\n"
}