{
  "Id": "1613",
  "Title": "\u0022Mastering OData Syntax for Azure AI Search Results Composition\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe syntax for search.score in $orderby is search.score(). The function search.scoredoesn\u0027t take any parameters.Sort hotels ascending by base rate:odata-filter-exprSort hotels descending by rating, then ascending by base rate (remember thatascending is the default):odata-filter-exprSort hotels descending by rating, then ascending by distance from the givencoordinates:odata-filter-exprExamples    $orderby=BaseRate asc    $orderby=Rating desc,BaseRateSort hotels in descending order by search.score and rating, and then in ascending orderby distance from the given coordinates.\r\nBetween two hotels with identical relevancescores and ratings, the closest one is listed first:odata-filter-exprHow to work with search results in Azure AI SearchOData expression language overview for Azure AI SearchOData expression syntax reference for Azure AI SearchSearch Documents (Azure AI Search REST API)    $orderby=Rating desc,geo.distance(Location, geography\u0027POINT(-122.\r\n131577 47.678581)\u0027) asc    $orderby=search.score() desc,Rating desc,geo.distance(Location, geography\u0027POINT(-122.131577 47.678581)\u0027) ascSee alsoOData $select syntax in Azure AI SearchArticle•11/15/2023In Azure AI Search, the $select parameter specifies which fields to include in searchresults. This article describes the OData syntax of $select and provides examples.\r\nField path construction and constants are described in the OData language overview inAzure AI Search. For more information about search result composition, see How towork with search results in Azure AI Search.The $select parameter determines which fields for each document are returned in thequery result set. The following EBNF (Extended Backus-Naur Form) defines thegrammar for the $select parameter:An interactive syntax diagram is also available:The $select parameter comes in two forms:1. A single star (*), indicating that all retrievable fields should be returned, or2. A comma-separated list of field paths, identifying which fields should be returned.When using the second form, you may only specify retrievable fields in the list.\n"
}