{
  "Id": "1146",
  "Title": "\u0022Maximizing Azure Search: Parameters, Queries, and Client Integration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfParameters used to shape the response:select specifies which fields to return in the response. Only fields marked as\u0022retrievable\u0022 in the index can be used in a select statement.top returns the specified number of best-matching documents. In this example,only 10 hits are returned. You can use top and skip (not shown) to page the results.\r\ncount tells you how many documents in the entire index match overall, which canbe more than what are returned.orderby is used if you want to sort results by a value, such as a rating or location.Otherwise, the default is to use the relevance score to rank results. A field must beattributed as \u0022sortable\u0022 to be a candidate for this parameter.\r\nFor early development and proof-of-concept testing, start with Azure portal or thePostman app for making REST API calls. These approaches are interactive, useful forChoose a clienttargeted testing, and help you assess the effects of different properties without havingto write any code.To call search from within an app, use the Azure.Document.\r\nSearch client libraries in theAzure SDKs for .NET, Java, JavaScript, and Python.In the portal, when you open an index, you can work with Search Explorer alongsidethe index JSON definition in side-by-side tabs for easy access to field attributes.Check the Fields table to see which ones are searchable, sortable, filterable, andfacetable while testing queries.1.\r\nSign in to the Azure portal and find your search service.2. Open Indexes and select an index.3. An index opens to the Search explorer tab so that you can query right away.Switch to JSON view to specify query syntax. Here\u0027s a full text search query expression that works for the Hotels sampleindex:JSONThe following screenshot illustrates the query and response:Azure portal   {       \u0022search\u0022: \u0022pool spa \u002Bairport\u0022,       \u0022queryType\u0022: \u0022simple\u0022,       \u0022searchMode\u0022: \u0022any\u0022,       \u0022searchFields\u0022: \u0022Description, Tags\u0022,       \u0022select\u0022: \u0022HotelName, Description, Tags\u0022,       \u0022top\u0022: 10,       \u0022count\u0022: true   }If your query is full text search, a query parser is used to process any text that\u0027s passedas search terms and phrases.\n"
}