{
  "Id": "893",
  "Title": "\u0022Maximizing Content Extraction: Azure Blob Indexer Functionality and Configuration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou canalso extract standard and user-defined metadata.An indexer is a data-source-aware subservice in Azure AI Search, equipped with internallogic for sampling data, reading and retrieving data and metadata, and serializing datafrom native formats into JSON documents for subsequent import.Blobs in Azure Storage are indexed using the blob indexer. You can invoke this indexerby using the Azure search command in Azure Storage, the Import data wizard, a RESTAPI, or the .NET SDK. In code, you use this indexer by setting the type, and by providingconnection information that includes an Azure Storage account along with a blobcontainer.\r\nYou can subset your blobs by creating a virtual directory, which you can thenpass as a parameter, or by filtering on a file type extension.An indexer \u0022cracks a document\u0022, opening a blob to inspect content. After connecting tothe data source, it\u0027s the first step in the pipeline. For blob data, this is where PDF, Officedocs, and other content types are detected.\r\nDocument cracking with text extraction isno charge. If your blobs contain image content, images are ignored unless you add AIenrichment. Standard indexing applies only to text content.The Blob indexer comes with configuration parameters and supports change tracking ifthe underlying data provides sufficient information.\r\nYou can learn more about the corefunctionality in Blob indexer.Blob storage access tiers include hot, cool, and archive. Only hot and cool can beaccessed by indexers.By running a Blob indexer over a container, you can extract text and metadata from thefollowing content types with a single query:７ NoteAzure AI Search imposes indexer limits on how much text it extracts depending onthe pricing tier. A warning will appear in the indexer status response if documentsare truncated. Use a Blob indexer for content extractionSupported access tiersSupported content typesCSV (see Indexing CSV blobs)EMLEPUBGZHTMLJSON (see Indexing JSON blobs)KML (XML for geographic representations)Microsoft Office formats: DOCX/DOC/DOCM, XLSX/XLS/XLSM, PPTX/PPT/PPTM,MSG (Outlook emails), XML (both 2003 and 2006 WORD XML)Open Document formats:\n"
}