{
  "Id": "582",
  "Title": "\u0022Maximizing Azure AI Search Availability and Resource Management Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure AI Search doesn\u0027t provideinstant failover in the event of an outage.Multi-tenant architectures sometimes call for two or more services.Globally deployed applications might require search services in each geography tominimize latency.A second service isn\u0027t required for high availability. High availability for queries isachieved when you use 2 or more replicas in the same service. Replica updates aresequential, which means at least one is operational when a service update is rolled out.For more information about uptime, see Service Level Agreements.Azure AI Search restricts the number of resources you can initially create in asubscription.\r\nIf you exhaust your maximum limit, file a new support request to add moresearch services.1. Sign in to the Azure portal and find your search service.2. On the left-navigation pane, scroll down and select New Support Request.3. In Issue type, choose Service and subscription limits (quotas).4.\r\nSelect the subscription that needs more quota.5. Under Quota type, select Search and then select Next.6. In the Problem details section, select Enter details.７ NoteIn Azure AI Search, you cannot segregate indexing and querying operations; thus,you would never create multiple services for segregated workloads.\r\nAn index isalways queried on the service in which it was created (you cannot create an index inone service and copy it to another).Add more services to a subscription7. Follow the prompts to select the location and tier for which you want to increasethe limit.8. Add the number of new services you would like to add to your quota. The valuemust not be empty and must between 0 to 100. For example, the maximumnumber of S2 services is 8. If you want 12 services, you would request 4 of S2services.9. When you\u0027re finished, select Save and continue to continue creating your supportrequest.10. Provide the additional information required to file the request, and then selectNext.\n"
}