{
  "Id": "615",
  "Title": "\u0022Maximizing Reliability and Cost Efficiency in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDeleting a service is permanent and also deletes itsassociated data.Can I change the billing rate (tier) of an existing search service?In-place upgrade or downgrade is not supported. Changing a service tier requiresprovisioning a new service at the desired tier.Learn more on how pricing works with Azure AI Search. See Azure AI Searchpricing page.Learn more about replicas and partitions.Learn how to optimize your cloud investment with Azure Cost Management.Learn more about managing costs with cost analysis.Learn about how to prevent unexpected costs.Take the Cost Management guided learning course.\r\nExport cost dataFAQNext stepsReliability in Azure AI SearchArticle•11/15/2023Across Azure, reliability means resiliency and availability if there\u0027s a service outage ordegradation. In Azure AI Search, reliability can be achieved within a single service orthrough multiple search services in separate regions.Deploy a single search service and scale up for high availability. You can addmultiple replicas to handle higher indexing and query workloads. If your searchservice supports availability zones, replicas are automatically provisioned indifferent physical data centers for extra resiliency.Deploy multiple search services across different geographic regions.\r\nAll searchworkloads are fully contained within a single service that runs in a singlegeographic region, but in a multi-service scenario, you have options forsynchronizing content so that it\u0027s the same across all services. You can also set up aload balancing solution to redistribute requests or fail over if there\u0027s a serviceoutage.For business continuity and recovery from disasters at a regional level, plan on a cross-regional topology, consisting of multiple search services having identical configurationand content. Your custom script or code provides the \u0022fail over\u0022 mechanism to analternate search service if one suddenly becomes unavailable. In Azure AI Search, replicas are copies of your index. A search service is commissionedwith at least one replica, and can have up to 12 replicas. Adding replicas allows Azure AISearch to do machine reboots and maintenance against one replica, while queryexecution continues on other replicas.For each individual search service, Microsoft guarantees at least 99.9% availability forconfigurations that meet these criteria:Two replicas for high availability of read-only workloads (queries)Three or more replicas for high availability of read-write workloads (queries andindexing)The system has internal mechanisms for monitoring replica health and partitionintegrity.\n"
}