{
  "Id": "41",
  "Title": "\u0022Maximizing Search Relevance with Azure AI: A Quickstart Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo searchwithout filtering, leave the Filter property unset, or don\u0027t pass in a SearchOptionsinstance at all.Press F5 to rebuild the app and run the program in its entirety.Output includes messages from Console.WriteLine, with the addition of queryinformation and results.When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created.\r\nResources left running can // Query 6 Console.WriteLine(\u0022Query #6: Call Autocomplete on HotelName that starts with \u0027sa\u0027...\\n\u0022); var autoresponse = srchclient.Autocomplete(\u0022sa\u0022, \u0022sg\u0022); WriteDocuments(autoresponse);// Call the RunQueries method to invoke a series of queriesConsole.WriteLine(\u0022Starting queries...\\n\u0022);RunQueries(srchclient);// End the programConsole.WriteLine(\u0022{0}\u0022, \u0022Complete. Press any key to end this program...\\n\u0022);Console.ReadKey();Run the programClean up resourcescost you money. You can delete resources individually or delete the resource group todelete the entire set of resources.\r\nYou can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.If you\u0027re using a free service, remember that you\u0027re limited to three indexes, indexers,and data sources. You can delete individual items in the portal to stay under the limit.In this quickstart, you worked through a set of tasks to create an index, load it withdocuments, and run queries. At different stages, we took shortcuts to simplify the codefor readability and comprehension. Now that you\u0027re familiar with the basic concepts, trya tutorial that calls the Azure AI Search APIs in a web app. Next stepsTutorial: Add search to web appsQuickstart: Semantic ranking with .NETor PythonArticle•11/15/2023In Azure AI Search, semantic ranking is query-side functionality that uses AI fromMicrosoft to rescore search results, moving results that have more semantic relevance tothe top of the list. Depending on the content and the query, semantic ranking cansignificantly improve search relevance, with minimal work for the developer.This quickstart walks you through the query modifications that invoke semantic ranking.An Azure account with an active subscription. Create an account for free.Azure AI Search, at Basic tier or higher, with semantic ranking enabled.\n"
}