{
  "Id": "1339",
  "Title": "\u0022Maximizing Data Integrity and Query Performance in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIt also explains how to get the query strings entered byapplication users.The Azure portal shows basic metrics about query latency, query load (QPS), andthrottling. Historical data that feeds into these metrics can be accessed in the portal for30 days. For longer retention, or to report on operational data and query strings, youmust enable a diagnostic setting that specifies a storage option for persisting loggedoperations and metrics.\r\nConditions that maximize the integrity of data measurement include:Use a billable service (a service created at either the Basic or a Standard tier). Thefree service is shared by multiple subscribers, which introduces a certain amount ofvolatility as loads shift.\r\nUse a single replica and partition, if possible, to create a contained and isolatedenvironment. If you use multiple replicas, query metrics are averaged acrossmultiple nodes, which can lower the precision of results. Similarly, multiplepartitions mean that data is divided, with the potential that some partitions mighthave different data if indexing is also underway. When tuning query performance,a single node and partition gives a more stable environment for testing.Volume is measured as Search Queries Per Second (QPS), a built-in metric that can bereported as an average, count, minimum, or maximum values of queries that executewithin a one-minute window. One-minute intervals (TimeGrain = \u0022PT1M\u0022) for metrics isfixed within the system. TipWith additional client-side code and Application Insights, you can also captureclickthrough data for deeper insight into what attracts the interest of yourapplication users. For more information, see Search traffic analytics.Query volume (QPS)It\u0027s common for queries to execute in milliseconds, so only queries that measure asseconds will appear in metrics.AggregationTypeDescriptionAverageThe average number of seconds within a minute during which query executionoccurred.CountThe number of metrics emitted to the log within the one-minute interval.\n"
}