{
  "Id": "1359",
  "Title": "\u0022Maximizing Azure Cognitive Search: Administration and Insights\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearches without clicks: terms for top queries that register no clicksThe following screenshot shows what a built-in report might look like if you have usedall of the schema elements.Instrument your search application to get powerful and insightful data about yoursearch service.Next stepsYou can find more information on Application Insights and visit the pricing page tolearn more about their different service tiers.\r\nLearn more about creating amazing reports. See Getting started with Power BI Desktopfor details.Service administration for AzureCognitive Search in the Azure portalArticle•01/12/2023Azure Cognitive Search is a fully managed, cloud-based search service used for buildinga rich search experience into custom apps. This article covers the administration tasksthat you can perform in the Azure portal for a search service that you\u0027ve alreadycreated.Depending on your permission level, the portal covers virtually all aspects of searchservice operations, including:Service administrationContent managementContent explorationEach search service is managed as a standalone resource.\r\nThe following image showsthe portal pages for a single free search service called \u0022demo-search-svc\u0022.The overview page is the \u0022home\u0022 page of each service. In the following screenshot, theareas on the screen enclosed in red boxes indicate tasks, tools, and tiles that you mightuse often, especially if you\u0027re new to the service.Overview (home) pageAreaDescriptionAreaDescription1The Essentials section lists service properties, such as the service endpoint, service tier,and replica and partition counts.2A command bar at the top of the page includes Import data and Search explorer, used forprototyping and exploration. 3Tabbed pages in the center provide quick access to usage statistics, service health metrics,and access to all of the existing indexes, indexers, data sources, and skillsets.4Navigation links to other pages.Several aspects of a search service are determined when the service is provisioned andcan\u0027t be easily changed:Service nameService location Service tier  Although there are ARM and bicep templates for service deployment, moving contentis a manual job. Switching a tier requires creating a new service or filing a support ticket to request atier upgrade.\n"
}