{
  "Id": "87",
  "Title": "\u0022Maximizing Efficiency and Troubleshooting in Azure Search Indexing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf2. Select Submit to create and simultaneously run the indexer.Select Indexers from the left navigation pane to monitor status, and then select theindexer. Skills-based indexing takes longer than text-based indexing, especially OCR andimage analysis.To view details about execution status, select Success (or Failed) to view executiondetails.\r\nMonitor statusIn this demo, there are a few warnings: \u0022Could not execute skill because one or moreskill input was invalid.\u0022 It tells you that a PNG file in the data source doesn\u0027t providea text input to Entity Recognition. This warning occurs because the upstream OCR skilldidn\u0027t recognize any text in the image, and thus couldn\u0027t provide a text input to thedownstream Entity Recognition skill.\r\nWarnings are common in skillset execution. As you become familiar with how skillsiterate over your data, you might begin to notice patterns and learn which warnings aresafe to ignore.After an index is created, use Search explorer to return results.\r\n1. On the left, select Indexes and then select the index. Search explorer is on the firsttab.2. Enter a search string to query the index, such as satya nadella. The search baraccepts keywords, quote-enclosed phrases, and operators (\u0022Satya Nadella\u0022 \u002B\u0022BillGates\u0022 \u002B\u0022Steve Ballmer\u0022).Results are returned as verbose JSON, which can be hard to read, especially in largedocuments.\r\nSome tips for searching in this tool include the following techniques:Switch to JSON view to specify parameters that shape results.Add select to limit the fields in results.Add count to show the number of matches.Use CTRL-F to search within the JSON for specific properties or terms. Query in Search explorerHere\u0027s some JSON you can paste into the view:JSONYou\u0027ve now created your first skillset and learned the basic steps of skills-basedindexing.{\u0022search\u0022: \u0022\\\u0022Satya Nadella\\\u0022 \u002B\\\u0022Bill Gates\\\u0022 \u002B\\\u0022Steve Ballmer\\\u0022\u0022,\u0022count\u0022: true,\u0022select\u0022: \u0022content, people\u0022} TipQuery strings are case-sensitive so if you get an \u0022unknown field\u0022 message, checkFields or Index Definition (JSON) to verify name and case.\n"
}