{
  "Id": "3",
  "Title": "\u0022Maximizing Azure AI Search Capabilities for Document Indexing and Querying\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe documentformat that Azure AI Search can index is JSON. You can upload JSON documentsthat you\u0027ve assembled, or use an indexer to retrieve and serialize your data intoJSON.AI enrichment through cognitive skills is an extension of indexing. If you haveimages or large unstructured text in source document, you can attach skills thatperform OCR, describe images, infer structure, translate text and more.\r\nYou canalso attach skills that perform data chunking and vectorization.Querying can happen once an index is populated with searchable content, whenyour client app sends query requests to a search service and handles responses. Allquery execution is over a search index that you control.\r\nSemantic ranking is an extension of query execution. It adds languageunderstanding to search results processing, promoting the most semanticallyrelevant results to the top.Azure AI Search is well suited for the following application scenarios:Search over your vector and text content, isolated from the internet.Consolidate heterogeneous content into a user-defined and populated searchindex composed of vectors and text.\r\nIntegrate data chunking and vectorization for generative AI and RAG apps.Apply granular access control at the document level.Offload indexing and query workloads onto a dedicated search service.Easily implement search-related features: relevance tuning, faceted navigation,filters (including geo-spatial search), synonym mapping, and autocomplete. Inside a search serviceWhy use Azure AI Search?Transform large undifferentiated text or image files, or application files stored inAzure Blob Storage or Azure Cosmos DB, into searchable chunks. This is achievedduring indexing through cognitive skills that add external processing from AzureAI.Add linguistic or custom text analysis. If you have non-English content, Azure AISearch supports both Lucene analyzers and Microsoft\u0027s natural languageprocessors. You can also configure analyzers to achieve specialized processing ofraw content, such as filtering out diacritics, or recognizing and preserving patternsin strings.\n"
}