{
  "Id": "334",
  "Title": "\u0022Maximizing Indexing Efficiency and Error Handling in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe script sets \u0022maxFailedItems\u0022 to -1, which instructs the indexing engine to ignoreerrors during data import. This is useful because there are so few documents in thedemo data source. For a larger data source, you would set the value to greater than 0.Also notice the \u0022dataToExtract\u0022:\u0022contentAndMetadata\u0022 statement in the configurationparameters.\r\nThis statement tells the indexer to extract the content from different fileformats and the metadata related to each file.When content is extracted, you can set imageAction to extract text from images found inthe data source.\r\nThe \u0022imageAction\u0022:\u0022generateNormalizedImages\u0022 configuration,combined with the OCR Skill and Text Merge Skill, tells the indexer to extract text fromthe images (for example, the word \u0022stop\u0022 from a traffic Stop sign), and embed it as partof the content field. This behavior applies to both the images embedded in thedocuments (think of an image inside a PDF) and images found in the data source, forinstance a JPG file.\r\nOnce the indexer is defined, it runs automatically when you submit the request.Depending on which skills you defined, indexing can take longer than you expect. Tofind out whether the indexer processing is complete, run the following script.                 data=json.dumps(indexer_payload), headers=headers, params=params)print(r.\r\nstatus_code) TipCreating an indexer invokes the pipeline. If there is a problem accessing the data,mapping inputs and outputs, or with the order of operations, it will appear at thisstage. To re-run the pipeline with code or script changes, you may need to deleteobjects first. For more information, see Reset and re-run. About the request body4 - Monitor indexingPythonIn the response, monitor the \u0022lastResult\u0022 for its \u0022status\u0022 and \u0022endTime\u0022 values.Periodically run the script to check the status. When the indexer has completed, thestatus will be set to \u0022success\u0022, an \u0022endTime\u0022 will be specified, and the response willinclude any errors and warnings that occurred during enrichment.\n"
}