{
  "Id": "1082",
  "Title": "\u0022Maximizing Throughput: Configuring Custom Skills for Azure Search Indexing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPower Skills: a repository of custom skillsExample: Creating a custom skill for AI enrichmentHow to define a skillsetCreate Skillset (REST)How to map enriched fields          {            \u0022name\u0022: \u0022contractText\u0022,            \u0022source\u0022: \u0022/document/content\u0022          }        ],        \u0022outputs\u0022: [          {            \u0022name\u0022: \u0022contractDate\u0022,            \u0022targetName\u0022: \u0022date\u0022          }        ]      }  ]}Watch this videohttps://www.\r\nyoutube-nocookie.com/embed/fHLCE-NZeb4?version=3Next stepsEfficiently scale out a custom skillArticle•12/02/2022Custom skills are web APIs that implement a specific interface. A custom skill can beimplemented on any publicly addressable resource.\r\nThe most common implementationsfor custom skills are:Azure Functions for custom logic skillsAzure Webapps for simple containerized AI skillsAzure Kubernetes service for more complex or larger skills.Review the custom skill interface for an introduction into the input/output interfacethat a custom skill should implement.Set up your environment. You could start with this tutorial end-to-end to set upserverless Azure Function using Visual Studio Code and Python extensions.Configuring a custom skill for maximizing throughput of the indexing process requiresan understanding of the skill, indexer configurations and how the skill relates to eachdocument. For example, the number of times a skill is invoked per document and theexpected duration per invocation.On the custom skill set the following parameters.1. Set batchSize of the custom skill to configure the number of records sent to theskill in a single invocation of the skill.2. Set the degreeOfParallelism to calibrate the number of concurrent requests theindexer will make to your skill.3. Set timeoutto a value sufficient for the skill to respond with a valid response.4. In the indexer definition, set batchSize to the number of documents that shouldbe read from the data source and enriched concurrently.\n"
}