{
  "Id": "1341",
  "Title": "\u0022Measuring and Managing Query Performance in Azure Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfService-wide, query performance is measured as search latency (how long a query takesto complete) and throttled queries that were dropped as a result of resource contention.AggregationTypeLatencyAverageAverage query duration in milliseconds.CountThe number of metrics emitted to the log within the one-minute interval.MaximumLongest running query in the sample.MinimumShortest running query in the sample.TotalTotal execution time of all queries in the sample, executing within the interval(one minute).Query performanceSearch latencyConsider the following example of Search Latency metrics: 86 queries were sampled,with an average duration of 23.\r\n26 milliseconds. A minimum of 0 indicates some querieswere dropped. The longest running query took 1000 milliseconds to complete. Totalexecution time was 2 seconds.Throttled queries refers to queries that are dropped instead of process. In most cases,throttling is a normal part of running the service.\r\nIt is not necessarily an indication thatthere is something wrong.Throttling occurs when the number of requests currently processed exceed the availableresources. You might see an increase in throttled requests when a replica is taken out ofrotation or during indexing. Both query and indexing requests are handled by the sameset of resources.\r\nThe service determines whether to drop requests based on resource consumption. Thepercentage of resources consumed across memory, CPU, and disk IO are averaged overa period of time. If this percentage exceeds a threshold, all requests to the index arethrottled until the volume of requests is reduced. Depending on your client, a throttled request can be indicated in these ways:A service returns an error \u0022You are sending too many requests. Please try againlater.\u0022A service returns a 503 error code indicating the service is currently unavailable.If you are using the portal (for example, Search Explorer), the query is droppedsilently and you will need to click Search again.\n"
}