{
  "Id": "1666",
  "Title": "\u0022Microsoft Azure AI Search: Enrichment Pipeline and Custom Skills\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure AISearch(pricing) forimageextraction.Microsoft.Skills.Text.MergeSkillConsolidates text from acollection of fields into a singlefield.Not applicableMicrosoft.Skills.Util.ShaperSkillMaps output to a complex type(a multi-part data type, whichNot applicableAzure OpenAI skillsUtility skillsOData typeDescriptionMetered bymight be used for a full name, amulti-line address, or acombination of last name and apersonal identifier.\r\n)Microsoft.Skills.Text.SplitSkillSplits text into pages so that youcan enrich or augment contentincrementally.Not applicableCustom skills wrap external code that you design, develop, and deploy to the web. Youcan then call the module from within a skillset as a custom skill.\r\nTypeDescriptionMetered byMicrosoft.Skills.Custom.WebApiSkillAllows extensibility of an AIenrichment pipeline by making anHTTP call into a custom Web APINone unless yoursolution uses ametered AzureserviceMicrosoft.Skills.Custom.AmlSkillAllows extensibility of an AIenrichment pipeline with an AzureMachine Learning modelNone unless yoursolution uses ametered AzureserviceFor guidance on creating a custom skill, see Define a custom interface and Example:Creating a custom skill for AI enrichment.\r\nHow to define a skillsetCustom Skills interface definitionTutorial: Enriched indexing with AICustom skillsSee alsoSkill context and input annotationlanguageArticle•02/28/2022This article is the reference documentation for skill context and input syntax. It\u0027s a fulldescription of the expression language used to construct paths to nodes in an enricheddocument.Azure Cognitive Search skills can use and enrich the data coming from the data sourceand from the output of other skills. The data working set that represents the currentstate of the indexer work for the current document starts from the raw data comingfrom the data source and is progressively enriched with each skill iteration\u0027s output data.That data is internally organized in a tree-like structure that can be queried to be usedas skill inputs or to be added to the index.\n"
}