{
  "Id": "1783",
  "Title": "\u0022Microsoft Azure Search Demos and Productivity Tools Showcase\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfMicrosoft built and hosts the following demos.DemonameDescriptionSource codeChat withyour dataAn Azure web app thatuses ChatGPT in AzureOpenAI with fictitioushealth plan data in asearch index.https://github.com/Azure-Samples/azure-search-openai-demo/NYC JobsdemoAn ASP.NET app withfacets, filters, details, geo-search (map controls).https://github.\r\ncom/Azure-Samples/search-dotnet-asp-net-mvc-jobsJFK filesdemoAn ASP.NET web appbuilt on a public data set,transformed with customand predefined skills toextract searchablecontent from scanneddocument (JPEG) files.Learn more...https://github.\r\ncom/Microsoft/AzureSearch_JFK_FilesSemanticranking forretailWeb app for a fictitiousonline retailer, \u0022Terra\u0022Not availableWoltersKluwerdemosearch appFinancial files demo thatuses custom skills andforms recognition tomake fictitious businessdocuments searchable.Not availableProductivity tools - Azure AI SearchArticle•11/15/2023Productivity tools are built by engineers at Microsoft, but aren\u0027t part of the Azure AISearch service and aren\u0027t under Service Level Agreement (SLA).\r\nThese tools are providedas source code that you can download, modify, and build to create an app that helpsyou develop or maintain a search solution.Tool nameDescriptionSource codeBack up andRestorereadmeDownload a populated search index to yourlocal device and then upload the index andits content to a new search service.https://github. com/liamca/azure-search-backup-restoreKnowledgeMiningAcceleratorreadmeCode and docs to jump start a knowledgestore using your data.https://github.com/Azure-Samples/azure-search-knowledge-miningPerformancetestingreadmeThis solution helps you load test Azure AISearch. It uses Apache JMeter as an opensource load and performance testing tooland Terraform to dynamically provision anddestroy the required infrastructure on Azure.\n"
}