{
  "Id": "1683",
  "Title": "\u0022Microsoft Entity Recognition and Entity Linking in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022microsoft\u0022,                    \u0022offset\u0022 : 13,                    \u0022length\u0022 : 9,                    \u0022matchDistance\u0022 : 0                  },                  {                    \u0022text\u0022 : \u0022Microsoft\u0022,                   \u0022offset\u0022 : 49,                    \u0022length\u0022 : 9,                    \u0022matchDistance\u0022 : 0                 }               ]              },             {                \u0022name\u0022 : \u0022Bill Gates\u0022,               \u0022description\u0022 : \u0022William Henry Gates III, founder of Microsoft.\r\n\u0022,                \u0022matches\u0022 : [                 {                    \u0022text\u0022 : \u0022Bill Gates\u0022,                   \u0022offset\u0022 : 37,                    \u0022length\u0022 : 10,                   \u0022matchDistance\u0022 : 0                  }               ]             }           ]          }        }      ]    }  Warnings\u0022Reached maximum capacity for matches, skipping all further duplicate matches.\r\n\u0022This warning will be emitted if the number of matches detected is greater than themaximum allowed. No more duplicate matches will be returned. If you need a higherthreshold, you can file a support ticket for assistance with your individual use case.\r\nCustom Entity Lookup sample and readmeBuilt-in skillsHow to define a skillsetEntity Recognition skill (to search for well known entities)See alsoEntity Linking cognitive skill (v3)Article•07/18/2023The Entity Linking skill (v3) returns a list of recognized entities with links to articles in awell-known knowledge base (Wikipedia).Microsoft.Skills.Text.V3.EntityLinkingSkillThe maximum size of a record should be 50,000 characters as measured byString. Length. If you need to break up your data before sending it to the EntityLinkingskill, consider using the Text Split skill. If you do use a text split skill, set the page lengthto 5000 for the best performance.Parameter names are case-sensitive and are all optional.Parameter nameDescriptiondefaultLanguageCodeLanguage code of the input text.\n"
}