{
  "Id": "677",
  "Title": "\u0022Migration to Azure Search API Version 2023-11-01\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf1547,            0.1183        ],        \u0022fields\u0022: \u0022contentVector\u0022,        \u0022k\u0022: 5      }    ],    \u0022select\u0022: \u0022title, content, category\u0022}{  \u0022search\u0022: \u0022(this parameter is ignored in vector search)\u0022,  \u0022vectorQueries\u0022: [    {      \u0022kind\u0022: \u0022vector\u0022,      \u0022vector\u0022: [        0.103,        0.0712,        0.0852,        0.\r\n1547,These steps complete the migration to 2023-11-01 API version.In this version, there\u0027s one breaking change and several behavioral differences. Generallyavailable features include:Knowledge store, persistent storage of enriched content created through skillsets,created for downstream analysis and processing through other applications.\r\nAknowledge store exists in Azure Storage, which you provision and then provideconnection details to a skillset. With this capability, an indexer-driven AIenrichment pipeline can populate a knowledge store in addition to a search index.If you used the preview version of this feature, it\u0027s equivalent to the generallyavailable version.\r\nThe only code change required is modifying the api-version.Existing code written against earlier API versions will break on api-version=2020-06-30and later if code contains the following functionality:Any Edm.Date literals (a date composed of year-month-day, such as 2020-12-12) infilter expressions must follow the Edm.DateTimeOffset format: 2020-12-12T00:00:00Z.\r\nThis change was necessary to handle erroneous or unexpected queryresults due to timezone differences.BM25 ranking algorithm replaces the previous ranking algorithm with newertechnology. Services created after 2019 use this algorithm automatically. For olderservices, you must set parameters to use the new algorithm. Ordered results for null values have changed in this version, with null valuesappearing first if the sort is asc and last if the sort is desc. If you wrote code to        0.1183      ],      \u0022fields\u0022: \u0022contentVector\u0022,      \u0022k\u0022: 5    }  ],  \u0022vectorFilterMode\u0022: \u0022preFilter\u0022,  \u0022select\u0022: \u0022title, content, category\u0022}Upgrade to 2020-06-30Breaking changeBehavior changeshandle how null values are sorted, be aware of this change.\n"
}