{
  "Id": "738",
  "Title": "\u0022Modeling Complex Data Types in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSometimes they include hierarchical or nested substructures. Examples mightinclude multiple addresses for a single customer, multiple colors and sizes for a singleSKU, multiple authors of a single book, and so on. In modeling terms, you might seethese structures referred to as complex, compound, composite, or aggregate data types.The term Azure Cognitive Search uses for this concept is complex type.\r\nIn AzureCognitive Search, complex types are modeled using complex fields. A complex field is afield that contains children (sub-fields) which can be of any data type, including othercomplex types. This works in a similar way as structured data types in a programminglanguage.Complex fields represent either a single object in the document, or an array of objects,depending on the data type. Fields of type Edm.ComplexType represent single objects,while fields of type Collection(Edm.ComplexType) represent arrays of objects.Azure Cognitive Search natively supports complex types and collections.\r\nThese typesallow you to model almost any JSON structure in an Azure Cognitive Search index. Inprevious versions of Azure Cognitive Search APIs, only flattened row sets could beimported. In the newest version, your index can now more closely correspond to sourcedata. In other words, if your source data has complex types, your index can havecomplex types also.\r\nTo get started, we recommend the Hotels data set, which you can load in the Importdata wizard in the Azure portal. The wizard detects complex types in the source andsuggests an index schema based on the detected structures.７ NoteSupport for complex types became generally available starting in api-version=2019-05-06. If your search solution is built on earlier workarounds of flattened datasets in acollection, you should change your index to include complex types as supported inthe newest API version. For more information about upgrading API versions, seeUpgrade to the newest REST API version or Upgrade to the newest .NET SDKversion.\n"
}