{
  "Id": "723",
  "Title": "\u0022Modifying and Updating Index Fields in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen animmediate rebuild isn\u0027t practical, you can modify application code to disable accessto the \u0022deleted\u0022 field or use the $select query parameter to choose which fields arerepresented in the result set. Physically, the field definition and contents remain in theindex until the next rebuild, when you apply a schema that omits the field in question.Change afielddefinitionRevising a field name, data type, or specific index attributes (searchable, filterable,sortable, facetable) requires a full rebuild.Assign ananalyzerto a fieldAnalyzers are defined in an index and then assigned to fields.\r\nYou can add a newanalyzer definition to an index at any time, but you can only assign an analyzer whenthe field is created. This is true for both the analyzer and indexAnalyzer properties.The searchAnalyzer property is an exception (you can assign this property to anexisting field).\r\nUpdateor deleteananalyzerdefinitionin anindexYou can\u0027t delete or change an existing analyzer configuration (analyzer, tokenizer,token filter, or char filter) in the index unless you rebuild the entire index.Modifications requiring a rebuildActionDescriptionAdd afield to asuggesterIf a field already exists and you want to add it to a Suggesters construct, you mustrebuild the index. SwitchtiersIn-place upgrades aren\u0027t supported. If you require more capacity, you must create anew service and rebuild your indexes from scratch. To help automate this process,you can use the index-backup-restore sample code in this Azure Cognitive Search.NET sample repo. This app will back up your index to a series of JSON files, andthen recreate the index in a search service you specify.Many other modifications can be made without impacting existing physical structures.Specifically, the following changes don\u0027t require an index rebuild. For these changes,you can update an existing index definition with your changes.\n"
}