{
  "Id": "1330",
  "Title": "\u0022Monitoring and Performance Management for Azure AI Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfReview these other articles related to service performance:Analyze performanceIndex large data sets in Azure Cognitive SearchChoose a service tierPlan or add capacityCase Study: Use Cognitive Search to Support Complex AI ScenariosTip: Consider alternatives to regular expression queriesNext stepsMonitoring Azure AI SearchArticle•11/15/2023Azure Monitor is enabled with every subscription to provide monitoring capabilities overall Azure resources, including Azure AI Search. When you sign up for search, AzureMonitor collects activity logs and platform metrics as soon as you start using theservice.Optionally, you can enable diagnostic settings to collect resource logs.\r\nResource logscontain detailed information about search service operations that\u0027s useful for deeperanalysis and investigation.This article explains how monitoring works for Azure AI Search. It also describes thesystem APIs that return information about your service.In the search service pages in Azure portal, you can find the current status of operationsand capacity.７ NoteAzure AI Search doesn\u0027t monitor individual user access to content on the searchservice. If you require this level of monitoring, you\u0027ll need to implement it in yourclient application.Monitoring in Azure portalMonitoring tab in the Overview page summarizes key query metrics, includingsearch latency, search queries per second, and throttled queries.\r\nOn the next tabover (not shown), Usage shows available capacity and the quantity of indexes,indexers, data sources, and skillsets relative to the maximum allowed for yourservice tier.Activity log on the navigation menu captures service-level events: service creation,configuration, and deletion.Further down the navigation menu, the Monitoring section includes actions forAzure Monitor, filtered for search. Here, you can enable diagnostic settings andresource logging, and specify how you want the data stored.Azure AI Search REST APIs provide the Usage data that\u0027s visible in the portal. Thisinformation is retrieved from your search service, which you can obtainprogrammatically:Service Statistics (REST)Index Statistics (REST)Document Counts (REST)Indexer Status (REST)For REST calls, use an admin API key and Postman or another REST client to query yoursearch service.In Azure AI Search, activity logs reflect control plane activity, such as service creationand configuration, or API key usage or management.\n"
}