{
  "Id": "1335",
  "Title": "\u0022Monitoring and Analysis of Azure AI Search Metrics and Operations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSee the Azure AI Search monitoring data reference for descriptionsof schema elements used in a query. See Analyze performance in Azure AI Search formore examples and guidance specific to search service.Return a list of metrics and the associated aggregation. The query is scoped to thecurrent search service over the time range that you specify.Kusto TipLogs are grouped into Category groups. Category groups are a collection ofdifferent logs to help you achieve different monitoring goals.The audit category group allows you to select the resource logs that are necessaryfor auditing your resource. For more information, see Diagnostic settings in AzureMonitor Resource logs.\r\nSample Kusto queries） ImportantWhen you select Logs from the Azure AI Search menu, Log Analytics is opened withthe query scope set to the current search service. This means that log queries willonly include data from that resource. If you want to query over multiple searchservices or combine data from other Azure services, select Logs from the AzureMonitor menu. See Log query scope and time range in Azure Monitor LogAnalytics for details.List metrics by nameReturn a list of operations and a count of each one.KustoThis Kusto query against AzureDiagnostics returns Query.Search operations, sorted byduration (in milliseconds). For more examples of Query.\r\nSearch queries, see Analyzeperformance in Azure AI Search.KustoThis Kusto query returns the status of indexer operations. Results include the operationname, description of the request (which includes the name of the indexer), result status(Success or Failure), and the HTTP status code. For more information about indexerexecution, see Monitor indexer status. KustoAzureMetrics| project MetricName, Total, Count, Maximum, Minimum, AverageList operations by nameAzureDiagnostics| summarize count() by OperationNameLong-running queriesAzureDiagnostics| project OperationName, resultSignature_d, DurationMs, Query_s, Documents_d, IndexName_s| where OperationName == \u0022Query.\n"
}