{
  "Id": "335",
  "Title": "\u0022Monitoring and Querying Azure Search with Python: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAbout the request body4 - Monitor indexingPythonIn the response, monitor the \u0022lastResult\u0022 for its \u0022status\u0022 and \u0022endTime\u0022 values.Periodically run the script to check the status. When the indexer has completed, thestatus will be set to \u0022success\u0022, an \u0022endTime\u0022 will be specified, and the response willinclude any errors and warnings that occurred during enrichment.\r\nWarnings are common with some source file and skill combinations and don\u0027t alwaysindicate a problem. Many warnings are benign. For example, if you index a JPEG file thatdoesn\u0027t have text, you\u0027ll see the warning in this screenshot.After indexing is finished, run queries that return the contents of the index or individualfields.# Get indexer statusr = requests.\r\nget(endpoint \u002B \u0022/indexers/\u0022 \u002B indexer_name \u002B                 \u0022/status\u0022, headers=headers, params=params)pprint(json.dumps(r.json(), indent=1))5 - SearchFirst, get the index definition showing all of the fields. Visual Studio Code limits theoutput to 30 lines by default, but provides an option to open the output in a text editor.\r\nUse that option to view the full output. The output is the index schema, with the name,type, and attributes of each field.PythonNext, submit a second query for \u0022*\u0022 to return all contents of a single field, such asorganizations. See Search Documents (REST API) for more information about therequest.\r\nPythonIf you\u0027d like to continue testing from this notebook, repeat the above commands usingother fields: content, languageCode, keyPhrases, and organizations in this exercise.In the early stages of development, it\u0027s practical to delete the objects from Azure AISearch and allow your code to rebuild them. Resource names are unique. Deleting anobject lets you recreate it using the same name. You can use the portal to delete indexes, indexers, data sources, and skillsets. When youdelete the indexer, you can optionally, selectively delete the index, skillset, and datasource at the same time.# Query the service for the index definitionr = requests.get(endpoint \u002B \u0022/indexes/\u0022 \u002B index_name,                 headers=headers, params=params)pprint(json.\n"
}