{
  "Id": "1336",
  "Title": "\u0022Monitoring and Visualization for Azure AI Search with Power BI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfKustoAzureMetrics| project MetricName, Total, Count, Maximum, Minimum, AverageList operations by nameAzureDiagnostics| summarize count() by OperationNameLong-running queriesAzureDiagnostics| project OperationName, resultSignature_d, DurationMs, Query_s, Documents_d, IndexName_s| where OperationName == \u0022Query.\r\nSearch\u0022| sort by DurationMs   Indexer statusAzureDiagnostics| project OperationName, Description_s, Documents_d, ResultType, resultSignature_d| where OperationName == \u0022Indexers.Status\u0022Next stepsThe monitoring framework for Azure AI Search is provided by Azure Monitor. If you\u0027renot familiar with this service, start with Monitoring Azure resources with Azure Monitorto review the main concepts.\r\nYou can also review the following articles for Azure AISearch:Analyze performance in Azure AI SearchMonitor queriesMonitor indexer-based indexingVisualize Azure AI Search Logs andMetrics with Power BIArticle•11/15/2023Azure AI Search can send operation logs and service metrics to an Azure Storageaccount, which you can then visualize in Power BI.\r\nThis article explains the steps andhow to use a Power BI Template App to visualize the data. The template can help yougain detailed insights about your search service, including information about queries,indexing, operations, and service metrics.You can find the Power BI Template App Azure AI Search: Analyze Logs and Metrics inthe Power BI Apps marketplace.1. Enable metric and resource logging for your search service:a. Create or identify an existing Azure Storage account where you can archive thelogs.b. Navigate to your Azure AI Search service in the Azure portal.c. Under the Monitoring section on the left column, select Diagnostic settings. d. Select \u002B Add diagnostic setting.e. Check Archive to a storage account, provide your Storage account information,and check OperationLogs and AllMetrics.Set up the appf. Select Save.2. After logging has been enabled, use your search service to start generating logsand metrics. It takes up to an hour before the containers will appear in Blobstorage with these logs. You will see a insights-logs-operationlogs container forsearch traffic logs and a insights-metrics-pt1m container for metrics.3. Find the Azure AI Search Power BI App in the Power BI Apps marketplace andinstall it into a new workspace or an existing workspace.\n"
}