{
  "Id": "1332",
  "Title": "\u0022Monitoring and Alerting in Azure AI Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor other entires, see the Management REST API reference for control planeactivity that might appear in the log.The following screenshot shows the activity log signals that can be configured in analert. These signals represent the entries you might see in the activity log.In Azure AI Search, platform metrics measure query performance, indexing volume, andskillset invocation.Metrics are collected free of charge, with no configuration required. Platform metrics arestored for 93 days. However, in the portal you can only query a maximum of 30 days\u0027worth of platform metrics data on any single chart.Monitor metricsIn the Azure portal, find your search service.\r\nFrom the menu on the left, underMonitoring, select Metrics to open metrics explorer.The following links provide more information about working with platform metrics:Tutorial: Analyze metrics for an Azure resource for general guidance on usingmetrics explorer.Microsoft.Search/searchServices (Azure Monitor) for the platform metricsreference.Monitoring data reference for supplemental descriptions and dimensions.Monitor queries has details about the query metrics.Alerts help you to identify and address issues before they become a problem forapplication users. You can set alerts on metrics, resource logs, and activity logs. Alertsare billable (see the Pricing model for details).1.\r\nIn the Azure portal, find your search service. From the menu on the left, underMonitoring, select Alerts to open metrics explorer.2. See Tutorial: Create a metric alert for an Azure resource for general guidance onsetting up alerts from metrics explorer.The following table describes several rules. On a search service, throttling or querylatency that exceeds a given threshold are the most commonly used alerts, but youmight also want to be notified if a search service is deleted.Alert typeConditionDescriptionSearch Latency(metric alert)Whenever the average search latency is greaterthan a user-specified threshold (in seconds)Send an SMS alert whenaverage query responsetime exceeds thethreshold.\n"
}