{
  "Id": "1394",
  "Title": "\u0022Moving Azure Cognitive Search Service to a New Region\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAlthough thecommand exists, we don\u0027t recommend using it for moving a search service.PrerequisitesPrepare and move3. Check pricing and availability in the new region to ensure availability of AzureCognitive Search plus any related services in the new region. The majority offeatures are available in all regions, but some preview features have restrictedavailability.4. Create a service in the new region and republish from source code any existingindexes, synonym maps, indexers, data sources, and skillsets. Remember thatservice names must be unique so you cannot reuse the existing name.\r\nCheck eachskillset to see if connections to Azure AI services are still valid in terms of thesame-region requirement. Also, if knowledge stores are created, check theconnection strings for Azure Storage if you are using a different service.5. Reload indexes and knowledge stores, if applicable.\r\nYou\u0027ll either use applicationcode to push JSON data into an index, or rerun indexers to pull documents in fromexternal sources.6. Enable logging, and if you are using them, re-create security roles.7. Update client applications and test suites to use the new service name and APIkeys, and test all applications.Delete the old service once the new service is fully tested and operational. Deleting theservice automatically deletes all content associated with the service.The following links can help you locate more information when completing the stepsoutlined above.Azure Cognitive Search pricing and regionsChoose a tierCreate a search serviceLoad search documentsEnable loggingDiscard or clean upNext stepsConnect to Cognitive Search using keyauthenticationArticle•05/14/2023Cognitive Search offers key-based authentication that you can use on connections toyour search service. An API key is a unique string composed of 52 randomly generatednumbers and letters. A request made to a search service endpoint will be accepted ifboth the request and the API key are valid.\n"
}