{
  "Id": "621",
  "Title": "\u0022Multi-Region Deployment and Traffic Management for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure AI Search provides a multi-region deployment sample that uses Azure TrafficManager for request redirection if the primary endpoint fails. This solution is usefulwhen you route to a search-enabled client that only calls a search service in the sameregion.Azure Traffic Manager is primarily used for routing network traffic across differentendpoints based on specific routing methods (such as priority, performance, orgeographic location). It acts at the DNS level to direct incoming requests to theOption 2: Use REST APIs for pushing content updates on multipleservicesFail over or redirect query requestsappropriate endpoint.\r\nIf an endpoint that Traffic Manager is servicing begins refusingrequests, traffic is routed to another endpoint.Traffic Manager doesn\u0027t provide an endpoint for a direct connection to Azure AI Search,which means you can\u0027t put a search service directly behind Traffic Manager. Instead, theassumption is that requests flow to Traffic Manager, then to a search-enabled webclient, and finally to a search service on the backend.\r\nThe client and service are locatedin the same region. If one search service goes down, the search client starts failing, andTraffic Manager redirects to the remaining client.When you deploy multiple search services in various geographic regions, your content isstored in the region you chose for each search service. About data residency in a multi-regiondeploymentAzure AI Search won\u0027t store data outside of your specified region without yourauthorization. Authorization is implicit when you use features that write to an AzureStorage resource: enrichment cache, debug session, knowledge store. In all cases, thestorage account is one that you provide, in the region of your choice.As stated in the Service Level Agreement (SLA), Microsoft guarantees a high level ofavailability for index query requests when an Azure AI Search service instance isconfigured with two or more replicas, and index update requests when an Azure AISearch service instance is configured with three or more replicas.\n"
}