{
  "Id": "1114",
  "Title": "\u0022Nested Input and Projection in Enrichment Pipeline: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022pages\u0022,             \u0022source\u0022: null,             \u0022sourceContext\u0022: \u0022/document/reviews_text/pages/*\u0022,             \u0022inputs\u0022: [                 {                     \u0022name\u0022: \u0022Sentiment\u0022,                     \u0022source\u0022: \u0022/document/reviews_text/pages/*/Sentiment\u0022,                     \u0022sourceContext\u0022: null,                     \u0022inputs\u0022: []                 },                 {                     \u0022name\u0022: \u0022LanguageCode\u0022,                     \u0022source\u0022: \u0022/document/Language\u0022,                     \u0022sourceContext\u0022: null,                     \u0022inputs\u0022: []                 },                 { Within a Shaper skill, an input can have a sourceContext element.\r\nThis same propertycan also be used in inline shapes in projections.sourceContext is used to construct multi-level, nested objects in an enrichment pipeline.If the input is at a different context than the skill context, use the sourceContext. ThesourceContext requires you to define a nested input with the specific element beingaddressed as the source.In the example above, sentiment analysis and key phrases extraction was performed ontext that was split into pages for more efficient analysis. Assuming you want the scoresand phrases projected into a table, you\u0027ll now need to set the context to nested inputthat provides the score and phrase.\r\nWith the tableprojection node defined in the outputs section above, you can sliceparts of the tableprojection node into individual, related tables:                    \u0022name\u0022: \u0022Page\u0022,                     \u0022source\u0022: \u0022/document/reviews_text/pages/*\u0022,                     \u0022sourceContext\u0022: null,                     \u0022inputs\u0022: []                 },                 {                     \u0022name\u0022: \u0022keyphrase\u0022,                     \u0022sourceContext\u0022: \u0022/document/reviews_text/pages/*/Keyphrases/*\u0022,                     \u0022inputs\u0022: [                         {                             \u0022source\u0022: \u0022/document/reviews_text/pages/*/Keyphrases/*\u0022,                             \u0022name\u0022: \u0022Keyphrases\u0022                         }                     ]                 }             ]         }     ],     \u0022outputs\u0022: [         {             \u0022name\u0022: \u0022output\u0022,             \u0022targetName\u0022: \u0022tableprojection\u0022         }     ] } SourceContext propertyProjecting a shape into multiple tablesJSONInline shaping is the ability to form new shapes within the projection definition itself.\n"
}