{
  "Id": "535",
  "Title": "\u0022Network Traffic Patterns and Security in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure AI Search has three basic network traffic patterns:Inbound requests made by a client to the search service (the predominant pattern)Outbound requests issued by the search service to other services on Azure andelsewhereInternal service-to-service requests over the secure Microsoft backbone networkInbound requests that target a search service endpoint can be characterized as:Create or manage indexes, indexers, data sources, skillsets, and synonym mapsTrigger indexer or skillset executionLoad or query an indexYou can review the REST APIs to understand the full range of inbound requests that arehandled by a search service.\r\nAt a minimum, all inbound requests must be authenticated:Key-based authentication is the default. Inbound requests that include a valid APIkey are accepted by the search service as originating from a trusted party.Microsoft Entra ID and role-based access control are also widely used for dataplane operations.Additionally, you can add network security features to further restrict access to theendpoint. You can create either inbound rules in an IP firewall, or create privateendpoints that fully shield your search service from the public internet.\r\nData flow (network traffic patterns)Inbound trafficOutbound requests from a search service to other applications are typically made byindexers for text-based indexing, skills-based AI enrichment, and vectorization.Outbound requests include both read and write operations.The following list is a full enumeration of the outbound requests that can be made by asearch service. A search service makes requests on its own behalf, and on the behalf ofan indexer or custom skill:Indexers read from external data sources.Indexers write to Azure Storage when creating knowledge stores, persisting cachedenrichments, and persisting debug sessions. If you\u0027re using custom skills, custom skills connect to an external Azure function orapp to run external code that\u0027s hosted off-service. The request for externalprocessing is sent during skillset execution.If you\u0027re using integrated vectorization, the search service connects to AzureOpenAI and a deployed embedding model, or it goes through a custom skill toconnect to an embedding model that you provide. The search service sends text toembedding models for vectorization during indexing or query execution.If you\u0027re using customer-managed keys, the service connects to an external AzureKey Vault for a customer-managed key used to encrypt and decrypt sensitive data.\n"
}