{
  "Id": "1309",
  "Title": "\u0022Oceanside Resort: Luxury Hotel with Bay Views and Rooftop Pool\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBay views from every room, location near the pier, rooftop pool, waterfront dining \u0026 more.\u0022,                \u0022highlights\u0022: \u0022\u003Cstrong\u003EOceanside Resort.\u003C/strong\u003E Luxury. New Luxury Hotel. Be the first to stay.\u003Cstrong\u003E Bay\u003C/strong\u003E views from every room, location near the pier, rooftop pool, waterfront dining \u0026 more.\r\n\u0022            }        ],        \u0022HotelName\u0022: \u0022Oceanside Resort\u0022,        \u0022Description\u0022: \u0022New Luxury Hotel. Be the first to stay. Bay views from every room, location near the pier, rooftop pool, waterfront dining \u0026 more.\u0022,        \u0022Category\u0022: \u0022Luxury\u0022    },  ...]Migrate from preview versionsThe semantic ranking engine is now language agnostic.\r\nIf queryLanguage is specified inyour query logic, it\u0027s no longer used for semantic ranking, but still applies to spellcorrection.Use Search POST and remove queryLanguage for semantic ranking purposes.If your code calls the 2020-06-30-Preview REST API or beta SDK packages targeting thatREST API version, you might be using searchFields in a query request to specifysemantic fields and priorities.\r\nThis code must now be updated to usesemanticConfiguration instead.Create or Update Index to add semanticConfiguration.Recall that semantic ranking and responses are built over an initial result set. Any logicthat improves the quality of the initial results carry forward to semantic ranking. As anext step, review the features that contribute to initial results, including analyzers thataffect how strings are tokenized, scoring profiles that can tune results, and the defaultrelevance algorithm.Analyzers for text processingConfigure BM25 relevance scoringRelevance scoring in hybrid search using Reciprocal Rank Fusion (RRF)Add scoring profilesSemantic ranking overviewStep 1: Remove queryLanguageStep 2: Add semanticConfigurationNext stepsAnalyze performance in Azure CognitiveSearchArticle•08/31/2023This article describes the tools, behaviors, and approaches for analyzing query andindexing performance in Cognitive Search.\n"
}