{
  "Id": "1605",
  "Title": "\u0022OData Syntax and Operators in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf*/variable ::= identifier | field_pathOData syntax diagram for Azure AI Search７ NoteSee OData expression syntax reference for Azure AI Search for the completeEBNF.Collection filter expressions using any or all. These apply filter criteria tocollection fields.\r\nFor more information, see OData collection operators in Azure AISearch.Logical expressions that combine other Boolean expressions using the operatorsand, or, and not. For more information, see OData logical operators in Azure AISearch.Comparison expressions, which compare fields or range variables to constantvalues using the operators eq, ne, gt, lt, ge, and le. For more information, seeOData comparison operators in Azure AI Search. Comparison expressions are alsoused to compare distances between geo-spatial coordinates using thegeo.distance function. For more information, see OData geo-spatial functions inAzure AI Search.The Boolean literals true and false.\r\nThese constants can be useful sometimeswhen programmatically generating filters, but otherwise don\u0027t tend to be used inpractice.Calls to Boolean functions, including:geo.intersects, which tests whether a given point is within a given polygon. Formore information, see OData geo-spatial functions in Azure AI Search.search.\r\nin, which compares a field or range variable with each value in a list ofvalues. For more information, see OData search.in function in Azure AI Search.search.ismatch and search.ismatchscoring, which execute full-text searchoperations in a filter context. For more information, see OData full-text searchfunctions in Azure AI Search. Field paths or range variables of type Edm.Boolean. For example, if your index has aBoolean field called IsEnabled and you want to return all documents where thisfield is true, your filter expression can just be the name IsEnabled.Boolean expressions in parentheses. Using parentheses can help to explicitlydetermine the order of operations in a filter.\n"
}