{
  "Id": "1169",
  "Title": "\u0022Optimizing Search Results with Semantic Ranking and RRF Algorithm\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA query might match to any number of documents, as many as all of them if the searchcriteria are weak (for example \u0022search=*\u0022 for a null query). Because it\u0027s seldom practicalto return unbounded results, you should specify a maximum for the response:\u0022k\u0022: n results for vector-only queries\u0022top\u0022: n results for hybrid queries that include a \u0022search\u0022 parameterBoth \u0022k\u0022 and \u0022top\u0022 are optional.\r\nUnspecified, the default number of results in a responseis 50. You can set \u0022top\u0022 and \u0022skip\u0022 to page through more results or change the default.If you\u0027re using semantic ranking, it\u0027s a best practice to set both \u0022k\u0022 and \u0022top\u0022 to at least50. The semantic ranker can take up to 50 results.\r\nBy specifying 50 for each query, youget equal representation from both search subsystems.Multiple sets are created for hybrid queries, with or without the optional semanticreranking. Ranking of results is computed by Reciprocal Rank Fusion (RRF).In this section, compare the responses between single vector search and simple hybridsearch for the top result.\r\nThe different ranking algorithms, HNSW\u0027s similarity metric andRRF is this case, produce scores that have different magnitudes. This behavior is bydesign. RRF scores can appear quite low, even with a high similarity match. Lower scoresare a characteristic of the RRF algorithm.\r\nIn a hybrid query with RRF, more of thereciprocal of the ranked documents are included in the results, given the relativelysmaller score of the RRF ranked documents, as opposed to pure vector search.Single Vector Search: Results ordered by cosine similarity (default vector similaritydistance function).JSONNumber of resultsRanking{    \u0022@search.score\u0022: 0. 8851871,    \u0022title\u0022: \u0022Azure AI Search\u0022,    \u0022content\u0022: \u0022Azure AI Search is a fully managed search-as-a-service that enables you to build rich search experiences for your applications. It provides features like full-text search, faceted navigation, and filters. Azure AI Search supports various data sources, such as Azure SQL Database, Azure Blob Storage, and Azure Cosmos DB.\n"
}