{
  "Id": "1311",
  "Title": "\u0022Optimizing Azure Search Performance: Resource Logging and Throttling Analysis\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA key benefit of resource logging is thatactivities are logged from the search service perspective, which means that the log canDevelop baseline numbers７ NoteFor the Storage Optimized tiers (L1 and L2), you should expect a lower querythroughput and higher latency than the Standard tiers.Use resource logginghelp you determine if the performance issue is due to problems with the query orindexing, or some other point of failure.\r\nResource logging gives you options for storing logged information. We recommendusing Log Analytics so that you can execute advanced Kusto queries against the data toanswer many questions about usage and performance.On your search service portal pages, you can enable logging through Diagnosticsettings, and then issue Kusto queries against Log Analytics by choosing Logs.\r\nFor moreinformation about setting up, see Collect and analyze log data.Throttling occurs when the search service is at capacity. Throttling can occur duringqueries or indexing. From the client side, an API call results in a 503 HTTP responsewhen it has been throttled.\r\nDuring indexing, there\u0027s also the possibility of receiving a207 HTTP response, which indicates that one or more items failed to index. This error isan indicator that the search service is getting close to capacity.As a rule of thumb, try to quantify the amount of throttling and any patterns. Forexample, if one search query out of 500,000 is throttled, it might not be worthinvestigating.\r\nHowever, if a large percentage of queries is throttled over a period, thiswould be a greater concern. By looking at throttling over a period, it also helps toidentify time frames where throttling might more likely occur and help you decide howto best accommodate that. Throttling behaviorsA simple fix to most throttling issues is to throw more resources at the search service(typically replicas for query-based throttling, or partitions for indexing-based throttling).However, increasing replicas or partitions adds cost, which is why it\u0027s important to knowthe reason why throttling is occurring at all. Investigating the conditions that causethrottling will be explained in the next several sections.\n"
}