{
  "Id": "472",
  "Title": "\u0022Optimizing Search Performance with Custom Analyzers in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSetting an analyzer is optional. As a general rule, try using the default standard Luceneanalyzer first to see how it performs. If queries fail to return the expected results,switching to a different analyzer is often the right solution.Types of analyzersSpecifying analyzers1.\r\nIf you\u0027re using a custom analyzer, add it to the search index under the \u0022analyzer\u0022section. For more information, see Create Index and also Add custom analyzers.2. When defining a field, set it\u0027s \u0022analyzer\u0022 property to one of the following: a built-inanalyzer such as keyword, a language analyzer such as en.\r\nmicrosoft, or a customanalyzer (defined in the same index schema).JSON3. If you\u0027re using a language analyzer, you must use the \u0022analyzer\u0022 property tospecify it. The \u0022searchAnalyzer\u0022 and \u0022indexAnalyzer\u0022 properties don\u0027t apply tolanguage analyzers.4. Alternatively, set \u0022indexAnalyzer\u0022 and \u0022searchAnalyzer\u0022 to vary the analyzer foreach workload.\r\nThese properties work together as a substitute for the \u0022analyzer\u0022property, which must be null. You might use different analyzers for indexing andqueries if one of those activities required a specific transformation not needed bythe other.JSON  \u0022fields\u0022: [ {   \u0022name\u0022: \u0022Description\u0022,   \u0022type\u0022: \u0022Edm.String\u0022,   \u0022retrievable\u0022: true,   \u0022searchable\u0022: true,   \u0022analyzer\u0022: \u0022en. microsoft\u0022,   \u0022indexAnalyzer\u0022: null,   \u0022searchAnalyzer\u0022: null },  \u0022fields\u0022: [ {   \u0022name\u0022: \u0022ProductGroup\u0022,   \u0022type\u0022: \u0022Edm.String\u0022,   \u0022retrievable\u0022: true,   \u0022searchable\u0022: true,   \u0022analyzer\u0022: null,   \u0022indexAnalyzer\u0022: \u0022keyword\u0022,   \u0022searchAnalyzer\u0022: \u0022standard\u0022 },When to add analyzersThe best time to add and assign analyzers is during active development, when droppingand recreating indexes is routine.\n"
}