{
  "Id": "1204",
  "Title": "\u0022Optimizing Vector Filter Modes for Azure Search Performance\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFilters are set on and iterate over string and numericfields attributed as filterable in the index, but the effects of filtering determine whatthe vector query executes over: the searchable space, or the documents in the searchresults.This article describes each filter mode and provides guidance on when to use each one.Prefiltering applies filters before query execution, reducing the search surface area overwhich the vector search algorithm looks for similar content.\r\nIn a vector query, preFilteris the default.Post-filtering applies filters after query execution, narrowing the search results.Prefilter modePostfilter modeTo understand the conditions under which one filter mode performs better than theother, we ran a series of tests to evaluate query outcomes over small, medium, and largeindexes.\r\nSmall (100,000 documents, 2.5-GB index, 1536 dimensions)Medium (1 million documents, 25-GB index, 1536 dimensions)Large (1 billion documents, 1.9-TB index, 96 dimensions)For the small and medium workloads, we used a Standard 2 (S2) service with onepartition and one replica. For the large workload, we used a Standard 3 (S3) service with12 partitions and one replica.\r\nIndexes had an identical construction: one key field, one vector field, one text field, andone numeric filterable field.PythonBenchmark testing of vector filter modesdef get_index_schema(self, index_name, dimensions):    return {        \u0022name\u0022: index_name,        \u0022fields\u0022: [            {\u0022name\u0022: \u0022id\u0022, \u0022type\u0022: \u0022Edm. String\u0022, \u0022key\u0022: True, \u0022searchable\u0022: True},            {\u0022name\u0022: \u0022myvector\u0022, \u0022type\u0022: \u0022Collection(Edm.Single)\u0022, \u0022dimensions\u0022: dimensions,              \u0022searchable\u0022: True, \u0022retrievable\u0022: True, \u0022filterable\u0022: False, \u0022facetable\u0022: False, \u0022sortable\u0022: False,              \u0022vectorSearchConfiguration\u0022: \u0022defaulthnsw\u0022},            {\u0022name\u0022: \u0022text\u0022, \u0022type\u0022: \u0022Edm.\n"
}