{
  "Id": "892",
  "Title": "\u0022Optimizing Blob Indexing and Search in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfResources used in a blob-search solution3. Use Search explorer in the search portal page to query your content.The wizard is the best place to start, but you\u0027ll discover more flexible options when youconfigure a blob indexer yourself. You can call the REST APIs using a tool like Postman.Tutorial: Index and search semi-structured data (JSON blobs) in Azure AI Search walksyou through the steps of calling the REST API in Postman.By default, most blobs are indexed as a single search document in the index, includingblobs with structured content, such as JSON or CSV, which are indexed as a single chunkof text.\r\nHowever, for JSON or CSV documents that have an internal structure(delimiters), you can assign parsing modes to generate individual search documents foreach line or element:Indexing JSON blobsIndexing CSV blobsA compound or embedded document (such as a ZIP archive, a Word document withembedded Outlook email containing attachments, or an .\r\nMSG file with attachments) isalso indexed as a single document. For example, all images extracted from theattachments of an .MSG file will be returned in the normalized_images field. If you haveimages, consider adding AI enrichment to get more search utility from that content.How blobs are indexedTextual content of a document is extracted into a string field named \u0022content\u0022. You canalso extract standard and user-defined metadata.An indexer is a data-source-aware subservice in Azure AI Search, equipped with internallogic for sampling data, reading and retrieving data and metadata, and serializing datafrom native formats into JSON documents for subsequent import.Blobs in Azure Storage are indexed using the blob indexer. You can invoke this indexerby using the Azure search command in Azure Storage, the Import data wizard, a RESTAPI, or the .NET SDK. In code, you use this indexer by setting the type, and by providingconnection information that includes an Azure Storage account along with a blobcontainer.\n"
}