{
  "Id": "1145",
  "Title": "\u0022Optimizing Azure Search Queries for Hotel Data Retrieval\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfnet/indexes/hotels-sample-index/docs/search?api-version=2023-11-01{    \u0022search\u0022: \u0022NY \u002Bview\u0022,    \u0022queryType\u0022: \u0022simple\u0022,    \u0022searchMode\u0022: \u0022all\u0022,    \u0022searchFields\u0022: \u0022HotelName, Description, Address/City, Address/StateProvince, Tags\u0022,    \u0022select\u0022: \u0022HotelName, Description, Address/City, Address/StateProvince, Tags\u0022,    \u0022top\u0022: \u002210\u0022,    \u0022count\u0022: \u0022true\u0022}Key points:search provides the match criteria, usually whole terms or phrases, with or withoutoperators.\r\nAny field that is attributed as \u0022searchable\u0022 in the index schema is acandidate for this parameter.queryType sets the parser: simple, full. The default simple query parser is optimalfor full text search. The full Lucene query parser is for advanced query constructslike regular expressions, proximity search, fuzzy and wildcard search. Thisparameter can also be set to semantic for semantic ranking for advanced semanticmodeling on the query response.\r\nsearchMode specifies whether matches are based on \u0022all\u0022 criteria (favors precision)or \u0022any\u0022 criteria (favors recall) in the expression. The default is \u0022any\u0022. If youanticipate heavy use of Boolean operators, which is more likely in indexes thatcontain large text blocks (a content field or long descriptions), be sure to testqueries with the searchMode=Any|All parameter to evaluate the impact of thatsetting on boolean search.\r\nsearchFields constrains query execution to specific searchable fields. Duringdevelopment, it\u0027s helpful to use the same field list for select and search. Otherwisea match might be based on field values that you can\u0027t see in the results, creatinguncertainty as to why the document was returned. Parameters used to shape the response:select specifies which fields to return in the response. Only fields marked as\u0022retrievable\u0022 in the index can be used in a select statement.top returns the specified number of best-matching documents. In this example,only 10 hits are returned. You can use top and skip (not shown) to page the results.\n"
}