{
  "Id": "1673",
  "Title": "\u0022Optimizing Performance and Parameters for Azure Search Text Split\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you do use a text split skill, set the page length to 5000 for the bestperformance.The maximum size of the custom entity definition is 10 MB if it\u0027s provided as anexternal file, specified through the \u0022entitiesDefinitionUri\u0022 parameter.If the entities are defined inline using the \u0022inlineEntitiesDefinition\u0022 parameter, themaximum size is 10 KB.\r\nParameters are case-sensitive.Parameter nameDescription７ NoteThis skill isn\u0027t bound to a Cognitive Services API but requires a Cognitive Serviceskey to allow more than 20 transactions. This skill is metered by Cognitive Search.@odata.typeData limitsSkill parametersParameter nameDescriptionentitiesDefinitionUriPath to an external JSON or CSV file containing all the targettext to match against. This entity definition is read at thebeginning of an indexer run; any updates to this file mid-runwon\u0027t be realized until subsequent runs. This file must beaccessible over HTTPS. See Custom Entity Definition Formatbelow for expected CSV or JSON schema.\r\ninlineEntitiesDefinitionInline JSON entity definitions. This parameter supersedes theentitiesDefinitionUri parameter if present. No more than 10 KBof configuration may be provided inline. See Custom EntityDefinition below for expected JSON schema.defaultLanguageCode(Optional) Language code of the input text used to tokenizeand delineate input text. The following languages aresupported: da, de, en, es, fi, fr, it, pt. The default isEnglish (en). If you pass a languagecode-countrycode format,only the languagecode part of the format is used.globalDefaultCaseSensitive(Optional) Default case sensitive value for the skill. IfdefaultCaseSensitive value of an entity isn\u0027t specified, thisvalue will become the defaultCaseSensitive value for thatentity.globalDefaultAccentSensitive(Optional) Default accent sensitive value for the skill. IfdefaultAccentSensitive value of an entity isn\u0027t specified, thisvalue will become the defaultAccentSensitive value for thatentity.globalDefaultFuzzyEditDistance(Optional) Default fuzzy edit distance value for the skill. IfdefaultFuzzyEditDistance value of an entity isn\u0027t specified,this value will become the defaultFuzzyEditDistance value forthat entity.Input nameDescriptiontextThe text to analyze.\n"
}