{
  "Id": "495",
  "Title": "\u0022Optimizing Azure Search: Cache Management and Skillset Evaluation\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf2. Append the \u0022disableCacheReprocessingChangeDetection=true\u0022 parameter on therequest.3. Submit the change.Setting this parameter ensures that only updates to the skillset definition are committedand the change isn\u0027t evaluated for effects on the existing cache. Use a preview APIversion, 2020-06-30-Preview or later.\r\nHTTPMost changes to a data source definition will invalidate the cache. However, forscenarios where you know that a change should not invalidate the cache - such aschanging a connection string or rotating the key on the storage account - append the\u0022ignoreResetRequirement\u0022 parameter on the data source update.\r\nSetting this parameterto true allows the commit to go through, without triggering a reset condition that wouldresult in all objects being rebuilt and populated from scratch.HTTPBypass skillset evaluationPUT https://[servicename].search.windows.net/skillsets/[skillset name]?api-version=2020-06-30-Preview\u0026disableCacheReprocessingChangeDetection    Bypass data source validation checksPUT https://[search service].\r\nsearch.windows.net/datasources/[data source name]?api-version=2020-06-30-Preview\u0026ignoreResetRequirement   Force skillset evaluationThe purpose of the cache is to avoid unnecessary processing, but suppose you make achange to a skill that the indexer doesn\u0027t detect (for example, changing something inexternal code, such as a custom skill).\r\nIn this case, you can use the Reset Skills to force reprocessing of a particular skill,including any downstream skills that have a dependency on that skill\u0027s output. This APIaccepts a POST request with a list of skills that should be invalidated and marked forreprocessing. After Reset Skills, follow with a Run Indexer request to invoke the pipelineprocessing. Resetting an indexer will result in all documents in the search corpus being reprocessed.In scenarios where only a few documents need to be reprocessed, use Reset Documents(preview) to force reprocessing of specific documents. When a document is reset, theindexer invalidates the cache for that document, which is then reprocessed by reading itfrom the data source.\n"
}