{
  "Id": "1281",
  "Title": "\u0022Optimizing Fuzzy Search with Analyzers and Indexing Techniques\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAnalyzers are important for tokenization７ NoteBecause fuzzy search tends to be slow, it might be worthwhile to investigatealternatives such as n-gram indexing, with its progression of short charactersequences (two and three character sequences for bigram and trigram tokens).Depending on your language and query surface, n-gram might give you betterperformance.\r\nThe trade off is that n-gram indexing is very storage intensive andgenerates much bigger indexes.Another alternative, which you could consider if you want to handle just the mostegregious cases, would be a synonym map. For example, mapping \u0022search\u0022 to\u0022serach, serch, sarch\u0022, or \u0022retrieve\u0022 to \u0022retreive\u0022.\r\nIndexing for fuzzy searchduring indexing, where tokens in the inverted indexes are used for matching against thegraph.As always, if test queries aren\u0027t producing the matches you expect, experiment withdifferent indexing analyzers. For example, try a language analyzer to see if you getbetter results. Some languages, particularly those with vowel mutations, can benefitfrom the inflection and irregular word forms generated by the Microsoft naturallanguage processors. In some cases, using the right language analyzer can make adifference in whether a term is tokenized in a way that is compatible with the valueprovided by the user.\r\nFuzzy queries are constructed using the full Lucene query syntax, invoking the fullLucene query parser, and appending a tilde character ~ after each whole termentered by the user.Here\u0027s an example of a query request that invokes fuzzy search. It includes four terms,two of which are misspelled:HTTP1. Set the query type to the full Lucene syntax (queryType=full).2. Provide the query string where each term is followed by a tilde (~) operator at theend of each whole term (search=\u003Cstring\u003E~). An expansion graph is created forevery term in the query input.Include an optional parameter, a number between 0 and 2 (default), if you want tospecify the edit distance (~1). For example, \u0022blue~\u0022 or \u0022blue~1\u0022 would return\u0022blue\u0022, \u0022blues\u0022, and \u0022glue\u0022.\n"
}