{
  "Id": "1013",
  "Title": "\u0022Optimizing Azure AI Search: Configuration and Query Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUse a double backslash to commas in column names:Example 1 (additionalColumns=MyCustomColumn,MyCustomColumn2):\u0022container\u0022 : { \u0022name\u0022 : \u0022useQuery\u0022, \u0022query\u0022 :\u0022includeLibrary=https://mycompany.sharepoint.com/mysite/MyDocumentLibrary;additionalColumns=MyCustomColumn,MyCustomColumn2\u0022 }Example 2 (escape characters using double backslash):\u0022container\u0022 : { \u0022name\u0022 : \u0022useQuery\u0022, \u0022query\u0022 :\u0022includeLibrary=https://mycompany.\r\nsharepoint.com/teams/mysite/MyDocumentLibrary/Forms/AllItems.aspx;additionalColumns=MyCustomColumnWi}Query７ NoteTo get the value for a particular keyword, we recommend navigating to the document library that you’re trying to include/exclude andcopying the URI from the browser.\r\nThis is the easiest way to get the value to use with a keyword in the query.By default, the SharePoint indexer stops as soon as it encounters a document with an unsupported content type (for example, an image).You can use the excludedFileNameExtensions parameter to skip certain content types. However, you might need to index documentswithout knowing all the possible content types in advance. To continue indexing when an unsupported content type is encountered, set thefailOnUnsupportedContentType configuration parameter to false:HTTPFor some documents, Azure AI Search is unable to determine the content type, or unable to process a document of otherwise supportedcontent type. To ignore this failure mode, set the failOnUnprocessableDocument configuration parameter to false:HTTPAzure AI Search limits the size of documents that are indexed. These limits are documented in Service Limits in Azure AI Search. Oversizeddocuments are treated as errors by default. However, you can still index storage metadata of oversized documents if you setindexStorageMetadataOnlyForOversizedDocuments configuration parameter to true:HTTPYou can also continue indexing if errors happen at any point of processing, either while parsing documents or while adding documents toan index.\n"
}