{
  "Id": "1352",
  "Title": "\u0022Optimizing Search Traffic Analytics for Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor search traffic analytics, these include:User-generated search events: Only search queries initiated by a user areinteresting. Other search requests, such as those used to populate facets orretrieve internal information, are not important. Be sure to only instrument user-initiated events to avoid skew or bias in your results.\r\nUser-generated click events: On a search results page, a click event generallymeans that a document is a relevant result for a specific search query.７ NoteThe pattern described in this article is for advanced scenarios and clickstream datagenerated by code you add to your client. In contrast, service logs are easy to setup, provide a range of metrics, and can be done in the portal with no coderequired.\r\nEnabling logging is recommended for all scenarios. For more information,see Collect and analyze log data.Identify relevant search dataBy linking search and click events with a correlation ID, you\u0027ll gain a deeperunderstanding of how well your application\u0027s search functionality is performing.In the portal page for your Azure Cognitive Search service, open the Search TrafficAnalytics page to access a cheat sheet for following this telemetry pattern. From thispage, you can select or create an Application Insights resource, get the instrumentationkey, copy snippets that you can adapt for your solution, and download a Power BI reportthat\u0027s built over the schema reflected in the pattern. Select an existing Application Insights resource or create one if you don\u0027t have onealready. If you use the Search Traffic Analytics page, you can copy the instrumentationkey your application needs to connect to Application Insights.Once you have an Application Insights resource, you can follow instructions forsupported languages and platforms to register your app. Registration is simply addingthe instrumentation key from Application Insights to your code, which sets up theassociation. You can find the key in the portal, or from the Search Traffic Analytics pagewhen you select an existing resource.\n"
}