{
  "Id": "1241",
  "Title": "\u0022Optimizing Search Results in Azure Cognitive Search: Field Selection and Composition\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAsciiFoldingTokenFilter\u0022,            \u0022preserveOriginal\u0022:true         }      ]   } See alsoHow to work with search results inAzure Cognitive SearchArticle•08/31/2023This article explains how to work with a query response in Azure Cognitive Search. Thestructure of a response is determined by parameters in the query itself, as described inSearch Documents (REST) or SearchResults Class (Azure for .NET).\r\nParameters on the query determine:Field selectionCount of matches found in the index for the queryPaging resultsNumber of results in the response (up to 50, by default)Sort orderHighlighting of terms within a result, matching on either the whole or partial termin the bodyResults are tabular, composed of fields of either all \u0022retrievable\u0022 fields, or limited to justthose fields specified in the $select parameters.\r\nRows are the matching documents.You can choose which fields are in search results. While a search document might have alarge number of fields, typically only a few are needed to represent each document inresults. On a query request, append $select=\u003Cfield list\u003E to specify which \u0022retrievable\u0022fields should appear in the response.\r\nPick fields that offer contrast and differentiation among documents, providing sufficientinformation to invite a click-through response on the part of the user. On an e-commerce site, it might be a product name, description, brand, color, size, price, andrating. For the built-in hotels-sample index, it might be the \u0022select\u0022 fields in thefollowing example:HTTPResult compositionPOST /indexes/hotels-sample-index/docs/search?api-version=2020-06-30     {        \u0022search\u0022: \u0022sandy beaches\u0022,      \u0022select\u0022: \u0022HotelId, HotelName, Description, Rating, Address/City\u0022Occasionally, the substance and not the structure of results are unexpected.\n"
}