{
  "Id": "254",
  "Title": "\u0022Optimizing Azure Cognitive Search: Querying and Resource Management Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf4. Next, enter a search string: search=river\u0026$count=true.This query invokes full text search on the term river, and the result includes acount of the matching documents. Returning the count of matching documents ishelpful in testing scenarios when you have a large index with thousands or millionsof documents.\r\nIn this case, only one document matches the query.5. Lastly, enter a search string that limits the JSON output to fields of interest:search=river\u0026$count=true\u0026$select=hotelId, baseRate, description.The query response is reduced to selected fields, resulting in more concise output.\r\nReset and rerunIn the early experimental stages of development, the most practical approach for designiteration is to delete the objects from Azure Cognitive Search and allow your code torebuild them. Resource names are unique. Deleting an object lets you recreate it usingthe same name.The sample code for this tutorial checks for existing objects and deletes them so thatyou can rerun your code.\r\nYou can also use the portal to delete indexes, indexers, and data sources.When you\u0027re working in your own subscription, at the end of a project, it\u0027s a good ideato remove the resources that you no longer need. Resources left running can cost youmoney. You can delete resources individually or delete the resource group to delete theentire set of resources.You can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.Now that you\u0027re familiar with the basics of SQL Database indexing, let\u0027s take a closerlook at indexer configuration. Clean up resourcesNext stepsConfigure a SQL Database indexerTutorial: Index JSON blobs from AzureStorage using RESTArticle•11/15/2023Azure AI Search can index JSON documents and arrays in Azure Blob Storage using anindexer that knows how to read semi-structured data. Semi-structured data containstags or markings which separate content within the data.\n"
}