{
  "Id": "718",
  "Title": "\u0022Optimizing Indexing Performance in Azure Search: Strategies and Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDuring indexing, twocommon HTTP status codes are:503 Service Unavailable - This error means that the system is under heavyload and your request can\u0027t be processed at this time.207 Multi-Status - This error means that some documents succeeded, but atleast one failed.3. To handle failures, requests should be retried using an exponential backoff retrystrategy.The Azure .NET SDK automatically retries 503s and other failed requests, but you\u0027ll needto implement your own logic to retry 207s. Open-source tools such as Polly can alsobe used to implement a retry strategy.\r\nAdd threads and a retry strategyIndex with indexers and the \u0022pull\u0022 APIsIndexers have several capabilities that are useful for long-running processes:Batching documentsParallel indexing over partitioned dataScheduling and change detection for indexing just new and change documentsover timeIndexer schedules can resume processing at the last known stopping point.\r\nIf data isn\u0027tfully indexed within the processing window, the indexer picks up wherever it left off onthe next run, assuming you\u0027re using a data source that provides change detection.Partitioning data into smaller individual data sources enables parallel processing. Youcan break up source data, such as into multiple containers in Azure Blob Storage, createa data source for each partition, and then run the indexers in parallel, subject to thenumber of search units of your search service. As with the push API, indexers allow you to configure the number of items per batch.For indexers based on the Create Indexer REST API, you can set the batchSize argumentto customize this setting to better match the characteristics of your data.Default batch sizes are data source specific. Azure SQL Database and Azure Cosmos DBhave a default batch size of 1000. In contrast, Azure Blob indexing sets batch size at 10documents in recognition of the larger average document size.\n"
}