{
  "Id": "1643",
  "Title": "\u0022Optimizing Search Queries with \u0027searchMode\u0027 Parameter in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHTTPThe \u0022searchMode\u0022 parameter is relevant in this example. Whenever boolean operatorsare on the query, you should generally set \u0022searchMode=all\u0022 to ensure that all of thecriteria is matched. Otherwise, you can use the default \u0022searchMode=any\u0022 that favorsrecall over precision.Example (simple syntax)POST https://{{service-name}}.search.windows.\r\nnet/indexes/hotel-rooms-sample/docs/search?api-version=2020-06-30 {   \u0022queryType\u0022: \u0022simple\u0022,   \u0022search\u0022: \u0022budget hotel \u002Bpool\u0022,   \u0022searchMode\u0022: \u0022all\u0022 } For more examples, see Simple query syntax examples. For details about the queryrequest and parameters, see Search Documents (REST API).\r\nStrings passed to the \u0022search\u0022 parameter can include terms or phrases in any supportedlanguage, boolean operators, precedence operators, wildcard or prefix characters for\u0022starts with\u0022 queries, escape characters, and URL encoding characters. The \u0022search\u0022parameter is optional. Unspecified, search (search=* or search=\u0022 \u0022) returns the top 50documents in arbitrary (unranked) order.\r\nA term search is a query of one or more terms, where any of the terms areconsidered a match.A phrase search is an exact phrase enclosed in quotation marks \u0022 \u0022. For example,while Roach Motel (without quotes) would search for documents containing Roachand/or Motel anywhere in any order, \u0022Roach Motel\u0022 (with quotes) will only matchdocuments that contain that whole phrase together and in that order (lexicalanalysis still applies). Depending on your search client, you might need to escape the quotation marks ina phrase search. For example, in Postman in a POST request, a phrase search on\u0022Roach Motel\u0022 in the request body would be specified as \u0022\\\u0022Roach Motel\\\u0022\u0022.\n"
}