{
  "Id": "25",
  "Title": "\u0022Optimizing Wildcard and Fuzzy Search Queries in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThisaspect of query parsing casts a broader net over possible matches, because thetokenized term matches a greater number of variants.Wildcard, fuzzy and regex queries, however, aren\u0027t analyzed like regular term or phrasequeries and can lead to poor recall if the query doesn\u0027t match the analyzed form of theword in the search index.\r\nFor more information on query parsing and analysis, see queryarchitecture.Most wildcard search queries, like prefix, fuzzy and regex, are rewritten internally withmatching terms in the search index. This extra processing adds to latency. Further, broadsearch queries, like a* for example, are likely to be rewritten with many terms, whichcan be slow.\r\nFor performant wildcard searches, consider defining a custom analyzer.No, a query is always scoped to a single index.Search scores are generated for full text search queries, based on the statisticalproperties of matching terms, and ordered high to low in the result set.\r\nQuery types thataren\u0027t full text search (wildcard, prefix, regex) aren\u0027t ranked by a relevance score. Thisbehavior is by design. A constant score allow matches found through query expansionto be included in the results, without affecting the ranking.For example, suppose an input of \u0022tour*\u0022 in a wildcard search produces matches on\u0022tours\u0022, \u0022tourettes\u0022, and \u0022tourmaline\u0022. Given the nature of these results, there\u0027s no wayto reasonably infer which terms are more valuable than others. For this reason, termfrequencies are ignored when scoring results in queries of types wildcard, prefix, andregex. Search results based on a partial input are given a constant score to avoid biastowards potentially unexpected matches.Why are my wildcard searches slow?Can I search across multiple indexes?Why is the search score a constant 1.0 for everymatch?SecurityIt stores your data wherever your service is deployed. Azure AI Search doesn\u0027t storecustomer data outside of the deployment region.\n"
}