{
  "Id": "836",
  "Title": "\u0022Optimizing Azure Search: Importing and Parsing JSON Data Efficiently\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can upload the data files to Blob storage and use the Import data wizard to quicklyevaluate how this content is parsed into individual search documents.The data set consists of eight blobs, each containing a JSON array of entities, for a totalof 100 entities. The entities vary as to which fields are populated, but the end result isone search document per entity, from all arrays, in all blobs.For JSON arrays having nested elements, you can specify a \u0022documentRoot\u0022 to indicatea multi-level structure.\r\nFor example, if your blobs look like this:HTTPUse this configuration to index the array contained in the level2 property:HTTP{     \u0022name\u0022 : \u0022my-json-indexer\u0022,     \u0022dataSourceName\u0022 : \u0022my-blob-datasource\u0022,     \u0022targetIndexName\u0022 : \u0022my-target-index\u0022,     \u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022parsingMode\u0022 : \u0022jsonArray\u0022 } } } jsonArrays example (clinical trials sample data)Parsing nested JSON arrays{     \u0022level1\u0022 :\r\n{         \u0022level2\u0022 : [             { \u0022id\u0022 : \u00221\u0022, \u0022text\u0022 : \u0022Use the documentRoot property\u0022 },             { \u0022id\u0022 : \u00222\u0022, \u0022text\u0022 : \u0022to pluck the array you want to index\u0022 },             { \u0022id\u0022 : \u00223\u0022, \u0022text\u0022 : \u0022even if it\u0027s nested inside the document\u0022 }           ]     } } {     \u0022name\u0022 : \u0022my-json-array-indexer\u0022,     .\r\n.. other indexer properties     \u0022parameters\u0022 : { \u0022configuration\u0022 : { \u0022parsingMode\u0022 : \u0022jsonArray\u0022, \u0022documentRoot\u0022 : \u0022/level1/level2\u0022 } } } If your blob contains multiple JSON entities separated by a newline, and you want eachelement to become a separate search document, use jsonLines.textFor JSON lines, the indexer definition should look similar to the following example.\n"
}