{
  "Id": "980",
  "Title": "\u0022Optimizing Azure SQL Indexers for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfLarge views aren\u0027tideal for SQL indexer. A workaround is to create a new table just for ingestion intoyour Azure AI Search index. You\u0027ll be able to use SQL integrated change tracking,which is easier to implement than High Water Mark.７ NoteReal-time data synchronization isn\u0027t possible with an indexer. An indexer canreindex your table at most every five minutes.\r\nIf data updates need to be reflectedin the index sooner, we recommend pushing updated rows directly.PrerequisitesRead permissions. Azure AI Search supports SQL Server authentication, where theuser name and password are provided on the connection string. Alternatively, youcan set up a managed identity and use Azure roles.\r\nTo work through the examples in this article, you\u0027ll need a REST client, such as Postman.Other approaches for creating an Azure SQL indexer include Azure SDKs or Import datawizard in the Azure portal. If you\u0027re using Azure portal, make sure that access to allpublic networks is enabled in the Azure SQL firewall and that the client has access via aninbound rule.\r\nThe data source definition specifies the data to index, credentials, and policies foridentifying changes in the data. A data source is defined as an independent resource sothat it can be used by multiple indexers.1. Create data source or Update data source to set its definition:HTTP2. Provide a unique name for the data source that follows Azure AI Search namingconventions.Define the data source POST https://myservice.search.windows.net/datasources?api-version=2020-06-30 Content-Type: application/json api-key: admin-key {     \u0022name\u0022 : \u0022myazuresqldatasource\u0022,     \u0022description\u0022 : \u0022A database for testing Azure AI Search indexes.\u0022,     \u0022type\u0022 : \u0022azuresql\u0022,     \u0022credentials\u0022 : { \u0022connectionString\u0022 : \u0022Server=tcp:\u003Cyour server\u003E.database.\n"
}