{
  "Id": "1344",
  "Title": "\u0022Optimizing Azure Search: Analyzing and Managing Query Performance Metrics\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe last two statements exclude querystrings consisting of an empty or unspecified search, over a sample index, whichcuts down the noise in your results.KustoReturn query strings entered by users   AzureDiagnostics | project OperationName, Query_s, IndexName_s, Documents_d | where OperationName == \u0022Query.Search\u0022 3. Optionally, set a Column filter on Query_s to search over a specific syntax or string.\r\nFor example, you could filter over is equal to ?api-version=2020-06-30\u0026search=*\u0026%24filter=HotelName).While this technique works for ad hoc investigation, building a report lets youconsolidate and present the query strings in a layout more conducive to analysis.Add the duration column to get the numbers for all queries, not just those that arepicked up as a metric.\r\nSorting this data shows you which queries take the longest tocomplete.1. Under the Monitoring section, select Logs to query for log information.2. Run the following basic query to return queries, sorted by duration in milliseconds.The longest-running queries are at the top.\r\nKusto| where Query_s != \u0022?api-version=2020-06-30\u0026search=*\u0022 | where IndexName_s != \u0022realestate-us-sample-index\u0022 Identify long-running queriesAzureDiagnostics | project OperationName, resultSignature_d, DurationMs, Query_s, Documents_d, IndexName_s | where OperationName == \u0022Query.Search\u0022 | sort by DurationMs A metric alert establishes a threshold at which you will either receive a notification ortrigger a corrective action that you define in advance. For a search service, it\u0027s common to create a metric alert for search latency and throttledqueries. If you know when queries are dropped, you can look for remedies that reduceload or increase capacity. For example, if throttled queries increase during indexing, youcould postpone it until query activity subsides.\n"
}