{
  "Id": "1329",
  "Title": "\u0022Optimizing Azure AI Search Performance and Cost Efficiency Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf4 (2 partitions x 2 replicas)Hypothetical Retail Price: ~$4,000 USD / month ($1000 USD x 4 search units)As this hypothetical scenario illustrates, you can have configurations on lower tiers thatresult in similar costs as if you had opted for a higher tier in the first place.\r\nHowever,higher tiers come with premium storage, which makes indexing faster. Higher tiers alsohave much more compute power, as well as extra memory. For the same costs, youcould have more powerful infrastructure backing the same index.An important benefit of added memory is that more of the index can be cached,resulting in lower search latency, and a greater number of queries per second. With thisextra power, the administrator may not need to even need to increase the replica countand could potentially pay less than by staying on the S1 service.\r\nRegular expression queries or regex can be particularly expensive. While they can bevery useful for complex searches, they also may require a lot of processing power to beexecuted, especially if the regular expression has a lot of complexity or when searchingthrough a large amount of data. This would result in high search latency. In order toreduce the search latency, try to simplify the regular expression or break the complexquery down into smaller, more manageable queries. Review these other articles related to service performance:Analyze performanceIndex large data sets in Azure Cognitive SearchChoose a service tierPlan or add capacityCase Study: Use Cognitive Search to Support Complex AI ScenariosTip: Consider alternatives to regular expression queriesNext stepsMonitoring Azure AI SearchArticle•11/15/2023Azure Monitor is enabled with every subscription to provide monitoring capabilities overall Azure resources, including Azure AI Search. When you sign up for search, AzureMonitor collects activity logs and platform metrics as soon as you start using theservice.Optionally, you can enable diagnostic settings to collect resource logs.\n"
}