{
  "Id": "578",
  "Title": "\u0022Optimizing Azure AI Search Resources with Resource Groups\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you aren\u0027t combining resources into a single group, or if existing resource groups arefilled with resources used in unrelated solutions, create a new resource group just foryour Azure AI Search resource.Over time, you can track current and projected costs all-up or you can view charges forindividual resources. The following screenshot shows the kind of cost information youcan expect to see when you combine multiple resources into one group.Set a resource groupIn Instance Details, provide a service name in the URL field. The name is part of the URLendpoint against which API calls are issued: https://your-service-name.search.windows.net.\r\nFor example, if you want the endpoint to behttps://myservice.search.windows.net, you would enter myservice.Service name requirements:It must be unique within the search.windows.\r\nnet namespaceIt must be between 2 and 60 characters in lengthYou must use lowercase letters, digits, or dashes (\u0022-\u0022)Don\u0027t use dashes (\u0022-\u0022) in the first 2 characters or as the last single characterYou may not use consecutive dashes (\u0022--\u0022) anywhere TipResource groups simplify cleanup because deleting a group deletes all of theservices within it. For prototype projects utilizing multiple services, putting all ofthem in the same resource group makes cleanup easier after the project is over.\r\nName the service TipIf you think you\u0027ll be using multiple services, we recommend including the region(or location) in the service name as a naming convention. Services within the sameregion can exchange data at no charge, so if Azure AI Search is in West US, and youhave other services also in West US, a name like mysearchservice-westus can saveAzure AI Search is available in most regions, as listed in the Products available byregion page. As a rule, if you\u0027re using multiple Azure services, putting all of them in the same regionminimizes or voids bandwidth charges. There are no charges for data exchanges amongservices when all of them are in the same region.\nTwo notable exceptions might lead to provisioning one or more search services in aseparate region:Outbound connections from Azure AI Search to Azure Storage. You might wantstorage in a different region if you\u0027re enabling a firewall.Business continuity and disaster recovery (BCDR) requirements dictate creatingmultiple search services in regional pairs.\n"
}