{
  "Id": "613",
  "Title": "\u0022Optimizing Cost and Security in Azure AI Search Solutions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCustomer-managed keys provide double encryption of sensitive content. This featurerequires a billable Azure Key Vault).Skillsets can include billable built-in skills, non-billable built-in utility skills, and customskills. Non-billable utility skills include Conditional, Shaper, Text Merge, Text Split.\r\nThereis no billing impact when using them, no Azure AI services key requirement, and no 20document limit.A custom skill is functionality you provide. The cost of using a custom skill dependsentirely on whether custom code is calling other metered services. There is no Azure AI1, 2111112services key requirement and no 20 document limit on custom skills.\r\nCost management is built into the Azure infrastructure. Review Billing and costmanagement for more information about tracking costs, tools, and APIs.Follow these guidelines to minimize costs of an Azure AI Search solution.1. If possible, create all resources in the same region, or in as few regions as possible,to minimize or eliminate bandwidth charges.2. Scale up for resource-intensive operations like indexing, and then readjustdownwards for regular query workloads. If there are predictable patterns to yourworkloads, you might be able to synchronize scale up to coincide with theexpected volume (you would need to write code to automate this).\r\nWhen estimating the cost of a search solution, keep in mind that pricing andcapacity aren\u0027t linear (doubling capacity more than doubles the cost on the sametier). Also, at some point, switching up to a higher tier can give you better andfaster performance at roughly the same price point. For more information and anexample, see Upgrade to a Standard S2 tier.3. Consider Azure Web App for your front-end application so that requests andresponses stay within the data center boundary.4. If you\u0027re using AI enrichment, there is an extra charge for blob storage, but thecumulative cost goes down if you enable enrichment caching.\n"
}