{
  "Id": "1645",
  "Title": "\u0022Optimizing Search Queries: Understanding Boolean Operators and Search Modes\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBecause OR is the default conjunctionoperator, you could also leave it out, such that pool ocean is theequivalent of pool | ocean.-pool –oceanA NOT operation returns matches on documents that exclude the term.The searchMode parameter on a query request controls whether a termwith the NOT operator is ANDed or ORed with other terms in the query(assuming there\u0027s no boolean operators on the other terms).\r\nValid valuesinclude any or all.searchMode=any increases the recall of queries by including more results,and by default - will be interpreted as \u0022OR NOT\u0022. For example, pool -ocean will match documents that either contain the term pool or thosethat don\u0027t contain the term ocean.\r\nsearchMode=all increases the precision of queries by including fewerresults, and by default - will be interpreted as \u0022AND NOT\u0022. For example,with searchMode=any, the query pool - ocean will match documents thatcontain the term \u0022pool\u0022 and all documents that don\u0027t contain the term\u0022ocean\u0022. This is arguably a more intuitive behavior for the - operator.\r\nTherefore, you should consider using searchMode=all instead ofsearchMode=any if you want to optimize searches for precision instead ofrecall, and Your users frequently use the - operator in searches.When deciding on a searchMode setting, consider the user interactionpatterns for queries in various applications.\r\nUsers who are searching forinformation are more likely to include an operator in a query, as opposedto e-commerce sites that have more built-in navigation structures.For \u0022starts with\u0022 queries, add a suffix operator (*) as the placeholder for the remainderof a term. A prefix query must begin with at least one alphanumeric character beforeBoolean operatorsPrefix queriesyou can add the suffix operator. CharacterExampleUsage*lingui* will match on\u0022linguistic\u0022 or \u0022linguini\u0022The asterisk (*) represents one or more characters ofarbitrary length, ignoring case.Similar to filters, a prefix query looks for an exact match. As such, there\u0027s no relevancescoring (all results receive a search score of 1.0). Be aware that prefix queries can beslow, especially if the index is large and the prefix consists of a small number ofcharacters.\n"
}