{
  "Id": "933",
  "Title": "\u0022Optimizing Azure Cognitive Search with Table Partitions and SAS\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor more information, seeUsing Shared Access Signatures.By default, Azure Cognitive Search uses the following internal query filter to keep trackof which source entities have been updated since the last run: Timestamp \u003E=HighWaterMarkValue. Because Azure tables don’t have a secondary index on theTimestamp field, this type of query requires a full table scan and is therefore slow forlarge tables.To avoid a full scan, you can use table partitions to narrow the scope of each indexerjob.If your data can naturally be partitioned into several partition ranges, create a datasource and a corresponding indexer for each partition range.\r\nEach indexer now hasto process only a specific partition range, resulting in better query performance. If７ NoteIf you use SAS credentials, you\u0027ll need to update the data source credentialsperiodically with renewed signatures to prevent their expiration. When SAScredentials expire, the indexer will fail with an error message similar to \u0022Credentialsprovided in the connection string are invalid or have expired\u0022.Partition for improved performancethe data that needs to be indexed has a small number of fixed partitions, evenbetter: each indexer only does a partition scan.\r\nFor example, to create a data source for processing a partition range with keysfrom 000 to 100, use a query like this: \u0022container\u0022 : { \u0022name\u0022 : \u0022my-table\u0022,\u0022query\u0022 : \u0022PartitionKey ge \u0027000\u0027 and PartitionKey lt \u0027100\u0027 \u0022 }If your data is partitioned by time (for example, if you create a new partition everyday or week), consider the following approach:In the data source definition, specify a query similar to the following example:(PartitionKey ge \u003CTimeStamp\u003E) and (other filters).\r\nMonitor indexer progress by using Get Indexer Status API, and periodicallyupdate the \u003CTimeStamp\u003E condition of the query based on the latest successfulhigh-water-mark value. With this approach, if you need to trigger a full reindex, reset the data sourcequery in addition to resetting the indexer.In a search index, add fields to accept the content and metadata of your table entities.1. Create or update an index to define search fields that will store content fromentities:HTTP2.\n"
}