{
  "Id": "405",
  "Title": "\u0022Optimizing Search Relevance: Hybrid Retrieval and Ranking in AI\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTheadvantage of vector search is finding information that\u0027s conceptually similar to yoursearch query, even if there are no keyword matches in the inverted index. The advantageof keyword or full text search is precision, with the ability to apply semantic ranking thatimproves the quality of the initial results. Some scenarios - such as querying overproduct codes, highly specialized jargon, dates, and people\u0027s names - can performbetter with keyword search because it can identify exact matches.Benchmark testing on real-world and benchmark datasets indicates that hybrid retrievalwith semantic ranking offers significant benefits in search relevance.\r\nThe following video explains how hybrid retrieval gives you optimal grounding data forgenerating useful AI responses.Outperform vector search with hybrid retrieval and ranking (Tech blog)            \u0022Address\u0022: {                \u0022City\u0022: \u0022Washington D.C.\u0022,                \u0022StateProvince\u0022: null            }        }    ]}Why choose hybrid search?https://www.\r\nyoutube-nocookie.com/embed/Xwx1DJ0OqCkSee alsoRetrieval Augmented Generation (RAG)in Azure AI SearchArticle•11/20/2023Retrieval Augmentation Generation (RAG) is an architecture that augments thecapabilities of a Large Language Model (LLM) like ChatGPT by adding an informationretrieval system that provides grounding data. Adding an information retrieval systemgives you control over grounding data used by an LLM when it formulates a response.For an enterprise solution, RAG architecture means that you can constrain generative AIto your enterprise content sourced from vectorized documents, images, audio, and video.The decision about which information retrieval system to use is critical because itdetermines the inputs to the LLM. The information retrieval system should provide:Indexing strategies that load and refresh at scale, for all of your content, at thefrequency you require.Query capabilities and relevance tuning.\n"
}