{
  "Id": "1338",
  "Title": "\u0022Optimizing Azure AI Search in Power BI: Troubleshooting and Monitoring\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf1. Navigate to your Power BI apps, find your Azure AI Search app and select the Editapp button to view the workspace.2. Select Settings from the Dataset options.Modify app parameters3. While in the Datasets tab, change the parameter values and select Apply. If there isan issue with the connection, update the data source credentials on the samepage.\r\n4. Navigate back to the workspace and select Refresh now from the Dataset options.5. Open the report to view the updated data. You might also need to refresh thereport to view the latest data.If you find that you cannot see your data follow these troubleshooting steps:1. Open the report and refresh the page to make sure you\u0027re viewing the latest data.There\u0027s an option in the report to refresh the data. Select this to get the latest data.2. Ensure the storage account name and access key you provided are correct. Thestorage account name should correspond to the account configured with yoursearch service logs.3.\r\nConfirm that your storage account contains the containers insights-logs-operationlogs and insights-metrics-pt1m and each container has data. The logsand metrics will be within a couple layers of folders.4. Check to see if the dataset is still refreshing. The refresh status indicator is shownin step 8 above. If it is still refreshing, wait until the refresh is complete to openand refresh the report.\r\nMonitor search operations and activityWhat is Power BI?Basic concepts for designers in the Power BI serviceTroubleshooting report issuesNext stepsMonitor query requests in AzureCognitive SearchArticle•03/01/2023This article explains how to measure query performance and volume using built-inmetrics and resource logging. It also explains how to get the query strings entered byapplication users.The Azure portal shows basic metrics about query latency, query load (QPS), andthrottling. Historical data that feeds into these metrics can be accessed in the portal for30 days. For longer retention, or to report on operational data and query strings, youmust enable a diagnostic setting that specifies a storage option for persisting loggedoperations and metrics.\n"
}