{
  "Id": "1684",
  "Title": "\u0022Optimizing Entity Linking with Text Split and Skill Parameters\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfLength. If you need to break up your data before sending it to the EntityLinkingskill, consider using the Text Split skill. If you do use a text split skill, set the page lengthto 5000 for the best performance.Parameter names are case-sensitive and are all optional.Parameter nameDescriptiondefaultLanguageCodeLanguage code of the input text.\r\nIf the default language code is notspecified, English (en) will be used as the default language code.See the full list of supported languages.minimumPrecisionA value between 0 and 1. If the confidence score (in the entities output)is lower than this value, the entity is not returned.\r\nThe default is 0.modelVersion(Optional) Specifies the version of the model to use when calling entitylinking. It will default to the latest available when not specified. Werecommend you do not specify this value unless it\u0027s necessary.７ NoteThis skill is bound to the Entity Linking machine learning models in Azure AILanguage and requires a billable resource for transactions that exceed 20documents per indexer per day. Execution of built-in skills is charged at the existingAzure AI services pay-as-you go price.@odata.typeData limitsSkill parametersInput nameDescriptionlanguageCodeA string indicating the language of the records.\r\nIf this parameter is not specified,the default language code will be used to analyze the records.See the full list of supported languages.textThe text to analyze. OutputnameDescriptionentitiesAn array of complex types that contains the following fields:\u0022name\u0022 (The actual entity name as it appears in the text)\u0022id\u0022\u0022language\u0022 (The language of the text as determined by the skill)\u0022url\u0022 (The linked url to this entity)\u0022bingId\u0022 (The bingId for this linked entity)\u0022dataSource\u0022 (The data source associated with the url)\u0022matches\u0022 (An array of complex types that contains: text, offset, lengthand confidenceScore)JSONSkill inputsSkill outputsSample definition  {    \u0022@odata.\n"
}