{
  "Id": "607",
  "Title": "\u0022Optimizing Azure Cognitive Search: Replicas, Partitions, and Query Performance\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAdditionally, a certain amount of redundancy smoothsout query performance when services or nodes are updated internally.Some guidelines for determining whether to add capacity include:Meeting the high availability criteria for service level agreementThe frequency of HTTP 503 errors is increasingLarge query volumes are expectedAs a general rule, search applications tend to need more replicas than partitions,particularly when the service operations are biased toward query workloads. Each replicais a copy of your index, allowing the service to load balance requests against multiplecopies.\r\nAll load balancing and replication of an index is managed by Azure CognitiveSearch and you can alter the number of replicas allocated for your service at any time.You can allocate up to 12 replicas in a Standard search service and 3 replicas in a Basicsearch service. Replica allocation can be made either from the Azure portal or one of theprogrammatic options.Search applications that require near real-time data refresh will need proportionallymore partitions than replicas. Adding partitions spreads read/write operations across alarger number of compute resources. It also gives you more disk space for storingadditional indexes and documents.Finally, larger indexes take longer to query.\r\nAs such, you might find that everyincremental increase in partitions requires a smaller but proportional increase in replicas.The complexity of your queries and query volume will factor into how quickly queryexecution is turned around.1. Sign in to the Azure portal and select the search service.７ NoteAdding more replicas or partitions increases the cost of running the service, andcan introduce slight variations in how results are ordered. Be sure to check thepricing calculator to understand the billing implications of adding more nodes.The chart below can help you cross-reference the number of search units requiredfor a specific configuration. For more information on how additional replicas impactquery processing, see Ordering results.Add or reduce replicas and partitions2. Under Settings, open the Scale page to modify replicas and partitions.The following screenshot shows a Basic Standard provisioned with one replica andpartition. The formula at the bottom indicates how many search units are beingused (1).\n"
}