{
  "Id": "729",
  "Title": "\u0022Optimizing Azure Search Suggestions for Better Results and User Experience\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSuggestions, on the other hand, produce better results when your field choice isselective. Remember that the suggestion is a proxy for a search document so you\u0027ll wantHow to create a suggesterChoose fieldsfields that best represent a single result. Names, titles, or other unique fields thatdistinguish among multiple matches work best.\r\nIf fields consist of repetitive values, thesuggestions consist of identical results and a user won\u0027t know which one to click.To satisfy both search-as-you-type experiences, add all of the fields that you need forautocomplete, but then use \u0022$select\u0022, \u0022$top\u0022, \u0022$filter\u0022, and \u0022searchFields\u0022 to controlresults for suggestions.\r\nYour choice of an analyzer determines how fields are tokenized and subsequentlyprefixed. For example, for a hyphenated string like \u0022context-sensitive\u0022, using a languageanalyzer will result in these token combinations: \u0022context\u0022, \u0022sensitive\u0022, \u0022context-sensitive\u0022. Had you used the standard Lucene analyzer, the hyphenated string wouldn\u0027texist.\r\nWhen evaluating analyzers, consider using the Analyze Text API for insight into howterms are processed. Once you build an index, you can try various analyzers on a stringto view token output.Fields that use custom analyzers or built-in analyzers (with the exception of standardLucene) are explicitly disallowed to prevent poor outcomes.\r\nWhen using Add Index or the Import data wizard to create an index, you have theoption of enabling a suggester:1. In the index definition, enter a name for the suggester.2. In each field definition for new fields, select a checkbox in the Suggester column. Acheckbox is available on string fields only. As previously noted, analyzer choice impacts tokenization and prefixing. Consider theentire field definition when enabling suggesters.Choose analyzers７ NoteIf you need to work around the analyzer constraint, for example if you need akeyword or ngram analyzer for certain query scenarios, you should use twoseparate fields for the same content.\n"
}