{
  "Id": "1340",
  "Title": "\u0022Optimizing Search Performance: Metrics and Analytics Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOne-minute intervals (TimeGrain = \u0022PT1M\u0022) for metrics isfixed within the system. TipWith additional client-side code and Application Insights, you can also captureclickthrough data for deeper insight into what attracts the interest of yourapplication users. For more information, see Search traffic analytics.Query volume (QPS)It\u0027s common for queries to execute in milliseconds, so only queries that measure asseconds will appear in metrics.AggregationTypeDescriptionAverageThe average number of seconds within a minute during which query executionoccurred.CountThe number of metrics emitted to the log within the one-minute interval.\r\nMaximumThe highest number of search queries per second registered during a minute.MinimumThe lowest number of search queries per second registered during a minute.SumThe sum of all queries executed within the minute.\r\nFor example, within one minute, you might have a pattern like this: one second of highload that is the maximum for SearchQueriesPerSecond, followed by 58 seconds ofaverage load, and finally one second with only one query, which is the minimum.Another example: if a node emits 100 metrics, where the value of each metric is 40, then\u0022Count\u0022 is 100, \u0022Sum\u0022 is 4000, \u0022Average\u0022 is 40, and \u0022Max\u0022 is 40. Service-wide, query performance is measured as search latency (how long a query takesto complete) and throttled queries that were dropped as a result of resource contention.AggregationTypeLatencyAverageAverage query duration in milliseconds.CountThe number of metrics emitted to the log within the one-minute interval.MaximumLongest running query in the sample.MinimumShortest running query in the sample.TotalTotal execution time of all queries in the sample, executing within the interval(one minute).Query performanceSearch latencyConsider the following example of Search Latency metrics: 86 queries were sampled,with an average duration of 23.\n"
}