{
  "Id": "889",
  "Title": "\u0022Optimizing Azure Blob Storage Content with Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfEncodingByte Order MarkUTF-16 Big Endian0xFE 0xFFUTF-16 Little Endian0xFF 0xFEUTF-80xEF 0xBB 0xBFIf no byte order mark is present, the text is assumed to be encoded as UTF-8.To work around this warning, determine what the text encoding for this blob is and addthe appropriate byte order mark.Collections with Lazy indexing policies can\u0027t be queried consistently, resulting in yourindexer missing data.\r\nTo work around this warning, change your indexing policy toConsistent.Warning: The data change detection policy isconfigured to use key column \u0027X\u0027Warning: Document text appears to be UTF-16encoded, but is missing a byte order markWarning: Azure Cosmos DB collection \u0027X\u0027 has aLazy indexing policy.\r\nSome data may be lostThis warning is passed from the Language service of Azure AI services. In some cases, it\u0027ssafe to ignore this warning, such as when your document contains a long URL (whichlikely isn\u0027t a key phrase or driving sentiment, etc.). Be aware that when a word is longerthan 64 characters, it will be truncated to 64 characters which can affect modelpredictions.Indexers have document size limits. Make sure that the documents in your data sourceare smaller than the supported size limit, as documented for your service SKU.Warning: The document contains very longwords (longer than 64 characters). These wordsmay result in truncated and/or unreliablemodel predictions.Error: Cannot write more bytes to the bufferthan the configured maximum buffer sizeSearch over Azure Blob Storage contentArticle•11/15/2023Searching across the variety of content types stored in Azure Blob Storage can be adifficult problem to solve, but Azure AI Search provides deep integration at the contentlayer, extracting and inferring textual information, which can then be queried in a searchindex.In this article, review the basic workflow for extracting content and metadata from blobsand sending it to a search index in Azure AI Search. The resulting index can be queriedusing full text search.\n"
}