{
  "Id": "370",
  "Title": "\u0022Optimizing Data Indexing and AI-Enriched Search Solutions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOptimize-data-indexingTutorial:Optimizeindexing with thepush API.Demonstrates optimizationtechniques for pushing data into asearch index.tutorial-ai-enrichmentTutorial: AI-generatedsearchablecontent fromAzure blobsShows how to configure an indexerand skillset.create-mvc-appTutorial: Addsearch to anASP.\r\nNET Core(MVC) appWhile most samples are consoleapplications, this MVC sample uses aweb page to front the sample Hotelsindex, demonstrating basic search,pagination, and other server-sidebehaviors.An accelerator is an end-to-end solution that includes code and documentation thatyou can adapt for your own implementation of a specific scenario.\r\nSamplesRepositoryDescriptionSearch \u002B QnA MakerAcceleratorsearch-qna-maker-acceleratorA solution combining the power of Search andQnA Maker. See the live demo site.Knowledge MiningSolution Acceleratorazure-search-knowledge-miningIncludes templates, support files, and analyticalreports to help you prototype an end-to-endknowledge mining solution.\r\nA demo repo provides proof-of-concept source code for examples or scenarios shownin demonstrations. Demo solutions aren\u0027t designed for adaptation by customers.AcceleratorsDemosSamplesRepositoryDescriptionCovid-19 searchappcovid19searchSource code repository for the Azure AI Searchbased Covid-19 Search AppJFK demoAzureSearch_JFK_FilesLearn more about the JFK solution. The following samples are also published by the Azure AI Search team, but aren\u0027treferenced in documentation. Associated readme files provide usage instructions.SamplesRepositoryDescriptionDotNetVectorDemoazure-search-vectorCalls Azure OpenAI to generate embeddings andAzure AI Search to create, load, and query anindex.Query multiple servicesazure-search-dotnet-scaleIssue a single query across multiple searchservices and combine the results into a singlepage.Check storageazure-search-dotnet-utilitiesInvokes an Azure function that checks searchservice storage on a schedule.Export an indexazure-search-dotnet-utilitiesC# console app that partitions and export a largeindex.\n"
}