{
  "Id": "604",
  "Title": "\u0022Optimizing Azure Search Service for Performance and Cost Efficiency\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCreate a service at a billable tier:Start low, at Basic or S1, if you\u0027re not sure about the projected load.Estimate with the Free tierEstimate with a billable tierStart high, at S2 or even S3, if testing includes large-scale indexing and queryloads.Start with Storage Optimized, at L1 or L2, if you\u0027re indexing a large amount ofdata and query load is relatively low, as with an internal business application.\r\n3. Build an initial index to determine how source data translates to an index. This isthe only way to estimate index size.4. Monitor storage, service limits, query volume, and latency in the portal. The portalshows you queries per second, throttled queries, and search latency. All of thesevalues can help you decide if you selected the right tier.5. Add replicas if you need high availability or if you experience slow queryperformance.There are no guidelines on how many replicas are needed to accommodate queryloads. Query performance depends on the complexity of the query and competingworkloads.\r\nAlthough adding replicas clearly results in better performance, theresult isn\u0027t strictly linear: adding three replicas doesn\u0027t guarantee triple throughput.For guidance in estimating QPS for your solution, see Analyze performanceandMonitor queries.Query volume considerationsQueries per second (QPS) is an important metric during performance tuning, but it\u0027sgenerally only a tier consideration if you expect high query volume at the outset.The Standard tiers can provide a balance of replicas and partitions. You can increasequery turnaround by adding replicas for load balancing or add partitions for parallelprocessing. You can then tune for performance after the service is provisioned. If you expect high sustained query volumes from the outset, you should consider higherStandard tiers, backed by more powerful hardware. You can then take partitions and７ NoteStorage requirements can be inflated if you include data that will never besearched. Ideally, documents contain only the data that you need for the searchexperience.\n"
}