{
  "Id": "1243",
  "Title": "\u0022Optimizing Document Count and Image Handling in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf the system is actively adding, updating, ordeleting documents, the count will be approximate, excluding any documents that      \u0022count\u0022: true    }７ NoteFor images in results, such as a product photo or logo, store them outside of AzureCognitive Search, but add a field in your index to reference the image URL in thesearch document.\r\nSample indexes that demonstrate images in the results includethe realestate-sample-us demo (a built-in sample dataset that you can build easilyin the Import Data wizard), and the New York City Jobs demo app.Tips for unexpected resultsCounting matchesaren\u0027t fully indexed.Count won\u0027t be affected by routine maintenance or other workloads on the searchservice.\r\nHowever if you have multiple partitions and a single replica, you couldexperience short-term fluctuations in document count (several minutes) as the partitionsare restarted.By default, the search engine returns up to the first 50 matches. The top 50 aredetermined by search score, assuming the query is full text search or semantic search.\r\nOtherwise, the top 50 are an arbitrary order for exact match queries (where uniform\u0022@searchScore=1.0\u0022 indicates arbitrary ranking).To control the paging of all documents returned in a result set, add $top and $skipparameters to the GET query request, or top and skip to the POST query request. Thefollowing list explains the logic. Return the first set of 15 matching documents plus a count of total matches: GET/indexes/\u003CINDEX-NAME\u003E/docs?search=\u003CQUERY STRING\u003E\u0026$top=15\u0026$skip=0\u0026$count=trueReturn the second set, skipping the first 15 to get the next 15: $top=15\u0026$skip=15.Repeat for the third set of 15: $top=15\u0026$skip=30The results of paginated queries aren\u0027t guaranteed to be stable if the underlying index ischanging.\n"
}