{
  "Id": "522",
  "Title": "\u0022Optimizing Azure Search: Incremental Caching and Knowledge Store Projections\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you are making changes to a skillset, you should enable caching of enricheddocuments to reuse existing enrichments where possible.Without incremental caching, the indexer will always process documents in order of thehigh water mark, without going backwards. For blobs, the indexer would process blobssorted by lastModified, regardless of any changes to indexer settings or the skillset.\r\nIfyou change a skillset, previously processed documents aren\u0027t updated to reflect the newskillset. Documents processed after the skillset change will use the new skillset, resultingin index documents being a mix of old and new skillsets.Content lifecycle７ NoteWhile you can edit the data in the projections, any edits will be overwritten on thenext pipeline invocation, assuming the document in source data is updated.\r\nChanges in source dataChanges to a skillsetWith incremental caching, and after a skillset update, the indexer will reuse anyenrichments that are unaffected by the skillset change. Upstream enrichments are pulledfrom cache, as are any enrichments that are independent and isolated from the skill thatwas changed.\r\nAlthough an indexer creates and updates structures and content in Azure Storage, itdoes not delete them. Projections continue to exist even when the indexer or skillset isdeleted. As the owner of the storage account, you should delete a projection if it is nolonger needed.\r\nKnowledge store offers persistence of enriched documents, useful when designing askillset, or the creation of new structures and content for consumption by any clientapplications capable of accessing an Azure Storage account.The simplest approach for creating enriched documents is through the portal, but youcan also use Postman and the REST API, which is more useful if you want insight intohow objects are created and referenced programmatically. DeletionsNext stepsCreate a knowledge store using Postman and RESTKnowledge store \u0022projections\u0022 in AzureCognitive SearchArticle•11/15/2022Projections are the physical tables, objects, and files in a knowledge store that acceptcontent from a Cognitive Search AI enrichment pipeline. If you\u0027re creating a knowledgestore, defining and shaping projections is most of the work.This article introduces projection concepts and workflow so that you have somebackground before you start coding.Projections are defined in Cognitive Search skillsets, but the end results are the table,object, and image file projections in Azure Storage.\n"
}