{
  "Id": "1051",
  "Title": "\u0022Optimizing Image Generation and File Inclusion in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor non-PDF files, the behavior of this parameter is similar as if youhad set \u0022generateNormalizedImages\u0022. However, note that setting\u0022generateNormalizedImagePerPage\u0022 can make indexing operation lessperformant by design (especially for big documents) since several imageswould have to be generated.\r\n5. Optionally, adjust the width or height of the generated normalized images:\u0022normalizedImageMaxWidth\u0022 (in pixels). Default is 2000. Maximum value is10000.\u0022normalizedImageMaxHeight\u0022 (in pixels). Default is 2000. Maximum value is10000.\r\n{   \u0022parameters\u0022:   {     \u0022configuration\u0022:      {        \u0022dataToExtract\u0022: \u0022contentAndMetadata\u0022,        \u0022parsingMode\u0022: \u0022default\u0022,        \u0022imageAction\u0022: \u0022generateNormalizedImages\u0022     }   } } The default of 2000 pixels for the normalized images maximum width and height isbased on the maximum sizes supported by the OCR skill and the image analysisskill.\r\nThe OCR skill supports a maximum width and height of 4200 for non-Englishlanguages, and 10000 for English. If you increase the maximum limits, processingcould fail on larger images depending on your skillset definition and the languageof the documents.Optionally, set file type criteria if the workload targets a specific file type.\r\nBlobindexer configuration includes file inclusion and exclusion settings. You can filterout files you don\u0027t want.JSONWhen \u0022imageAction\u0022 is set to a value other than \u0022none\u0022, the new normalized_imagesfield will contain an array of images. Each image is a complex type that has the followingmembers:Image memberDescriptiondataBASE64 encoded string of the normalized image in JPEG format. widthWidth of the normalized image in pixels.heightHeight of the normalized image in pixels.originalWidthThe original width of the image before normalization.originalHeightThe original height of the image before normalization.rotationFromOriginalCounter-clockwise rotation in degrees that occurred to create thenormalized image. A value between 0 degrees and 360 degrees. This stepreads the metadata from the image that is generated by a camera orscanner. Usually a multiple of 90 degrees.{   \u0022parameters\u0022 : {        \u0022configuration\u0022 : {            \u0022indexedFileNameExtensions\u0022 : \u0022.\n"
}