{
  "Id": "605",
  "Title": "\u0022Optimizing Azure Cognitive Search for High Query Volumes\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you expect high sustained query volumes from the outset, you should consider higherStandard tiers, backed by more powerful hardware. You can then take partitions and７ NoteStorage requirements can be inflated if you include data that will never besearched. Ideally, documents contain only the data that you need for the searchexperience.\r\nBinary data isn\u0027t searchable and should be stored separately (maybe inan Azure table or blob storage). A field should then be added in the index to hold aURL reference to the external data. The maximum size of an individual searchdocument is 16 MB (or less if you\u0027re bulk uploading multiple documents in onerequest).\r\nFor more information, see Service limits in Azure Cognitive Search.replicas offline, or even switch to a lower-tier service, if those query volumes don\u0027toccur. For more information on how to calculate query throughput, see Monitor queries.The Storage Optimized tiers are useful for large data workloads, supporting more overallavailable index storage for when query latency requirements are less important. Youshould still use additional replicas for load balancing and additional partitions forparallel processing. You can then tune for performance after the service is provisioned.Service-level agreementsThe Free tier and preview features aren\u0027t covered by service-level agreements (SLAs).\r\nFor all billable tiers, SLAs take effect when you provision sufficient redundancy for yourservice. You need to have two or more replicas for query (read) SLAs. You need to havethree or more replicas for query and indexing (read-write) SLAs. The number ofpartitions doesn\u0027t affect SLAs. Allow metrics to build around queries, and collect data around usage patterns(queries during business hours, indexing during off-peak hours). Use this data toinform service provisioning decisions. Though it\u0027s not practical at an hourly or dailycadence, you can dynamically adjust partitions and resources to accommodateplanned changes in query volumes.\n"
}