{
  "Id": "438",
  "Title": "\u0022Optimizing Search Results with Semantic Ranking and Reranking Strategies\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfscoreRRF algorithmUpper limit is bounded by thenumber of queries being fused, witheach query contributing a maximumof approximately 1 to the RRF score.For example, merging three querieswould produce higher RRF scoresthan if only two search results aremerged.semanticranking@search.rerankerScoreSemantic ranking0.00 - 4.00Semantic ranking doesn\u0027t participate in RRF. Its score (@search.\r\nrerankerScore) is alwaysreported separately in the query response. Semantic ranking can rerank full text andhybrid search results, assuming those results include fields having semantically richcontent.By default, if you aren\u0027t using pagination, the search engine returns the top 50 highestranking matches for full text search, and the most similar k matches for vector search.\r\nIna hybrid query, top determines the number of results in the response. Based ondefaults, the top 50 highest ranked matches of the unified result set are returned.Often, the search engine finds more results than top and k. To return more results, usethe paging parameters top, skip, and next.\r\nPaging is how you determine the numberof results on each logical page and navigate through the full payload.Full text search is subject to a maximum limit of 1,000 matches (see API response limits).Once 1,000 matches are found, the search engine no longer looks for more.For more information, see How to work with search results.\r\nThe following diagram illustrates a hybrid query that invokes keyword and vector search,with boosting through scoring profiles, and semantic ranking.Number of ranked results in a hybrid queryresponseDiagram of a search scoring workflowA query that generates the previous workflow might look like this:HTTPPOST https://{{search-service-name}}.search. windows.net/indexes/{{index-name}}/docs/search?api-version=2023-11-01Content-Type: application/jsonapi-key: {{admin-api-key}}{Learn more about hybrid searchLearn more about vector search   \u0022queryType\u0022:\u0022semantic\u0022,   \u0022search\u0022:\u0022hello world\u0022,   \u0022searchFields\u0022:\u0022field_a, field_b\u0022,   \u0022vectorQueries\u0022: [       {           \u0022kind\u0022:\u0022vector\u0022,           \u0022vector\u0022: [1.\n"
}