{
  "Id": "709",
  "Title": "\u0022Optimizing Chunk Size for Large Language Models: Techniques and Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCommon chunking techniquesContent overlap considerationsFactors for chunking dataLarge Language Models (LLM) have performance guidelines for chunk size. youneed to set a chunk size that works best for all of the models you\u0027re using. Forinstance, if you use models for summarization and embeddings, choose an optimalchunk size that works for both.\r\nThis section uses an example to demonstrate the logic of creating chunks out ofsentences. For this example, assume the following:Tokens are equal to words.Input = text_to_chunk(string)Output = sentences(list[string])\u0022Barcelona is a city in Spain. It is close to the sea and /n the mountains. /n Youcan both ski in winter and swim in summer.\r\n\u0022Sentence 1 contains 6 words: \u0022Barcelona is a city in Spain.\u0022Sentence 2 contains 9 words: \u0022It is close to the sea /n and the mountains. /n\u0022Sentence 3 contains 10 words: \u0022You can both ski in winter and swim in summer.\u0022Given a maximum number of tokens, iterate through the sentences and concatenatesentences until the maximum token length is reached.\r\nIf a sentence is bigger than themaximum number of chunks, truncate to a maximum number of tokens, and put therest in the next chunk.Example: maximum tokens = 10Simple example of how to create chunks withsentencesSample inputApproach 1: Sentence chunking with \u0022no overlap\u0022７ NoteThe examples ignore the newline /n character because it\u0027s not a token, but if thepackage or library detects new lines, then you\u0027d see those line breaks here. Example: maximum tokens = 16Example: maximum tokens = 6Follow the same logic with no overlap approach, except that you create an overlapbetween chunks according to certain ratio. A 10% overlap on maximum tokens of 10 isone token.\nExample: maximum tokens = 10A fixed-sized chunking and embedding generation sample demonstrates bothchunking and vector embedding generation using Azure OpenAI embedding models.Barcelona is a city in Spain.It is close to the sea /n and the mountains. /nYou can both ski in winter and swim in summer.Barcelona is a city in Spain.\n"
}