{
  "Id": "528",
  "Title": "\u0022Optimizing Projections and Enrichment in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhile in Azure Storage, familiarize yourself with existing content in containers andtables so that you choose non-conflicting names for the projections. A knowledgestore is a loose collection of tables and containers. Consider adopting a namingconvention to keep track of related objects.3.\r\nIn Cognitive Search, enable enrichment caching (preview) in the indexer and thenrun the indexer to execute the skillset and populate the cache. This is a previewfeature, so be sure to use the preview REST API (api-version=2020-06-30-previewor later) on the indexer request. Once the cache is populated, you can modifyprojection definitions in a knowledge store free of charge (as long as the skillsthemselves are not modified).\r\n4. In your code, all projections are defined solely in a skillset. There are no indexerproperties (such as field mappings or output field mappings) that apply toprojections. Within a skillset definition, you will focus on two areas:knowledgeStore property and skills array.a. Under knowledgeStore, specify table, object, file projections in the projectionssection.\r\nObject type, object name, and quantity (per the number of projectionsyou define) are determined in this section.b. From the skills array, determine which skill outputs will be referenced in thesource of each projection. All projections have a source. The source can be theoutput of an upstream skill, but is often the output of a Shaper skill. Thecomposition of your projection is determined through shapes.5. If you\u0027re adding projections to an existing skillset, update the skillset and run theindexer.6. Check your results in Azure Storage. On subsequent runs, avoid naming collisionsby deleting objects in Azure Storage or changing project names in the skillset.7. If you are using Table projections check Understanding the Table Service datamodel and Scalability and performance targets for Table storage to make sure yourdata requirements are within Table storage documented limits.Checklist for getting startedReview syntax and examples for each projection type.\n"
}