{
  "Id": "1328",
  "Title": "\u0022Optimizing Azure Search Service Performance and Cost Efficiency\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfEach progressively higher tier provides faster CPUs and morememory, both of which have a positive impact on performance.The Standard S1 search tier is often where customers start. A common pattern for S1services is that indexes grow over time, which requires more partitions. More partitionslead to slower response times, so more replicas are added to handle the query load.\r\nAsyou can imagine, the cost of running an S1 service has now progressed to levels beyondthe initial configuration.At this juncture, an important question to ask is whether it would be beneficial to moveto a higher tier, as opposed to progressively increasing the number of partitions orreplicas of the current service.\r\nConsider the following topology as an example of a service that has taken on increasinglevels of capacity:Standard S1 tierIndex Size: 190 GBPartition Count: 8 (on S1, partition size is 25 GB per partition)Replica Count: 2Total Search Units: 16 (8 partitions x 2 replicas)Hypothetical Retail Price: ~$4,000 USD / month (assume $250 USD x 16 searchunits)Suppose the service administrator is still seeing higher latency rates and is consideringadding another replica.\r\nThis would change the replica count from 2 to 3 and as a resultchange the Search Unit count to 24 and a resulting price of $6,000 USD/month.\r\nService capacityTip: Upgrade to a Standard S2 tierHowever, if the administrator chose to move to a Standard S2 tier the topology wouldlook like:Standard S2 tierIndex Size: 190 GBPartition Count: 2 (on S2, partition size is 100 GB per partition)Replica Count: 2Total Search Units: 4 (2 partitions x 2 replicas)Hypothetical Retail Price: ~$4,000 USD / month ($1000 USD x 4 search units)As this hypothetical scenario illustrates, you can have configurations on lower tiers thatresult in similar costs as if you had opted for a higher tier in the first place.\n"
}