{
  "Id": "606",
  "Title": "\u0022Optimizing Service Provisioning for Query Workloads: Capacity Planning Tips\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAllow metrics to build around queries, and collect data around usage patterns(queries during business hours, indexing during off-peak hours). Use this data toinform service provisioning decisions. Though it\u0027s not practical at an hourly or dailycadence, you can dynamically adjust partitions and resources to accommodateplanned changes in query volumes.\r\nYou can also accommodate unplanned butsustained changes if levels hold long enough to warrant taking action.Remember that the only downside of under provisioning is that you might have totear down a service if actual requirements are greater than your predictions. Toavoid service disruption, you would create a new service at a higher tier and run itside by side until all apps and requests target the new endpoint.Initially, a service is allocated a minimal level of resources consisting of one partition andone replica. The tier you choose determines partition size and speed, and each tier isoptimized around a set of characteristics that fit various scenarios.\r\nIf you choose ahigher-end tier, you might need fewer partitions than if you go with S1. One of thequestions you\u0027ll need to answer through self-directed testing is whether a larger andmore expensive partition yields better performance than two cheaper partitions on aservice provisioned at a lower tier.A single service must have sufficient resources to handle all workloads (indexing andqueries). Neither workload runs in the background. You can schedule indexing for timesTips for capacity planningWhen to add capacitywhen query requests are naturally less frequent, but the service won\u0027t otherwiseprioritize one task over another. Additionally, a certain amount of redundancy smoothsout query performance when services or nodes are updated internally.Some guidelines for determining whether to add capacity include:Meeting the high availability criteria for service level agreementThe frequency of HTTP 503 errors is increasingLarge query volumes are expectedAs a general rule, search applications tend to need more replicas than partitions,particularly when the service operations are biased toward query workloads. Each replicais a copy of your index, allowing the service to load balance requests against multiplecopies.\n"
}