{
  "Id": "720",
  "Title": "\u0022Optimizing Indexer Performance in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor more information about setting schedules, see Create Indexer REST API or see Howto schedule indexers for Azure AI Search.If you partition your data, you can create multiple indexer-data-source combinationsthat pull from each data source and write to the same search index. Because eachindexer is distinct, you can run them at the same time, populating a search index morequickly than if you ran them sequentially.\r\nMake sure you have sufficient capacity. One search unit in your service can run oneindexer at any given time. Creating multiple indexers is only useful if they can run inparallel.The number of indexing jobs that can run simultaneously varies for text-based andskills-based indexing. For more information, see Indexer execution.\r\nIf your data source is an Azure Blob Storage container or Azure Data Lake Storage Gen2, enumerating a large number of blobs can take a long time (even hours) until thisoperation is completed. This will cause that your indexer\u0027s documents succeeded countisn\u0027t increased during that time and it may seem it\u0027s not making any progress, when it is.\r\nIf you would like document processing to go faster for a large number of blobs,consider partitioning your data into multiple containers and create parallel indexerspointing to a single index.}}７ NoteSome indexers that run on an older runtime architecture have a 24-hour ratherthan 2-hour maximum processing window.\r\nThe 2-hour limit is for newer contentprocessors that run in an internally managed multi-tenant environment.Whenever possible, Azure AI Search tries to offload indexer and skillset processingto the multi-tenant environment. If the indexer can\u0027t be migrated, it will run in theprivate environment and it can run for as long as 24 hours. If you\u0027re scheduling anindexer that exhibits these characteristics, assume a 24 hour processing window.Run indexers in parallel1. Sign in to the Azure portal and check the number of search units used by yoursearch service. Select Settings \u003E Scale to view the number at the top of the page.\n"
}