{
  "Id": "426",
  "Title": "\u0022Optimizing Search Relevance and Consistency in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis approach is generally not a problem for a large corpus of data,and it provides better performance than having to calculate the score based oninformation across all shards. That said, using this performance optimization could causetwo very similar documents (or even identical documents) to end up with differentrelevance scores if they end up in different shards.\r\nIf you prefer to compute the score based on the statistical properties across all shards,you can do so by adding scoringStatistics=global as a query parameter (or add\u0022scoringStatistics\u0022: \u0022global\u0022 as a body parameter of the query request).HTTPUsing scoringStatistics will ensure that all shards in the same replica provide the sameresults.\r\nThat said, different replicas may be slightly different from one another as they\u0027realways getting updated with the latest changes to your index. In some scenarios, youmay want your users to get more consistent results during a \u0022query session\u0022. In suchscenarios, you can provide a sessionId as part of your queries. The sessionId is aunique string that you create to refer to a unique user session.\r\nHTTPAs long as the same sessionId is used, a best-effort attempt is made to target the samereplica, increasing the consistency of results your users will see.POST https://[service name].search.windows.net/indexes/hotels/docs/search?api-version=2020-06-30{    \u0022search\u0022: \u0022\u003Cquery string\u003E\u0022,    \u0022scoringStatistics\u0022: \u0022global\u0022}POST https://[service name]. search.windows.net/indexes/hotels/docs/search?api-version=2020-06-30{    \u0022search\u0022: \u0022\u003Cquery string\u003E\u0022,    \u0022sessionId\u0022: \u0022\u003Cstring\u003E\u0022}７ NoteIn Azure Cognitive Search, you can configure BM25 algorithm parameters, and tunesearch relevance and boost search scores through these mechanisms:ApproachImplementationDescriptionScoringalgorithmconfigurationSearch indexScoring profilesSearch indexProvide criteria for boosting the search score of a matchbased on content characteristics. For example, you mightwant to boost matches based on their revenue potential,promote newer items, or perhaps boost items that havebeen in inventory too long.\n"
}