{
  "Id": "1724",
  "Title": "\u0022Optimizing Azure AI Services for Document Translation: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf７ NoteThis skill is bound to Azure AI services and requires a billable resource fortransactions that exceed 20 documents per indexer per day. Execution of built-inskills is charged at the existing Azure AI services pay-as-you go price.When using this skill, all documents in the source are processed and billed fortranslation, even if the source and target languages are the same.\r\nThis behavior isuseful for multi-language support within the same document, but it can result inunnecessary processing. To avoid unexpected billing charges from documents thatdon\u0027t need processing, move them out of the data source container prior torunning the skill.@odata.typeData limitsParameters are case-sensitive.InputsDescriptiondefaultToLanguageCode(Required) The language code to translate documents into fordocuments that don\u0027t specify the \u0022to\u0022 language explicitly.See the full list of supported languages.defaultFromLanguageCode(Optional) The language code to translate documents from fordocuments that don\u0027t specify the \u0022from\u0022 language explicitly.\r\nIf thedefaultFromLanguageCode isn\u0027t specified, the automatic languagedetection provided by the Translator Text API will be used todetermine the \u0022from\u0022 language.See the full list of supported languages.suggestedFrom(Optional) The language code to translate documents from iffromLanguageCode or defaultFromLanguageCode are unspecified, andthe automatic language detection is unsuccessful. If thesuggestedFrom language isn\u0027t specified, English (en) will be used asthe suggestedFrom language.See the full list of supported languages.Input nameDescriptiontextThe text to be translated.toLanguageCodeA string indicating the language the text should be translated to. If thisinput isn\u0027t specified, the defaultToLanguageCode will be used to translatethe text.See the full list of supported languages.fromLanguageCodeA string indicating the current language of the text. If this parameter isn\u0027tspecified, the defaultFromLanguageCode (or automatic language detectionif the defaultFromLanguageCode isn\u0027t provided) will be used to translatethe text.See the full list of supported languages.Skill parametersSkill inputsSkill outputsOutput nameDescriptiontranslatedTextThe string result of the text translation from thetranslatedFromLanguageCode to the translatedToLanguageCode.\n"
}