{
  "Id": "581",
  "Title": "\u0022Optimizing Azure AI Search: Scaling and Resource Management Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor a portal walkthrough, start withQuickstart: Create an Azure AI Search index in the portal.Scale your serviceAfter a search service is provisioned, you can scale it to meet your needs. If you chosethe Standard tier, you can scale the service in two dimensions: replicas and partitions.\r\nFor the Basic tier, you can only add replicas. For the free service, scale isn\u0027t available.Partitions allow your service to store and search through more documents.Replicas allow your service to handle a higher load of search queries.Adding resources increases your monthly bill. The pricing calculator can help youunderstand the billing ramifications of adding resources.\r\nRemember that you can adjustresources based on load. For example, you might increase resources to create a fullinitial index, and then reduce resources later to a level more appropriate for incrementalindexing.1. Go to your search service page in the Azure portal.2. In the left-navigation pane, select Settings \u003E Scale.3.\r\nUse the slidebar to add resources of either type.Most customers use just one service provisioned at a tier sufficient for expected load.One service can host multiple indexes, subject to the maximum limits of the tier youselect, with each index isolated from another. In Azure AI Search, requests can only be） ImportantA service must have 2 replicas for read-only SLA and 3 replicas for read/writeSLA.\r\nWhen to add a second servicedirected to one index, minimizing the chance of accidental or intentional data retrievalfrom other indexes in the same service.Although most customers use just one service, service redundancy might be necessary ifoperational requirements include the following:Business continuity and disaster recovery (BCDR). Azure AI Search doesn\u0027t provideinstant failover in the event of an outage.Multi-tenant architectures sometimes call for two or more services.Globally deployed applications might require search services in each geography tominimize latency.A second service isn\u0027t required for high availability. High availability for queries isachieved when you use 2 or more replicas in the same service. Replica updates aresequential, which means at least one is operational when a service update is rolled out.For more information about uptime, see Service Level Agreements.Azure AI Search restricts the number of resources you can initially create in asubscription.\n"
}