{
  "Id": "579",
  "Title": "\u0022Optimizing Azure Services: Regional Considerations and Feature Availability\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAs a rule, if you\u0027re using multiple Azure services, putting all of them in the same regionminimizes or voids bandwidth charges. There are no charges for data exchanges amongservices when all of them are in the same region.\r\nTwo notable exceptions might lead to provisioning one or more search services in aseparate region:Outbound connections from Azure AI Search to Azure Storage. You might wantstorage in a different region if you\u0027re enabling a firewall.Business continuity and disaster recovery (BCDR) requirements dictate creatingmultiple search services in regional pairs.\r\nFor example, if you\u0027re operating in NorthAmerica, you might choose East US and West US, or North Central US and SouthCentral US, for each search service.Some features are subject to regional availability. If you require any of followingfeatures, choose a region that provides them:AI enrichment requires Azure AI services to be in the same physical region as AzureAI Search.\r\nThere are just a few regions that don\u0027t provide both. The Productsavailable by region page indicates a common regional presence by showing twostacked check marks. An unavailable combination has a missing check mark. Thetime piece icon indicates future availability.Semantic ranking is an optional premium feature. Check the Products available byregion page to confirm the feature is available in your chosen region.\r\nyou a trip to the properties page when deciding how to combine or attachresources.Choose a regionOther features that have regional constraints:Availability ZonesAzure roles for data plane operations (Azure public cloud only)Azure AI Search is currently offered in multiple pricing tiers: Free, Basic, Standard, orStorage Optimized. Each tier has its own capacity and limits. Also the tier you select mayimpact the availability of certain features. See Feature availability by tier for guidance.Basic and Standard are the most common choices for production workloads, but initiallymany customers start with the Free service for evaluation purposes. Among the billabletiers, key differences are partition size and speed, and limits on the number of objectsyou can create.Remember, a pricing tier can\u0027t be changed once the service is created. If you need ahigher or lower tier, you\u0027ll have to re-create the service.\n"
}