{
  "Id": "1659",
  "Title": "\u0022Optimizing Text Queries and Special Characters in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis means that allgenerated tokens should be valid English words. For example, terminate, terminates,and termination will mostly stay whole in the index, and would be a preferable choicefor scenarios that depend a lot on wildcards and fuzzy search.Azure Cognitive Search uses frequency-based scoring (BM25) for text queries.\r\nHowever, for wildcard and regex queries where scope of terms can potentially be broad,the frequency factor is ignored to prevent the ranking from biasing towards matchesfrom rarer terms. All matches are treated equally for wildcard and regex searches.In some circumstances, you may want to search for a special character, like an \u0027❤\u0027 emojior the \u0027€\u0027 sign. In such cases, make sure that the analyzer you use doesn\u0027t filter thosecharacters out. The standard analyzer bypasses many special characters, excluding themfrom your index.strings you are indexing. For more information, see Partial term search andpatterns with special characters.\r\nEffect of an analyzer on wildcard queriesScoring wildcard and regex queriesSpecial charactersAnalyzers that tokenize special characters include the whitespace analyzer, which takesinto consideration any character sequences separated by whitespaces as tokens (so the❤ string would be considered a token). Also, a language analyzer like the MicrosoftEnglish analyzer (\u0022en.\r\nmicrosoft\u0022), would take the \u0022€\u0022 string as a token. You can test ananalyzer to see what tokens it generates for a given query.When using Unicode characters, make sure symbols are properly escaped in the queryurl (for instance for ❤ would use the escape sequence %E2%9D%A4\u002B). Postman does thistranslation automatically. You can use parentheses to create subqueries, including operators within theparenthetical statement. For example, motel\u002B(wifi|luxury) searches for documentscontaining the motel term and either wifi or luxury (or both).Field grouping is similar but scopes the grouping to a single field. For example,hotelAmenities:(gym\u002B(wifi|pool)) searches the field hotelAmenities for gym and wifi,or gym and pool.\n"
}