{
  "Id": "614",
  "Title": "\u0022Optimizing Azure Costs and Budget Management Strategies\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor more information and anexample, see Upgrade to a Standard S2 tier.3. Consider Azure Web App for your front-end application so that requests andresponses stay within the data center boundary.4. If you\u0027re using AI enrichment, there is an extra charge for blob storage, but thecumulative cost goes down if you enable enrichment caching.\r\nYou can create budgets to manage costs and create alerts that automatically notifystakeholders of spending anomalies and overspending risks. Alerts are based onspending compared to budget and cost thresholds. Budgets and alerts are created forAzure subscriptions and resource groups, so they\u0027re useful as part of an overall costmonitoring strategy.\r\nBudgets can be created with filters for specific resources or services in Azure if you wantmore granularity present in your monitoring. Filters help ensure that you don\u0027taccidentally create new resources that cost you extra money. For more informationMonitor costsMinimize costsCreate budgetsabout the filter options available when you create a budget, see Group and filteroptions.\r\nYou can also export your cost data to a storage account. This is helpful when you needor others to do more data analysis for costs. For example, a finance team can analyzethe data using Excel or Power BI. You can export your costs on a daily, weekly, ormonthly schedule and set a custom date range. Exporting cost data is therecommended way to retrieve cost datasets.Can I temporarily shut down a search service to save on costs?Search runs as a continuous service. Dedicated resources are always operational,allocated for your exclusive use for the lifetime of your service. To stop billing entirely,you must delete the service. Deleting a service is permanent and also deletes itsassociated data.Can I change the billing rate (tier) of an existing search service?In-place upgrade or downgrade is not supported. Changing a service tier requiresprovisioning a new service at the desired tier.Learn more on how pricing works with Azure AI Search. See Azure AI Searchpricing page.Learn more about replicas and partitions.Learn how to optimize your cloud investment with Azure Cost Management.Learn more about managing costs with cost analysis.Learn about how to prevent unexpected costs.Take the Cost Management guided learning course.\n"
}