{
  "Id": "601",
  "Title": "\u0022Optimizing Azure Search Performance and Capacity: Key Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can avoid these rankinganomalies by choosing to compute scores globally across the entire index, butdoing so will incur a performance penalty.Autocomplete anomalies: Autocomplete queries, where matches are made on thefirst several characters of a partially entered term, accept a fuzzy parameter thatforgives small deviations in spelling. For autocomplete, fuzzy matching isconstrained to terms within the current shard. For example, if a shard contains\u0022Microsoft\u0022 and a partial term of \u0022micor\u0022 is entered, the search engine will matchon \u0022Microsoft\u0022 in that shard, but not in other shards that hold the remaining partsof the index.\r\nCapacity and the costs of running the service go hand in hand. Tiers impose limits ontwo levels: content (a count of indexes on a service, for example) and storage. It\u0027simportant to consider both because whichever limit you reach first is the effective limit.Counts of indexes and other objects are typically dictated by business and engineeringrequirements.\r\nFor example, you might have multiple versions of the same index foractive development, testing, and production.Storage needs are determined by the size of the indexes you expect to build. There areno solid heuristics or generalities that help with estimates. The only way to determinethe size of an index is build one. Its size will be based on imported data, text analysis,and index configuration such as whether you enable suggesters, filtering, and sorting.For full text search, the primary data structure is an inverted index structure, which hasdifferent characteristics than source data. For an inverted index, size and complexity aredetermined by content, not necessarily by the amount of data that you feed into it. Alarge data source with high redundancy could result in a smaller index than a smallerdataset that contains highly variable content. So it\u0027s rarely possible to infer index sizebased on the size of the original dataset.\n"
}