{
  "Id": "719",
  "Title": "\u0022Optimizing Indexer Batch Sizes and Scheduling for Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAs with the push API, indexers allow you to configure the number of items per batch.For indexers based on the Create Indexer REST API, you can set the batchSize argumentto customize this setting to better match the characteristics of your data.Default batch sizes are data source specific. Azure SQL Database and Azure Cosmos DBhave a default batch size of 1000. In contrast, Azure Blob indexing sets batch size at 10documents in recognition of the larger average document size.\r\nIndexer scheduling is an important mechanism for processing large data sets and foraccommodating slow-running processes like image analysis in an enrichment pipeline.Typically, indexer processing runs within a 2-hour window. If the indexing workloadtakes days rather than hours to complete, you can put the indexer on a consecutive,recurring schedule that starts every two hours. Assuming the data source has changetracking enabled, the indexer will resume processing where it last left off. At thiscadence, an indexer can work its way through a document backlog over a series of daysuntil all unprocessed documents are processed.\r\nJSONCheck indexer batch sizeSchedule indexers for long-running processes{    \u0022dataSourceName\u0022 : \u0022hotels-ds\u0022,    \u0022targetIndexName\u0022 : \u0022hotels-idx\u0022,    \u0022schedule\u0022 : { \u0022interval\u0022 : \u0022PT2H\u0022, \u0022startTime\u0022 : \u00222022-01-01T00:00:00Z\u0022 When there are no longer any new or updated documents in the data source, indexerexecution history will report 0/0 documents processed, and no processing occurs. For more information about setting schedules, see Create Indexer REST API or see Howto schedule indexers for Azure AI Search.If you partition your data, you can create multiple indexer-data-source combinationsthat pull from each data source and write to the same search index. Because eachindexer is distinct, you can run them at the same time, populating a search index morequickly than if you ran them sequentially.\n"
}