{
  "Id": "1028",
  "Title": "\u0022Optimizing Azure AI Search Skillsets: Tips and Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022companyDescription\u0022    }  ]}Send output to a destinationTips for a first skillsetFor some skills, such as OCR or image analysis, the wizard adds utility skills thatmerge the image and text content that was separated during document cracking.\r\nAfter the wizard runs, you can open each object in the Azure portal to view itsJSON definition. You can also use Debug Sessions to invoke skillset execution overa target document.Alternatively, you can import sample Postman collections that provide a fullarticulation of the object definitions required to evaluate a skill.When you\u0027re ready to start from scratch on a new skillset, checking preliminaryresults is important. We recommend a search index for content validation becauseit\u0027s simpler to set up, in comparison to knowledge stores.\r\nFor each skill output, define an output field mapping in the indexer, and a field inthe search index.After you run the indexer, use Search Explorer to return documents from the indexand check the contents of each field to determine what the skillset detected orcreated.This screenshot shows the results of an entity recognition skill that detectedpersons, locations, organizations, and other entities in a chunk of text. You canview the results to decide whether a skill adds value to your solution.Context and input source fields are paths to nodes in an enrichment tree. As a next step,learn more about the path syntax for nodes in an enrichment tree.\r\nNext stepsReferencing annotations in a skillsetDebug an Azure AI Search skillset inAzure portalArticle•11/27/2023Start a portal-based debug session to identify and resolve errors, validate changes, andpush changes to a published skillset in your Azure AI Search service. A debug session is a cached indexer and skillset execution, scoped to a singledocument, that you can use to edit and test your changes interactively. If you\u0027reunfamiliar with how a debug session works, see Debug sessions in Azure AI Search. Topractice a debug workflow with a sample document, see Tutorial: Debug sessions.An existing enrichment pipeline, including a data source, a skillset, an indexer, andan index.\n"
}