{
  "Id": "992",
  "Title": "\u0022Optimizing Change Tracking in Azure SQL Database for Indexers\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOn read-only replicas, SQL Database doesn\u0027t support integrated change tracking.Therefore, you must use High Water Mark policy.Our standard recommendation is to use the rowversion data type for the high watermark column. However, using rowversion relies on the MIN_ACTIVE_ROWVERSION function,which isn\u0027t supported on read-only replicas.\r\nTherefore, you must point the indexer to aprimary replica if you\u0027re using rowversion.FAQIf you attempt to use rowversion on a read-only replica, you\u0027ll see the following error:\u0022Using a rowversion column for change tracking isn\u0027t supported on secondary (read-only) availability replicas. Please update the datasource and specify a connection to theprimary availability replica. Current database \u0027Updateability\u0027 property is \u0027READ_ONLY\u0027\u0022.Q: Can I use an alternative, non-rowversion column for high water mark changetracking?It\u0027s not recommended. Only rowversion allows for reliable data synchronization.\r\nHowever, depending on your application logic, it may be safe if:You can ensure that when the indexer runs, there are no outstanding transactionson the table that’s being indexed (for example, all table updates happen as a batchon a schedule, and the Azure AI Search indexer schedule is set to avoidoverlapping with the table update schedule).You periodically do a full reindex to pick up any missed rows.\r\nIndexer connections to Azure SQLManaged Instance through a publicendpointArticle•11/15/2023Indexers in Azure AI Search connect to external data sources over a public endpoint. Ifyou\u0027re setting up an Azure SQL indexer for a connection to a SQL managed instance,follow the steps in this article to ensure the public endpoint is set up correctly. Alternatively, if the managed instance is behind a firewall, create a shared private linkinstead.This article highlights just the steps for an indexer connection in Azure AI Search. If youwant more background, see Configure public endpoint in Azure SQL Managed Instanceinstead.1. For a new SQL Managed Instance, create the resource with the Enable publicendpoint option selected.７ NoteAlways Encrypted columns are not currently supported by Azure AI Searchindexers.Enable a public endpoint2. Alternatively, if the instance already exists, you can enable public endpoint on anexisting SQL Managed Instance under Security \u003E Virtual network \u003E Publicendpoint \u003E Enable.\n"
}