{
  "Id": "1073",
  "Title": "\u0022Optimizing AI Enrichment in Azure Cognitive Search: Tips and Tricks\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCheck for cached outputCommon errorsA 400 Bad Request error will also occur if you are missing an indexer requirement. Theerror message will specify any missing dependencies.Incremental enrichment is applicable on indexers that contain skillsets, providingreusable content for both indexes and knowledge stores. The following links providemore information about caching and skillsets.\r\nIncremental enrichment (lifecycle and management)Skillset concepts and compositionCreate a skillsetTutorial: Use REST and AI to generate searchable content from Azure blobsNext stepsTips for AI enrichment in AzureCognitive SearchArticle•09/16/2022This article contains a list of tips and tricks to keep you moving as you get started withAI enrichment capabilities in Azure Cognitive Search.\r\nIf you haven\u0027t already, step through Quickstart: Create a skillset for AI enrichment for alight-weight introduction to enrichment of blob data.The best way to find issues quickly is to increase the speed at which you can fix issues,which means working with smaller or simpler documents.\r\nStart by creating a data source with just a handful of documents or rows in a table thatare representative of the documents that will be indexed.Run your sample through the end-to-end pipeline and check that the results meet yourneeds. Once you\u0027re satisfied with the results, you\u0027re ready to add more files to your datasource.\r\nThe data source connection isn\u0027t validated until you define an indexer that uses it. If youget connection errors, make sure that:Your connection string is correct. Specially when you\u0027re creating SAS tokens, makesure to use the format expected by Azure Cognitive Search. See How to specifycredentials section to learn about the different formats supported. Your container name in the indexer is correct.Sometimes a small failure stops an indexer in its tracks. That is fine if you plan to fixissues one by one. However, you might want to ignore a particular type of error,Tip 1: Start with a small datasetTip 2: Make sure your data source credentialsare correctTip 3: See what works even if there are somefailuresallowing the indexer to continue so that you can see what flows are actually working.\n"
}