{
  "Id": "1636",
  "Title": "\u0022Optimizing Performance with Azure AI Search: Leveraging search.in Function\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfin(myfield, \u0027a, b, c\u0027) is equivalent to myfield eq \u0027a\u0027 ormyfield eq \u0027b\u0027 or myfield eq \u0027c\u0027, except that search.in will yield much betterperformance.There are two overloads of the search.in function:search.in(variable, valueList)search.in(variable, valueList, delimiters)The parameters are defined in the following table:ParameternameTypeDescriptionvariableEdm.\r\nStringA string field reference (or a range variable over a string collectionfield in the case where search.in is used inside an any or allexpression).valueListEdm.StringA string containing a delimited list of values to match against thevariable parameter. If the delimiters parameter is not specified,the default delimiters are space and comma.\r\ndelimitersEdm.StringA string where each character is treated as a separator when parsingthe valueList parameter. The default value of this parameter is \u0027 ,\u0027search_in_call ::=    \u0027search.in(\u0027 variable \u0027,\u0027 string_literal(\u0027,\u0027 string_literal)? \u0027)\u0027OData syntax diagram for Azure AI Search７ NoteSee OData expression syntax reference for Azure AI Search for the completeEBNF.ParameternameTypeDescriptionwhich means that any values with spaces and/or commas betweenthem will be separated. If you need to use separators other thanspaces and commas because your values include those characters,you can specify alternate delimiters such as \u0027|\u0027 in this parameter.\r\nIf you use search.in, you can expect sub-second response time when the secondparameter contains a list of hundreds or thousands of values. There is no explicit limiton the number of items you can pass to search.in, although you are still limited by themaximum request size. However, the latency will grow as the number of values grows.Find all hotels with name equal to either \u0027Sea View motel\u0027 or \u0027Budget hotel\u0027. Phrasescontain spaces, which is a default delimiter. You can specify an alternative delimiter insingle quotes as the third string parameter:odata-filter-exprFind all hotels with name equal to either \u0027Sea View motel\u0027 or \u0027Budget hotel\u0027 separated by\u0027|\u0027):odata-filter-exprFind all hotels with rooms that have the tag \u0027wifi\u0027 or \u0027tub\u0027:odata-filter-exprFind a match on phrases within a collection, such as \u0027heated towel racks\u0027 or \u0027hairdryerincluded\u0027 in tags.\n"
}