{
  "Id": "752",
  "Title": "\u0022Optimizing Search with Language Analyzers in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSince large chunks of text are more likely to have this content, fieldsconsisting of descriptions, reviews, or summaries are good candidates for a languageanalyzer.You should also consider language analyzers when content consists of non-Westernlanguage strings. While the default analyzer (Standard Lucene) is language-agnostic, theconcept of using spaces and special characters (hyphens and slashes) to separate stringsis more applicable to Western languages than non-Western ones.For example, in Chinese, Japanese, Korean (CJK), and other Asian languages, a spaceisn\u0027t necessarily a word delimiter. Consider the following Japanese string.\r\nBecause it hasno spaces, a language-agnostic analyzer would likely analyze the entire string as onetoken, when in fact the string is actually a phrase.For the example above, a successful query would have to include the full token, or apartial token using a suffix wildcard, resulting in an unnatural and limiting searchexperience.\r\nWhen to use a language analyzerこれは私たちの銀河系の中ではもっとも重く明るいクラスの球状星団です。(This is the heaviest and brightest group of spherical stars in our galaxy.)A better experience is to search for individual words: 明るい (Bright), 私たちの (Our), 銀河系 (Galaxy).\r\nUsing one of the Japanese analyzers available in Cognitive Search is morelikely to unlock this behavior because those analyzers are better equipped at splittingthe chunk of text into meaningful words in the target language. Azure Cognitive Search supports 35 language analyzers backed by Lucene, and 50language analyzers backed by proprietary Microsoft natural language processingtechnology used in Office and Bing.Some developers might prefer the more familiar, simple, open-source solution ofLucene. Lucene language analyzers are faster, but the Microsoft analyzers haveadvanced capabilities, such as lemmatization, word decompounding (in languages likeGerman, Danish, Dutch, Swedish, Norwegian, Estonian, Finnish, Hungarian, Slovak) andentity recognition (URLs, emails, dates, numbers).\n"
}