{
  "Id": "739",
  "Title": "\u0022Optimizing Search Solutions with Complex Data Structures in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf your search solution is built on earlier workarounds of flattened datasets in acollection, you should change your index to include complex types as supported inthe newest API version. For more information about upgrading API versions, seeUpgrade to the newest REST API version or Upgrade to the newest .NET SDKversion.\r\nThe following JSON document is composed of simple fields and complex fields.Complex fields, such as Address and Rooms, have sub-fields. Address has a single set ofvalues for those sub-fields, since it\u0027s a single object in the document. In contrast, Roomshas multiple sets of values for its sub-fields, one for each object in the collection.\r\nJSONDuring indexing, you can have a maximum of 3000 elements across all complexcollections within a single document. An element of a complex collection is a member ofthat collection, so in the case of Rooms (the only complex collection in the Hotelexample), each room is an element. In the example above, if the \u0022Secret Point Motel\u0022had 500 rooms, the hotel document would have 500 room elements.\r\nFor nestedcomplex collections, each nested element is also counted, in addition to the outer(parent) element.Example of a complex structure{   \u0022HotelId\u0022: \u00221\u0022,   \u0022HotelName\u0022: \u0022Secret Point Motel\u0022,   \u0022Description\u0022: \u0022Ideally located on the main commercial artery of the city in the heart of New York. \u0022,   \u0022Tags\u0022: [\u0022Free wifi\u0022, \u0022on-site parking\u0022, \u0022indoor pool\u0022, \u0022continental breakfast\u0022],   \u0022Address\u0022: {     \u0022StreetAddress\u0022: \u0022677 5th Ave\u0022,     \u0022City\u0022: \u0022New York\u0022,    \u0022StateProvince\u0022: \u0022NY\u0022   },   \u0022Rooms\u0022: [     {       \u0022Description\u0022: \u0022Budget Room, 1 Queen Bed (Cityside)\u0022,       \u0022RoomNumber\u0022: 1105,       \u0022BaseRate\u0022: 96.\n"
}