{
  "Id": "876",
  "Title": "\u0022Optimizing Custom Skill Execution and Indexing in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOnce you have confirmed that a resultis returned, check the duration of execution. If you didn\u0027t explicitly set a timeout valueon your custom skill definition, then the default timeout is 30 seconds. If 30 secondsisn\u0027t long enough for your skill to execute, you may specify a higher timeout value onyour custom skill definition. Here\u0027s an example of a custom skill definition where thetimeout is set to 90 seconds:JSONThe maximum value that you can set for the timeout parameter is 230 seconds.\r\nIf yourcustom skill is unable to execute consistently within 230 seconds, you may considerreducing the batchSize of your custom skill so that it has fewer documents to processwithin a single execution. If you have already set your batchSize to 1, you need torewrite the skill to be able to execute in under 230 seconds, or otherwise split it intomultiple custom skills so that the execution time for any single custom skill is amaximum of 230 seconds.\r\nReview the custom skill documentation for more information.The document was read and processed, but the indexer couldn\u0027t add it to the searchindex. This can happen due to:  {        \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Custom.\r\nWebApiSkill\u0022,        \u0022uri\u0022: \u0022\u003Cyour custom skill uri\u003E\u0022,        \u0022batchSize\u0022: 1,        \u0022timeout\u0022: \u0022PT90S\u0022,        \u0022context\u0022: \u0022/document\u0022,        \u0022inputs\u0022: [          {            \u0022name\u0022: \u0022input\u0022,            \u0022source\u0022: \u0022/document/content\u0022          }        ],        \u0022outputs\u0022: [          {            \u0022name\u0022: \u0022output\u0022,            \u0022targetName\u0022: \u0022output\u0022          }        ]      }Error: Could not \u0027MergeOrUpload\u0027 | \u0027Delete\u0027document to the search indexReasonDetails/ExampleResolutionA field contains a term thatis too largeA term in your document is largerthan the 32-KB limitYou can avoid thisrestriction by ensuringthe field isn\u0027t configuredas filterable, facetable, orsortable.\n"
}