{
  "Id": "494",
  "Title": "\u0022Optimizing Document Processing and Cache Management in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIt\u0027s used to controlprocessing over incoming documents already represented in the cache. When true(default), documents already in the cache are reprocessed when you rerun the indexer,assuming your skill update affects that doc.When false, existing documents are not reprocessed, effectively prioritizing new,incoming content over existing content. You should only set \u0022enableReprocessing\u0022 tofalse on a temporary basis. Having \u0022enableReprocessing\u0022 set to true most of the timeensures that all documents, both new and existing, are valid per the current skillsetdefinition.POST https://[search service name].search.windows.\r\nnet/indexers?api-version=2020-06-30-Preview     {         \u0022name\u0022: \u0022myIndexerName\u0022,         \u0022targetIndexName\u0022: \u0022myIndex\u0022,         \u0022dataSourceName\u0022: \u0022myDatasource\u0022,         \u0022skillsetName\u0022: \u0022mySkillset\u0022,         \u0022cache\u0022 : {             \u0022storageConnectionString\u0022 : \u0022\u003CYour storage account connection string\u003E\u0022,             \u0022enableReprocessing\u0022: true         },         \u0022fieldMappings\u0022 : [],         \u0022outputFieldMappings\u0022: [],         \u0022parameters\u0022: []     } Cache managementPrioritize new documentsModifying a skill and reprocessing of that skill typically go hand in hand.\r\nHowever, somechanges to a skill should not result in reprocessing (for example, deploying a customskill to a new location or with a new access key).\r\nMost likely, these are peripheralmodifications that have no genuine impact on the substance of the skill output itself.If you know that a change to the skill is indeed superficial, you should override skillevaluation by setting the \u0022disableCacheReprocessingChangeDetection\u0022 parameter totrue:1. Call Update Skillset and modify the skillset definition. 2. Append the \u0022disableCacheReprocessingChangeDetection=true\u0022 parameter on therequest.3. Submit the change.Setting this parameter ensures that only updates to the skillset definition are committedand the change isn\u0027t evaluated for effects on the existing cache. Use a preview APIversion, 2020-06-30-Preview or later.\nHTTPMost changes to a data source definition will invalidate the cache. However, forscenarios where you know that a change should not invalidate the cache - such aschanging a connection string or rotating the key on the storage account - append the\u0022ignoreResetRequirement\u0022 parameter on the data source update.\n"
}