{
  "Id": "1248",
  "Title": "\u0022Optimizing Search Results with Sorting, Scoring, and Highlighting Techniques\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUpper case strings are sorted ahead of lower case (APPLE, Apple, BANANA,Banana, apple, banana). You can assign a text normalizer to preprocess the textbefore sorting to change this behavior. Using the lowercase tokenizer on a fieldwill have no effect on sorting behavior because Cognitive Search sorts on a non-analyzed copy of the field.\r\nStrings that lead with diacritics appear last (Äpfel, Öffnen, Üben)Another approach that promotes order consistency is using a custom scoring profile.Scoring profiles give you more control over the ranking of items in search results, withthe ability to boost matches found in specific fields.\r\nThe extra scoring logic can helpoverride minor differences among replicas because the search scores for each documentare farther apart. We recommend the ranking algorithm for this approach.Hit highlighting refers to text formatting (such as bold or yellow highlights) applied tomatching terms in a result, making it easy to spot the match.\r\nHighlighting is useful forlonger content fields, such as a description field, where the match isn\u0027t immediatelyobvious.Notice that highlighting is applied to individual terms. There\u0027s no highlight capability forthe contents of an entire field. If you want to highlight over a phrase, you\u0027ll have toprovide the matching terms (or phrase) in a quote-enclosed query string. This techniqueis described further on in this section.Hit highlighting instructions are provided on the query request. Queries that triggerquery expansion in the engine, such as fuzzy and wildcard search, have limited supportfor hit highlighting.Fields must be Edm.String or Collection(Edm.String)Fields must be attributed at searchableBoost relevance using a scoring profileHit highlightingRequirements for hit highlightingSpecify highlighting in the requestTo return highlighted terms, include the \u0022highlight\u0022 parameter in the query request. Theparameter is set to a comma-delimited list of fields.\n"
}