{
  "Id": "1242",
  "Title": "\u0022Optimizing Azure Search Query Results: Best Practices and Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor the built-in hotels-sample index, it might be the \u0022select\u0022 fields in thefollowing example:HTTPResult compositionPOST /indexes/hotels-sample-index/docs/search?api-version=2020-06-30     {        \u0022search\u0022: \u0022sandy beaches\u0022,      \u0022select\u0022: \u0022HotelId, HotelName, Description, Rating, Address/City\u0022Occasionally, the substance and not the structure of results are unexpected.\r\nForexample, you might find that some results appear to be duplicates, or a result thatshould appear near the top is positioned lower in the results. When query outcomes areunexpected, you can try these query modifications to see if results improve:Change searchMode=any (default) to searchMode=all to require matches on allcriteria instead of any of the criteria.\r\nThis is especially true when boolean operatorsare included the query.Experiment with different lexical analyzers or custom analyzers to see if it changesthe query outcome. The default analyzer will break up hyphenated words andreduce words to root forms, which usually improves the robustness of a queryresponse.\r\nHowever, if you need to preserve hyphens, or if strings include specialcharacters, you might need to configure custom analyzers to ensure the indexcontains tokens in the right format. For more information, see Partial term searchand patterns with special characters (hyphens, wildcard, regex, patterns).\r\nThe count parameter returns the number of documents in the index that are considereda match for the query. To return the count, add $count=true to the query request.There\u0027s no maximum value imposed by the search service. Depending on your queryand the content of your documents, the count could be as high as every document inthe index.Count is accurate when the index is stable. If the system is actively adding, updating, ordeleting documents, the count will be approximate, excluding any documents that      \u0022count\u0022: true    }７ NoteFor images in results, such as a product photo or logo, store them outside of AzureCognitive Search, but add a field in your index to reference the image URL in thesearch document.\n"
}