{
  "Id": "230",
  "Title": "\u0022Optimizing Azure AI Search: Setup and Implementation Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWe recommend using the same tier you plan to use in production so thatyou can accurately test and optimize indexing speeds.API calls require the service URL and an access key. A search service is created with both,so if you added Azure AI Search to your subscription, follow these steps to get thenecessary information:1.\r\nSign in to the Azure portal, and in your search service Overview page, get theURL. An example endpoint might look like https://mydemo.search.windows.net.2. In Settings \u003E Keys, get an admin key for full rights on the service. There are twointerchangeable admin keys, provided for business continuity in case you need toroll one over.\r\nYou can use either the primary or secondary key on requests foradding, modifying, and deleting objects.1 - Create Azure AI Search serviceGet an admin api-key and URL for Azure AI Search1. Start Visual Studio and open OptimizeDataIndexing.sln.2. In Solution Explorer, open appsettings.json to provide connection information.\r\nJSONOnce you update appsettings.json, the sample program in OptimizeDataIndexing.slnshould be ready to build and run.This code is derived from the C# section of Quickstart: Full text search using the AzureSDKs. You can find more detailed information on the basics of working with the .NETSDK in that article.This simple C#/.\r\nNET console app performs the following tasks:Creates a new index based on the data structure of the C# Hotel class (which alsoreferences the Address class).Tests various batch sizes to determine the most efficient size2 - Set up your environment{  \u0022SearchServiceUri\u0022: \u0022https://{service-name}.search.windows. net\u0022,  \u0022SearchServiceAdminApiKey\u0022: \u0022\u0022,  \u0022SearchIndexName\u0022: \u0022optimize-indexing\u0022}3 - Explore the codeIndexes data asynchronouslyUsing multiple threads to increase indexing speedsUsing an exponential backoff retry strategy to retry failed itemsBefore running the program, take a minute to study the code and the index definitionsfor this sample. The relevant code is in several files:Hotel.cs and Address.\n"
}