{
  "Id": "1246",
  "Title": "\u0022Optimizing Search Results Ranking and Pagination in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis \u0022id\u0022 fieldshould have unique values, otherwise pagination may include duplicate results.HTTP4. Pagination ends when the query returns zero results.\r\nIn a full text search query, results can be ranked by:a search scorea semantic reranker scorea sort order on a \u0022sortable\u0022 fieldPOST /indexes/good-books/docs/search?api-version=2020-06-30    {        \u0022search\u0022: \u0022divine secrets\u0022,      \u0022top\u0022: 50,      \u0022orderby\u0022: \u0022id asc\u0022    }{    \u0022id\u0022: \u002250\u0022}POST /indexes/good-books/docs/search?\r\napi-version=2020-06-30    {        \u0022search\u0022: \u0022divine secrets\u0022,      \u0022top\u0022: 50,      \u0022orderby\u0022: \u0022id asc\u0022,      \u0022filter\u0022: \u0022id ge 50\u0022    }７ NoteThe \u0022filterable\u0022 and \u0022sortable\u0022 attributes can only be enabled when a field is firstadded to an index, they cannot be enabled on an existing field.\r\nOrdering resultsYou can also boost any matches found in specific fields by adding a scoring profile.For full text search queries, results are automatically ranked by a search score, calculatedbased on term frequency and proximity in a document (derived from TF-IDF), withhigher scores going to documents having more or stronger matches on a search term.The \u0022@search.score\u0022 range is either unbounded, or 0 up to (but not including) 1.00 onolder services.For either algorithm, a \u0022@search.score\u0022 equal to 1.00 indicates an unscored or unrankedresult set, where the 1. 0 score is uniform across all results. Unscored results occur whenthe query form is fuzzy search, wildcard or regex queries, or an empty search (search=*).If you need to impose a ranking structure over unscored results, consider an $orderbyexpression to achieve that objective.If you\u0027re using semantic search, the \u0022@search.rerankerScore\u0022 determines the sort orderof your results.The \u0022@search.rerankerScore\u0022 range is 1 to 4.00, where a higher score indicates astronger semantic match.If consistent ordering is an application requirement, you can define an $orderbyexpression on a field.\n"
}