{
  "Id": "1000",
  "Title": "\u0022Optimizing SharePoint Indexing with Azure Search: Best Practices and Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you require document-level permissions, you should consider security filters to trim results and automate copying the permissions at a file level to a field inthe index.(Known issue) Support for delegated permissions is currently broken. For now, use app-based permissions as a workaround. However,once user-delegated permissions do become operational, a new behavior enforces token expiration every 75 minutes, per the librariesused to implement delegated permissions. An expired token requires manual indexing using Run Indexer (preview). For this reason,you might want app-based permissions as a permanent solution.\r\nHere are the considerations when using this feature:If you need a SharePoint content indexing solution in a production environment, consider creating a custom connector withSharePoint Webhooks, calling Microsoft Graph API to export the data to an Azure Blob container, and then use the Azure Blob indexerfor incremental indexing.If your SharePoint configuration allows Microsoft 365 processes to update SharePoint file system metadata, be aware that theseupdates can trigger the SharePoint indexer, causing the indexer to ingest documents multiple times. Because the SharePoint indexer isa third-party connector to Azure, the indexer can\u0027t read the configuration or vary its behavior.\r\nIt responds to changes in new andchanged content, regardless of how those updates are made. For this reason, make sure that you test your setup and understand thedocument processing count prior to using the indexer and any AI enrichment.To set up the SharePoint indexer, use both the Azure portal and a preview REST API.This section provides the steps. You can also watch the following video.Enable a system-assigned managed identity to automatically detect the tenant the search service is provisioned in.Perform this step if the SharePoint site is in the same tenant as the search service. Skip this step if the SharePoint site is in a different tenant.The identity isn\u0027t used for indexing, just tenant detection. You can also skip this step if you want to put the tenant ID in the connectionstring.After selecting Save, you get an Object ID that has been assigned to your search service.Configure the SharePoint indexerhttps://www.youtube-nocookie.com/embed/QmG65Vgl0JIStep 1 (Optional): Enable system assigned managed identityThe SharePoint indexer supports both delegated and application permissions. Choose which permissions you want to use based on yourscenario.We recommend app-based permissions.\n"
}