{
  "Id": "806",
  "Title": "\u0022Optimizing Indexing Performance with Azure Search Scheduling\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen indexing can\u0027t complete within the typical 2-hour processing window, you canschedule the indexer to run on a 2-hour cadence to work through a large volume ofdata. As long as your data source supports change detection logic, indexers canautomatically pick up where they left off on each run.\r\nOnce an indexer is on a schedule, it remains on the schedule until you clear the intervalor start time, or set \u0022disabled\u0022 to true. Leaving the indexer on a schedule when there\u0027snothing to process won\u0027t impact system performance. Checking for changed content isa relatively fast operation.A valid indexer configured with a data source and index.Change detection in the data source.\r\nAzure Storage and SharePoint have built-inchange detection. Other data sources, such as Azure SQL and Azure Cosmos DBmust be enabled manually.A schedule is part of the indexer definition. If the \u0022schedule\u0022 property is omitted, theindexer will only run on demand. The property has two parts.\r\nPropertyDescriptionPrerequisitesSchedule definitionPropertyDescription\u0022interval\u0022(required) The amount of time between the start of two consecutive indexerexecutions. The smallest interval allowed is 5 minutes, and the longest is 1440minutes (24 hours). It must be formatted as an XSD \u0022dayTimeDuration\u0022 value (arestricted subset of an ISO 8601 duration value).\r\nThe pattern for this is: P(nD)(T(nH)(nM)).  Examples: PT15M for every 15 minutes, PT2H for every two hours.\u0022startTime\u0022(optional) Start time is specified in coordinated universal time (UTC). If omitted, thecurrent time is used. This time can be in the past, in which case the first execution isscheduled as if the indexer has been running continuously since the original starttime. The following example is a schedule that starts on January 1 at midnight and runs everytwo hours.JSONSchedules are specified in an indexer definition. To set up a schedule, you can use Azureportal, REST APIs, or an Azure SDK.1. Sign in to Azure portal and open the search service page.2. On the Overview page, select the Indexers tab.\n3. Select an indexer.4. Select Settings.5. Scroll down to Schedule, and then choose Hourly, Daily, or Custom to set aspecific date, time, or custom interval.\n"
}