{
  "Id": "950",
  "Title": "\u0022Optimizing Azure AI Search: Incremental Indexing and Custom Queries\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf957Z\u0022,                \u0022endTime\u0022:\u00222022-02-21T00:36:47.752Z\u0022,                \u0022errors\u0022:[],                \u0022itemsProcessed\u0022:1599501,                \u0022itemsFailed\u0022:0,                \u0022initialTrackingState\u0022:null,                \u0022finalTrackingState\u0022:null            },            ...\r\nearlier history items        ]    }Indexing new and changed documentsHTTPIf you\u0027re using a custom query to retrieve documents, make sure the query orders theresults by the _ts column. This enables periodic check-pointing that Azure AI Searchuses to provide incremental progress in the presence of failures.In some cases, even if your query contains an ORDER BY [collection alias].\r\n_ts clause,Azure AI Search may not infer that the query is ordered by the _ts. You can tell Azure AISearch that results are ordered by setting the assumeOrderByHighWaterMarkColumnconfiguration property.To specify this hint, create or update your indexer definition as follows:HTTPWhen rows are deleted from the collection, you normally want to delete those rowsfrom the search index as well.\r\nThe purpose of a data deletion detection policy is toefficiently identify deleted data items. Currently, the only supported policy is the SoftDelete policy (deletion is marked with a flag of some sort), which is specified in the datasource definition as follows:HTTP\u0022dataChangeDetectionPolicy\u0022: {    \u0022@odata.type\u0022: \u0022#Microsoft.Azure.\r\nSearch.HighWaterMarkChangeDetectionPolicy\u0022,\u0022  highWaterMarkColumnName\u0022: \u0022_ts\u0022},Incremental indexing and custom queries{    ... other indexer definition properties    \u0022parameters\u0022 : {        \u0022configuration\u0022 : { \u0022assumeOrderByHighWaterMarkColumn\u0022 : true } }} Indexing deleted documents\u0022dataDeletionDetectionPolicy\u0022\u0022: {    \u0022@odata. type\u0022 : \u0022#Microsoft.Azure.Search.SoftDeleteColumnDeletionDetectionPolicy\u0022,    \u0022softDeleteColumnName\u0022 : \u0022the property that specifies whether a document was deleted\u0022,If you\u0027re using a custom query, make sure that the property referenced bysoftDeleteColumnName is projected by the query.The following example creates a data source with a soft-deletion policy:HTTPFor data accessed through the SQL API protocol, you can use the .NET SDK to automatewith indexers. We recommend that you review the previous REST API sections to learnconcepts, workflow, and requirements. You can then refer to following .\n"
}