{
  "Id": "1085",
  "Title": "\u0022Optimizing Custom Skills for Azure Enrichment Pipelines: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStart by testing your custom skill with a REST API client to validate:The skill implements the custom skill interface for requests and responsesThe skill returns valid JSON with the application/JSON MIME typeReturns a valid HTTP status codeCreate a debug session to add your skill to the skillset and make sure it produces a validenrichment. While a debug session does not allow you to tune the performance of theskill, it enables you to ensure that the skill is configured with valid values and returns theexpected enriched objects.While skills can accept and return larger payloads, consider limiting the responseto 150 MB or less when returning JSON.\r\nCommon error messagesTesting custom skillsBest practicesConsider setting the batch size on the indexer and skill to ensure that each datasource batch generates a full payload for your skill.For long running tasks, set the timeout to a high enough value to ensure theindexer does not error out when processing documents concurrently.Optimize the indexer batch size, skill batch size, and skill degrees of parallelism togenerate the load pattern your skill expects, fewer large requests or many smallrequests.\r\nMonitor custom skills with detailed logs of failures as you can have scenarioswhere specific requests consistently fail as a result of the data variability.Congratulations! Your custom skill is now scaled right to maximize throughput on theindexer.Power Skills: a repository of custom skillsAdd a custom skill to an AI enrichment pipelineAdd a Azure Machine Learning skillUse debug sessions to test changesNext stepsExample: Create a custom skill using theBing Entity Search APIArticle•12/02/2022In this example, learn how to create a web API custom skill. This skill will acceptlocations, public figures, and organizations, and return descriptions for them. Theexample uses an Azure Function to wrap the Bing Entity Search API so that itimplements the custom skill interface.Read about custom skill interface article if you aren\u0027t familiar with the input/outputinterface that a custom skill should implement.Create a Bing Search v7 resource through the Azure Portal. A free tier is availableand sufficient for this example.Install Visual Studio 2019 or later, including the Azure development workload.Although this example uses an Azure Function to host a web API, it isn\u0027t required. Aslong as you meet the interface requirements for a cognitive skill, the approach you takeis immaterial.\n"
}