{
  "Id": "1236",
  "Title": "\u0022Optimizing Text Search with Normalizers in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfsearch=*\u0026facet=City,count:5 will return \u0022Las Vegas\u0022, \u0022LAS VEGAS\u0022 and \u0022las vegas\u0022as distinct values despite being the same city.） ImportantThis feature is in public preview under Supplemental Terms of Use. The previewREST API supports this feature.\r\nBenefits of normalizerssearch=usa\u0026$orderby=City will return the cities in lexicographical order: \u0022LasVegas\u0022, \u0022Seattle\u0022, \u0022las vegas\u0022, even if the intent is to order the same cities togetherirrespective of the case.A normalizer, which is invoked during indexing and query execution, adds lighttransformations that smooth out minor differences in text for filter, facet, and sortscenarios.\r\nIn the previous examples, the variants of \u0022Las Vegas\u0022 would be processedaccording to the normalizer you select (for example, all text is lower-cased) for moreuniform results.Normalizers are specified in an index definition, on a per-field basis, on text fields(Edm.String and Collection(Edm.\r\nString)) that have at least one of \u0022filterable\u0022,\u0022sortable\u0022, or \u0022facetable\u0022 properties set to true. Setting a normalizer is optional and it\u0027snull by default. We recommend evaluating predefined normalizers before configuring acustom one.\r\nNormalizers can only be specified when you add a new field to the index, so if possible,try to assess the normalization needs upfront and assign normalizers in the initial stagesof development when dropping and recreating indexes is routine.1. When creating a field definition in the index, set the \u0022normalizer\u0022 property to oneof the following values: a predefined normalizer such as \u0022lowercase\u0022, or a customnormalizer (defined in the same index schema). JSON2. Custom normalizers are defined in the \u0022normalizers\u0022 section of the index first, andthen assigned to the field definition as shown in the previous step. For moreinformation, see Create Index and also Add custom normalizers.How to specify a normalizer\u0022fields\u0022: [  {    \u0022name\u0022: \u0022Description\u0022,    \u0022type\u0022: \u0022Edm.\n"
}