{
  "Id": "810",
  "Title": "\u0022Optimizing Data Paths: Field Mapping Strategies for Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOptionally, you might want just a few nodes in thecomplex structure. To get individual nodes, you can flatten incoming data into astring collection (see outputFieldMappings for this workaround).Supported scenariosUse-caseDescriptionNamediscrepancySuppose your data source has a field named _city.\r\nGiven that Azure CognitiveSearch doesn\u0027t allow field names that start with an underscore, a field mapping letsyou effectively map \u0022_city\u0022 to \u0022city\u0022.If your indexing requirements include retrieving content from multiple data sources,where field names vary among the sources, you could use a field mapping to clarifythe path.\r\nTypediscrepancySupposed you want a source integer field to be of type Edm.String so that it\u0027ssearchable in the search index. Because the types are different, you\u0027ll need to definea field mapping in order for the data path to succeed. Note that Cognitive Searchhas a smaller set of supported data types than many data sources.\r\nIf you\u0027reimporting SQL data, a field mapping allows you to map the SQL data type you wantin a search index.One-to-many datapathsYou can populate multiple fields in the index with content from the same sourcefield. For example, you might want to apply different analyzers to each field tosupport different use cases in your client app.\r\nEncodinganddecodingYou can apply mapping functions to support Base64 encoding or decoding of dataduring indexing.Split stringsor recastarrays intocollectionsYou can apply mapping functions to split a string that includes a delimiter, or tosend a JSON array to a search field of type Collection(Edm.String).Field mappings are added to the \u0022fieldMappings\u0022 array of an indexer definition. A fieldmapping consists of three parts.JSONPropertyDescriptionsourceFieldNameRequired. Represents a field in your data source.Define a field mapping\u0022fieldMappings\u0022: [   {     \u0022sourceFieldName\u0022: \u0022_city\u0022,     \u0022targetFieldName\u0022: \u0022city\u0022,     \u0022mappingFunction\u0022: null   } ], PropertyDescriptiontargetFieldNameOptional.\n"
}