{
  "Id": "1037",
  "Title": "\u0022Path Syntax and Context in Azure Document Processing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe following list includes several common examples:Background conceptsPaths for different scenarios/document is the root node and indicates an entire blob in Azure Storage, or a rowin a SQL table./document/{key} is the syntax for a document or item in an Azure Cosmos DBcollection, where {key} is the actual key, such as /document/HotelId in theprevious example.\r\n/document/content specifies the \u0022content\u0022 property of a JSON blob./document/{field} is the syntax for an operation performed on a specific field,such as translating the /document/Description field, seen in the previous example./document/pages/* or /document/sentences/* become the context if you\u0027rebreaking a large document into smaller chunks for processing.\r\nIf \u0022context\u0022 is/document/pages/*, the skill executes once over each page in the document.Because there might be more than one page or sentence, you\u0027ll append /* tocatch them all./document/normalized_images/* is created during document cracking if thedocument contains images. All paths to images start with normalized_images.\r\nSince there are often multiple images embedded in a document, append /*.Examples in the remainder of this article are based on the \u0022content\u0022 field generatedautomatically by Azure Blob indexers as part of the document cracking phase. Whenreferring to documents from a Blob container, use a format such as\u0022/document/content\u0022, where the \u0022content\u0022 field is part of the \u0022document\u0022.\r\nIn Azure Blob Storage, suppose you have a variety of files containing references topeople\u0027s names that you want to extract using entity recognition. In the skill definitionbelow, \u0022/document/content\u0022 is the textual representation of the entire document, and\u0022people\u0022 is an extraction of full names for entities identified as persons. Because the default context is \u0022/document\u0022, the list of people can now be referenced as\u0022/document/people\u0022. In this specific case \u0022/document/people\u0022 is an annotation, whichcould now be mapped to a field in an index, or used in another skill in the same skillset.JSONExample 1: Simple annotation reference  {     \u0022@odata.\n"
}