{
  "Id": "1206",
  "Title": "\u0022Performance Comparison of Prefiltering and Postfiltering in Large Datasets\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPostfiltering is for customers who:value speed over selection (postfiltering can return fewer than k results)use filters that are not overly selectivehave indexes of sufficient size such that prefiltering performance isunacceptableGiven a dataset with 100,000 vectors at 1536 dimensions:When filtering more than 30% of the dataset, prefiltering and postfiltering werecomparable.When filtering less than 0.1% of the dataset, prefiltering was about 50% slowerthan postfiltering.\r\nGiven a dataset with 1 million vectors at 1536 dimensions:\u0022filterable\u0022: True,              \u0022retrievable\u0022: True, \u0022sortable\u0022: True, \u0022facetable\u0022: True, \u0022key\u0022: False}        ],        \u0022vectorSearch\u0022:        {            \u0022algorithmConfigurations\u0022: [                {\u0022name\u0022: \u0022defaulthnsw\u0022, \u0022kind\u0022: \u0022hnsw\u0022, \u0022hnswParameters\u0022: {\u0022metric\u0022: \u0022euclidean\u0022}}            ]        }    }TakeawaysDetailsWhen filtering more than 30% of the dataset, prefiltering was about 30% slower.\r\nWhen filtering less than 2% of the dataset, prefiltering was about seven timesslower.Given a dataset with 1 billion vectors at 96 dimensions:When filtering more than 5% of the dataset, prefiltering was about 50% slower.When filtering less than 10% of the dataset, prefiltering was about seven timesslower.\r\nThe following graph shows prefilter relative QPS, computed as prefilter QPS divided bypostfilter QPS.The vertical axis is QPS of prefiltering over QPS of postfiltering. For example, a value of0.0 means prefiltering is 100% slower, 0. 5 on the vertical axis means prefiltering is 50%slower, 1.0 means prefiltering and post filtering are equivalent.The horizontal axis represents the filtering rate, or the percentage of candidatedocuments after applying the filter. For example, 1.00% means that one percent of thesearch corpus was selected by the filter criteria.\n"
}