{
  "Id": "1473",
  "Title": "\u0022PowerShell Commands for Azure Search Service Administration and Configuration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNET, Python, JavaScript, and Java.First, connect to your Azure account.PowerShellSet up the headers used on each request in the current session. Provide the admin APIkey used for search service authentication.PowerShellTo return a list of all search indexes, set the endpoint to the indexes collection.PowerShellTo return a specific index definition, provide its name in the path. The encryptionKeyproperty is at the end.\r\nPowerShellTo return synonym maps, set the endpoint to the synonyms collection and then sendthe request.PowerShellRetrieve object propertiesConnect-AzAccount $headers = @{ \u0027api-key\u0027 = \u0027\u003CYOUR-ADMIN-API-KEY\u003E\u0027 \u0027Content-Type\u0027 = \u0027application/json\u0027 \u0027Accept\u0027 = \u0027application/json\u0027 } $uri= \u0027https://\u003CYOUR-SEARCH-SERVICE\u003E.search.windows.\r\nnet/indexes?api-version=2020-06-30\u0026$select=name\u0027 Invoke-RestMethod -Uri $uri -Headers $headers | ConvertTo-Json $uri= \u0027https://\u003CYOUR-SEARCH-SERVICE\u003E.search.windows.net/indexes/\u003CYOUR-INDEX-NAME\u003E?api-version=2020-06-30\u0027 Invoke-RestMethod -Uri $uri -Headers $headers | ConvertTo-Json The following example returns a specific synonym map definition, including theencryptionKey property at the end.\r\nPowerShellUse the same pattern to return the encryptionKey property for other top-level objectssuch as indexers, skillsets, data sources, and index aliases.We recommend that you enable logging on Azure Key Vault so that you can monitorkey usage. For more information about using Azure Key or configuring customer managedencryption:Quickstart: Set and retrieve a secret from Azure Key Vault using PowerShellConfigure customer-managed keys for data encryption in Azure Cognitive Search$uri= \u0027https://\u003CYOUR-SEARCH-SERVICE\u003E.search.windows.net/synonyms?api-version=2020-06-30\u0026$select=name\u0027 Invoke-RestMethod -Uri $uri -Headers $headers | ConvertTo-Json $uri= \u0027https://\u003CYOUR-SEARCH-SERVICE\u003E.\n"
}