{
  "Id": "1538",
  "Title": "\u0022Private Link Service Connection Provisioning and Status Definitions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDeleting: The private link service connection is in the process ofbeing deleted.Failed: The private link service connection has failed to beprovisioned or deleted.Succeeded: The private link service connection has finishedprovisioning and is ready for approval.Incomplete: Provisioning request for the private link serviceconnection resource has been accepted but the process ofcreation has not commenced yet.Canceled: Provisioning request for the private link serviceconnection resource has been canceledPrivateLinkServiceConnectionStatusDefines values for PrivateLinkServiceConnectionStatus.ProvisioningStateDefines values for ProvisioningState.\r\nPublicNetworkAccessDefines values for PublicNetworkAccess.QueryKeysCreateResponseContains response data for the create operation.QueryKeysListBySearchServiceNextResponseContains response data for the listBySearchServiceNextoperation.QueryKeysListBySearchServiceResponseContains response data for the listBySearchService operation.SearchEncryptionComplianceStatusDefines values for SearchEncryptionComplianceStatus.SearchEncryptionWithCmkDefines values for SearchEncryptionWithCmk.SearchSemanticSearchDefines values for SearchSemanticSearch.KnownSearchSemanticSearch can be used interchangeably withSearchSemanticSearch, this enum contains the known valuesthat the service supports.\r\nKnown values supported by theservicedisabled: Indicates that semantic search is disabled for thesearch service.free: Enables semantic search on a search service and indicatesthat it is to be used within the limits of the free tier. This wouldcap the volume of semantic search requests and is offered at noextra charge. This is the default for newly provisioned searchservices.standard: Enables semantic search on a search service as abillable feature, with higher throughput and volume of semanticsearch queries.SearchServiceStatusDefines values for SearchServiceStatus.ServicesCheckNameAvailabilityResponseContains response data for the checkNameAvailability operation. ServicesCreateOrUpdateResponseContains response data for the createOrUpdate operation.ServicesGetResponseContains response data for the get operation.ServicesListByResourceGroupNextResponseContains response data for the listByResourceGroupNextoperation.ServicesListByResourceGroupResponseContains response data for the listByResourceGroup operation.ServicesListBySubscriptionNextResponseContains response data for the listBySubscriptionNext operation.ServicesListBySubscriptionResponseContains response data for the listBySubscription operation.ServicesUpdateResponseContains response data for the update operation.\n"
}