{
  "Id": "1493",
  "Title": "\u0022Programmatic Access and Security in Azure AI Search Documentation\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you disablerole-based authentication, some built-in roles will still have access. See Microsoft EntraID authentication and role-based access control for Azure AI Search for details.The APIs documented in this section provide access to operations on search data, suchas index creation and population, document upload, and queries.\r\nWhen calling APIs,keep the following points in mind:Requests must be issued over HTTPS (on the default port 443).Permissions and access controlCalling the APIsRequest URIs must include the api-version. The value must be set to a supportedversion, formatted as shown in this example: GET https://[search servicename].search.windows.net/indexes?api-version=2020-06-30Request headers must include either an api-key or a bearer token forauthenticated connections. Optionally, you can set the Accept HTTP header. If thecontent type header isn\u0027t set, the default is assumed to be application/json.\r\nCreate a search service in Azure portalCommon HTTP request and response headersSee alsoManagement REST API reference (AzureAI Search)Article•11/14/2023The Management REST APIs of Azure AI Search (formerly known as Azure CognitiveSearch) provide programmatic access to administrative operations:\r\nCreate, update, and delete a search serviceRetrieve search service informationCreate, regenerate, or retrieve api-keys (query or admin keys)Add or remove replicas and partitions (adjust capacity)Configure a search service to use a private endpointEnable or disable Azure role-based access controlFor data plane tasks, such as creating and querying an index, use the Search ServiceREST APIs instead. To fully administer your service programmatically, you work with two APIs: theManagement REST API of Azure AI Search documented here, plus the common AzureResource Manager REST API. The Resource Manager API is used for general-purposeoperations that aren\u0027t service specific, such as querying subscription data, listing geo-locations, and so forth.REST API docs are now versioned. When you open an API reference page, select the APIversion from the dropdown filter.Administration rights are conveyed through built-in roles in Microsoft Entra ID:Owner or Contributor assignments are required for most tasks.\n"
}