{
  "Id": "525",
  "Title": "\u0022Projection Groups: Mutual Exclusivity and Relatedness in Knowledge Store\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfJSONProjection groups have the following key characteristics of mutual exclusivity andrelatedness.PrincipleDescriptionMutualexclusivityEach group is fully isolated from other groups to support different data shapingscenarios. For example, if you are testing different table structures andcombinations, you would put each set in a different projection group for ABtesting. Each group obtains data from the same source (enrichment tree) but is fullyisolated from the table-object-file combination of any peer projection groups.\r\n}     ] Projection groups\u0022knowledgeStore\u0022 : {     \u0022storageConnectionString\u0022: \u0022DefaultEndpointsProtocol=https;AccountName=\u003CAcct Name\u003E;AccountKey=\u003CAcct Key\u003E;\u0022,     \u0022projections\u0022: [         {             \u0022tables\u0022: [],             \u0022objects\u0022: [],             \u0022files\u0022: []         },          {             \u0022tables\u0022: [],             \u0022objects\u0022: [],             \u0022files\u0022: []         }     ] } PrincipleDescriptionRelatednessWithin a projection group, content in tables, objects, and files are related.\r\nKnowledge store uses generated keys as reference points to a common parentnode. For example, consider a scenario where you have a document containingimages and text. You could project the text to tables and the images to binary files,and both tables and objects will have a column/property containing the file URL. The source parameter is the third component of a projection definition. Becauseprojections store data from an AI enrichment pipeline, the source of a projection isalways the output of a skill. As such, output might be a single field (for example, a fieldof translated text), but often it\u0027s a reference to a data shape.Data shapes come from your skillset. Among all of the built-in skills provided inCognitive Search, there is a utility skill called the Shaper skill that\u0027s used to create datashapes. You can include Shaper skills (as many as you need) to support the projectionsin the knowledge store.\n"
}