{
  "Id": "325",
  "Title": "\u0022Provisioning and Using Azure AI Services with Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAI enrichment is backed by Azure AI services, including Language service and Azure AIVision for natural language and image processing. If your objective was to complete anactual prototype or project, you would at this point provision Azure AI services (in thesame region as Azure AI Search) so that you can attach it to indexing operations.\r\nSince this tutorial only uses 14 transactions, you can skip resource provisioning becauseAzure AI Search can connect to Azure AI services for 20 free transactions per indexerrun. For larger projects, plan on provisioning Azure AI services at the pay-as-you-go S0tier. For more information, see Attach Azure AI services.The third component is Azure AI Search, which you can create in the portal or find anexisting search service in your subscription.You can use the Free tier to complete this tutorial.To send requests to your Azure AI Search service, you\u0027ll need the service URL and anaccess key.1.\r\nSign in to the Azure portal, and in your search service Overview page, get thename of your search service. You can confirm your service name by reviewing theendpoint URL. If your endpoint URL is https://mydemo.search.windows.net, yourservice name would be mydemo.2. In Settings \u003E Keys, get an admin key for full rights on the service.\r\nThere are twointerchangeable admin keys, provided for business continuity in case you need toroll one over. You can use either the primary or secondary key on requests foradding, modifying, and deleting objects.DefaultEndpointsProtocol=https;AccountName=\u003Cstorageaccountname\u003E;AccountKey=\u003Cyour account key\u003E;EndpointSuffix=core.windows. netAzure AI servicesAzure AI SearchCopy an admin api-key and URL for Azure AI SearchAll requests require an api-key in the header of every request sent to your service. Avalid key establishes trust, on a per request basis, between the application sending therequest and the service that handles it.Use Visual Studio Code with the Python extension to create a new notebook.\n"
}