{
  "Id": "580",
  "Title": "\u0022Provisioning and Scaling Azure AI Search Services: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfEach tier has its own capacity and limits. Also the tier you select mayimpact the availability of certain features. See Feature availability by tier for guidance.Basic and Standard are the most common choices for production workloads, but initiallymany customers start with the Free service for evaluation purposes. Among the billabletiers, key differences are partition size and speed, and limits on the number of objectsyou can create.Remember, a pricing tier can\u0027t be changed once the service is created. If you need ahigher or lower tier, you\u0027ll have to re-create the service.\r\nAfter you\u0027ve provided the necessary inputs, go ahead and create the service.Choose a tierCreate your serviceYour service is deployed within minutes. You can monitor progress through Azurenotifications. Consider pinning the service to your dashboard for easy access in thefuture.Unless you\u0027re using the portal, programmatic access to your new service requires thatyou provide the URL endpoint and an authenticated connection.\r\nYou can use either orboth of these options:Configure authenticationConnect using key-based authenticationConnect using Azure roles1. When setting up a programmatic connection, you\u0027ll need the search serviceendpoint. On the Overview page, locate and copy the URL endpoint on the rightside of the page.\r\n2. To set authentication options, use the Keys page. Most quickstarts and tutorialsuse API keys for simplicity, but if you\u0027re setting up a service for productionworkloads, consider using Azure roles. You can copy keys from this page.An endpoint and key aren\u0027t needed for portal-based tasks. The portal is already linkedto your Azure AI Search resource with admin rights. For a portal walkthrough, start withQuickstart: Create an Azure AI Search index in the portal.Scale your serviceAfter a search service is provisioned, you can scale it to meet your needs. If you chosethe Standard tier, you can scale the service in two dimensions: replicas and partitions.\n"
}