{
  "Id": "1093",
  "Title": "\u0022Publishing Azure Entity Search Function: Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022e2\u0022,             \u0022data\u0022:             {                 \u0022name\u0022:  \u0022Microsoft\u0022             }         }     ] } Response{     \u0022values\u0022: [         {             \u0022recordId\u0022: \u0022e1\u0022,             \u0022data\u0022: {                 \u0022name\u0022: \u0022Pablo Picasso\u0022,                 \u0022description\u0022: \u0022Pablo Ruiz Picasso was a Spanish painter [.\r\n..]\u0022,                 \u0022source\u0022: \u0022Wikipedia\u0022,                 \u0022sourceUrl\u0022: \u0022http://en.wikipedia.org/wiki/Pablo_Picasso\u0022,                 \u0022licenseAttribution\u0022: \u0022Text under CC-BY-SA license\u0022,                 \u0022licenseUrl\u0022: \u0022http://creativecommons.org/licenses/by-sa/3.0/\u0022             },             \u0022errors\u0022: null,             \u0022warnings\u0022: null         },         \u0022...\u0022     ] } Publish the function to AzureWhen you\u0027re satisfied with the function behavior, you can publish it.1. In Solution Explorer, right-click the project and select Publish. Choose Create New\u003E Publish.\r\n2. If you haven\u0027t already connected Visual Studio to your Azure account, select Addan account....3. Follow the on-screen prompts. You\u0027re asked to specify a unique name for your appservice, the Azure subscription, the resource group, the hosting plan, and thestorage account you want to use. You can create a new resource group, a newhosting plan, and a storage account if you don\u0027t already have these.\r\nWhen finished,select Create4. After the deployment is complete, notice the Site URL. It is the address of yourfunction app in Azure.5. In the Azure portal, navigate to the Resource Group, and look for theEntitySearch Function you published. Under the Manage section, you should seeHost Keys. Select the Copy icon for the default host key. Now that you have the default host key, test your function as follows:HTTPJSONTest the function in AzurePOST https://[your-entity-search-app-name].azurewebsites.net/api/EntitySearch?code=[enter default host key here] Request Body{     \u0022values\u0022: [         {             \u0022recordId\u0022: \u0022e1\u0022,             \u0022data\u0022:             {                 \u0022name\u0022:  \u0022Pablo Picasso\u0022             }         },         {             \u0022recordId\u0022: \u0022e2\u0022, This example should produce the same result you saw previously when running thefunction in the local environment.\n"
}