{
  "Id": "375",
  "Title": "\u0022Python Code Samples for Azure AI Search: Features and Workflows\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOther samplesPython samples for Azure AI SearchArticle•11/15/2023Learn about the Python code samples that demonstrate the functionality and workflowof an Azure AI Search solution. These samples use the Azure AI Search client library forthe Azure SDK for Python, which you can explore through the following links.TargetLinkPackagedownloadpypi.\r\norg/project/azure-search-documents/API referenceazure-search-documentsAPI test casesgithub.com/Azure/azure-sdk-for-python/tree/main/sdk/search/azure-search-documents/testsSource codegithub.com/Azure/azure-sdk-for-python/tree/main/sdk/search/azure-search-documentsCode samples from the Azure SDK development team demonstrate API usage.\r\nYou canfind these samples in azure-sdk-for-python/tree/main/sdk/search/azure-search-documents/samples on GitHub.SamplesDescriptionAuthenticateDemonstrates how to configure a client and authenticate to theservice.Index Create-Read-Update-Delete operationsDemonstrates how to create, update, get, list, and delete searchindexes.\r\nIndexer Create-Read-Update-Delete operationsDemonstrates how to create, update, get, list, reset, and deleteindexers.Search indexer data sourcesDemonstrates how to create, update, get, list, and delete indexerdata sources, required for indexer-based indexing of supportedAzure data sources.SynonymsDemonstrates how to create, update, get, list, and delete synonymmaps. Load documentsDemonstrates how to upload or merge documents into an index ina data import operation.SDK samplesSamplesDescriptionSimple queryDemonstrates how to set up a basic query.Filter queryDemonstrates setting up a filter expression.Facet queryDemonstrates working with facets.Vector searchDemonstrates how to get embeddings from a description field andthen send vector queries against the data.Code samples from the Azure AI Search team demonstrate features and workflows.Many of these samples are referenced in tutorials, quickstarts, and how-to articles. Youcan find these samples in Azure-Samples/azure-search-python-samples on GitHub.\n"
}