{
  "Id": "1152",
  "Title": "\u0022Querying Vector Fields in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo query a vector field, the query itself must be a vector. To convert a text query stringprovided by a user into a vector representation, your application must call anembedding library or API endpoint that provides this capability. Use the sameembedding that you used to generate embeddings in the source documents.You can find multiple instances of query string conversion in the azure-search-vectorrepository for each of the Azure SDKs.Here\u0027s a REST API example of a query string submitted to a deployment of an AzureOpenAI model:HTTPCheck your index for vector fieldsConvert query input into a vectorPOST https://{{openai-service-name}}.openai.azure.\r\ncom/openai/deployments/{{openai-deployment-name}}/embeddings?api-version={{openai-api-version}}Content-Type: application/jsonapi-key: {{admin-api-key}}{    \u0022input\u0022: \u0022what azure services support full text search\u0022}The expected response is 202 for a successful call to the deployed model. The\u0022embedding\u0022 field in the body of the response is the vector representation of the querystring \u0022input\u0022.\r\nFor testing purposes, you would copy the value of the \u0022embedding\u0022 arrayinto \u0022vector.value\u0022 in a query request, using syntax shown in the next several sections.The actual response for this POST call to the deployment model includes 1536embeddings, trimmed here to just the first few vectors for readability.\r\nJSONYour application code is responsible for handling this response and providing theembedding in the query request.This section shows you the basic structure of a vector query. You can use the Azureportal, REST APIs, or the Azure SDKs to query vectors.REST API version 2023-11-01 is the stable API version for Search POST. This APIsupports:vectorQueries is the construct for vector search.kind set to vector specifies the query string is a vector.{    \u0022object\u0022: \u0022list\u0022,    \u0022data\u0022: [        {            \u0022object\u0022: \u0022embedding\u0022,            \u0022index\u0022: 0,            \u0022embedding\u0022: [                -0.009171937,                0.018715322,                .\n"
}