{
  "Id": "1649",
  "Title": "\u0022Query Limits and Syntax in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor example, motel\u002B(wifi|luxury) will search for documentscontaining the \u0022motel\u0022 term and either \u0022wifi\u0022 or \u0022luxury\u0022 (or both).If your application generates search queries programmatically, we recommenddesigning it in such a way that it doesn\u0027t generate queries of unbounded size.For GET, the length of the URL can\u0027t exceed 8 KB.For POST (and any other request), where the body of the request includes searchand other parameters such as filter and orderby, the maximum size is 16 MB.Additional limits include:The maximum length of the search clause is 100,000 characters.\r\nThe maximum number of clauses in search (expressions separated by AND orOR) is 1024.The maximum search term size is 1000 characters for prefix search.There\u0027s also a limit of approximately 32 KB on the size of any individual term ina query.For more information on query limits, see API request limits.If you\u0027ll be constructing queries programmatically, review Full text search in AzureCognitive Search to understand the stages of query processing and the implications oftext analysis.\r\nYou can also review the following articles to learn more about query construction:Query examples for simple searchQuery examples for full Lucene searchSearch Documents REST APILucene query syntaxFilter and Select (OData) expression syntaxPrecedence (grouping)Query size limitsNext stepsLucene query syntax in Azure CognitiveSearchArticle•08/30/2023When creating queries in Azure Cognitive Search, you can opt for the full Lucene QueryParser syntax for specialized query forms: wildcard, fuzzy search, proximity search,regular expressions.\r\nMuch of the Lucene Query Parser syntax is implemented intact inAzure Cognitive Search, except for *range searches, which are constructed through$filter expressions. To use full Lucene syntax, set the queryType to \u0022full\u0022 and pass in a query expressionpatterned for wildcard, fuzzy search, or one of the other query forms supported by thefull syntax. In REST, query expressions are provided in the search parameter of a SearchDocuments (REST API) request.The following example is a search request constructed using the full syntax. Thisparticular example shows in-field search and term boosting.\n"
}