{
  "Id": "70",
  "Title": "\u0022Quickstart Guide for Azure Search Service: Creating and Loading Indexes\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can use a free service forthis quickstart.Many customers start with the free service. The free tier is limited to three indexes, threedata sources, and three indexers. Make sure you have room for extra items before youbegin. This quickstart creates one of each object.Check the Overview \u003E Usage tab for the service to see how many indexes, indexers, anddata sources you already have.\r\n７ NoteThe Import data wizard includes options for OCR, text translation, and other AIenrichments that aren\u0027t covered in this quickstart. For a similar walkthrough thatfocuses on AI enrichment, see Quickstart: Create a skillset in the Azure portal.PrerequisitesCheck for space1.\r\nSign in to the Azure portal with your Azure account, and go to your Azure AISearch service.2. On the Overview page, select Import data to start the wizard.In this section, create and load an index in four steps.The wizard creates a data source connection to sample data hosted by Microsoft onAzure Cosmos DB.\r\nThis sample data is retrieved accessed over an internal connection.You don\u0027t need your own Azure Cosmos DB account or source files to run this quickstart.1. On Connect to your data, expand the Data Source dropdown list and selectSamples.2. In the list of built-in samples, select hotels-sample.Start the wizardCreate and load an indexConnect to a data source3.\r\nSelect Next: Add cognitive skills (Optional) to continue.The Import data wizard supports the creation of a skillset and AI-enrichment intoindexing.1. For this quickstart, ignore the AI enrichment configuration options on the Addcognitive skills tab.2. Select Skip to: Customize target index to continue. The wizard infers a schema for the built-in hotels-sample index. Follow these steps toconfigure the index:Skip configuration for cognitive skills TipInterested in AI enrichment? Try this Quickstart: Create a skillset in the AzureportalConfigure the index1. Accept the system-generated values for the Index name (hotels-sample-index) andKey field (HotelId).2.\n"
}