{
  "Id": "1393",
  "Title": "\u0022Recreating Azure Cognitive Search Service in a New Region\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCurrently,there is no built-in mechanism or tooling to help with that task, but this article can helpyou understand the manual steps for recreating indexes and other objects on a newsearch service in a different region.Ensure that the services and features that your account uses are supported in thetarget region.\r\nFor preview features, ensure that your subscription is approved for the targetregion.1. Identify dependencies and related services to understand the full impact ofrelocating a service, in case you need to move more than just Azure CognitiveSearch.Azure Storage is used for logging, creating a knowledge store, and is a commonlyused external data source for AI enrichment and indexing.\r\nAzure AI services is adependency in AI enrichment. Both Azure AI services and your search service arerequired to be in the same region if you are using AI enrichment.2. Create an inventory of all objects on the service so that you know what to move:indexes, synonym maps, indexers, data sources, skillsets. If you enabled logging,create and archive any reports you might need for a historical record.\r\n７ NoteIn the Azure portal, all services have an Export template command. In the case ofAzure Cognitive Search, this command produces a basic definition of a service(name, location, tier, replica, and partition count), but does not recognize thecontent of your service, nor does it carry over keys, roles, or logs. Although thecommand exists, we don\u0027t recommend using it for moving a search service.PrerequisitesPrepare and move3. Check pricing and availability in the new region to ensure availability of AzureCognitive Search plus any related services in the new region. The majority offeatures are available in all regions, but some preview features have restrictedavailability.4. Create a service in the new region and republish from source code any existingindexes, synonym maps, indexers, data sources, and skillsets. Remember thatservice names must be unique so you cannot reuse the existing name.\n"
}