{
  "Id": "552",
  "Title": "\u0022Regulatory Compliance Controls for Azure AI Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNow that you\u0027re familiar with indexer data access options for solutions deployed in anAzure virtual network, review either of the following how-to articles as your next step:How to make indexer connections to a private endpointHow to make indexer connections through an IP firewallAccess to a network-protected storage accountSame-region servicesServices in different regionsNext stepsAzure Policy Regulatory Compliancecontrols for Azure AI SearchArticle•12/04/2023If you are using Azure Policy to enforce the recommendations in Microsoft cloudsecurity benchmark, then you probably already know that you can create policies foridentifying and fixing non-compliant services.\r\nThese policies might be custom, or theymight be based on built-in definitions that provide compliance criteria and appropriatesolutions for well-understood best practices.For Azure AI Search, there is currently one built-definition, listed below, that you can usein a policy assignment. The built-in is for logging and monitoring. By using this built-indefinition in a policy that you create, the system will scan for search services that do nothave resource logging, and then enable it accordingly.Regulatory Compliance in Azure Policy provides Microsoft-created and managedinitiative definitions, known as built-ins, for the compliance domains and securitycontrols related to different compliance standards.\r\nThis page lists the compliancedomains and security controls for Azure AI Search. You can assign the built-ins for asecurity control individually to help make your Azure resources compliant with thespecific standard.The title of each built-in policy definition links to the policy definition in the Azureportal. Use the link in the Policy Version column to view the source on the Azure PolicyGitHub repo.） ImportantEach control is associated with one or more Azure Policy definitions. These policiesmight help you assess compliance with the control. However, there often isn\u0027t aone-to-one or complete match between a control and one or more policies. Assuch, Compliant in Azure Policy refers only to the policies themselves. This doesn\u0027tensure that you\u0027re fully compliant with all requirements of a control. In addition, thecompliance standard includes controls that aren\u0027t addressed by any Azure Policydefinitions at this time. Therefore, compliance in Azure Policy is only a partial viewof your overall compliance status. The associations between controls and AzurePolicy Regulatory Compliance definitions for these compliance standards canchange over time.\n"
}