{
  "Id": "801",
  "Title": "\u0022Resetting Indexers and Skills in Azure Search: A How-To Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor more information about deletingdocuments, see Add, Update or Delete Documents.Once you reset an indexer, you can\u0027t undo the action.1. Sign in to Azure portal and open the search service page.2. On the Overview page, select the Indexers tab.3. Select an indexer.4. Select the Reset command, and then select Yes to confirm the action.\r\n5. Refresh the page to show the status. You can select the item to view its details.6. Select Run to start indexer processing, or wait for the next scheduledexecution.For indexers that have skillsets, you can reset individual skills to force processing of justthat skill and any downstream skills that depend on its output.\r\nThe enrichment cache, ifyou enabled it, is also refreshed.Azure portalHow to reset skills (preview)Reset Skills is currently REST-only, available through api-version=2020-06-30-Preview orlater.HTTPYou can specify individual skills, as indicated in the example above, but if any of thoseskills require output from unlisted skills (#2 through #4), unlisted skills will run unlessthe cache can provide the necessary information.\r\nIn order for this to be true, cachedenrichments for skills #2 through #4 must not have dependency on #1 (listed for reset).If no skills are specified, the entire skillset is executed and if caching is enabled, thecache is also refreshed. Remember to follow up with Run Indexer to invoke actual processing.The Reset Documents API accepts a list of document keys so that you can refreshspecific documents. If specified, the reset parameters become the sole determinant ofwhat gets processed, regardless of other changes in the underlying data. For example, if20 blobs were added or updated since the last indexer run, but you only reset onedocument, only that document is processed.On a per-document basis, all fields in that search document are refreshed with valuesfrom the data source. You can\u0027t pick and choose which fields to refresh.\n"
}