{
  "Id": "496",
  "Title": "\u0022Resetting and Reprocessing Documents in Azure Search Indexers\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfResetting an indexer will result in all documents in the search corpus being reprocessed.In scenarios where only a few documents need to be reprocessed, use Reset Documents(preview) to force reprocessing of specific documents. When a document is reset, theindexer invalidates the cache for that document, which is then reprocessed by reading itfrom the data source.\r\nFor more information, see Run or reset indexers, skills, anddocuments.To reset specific documents, the request provides a list of document keys as read fromthe search index. If the key is mapped to a field in the external data source, the valuethat you provide should be the one used in the search index.\r\nDepending on how you call the API, the request will either append, overwrite, or queueup the key list:Calling the API multiple times with different keys appends the new keys to the listof document keys reset.Calling the API with the \u0022overwrite\u0022 query string parameter set to true willoverwrite the current list of document keys to be reset with the request\u0027s payload.Calling the API only results in the document keys being added to the queue ofwork the indexer performs. When the indexer is next invoked, either as scheduledor on demand, it will prioritize processing the reset document keys before anyother changes from the data source. The following example illustrates a reset document request:HTTPRe-cache specific documentsPOST https://[search service name].search.windows.net/indexers/[indexer name]/resetdocs?api-version=2020-06-30-Preview     { Once you enable a cache, the indexer evaluates changes in your pipeline composition todetermine which content can be reused and which needs reprocessing. This sectionenumerates changes that invalidate the cache outright, followed by changes that triggerincremental processing.An invalidating change is one where the entire cache is no longer valid. An example ofan invalidating change is one where your data source is updated.\n"
}