{
  "Id": "800",
  "Title": "\u0022Reset and Run Operations in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfReset APIs are available at decreasing levels in the object hierarchy:Reset Indexers clears the high-water mark and performs a full reindex of alldocumentsReset Documents (preview) reindexes a specific document or list of documentsReset Skills (preview) invokes skill processing for a specific skillAfter reset, follow with a Run command to reprocess new and existing documents.\r\nOrphaned search documents having no counterpart in the data source can\u0027t be removedthrough reset/run. If you need to delete documents, see Add, Update or DeleteDocuments instead.Reset clears the high-water mark. All documents in the search index will be flagged forfull overwrite, without inline updates or merging into existing content. For indexers witha skillset and enrichment caching, resetting the index will also implicitly reset the skillset.The actual work occurs when you follow a reset with a Run command:All new documents found the underlying source will be added to the search index.\r\nAll documents that exist in both the data source and search index will beoverwritten in the search index.Any enriched content created from skillsets will be rebuilt. The enrichment cache, ifone is enabled, is refreshed.As previously noted, reset is a passive operation: you must follow up a Run request torebuild the index.\r\nResetting indexersHow to reset and run indexersReset/run operations apply to a search index or a knowledge store, to specificdocuments or projections, and to cached enrichments if a reset explicitly or implicitlyincludes skills.Reset also applies to create and update operations. It will not trigger deletion or cleanup of orphaned documents in the search index. For more information about deletingdocuments, see Add, Update or Delete Documents.Once you reset an indexer, you can\u0027t undo the action.1. Sign in to Azure portal and open the search service page.2. On the Overview page, select the Indexers tab.3. Select an indexer.4. Select the Reset command, and then select Yes to confirm the action.\n"
}