{
  "Id": "1539",
  "Title": "\u0022Response Data and Known Values for Azure Search Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfServicesCreateOrUpdateResponseContains response data for the createOrUpdate operation.ServicesGetResponseContains response data for the get operation.ServicesListByResourceGroupNextResponseContains response data for the listByResourceGroupNextoperation.ServicesListByResourceGroupResponseContains response data for the listByResourceGroup operation.ServicesListBySubscriptionNextResponseContains response data for the listBySubscriptionNext operation.ServicesListBySubscriptionResponseContains response data for the listBySubscription operation.ServicesUpdateResponseContains response data for the update operation.\r\nSharedPrivateLinkResourceAsyncOperationResultDefines values forSharedPrivateLinkResourceAsyncOperationResult.KnownSharedPrivateLinkResourceAsyncOperationResult can beused interchangeably withSharedPrivateLinkResourceAsyncOperationResult, this enumcontains the known values that the service supports.Known values supported by theserviceRunningSucceededFailedSharedPrivateLinkResourceProvisioningStateDefines values for SharedPrivateLinkResourceProvisioningState.SharedPrivateLinkResourceStatusDefines values for SharedPrivateLinkResourceStatus.SharedPrivateLinkResourcesCreateOrUpdateResponseContains response data for the createOrUpdate operation.\r\nSharedPrivateLinkResourcesGetResponseContains response data for the get operation.SharedPrivateLinkResourcesListByServiceNextResponseContains response data for the listByServiceNext operation.SharedPrivateLinkResourcesListByServiceResponseContains response data for the listByService operation.SkuNameDefines values for SkuName.UnavailableNameReasonDefines values for UnavailableNameReason.\r\nKnownUnavailableNameReason can be used interchangeablywith UnavailableNameReason, this enum contains the knownvalues that the service supports.Known values supported by theserviceInvalid: The search service name does not match namingrequirements.AlreadyExists: The search service name is already assigned to adifferent search service. UsageBySubscriptionSkuResponseContains response data for the usageBySubscriptionSkuoperation.UsagesListBySubscriptionNextResponseContains response data for the listBySubscriptionNext operation.UsagesListBySubscriptionResponseContains response data for the listBySubscription operation.KnownPrivateLinkServiceConnectionProvisioningStateKnown values of PrivateLinkServiceConnectionProvisioningStatethat the service accepts.KnownSearchSemanticSearchKnown values of SearchSemanticSearch that the service accepts.KnownSharedPrivateLinkResourceAsyncOperationResultKnown values ofSharedPrivateLinkResourceAsyncOperationResult that the serviceaccepts.\n"
}