{
  "Id": "1331",
  "Title": "\u0022Retrieving and Monitoring Azure AI Search Service Data Using REST APIs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThisinformation is retrieved from your search service, which you can obtainprogrammatically:Service Statistics (REST)Index Statistics (REST)Document Counts (REST)Indexer Status (REST)For REST calls, use an admin API key and Postman or another REST client to query yoursearch service.In Azure AI Search, activity logs reflect control plane activity, such as service creationand configuration, or API key usage or management.\r\n７ NoteBecause portal pages are refreshed every few minutes, the numbers reported areapproximate, intended to give you a general sense of how well your system ishandling requests. Actual metrics, such as queries per second (QPS) may be higheror lower than the number shown on the page. If precision is a requirement,consider using APIs.\r\nGet system data from REST APIsMonitor activity logsActivity logs are collected free of charge, with no configuration required. Data retentionis 90 days, but you can configure durable storage for longer retention.1. In the Azure portal, find your search service. From the menu on the left, selectActivity logs to view the logs for your search service.\r\nSee Azure Monitor activitylog for general guidance on working with activity logs.2. Review the entries. Entries often include Get Admin Key, one entry for every callthat provided an admin API key on the request. There are no details about the callitself, just a notification that the admin key was used.3. For other entires, see the Management REST API reference for control planeactivity that might appear in the log.The following screenshot shows the activity log signals that can be configured in analert. These signals represent the entries you might see in the activity log.In Azure AI Search, platform metrics measure query performance, indexing volume, andskillset invocation.Metrics are collected free of charge, with no configuration required. Platform metrics arestored for 93 days. However, in the portal you can only query a maximum of 30 days\u0027worth of platform metrics data on any single chart.Monitor metricsIn the Azure portal, find your search service.\n"
}