{
  "Id": "1472",
  "Title": "\u0022Retrieving EncryptionKey Property from Azure Key Vault Objects: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you need to determine whether an object is encrypted,or what key name or version was used in Azure Key Vault, use the REST API or an AzureSDK to retrieve the encryptionKey property from the object definition in your searchservice.Objects that aren\u0027t encrypted with a customer-managed key will have an emptyencryptionKey property. Otherwise, you might see a definition similar to the followingexample.JSONThe encryptionKey construct is the same for all encrypted objects. It\u0027s a first-levelproperty, on the same level as the object name and description.Before you can retrieve object definitions from a search service, you\u0027ll need to providean admin API key.\r\nAdmin API keys are required on requests that query for objectdefinitions and metadata. The easiest way to get the admin API key is through theportal.1. Sign in to the Azure portal and open the search service overview page.2. On the left side, select Keys and copy an admin API.For the remaining steps, switch to PowerShell and the REST API. The portal doesn\u0027t showencryption key information for any object.\u0022encryptionKey\u0022: { \u0022keyVaultUri\u0022: \u0022https://demokeyvault.vault.azure.\r\nnet\u0022, \u0022keyVaultKeyName\u0022: \u0022myEncryptionKey\u0022, \u0022keyVaultKeyVersion\u0022: \u0022eaab6a663d59439ebb95ce2fe7d5f660\u0022, \u0022accessCredentials\u0022: {     \u0022applicationId\u0022: \u002200000000-0000-0000-0000-000000000000\u0022,     \u0022applicationSecret\u0022: \u0022myApplicationSecret\u0022     } } Get the admin API keyUse PowerShell and REST to run the following commands to set up the variables and getobject definitions.Alternatively, you can also use the Azure SDKs for . NET, Python, JavaScript, and Java.First, connect to your Azure account.PowerShellSet up the headers used on each request in the current session. Provide the admin APIkey used for search service authentication.PowerShellTo return a list of all search indexes, set the endpoint to the indexes collection.PowerShellTo return a specific index definition, provide its name in the path. The encryptionKeyproperty is at the end.\n"
}