{
  "Id": "377",
  "Title": "\u0022Revolutionizing Enterprise Data with Azure AI Search and Python\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor more vector search Python demos, seecognitive-search-vector-pr/demo-python.ChatGPT \u002B Enterprise datawith Azure OpenAI andPython code showing how to use Azure AI Search with the largelanguage models in Azure OpenAI. For background, see this TechDoc samplesDemosRepositoryDescriptionCognitive SearchCommunity blog post: Revolutionize your Enterprise Data withChatGPT.\r\n TipTry the Samples browser to search for Microsoft code samples in GitHub, filteredby product, service, and language.REST samples for Azure AI SearchArticle•11/15/2023Learn about the REST API samples that demonstrate the functionality and workflow ofan Azure AI Search solution. These samples use the Search REST APIs.REST is the definitive programming interface for Azure AI Search, and all operations thatcan be invoked programmatically are available first in REST, and then in SDKs. For thisreason, most examples in the documentation leverage the REST APIs to demonstrate orexplain important concepts.\r\nREST samples are usually developed and tested on Postman, but you can use any clientthat supports HTTP calls, including the Postman app. This quickstart explains how toformulate the HTTP request from end-to-end.Code samples from the Azure AI Search team demonstrate features and workflows.\r\nMany of these samples are referenced in tutorials, quickstarts, and how-to articles. Youcan find these samples in Azure-Samples/azure-search-postman-samples on GitHub.SamplesArticleQuickstartSource code for Quickstart: Create a search index using REST APIs. This articlecovers the basic workflow for creating, loading, and querying a search indexusing sample data. TutorialSource code for Tutorial: Use REST and AI to generate searchable contentfrom Azure blobs. This article shows you how to create a skillset that iteratesover Azure blobs to extract information and infer structure.Debug-sessionsSource code for Tutorial: Diagnose, repair, and commit changes to yourskillset. This article shows you how to use a skillset debug session in the Azureportal. REST is used to create the objects used during debug.custom-analyzersSource code for Tutorial: Create a custom analyzer for phone numbers. Thisarticle explains how to use analyzers to preserve patterns and specialcharacters in searchable content.\n"
}