{
  "Id": "628",
  "Title": "\u0022Scalable Multitenant Architecture with Azure AI Search: S3 HD Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfS3 HD allows for the many small indexes to be packed under the management of asingle search service by trading the ability to scale out indexes using partitions for theService and index limits in Azure AI SearchS3 High Densityability to host more indexes in a single service.\r\nAn S3 service is designed to host a fixed number of indexes (maximum 200) and alloweach index to scale in size horizontally as new partitions are added to the service.Adding partitions to S3 HD services increases the maximum number of indexes that theservice can host. The ideal maximum size for an individual S3HD index is around 50 - 80GB, although there\u0027s no hard size limit on each index imposed by the system.Multitenant applications must effectively distribute resources among the tenants whilepreserving some level of privacy between the various tenants.\r\nThere are a fewconsiderations when designing the architecture for such an application:Tenant isolation: Application developers need to take appropriate measures toensure that no tenants have unauthorized or unwanted access to the data of othertenants. Beyond the perspective of data privacy, tenant isolation strategies requireeffective management of shared resources and protection from noisy neighbors.Cloud resource cost: As with any other application, software solutions must remaincost competitive as a component of a multitenant application.Ease of Operations: When developing a multitenant architecture, the impact on theapplication\u0027s operations and complexity is an important consideration. Azure AISearch has a 99.9% SLA.Global footprint: Multitenant applications may need to effectively serve tenants,which are distributed across the globe.Scalability: Application developers need to consider how they reconcile betweenmaintaining a sufficiently low level of application complexity and designing theapplication to scale with number of tenants and the size of tenants\u0027 data andworkload.Azure AI Search offers a few boundaries that can be used to isolate tenants’ data andworkload.In the case of a multitenant scenario, the application developer consumes one or moresearch services and divides their tenants among services, indexes, or both.\n"
}