{
  "Id": "1295",
  "Title": "\u0022Scoring Profiles and Functions in Azure Search: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022, Property referenceAttributeDescriptionnameRequired. This is the name of the scoring profile. It follows thesame naming conventions of a field. It must start with a letter,can\u0027t contain dots, colons or @ symbols, and can\u0027t start with thephrase azureSearch (case-sensitive).textContains the weights property.weightsOptional.\r\nName-value pairs that specify a searchable field and apositive integer or floating-point number by which to boost afield\u0027s score. The positive integer or number becomes amultiplier for the original field score generated by the rankingalgorithm. For example, if a field score is 2 and the weight valueis 3, the boosted score for the field becomes 6.\r\nIndividual fieldscores are then aggregated to create a document field score,which is then used to rank the document in the result set.functionsOptional. A scoring function can only be applied to fields thatare filterable.functions \u003E typeRequired for scoring functions. Indicates the type of function touse.\r\nValid values include magnitude, freshness, distance, and tag.You can include more than one function in each scoring profile.The function name must be lower case.functions \u003E boostRequired for scoring functions. A positive number used asmultiplier for raw score. It can\u0027t be equal to 1.functions \u003E fieldnameRequired for scoring functions.\r\nA scoring function can only beapplied to fields that are part of the field collection of the index,and that are filterable. In addition, each function type introducesadditional restrictions (freshness is used with datetime fields,magnitude with integer or double fields, and distance withlocation fields). You can only specify a single field per functiondefinition. For example, to use magnitude twice in the sameprofile, you would need to include two definitions magnitude,one for each field.functions \u003E interpolationRequired for scoring functions. Defines the slope for which thescore boosting increases from the start of the range to the endof the range. Valid values include Linear (default), Constant,Quadratic, and Logarithmic.\n"
}