{
  "Id": "1296",
  "Title": "\u0022Scoring Functions and Boosting in Azure Search: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor example, to use magnitude twice in the sameprofile, you would need to include two definitions magnitude,one for each field.functions \u003E interpolationRequired for scoring functions. Defines the slope for which thescore boosting increases from the start of the range to the endof the range. Valid values include Linear (default), Constant,Quadratic, and Logarithmic.\r\nSee Set interpolations for details.functions \u003E magnitudeThe magnitude scoring function is used to alter rankings basedon the range of values for a numeric field. Some of the mostcommon usage examples of this are:\u0022Star ratings:\u0022 Alter the scoring based on the value within the\u0022Star Rating\u0022 field.\r\nWhen two items are relevant, the item withthe higher rating will be displayed first.AttributeDescription\u0022Margin:\u0022 When two documents are relevant, a retailer may wishto boost documents that have higher margins first.\u0022Click counts:\u0022 For applications that track click through actions toproducts or pages, you could use magnitude to boost items thattend to get the most traffic.\r\n\u0022Download counts:\u0022 For applications that track downloads, themagnitude function lets you boost items that have the mostdownloads.functions \u003E magnitude \u003EboostingRangeStartSets the start value of the range over which magnitude is scored.The value must be an integer or floating-point number. For starratings of 1 through 4, this would be 1.\r\nFor margins over 50%,this would be 50.functions \u003E magnitude \u003EboostingRangeEndSets the end value of the range over which magnitude is scored.The value must be an integer or floating-point number. For starratings of 1 through 4, this would be 4.functions \u003E magnitude \u003EconstantBoostBeyondRangeValid values are true or false (default). When set to true, the fullboost will continue to apply to documents that have a value forthe target field that’s higher than the upper end of the range. Iffalse, the boost of this function won’t be applied to documentshaving a value for the target field that falls outside of the range.functions \u003E freshnessThe freshness scoring function is used to alter ranking scores foritems based on values in DateTimeOffset fields.\n"
}