{
  "Id": "1298",
  "Title": "\u0022Scoring Functions and Parameters in Azure Search Queries\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdffunctions \u003E distance \u003EreferencePointParameterA parameter to be passed in queries to use as reference location(using the scoringParameter query parameter).functions \u003E distance \u003EboostingDistanceA number that indicates the distance in kilometers from thereference location where the boosting range ends.functions \u003E tagThe tag scoring function is used to affect the score of documentsbased on tags in documents and search queries. Documents thathave tags in common with the search query will be boosted. Thetags for the search query are provided as a scoring parameter ineach search request (using the scoringParameter queryparameter).\r\nfunctions \u003E tag \u003EtagsParameterA parameter to be passed in queries to specify tags for aparticular request (using the scoringParameter query parameter).The parameter consists of a comma-delimited list of wholeterms. If a given tag within the list is itself a comma-delimitedlist, you can use a text normalizer on the field to strip out thecommas at query time (map the comma character to a space).\r\nThis approach will \u0022flatten\u0022 the list so that all terms are a single,long string of comma-delimited terms.functionAggregationOptional. Applies only when functions are specified. Valid valuesinclude: sum (default), average, minimum, maximum, andfirstMatching.\r\nA search score is single value that is computedfrom multiple variables, including multiple functions. Thisattribute indicates how the boosts of all the functions arecombined into a single aggregate boost that then is applied tothe base document score. The base score is based on the tf-idfvalue computed from the document and the search query. defaultScoringProfileWhen executing a search request, if no scoring profile isspecified, then default scoring is used (tf-idf only).You can override the built-in default, substituting a customprofile as the one to use when no specific profile is given in thesearch request.Interpolations allow you to set the shape of the slope used for scoring.\n"
}