{
  "Id": "568",
  "Title": "\u0022Securing Azure Cognitive Search: Network Integration and Access Control\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDescription: Service supports deployment into customer\u0027s private Virtual Network(VNet). Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.Description: Service network traffic respects Network Security Groups rule assignmenton its subnets. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.Description: Service native IP filtering capability for filtering network traffic (not to beconfused with NSG or Azure Firewall). Learn more.\r\nNetwork securityNS-1: Establish network segmentation boundariesFeaturesVirtual Network IntegrationNetwork Security Group SupportNS-2: Secure cloud services with network controlsFeaturesAzure Private LinkSupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerFeature notes: For outbound connections through a private endpoint, refer to: Makeoutbound connections through a private endpointConfiguration Guidance: Deploy private endpoints to establish a private access pointfor the resources. Block all connections on the public endpoint for your search service.Increase security for the virtual network, by enabling you to block exfiltration of datafrom the virtual network.\r\nReference: Create a Private Endpoint for a secure connection to Azure Cognitive SearchDescription: Service supports disabling public network access either through usingservice-level IP ACL filtering rule (not NSG or Azure Firewall) or using a \u0027Disable PublicNetwork Access\u0027 toggle switch. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: Azure Cognitive Search supports IP rules for inbound accessthrough a firewall, similar to the IP rules you\u0027ll find in an Azure virtual network securitygroup. By leveraging IP rules, you can restrict search service access to an approved setof machines and cloud services. Access to data stored in your search service from theapproved sets of machines and services will still require the caller to present a validauthorization token.Reference: Configure an IP firewall for Azure Cognitive SearchFor more information, see the Microsoft cloud security benchmark: Identity management.Disable Public Network AccessIdentity managementIM-1: Use centralized identity and authentication systemFeaturesDescription: Service supports using Azure AD authentication for data plane access.Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueTrueMicrosoftConfiguration Guidance: No additional configurations are required as this is enabled ona default deployment.\n"
}