{
  "Id": "574",
  "Title": "\u0022Secure Configuration and Monitoring in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfReference: Configure customer-managed keys for data encryption in Azure CognitiveSearchDescription: The service supports Azure Key Vault integration for any customercertificates. Learn more.DP-6: Use a secure key management processFeaturesKey Management in Azure Key VaultDP-7: Use a secure certificate management processFeaturesCertificate Management in Azure Key VaultSupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.For more information, see the Microsoft cloud security benchmark: Asset management.\r\nDescription: Service configurations can be monitored and enforced via Azure Policy.Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: Use Microsoft Defender for Cloud to configure Azure Policy toaudit and enforce configurations of your Azure resources. Use Azure Monitor to createalerts when there is a configuration deviation detected on the resources. Use AzurePolicy [deny] and [deploy if not exists] effects to enforce secure configuration acrossAzure resources.Reference: Azure Cognitive Search PoliciesFor more information, see the Microsoft cloud security benchmark: Logging and threatdetection.\r\nAsset managementAM-2: Use only approved servicesFeaturesAzure Policy SupportLogging and threat detectionLT-1: Enable threat detection capabilitiesFeaturesDescription: Service has an offering-specific Microsoft Defender solution to monitor andalert on security issues. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.Description: Service produces resource logs that can provide enhanced service-specificmetrics and logging. The customer can configure these resource logs and send them totheir own data sink like a storage account or log analytics workspace. Learn more. SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: Enable resource logs for the service to view the AzureCognitive Search operations logs, search metrics, and etc.Reference: Azure Cognitive Search resource logFor more information, see the Microsoft cloud security benchmark: Backup and recovery.Description: The service can be backed up by the Azure Backup service.\n"
}