{
  "Id": "1460",
  "Title": "\u0022Secure Encryption Practices for Azure Key Vault and Active Directory\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFull double encryptionPrerequisitesAzure Key Vault, you can create key vault using Azure portal, Azure CLI, or AzurePowerShell. Create the resource in the same subscription as Azure CognitiveSearch. The key vault must have soft-delete and purge protection enabled.Azure Active Directory. If you don\u0027t have one, set up a new tenant.You should have a search client that can create the encrypted object.\r\nInto this code,you\u0027ll reference a key vault key and Active Directory registration information. This codecould be a working app, or prototype code such as the C# code sampleDotNetHowToEncryptionUsingCMK.If you\u0027re new to Azure Key Vault, review this quickstart to learn about basic tasks: Setand retrieve a secret from Azure Key Vault using PowerShell.\r\nHere are some tips forusing Key Vault:Use as many key vaults as you need. Managed keys can be in different key vaults.A search service can have multiple encrypted objects, each one encrypted with adifferent customer-managed encryption key, stored in different key vaults.Enable logging on Key Vault so that you can monitor key usage.\r\nRemember to follow strict procedures during routine rotation of key vault keys andActive Directory application secrets and registration. Always update all encryptedcontent to use new secrets and keys before deleting the old ones. If you miss thisstep, your content can\u0027t be decrypted.As a first step, make sure soft-delete and purge protection are enabled on the key vault.Due to the nature of encryption with customer-managed keys, no one can retrieve yourdata if your Azure Key Vault key is deleted. TipYou can use Postman or Azure PowerShell to call REST APIs that create indexes andsynonym maps that include an encryption key parameter. You can also use AzureSDKs. Portal support for adding a key to indexes or synonym maps isn\u0027t supported.Key Vault tips1 - Enable purge protectionTo prevent data loss caused by accidental Key Vault key deletions, soft-delete and purgeprotection must be enabled on the key vault.\n"
}