{
  "Id": "1399",
  "Title": "\u0022Securing Azure Cognitive Search: Role-Based Access Control and Keys\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRegenerate admin keysSecure API keys1. Navigate to your search service page in Azure portal.2. On the left navigation pane, select Access control (IAM), and then select the Roleassignments tab.3. In the Role filter, select the roles that have permission to view or manage keys(Owner, Contributor, Search Service Contributor). The resulting security principalsassigned to those roles have key permissions on your search service.4. As a precaution, also check the Classic administrators tab to determine whetheradministrators and co-administrators have access.\r\nSecurity in Azure Cognitive SearchAzure role-based access control in Azure Cognitive SearchManage using PowerShellSee alsoConnect to Azure AI Search using Azurerole-based access control (Azure RBAC)Article•11/15/2023Azure provides a global role-based access control authorization system for all servicesrunning on the platform. In Azure AI Search, you can use Azure roles for:Control plane operations (service administration tasks through Azure ResourceManager).\r\nData plane operations, such as creating, loading, and querying indexes.Per-user access over search results (sometimes referred to as row-level security ordocument-level security) isn\u0027t supported. As a workaround, create security filters thattrim results by user identity, removing documents for which the requestor shouldn\u0027thave access.\r\nThe following roles are built in. If these roles are insufficient, create a custom role.RolePlaneDescriptionOwnerControl\u0026 DataFull access to the control plane of the search resource, including theability to assign Azure roles. Only the Owner role can enable or disableauthentication options or manage roles for other users. Subscriptionadministrators are members by default.On the data plane, this role has the same access as the Search ServiceContributor role. It includes access to all data plane actions except theability to query or index documents. ContributorControl\u0026 DataSame level of control plane access as Owner, minus the ability to assignroles or change authentication options.７ NoteIn Azure AI Search, \u0022control plane\u0022 refers to operations supported in theManagement REST API or equivalent client libraries.\n"
}