{
  "Id": "561",
  "Title": "\u0022Securing Azure Cognitive Search Services: NIST SP 800-53 Compliance\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf5Implement subnetworks forpublicly accessible systemcomponents that are physically orlogically separated from internalnetworks.Azure CognitiveSearch servicesshould useprivate link1.0.0System andCommunicationsProtection3.13.6Deny network communicationstraffic by default and allownetwork communications traffic byexception (i.e., deny all, permit byexception).\r\nAzure CognitiveSearch servicesshould disablepublic networkaccess1.0.0Audit andAccountability3.3.1Create and retain system auditlogs and records to the extentneeded to enable the monitoring,analysis, investigation, andResource logs inSearch servicesshould beenabled5.0.\r\n0(Azure portal)(GitHub)DomainControlIDControl titlePolicyPolicyversionreporting of unlawful orunauthorized system activityAudit andAccountability3.3.2Ensure that the actions ofindividual system users can beuniquely traced to those users, sothey can be held accountable fortheir actions.Resource logs inSearch servicesshould beenabled5.0.\r\n0To review how the available Azure Policy built-ins for all Azure services map to thiscompliance standard, see Azure Policy Regulatory Compliance - NIST SP 800-53 Rev. 4.For more information about this compliance standard, see NIST SP 800-53 Rev. 4.DomainControlIDControl titlePolicyPolicyversionAccess ControlAC-4Information FlowEnforcementAzure Cognitive Searchservice should use a SKUthat supports private link1.\r\n0.0Access ControlAC-4Information FlowEnforcementAzure Cognitive Searchservices should disablepublic network access1.0.0Access ControlAC-4Information FlowEnforcementAzure Cognitive Searchservices should useprivate link1.0.0Access ControlAC-17Remote AccessAzure Cognitive Searchservice should use a SKUthat supports private link1. 0.0Access ControlAC-17Remote AccessAzure Cognitive Searchservices should useprivate link1.0.0Access ControlAC-17(1)AutomatedMonitoring / ControlAzure Cognitive Searchservice should use a SKUthat supports private link1.0.0(Azure portal)(GitHub)NIST SP 800-53 Rev.\n"
}