{
  "Id": "1561",
  "Title": "\u0022Securing Azure Cognitive Search: Private Endpoints and Access Control\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfLearn more at:https://aka.ms/azure-cognitive-search/rbac.Modify, Disabled1.0.0Configure AzureCognitive Searchservices to disablepublic networkaccessDisable public network access for yourAzure Cognitive Search service so that it isnot accessible over the public internet. Thiscan reduce data leakage risks. Learn moreat: https://aka.\r\nms/azure-cognitive-search/inbound-private-endpoints.Modify, Disabled1.0.0(Azure portal)(GitHub)NameDescriptionEffect(s)VersionConfigure AzureCognitive Searchservices with privateendpointsPrivate endpoints connect your virtualnetwork to Azure services without a publicIP address at the source or destination.\r\nBymapping private endpoints to your AzureCognitive Search service, you can reducedata leakage risks. Learn more at:https://aka.ms/azure-cognitive-search/inbound-private-endpoints.DeployIfNotExists,Disabled1.0.0Deploy DiagnosticSettings for SearchServices to EventHubDeploys the diagnostic settings for SearchServices to stream to a regional Event Hubwhen any Search Services which is missingthis diagnostic settings is created orupdated.\r\nDeployIfNotExists,Disabled2.0.0Deploy DiagnosticSettings for SearchServices to LogAnalytics workspaceDeploys the diagnostic settings for SearchServices to stream to a regional LogAnalytics workspace when any SearchServices which is missing this diagnosticsettings is created or updated.\r\nDeployIfNotExists,Disabled1.0.0Resource logs inSearch servicesshould be enabledAudit enabling of resource logs. Thisenables you to recreate activity trails to usefor investigation purposes; when a securityincident occurs or when your network iscompromisedAuditIfNotExists,Disabled5.0.0See the built-ins on the Azure Policy GitHub repo. Review the Azure Policy definition structure.Review Understanding policy effects.(Azure portal)(GitHub)Next stepsAzure AI Search monitoring datareferenceArticle•11/15/2023This article provides a reference of log and metric data collected to analyze theperformance and availability of Azure AI Search.\n"
}