{
  "Id": "1380",
  "Title": "\u0022Securing Azure AI Search with Private Endpoints: A How-To Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe private endpoint uses an IP addressfrom the virtual network address space for your search service. Network traffic betweenthe client and the search service traverses over the virtual network and a private link onthe Microsoft backbone network, eliminating exposure from the public internet. Formore details, please refer to the documentation on creating a private endpoint for AzureAI SearchThe following example shows how to create a search service with a private endpoint.\r\nFirst, deploy a search service with PublicNetworkAccess set to Disabled.Azure CLINext, create a virtual network and the private endpoint.\r\nAzure CLIaz search service create \\    --name \u003Csearch-service-name\u003E \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --sku Standard \\    --partition-count 1 \\    --replica-count 1 \\    --public-access Disabled# Create the virtual networkaz network vnet create \\    --resource-group \u003Cvnet-resource-group-name\u003E \\    --location \u0022West US\u0022 \\    --name \u003Cvirtual-network-name\u003E \\    --address-prefixes 10.\r\n1.0.0/16 \\    --subnet-name \u003Csubnet-name\u003E \\    --subnet-prefixes 10.1.0.\r\n0/24# Update the subnet to disable private endpoint network policiesaz network vnet subnet update \\    --name \u003Csubnet-name\u003E \\    --resource-group \u003Cvnet-resource-group-name\u003E \\    --vnet-name \u003Cvirtual-network-name\u003E \\    --disable-private-endpoint-network-policies true# Get the id of the search serviceid=$(az search service show \\    --resource-group \u003Csearch-service-resource-group-name\u003E \\    --name \u003Csearch-service-name\u003E \\    --query [id] \\    --output tsv)# Create the private endpointFinally, create a private DNS Zone. Azure CLIFor more information on creating private endpoints in Azure CLI, see this Private LinkQuickstartIn addition to creating a private endpoint connection, you can also show, update, anddelete the connection.\nTo retrieve a private endpoint connection and to see its status, use az search private-endpoint-connection show.\n"
}