{
  "Id": "570",
  "Title": "\u0022Securing Azure Data Plane Access: Best Practices and Guidance\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfManaged identity credentials are fullymanaged, rotated, and protected by the platform, avoiding hard-coded credentials insource code or configuration files.Reference: Authorize access to a search app using Azure Active DirectoryDescription: Data plane supports authentication using service principals. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: There is no current Microsoft guidance for this featureconfiguration. Please review and determine if your organization wants to configure thissecurity feature.Description: Data plane access can be controlled using Azure AD Conditional AccessPolicies.\r\nLearn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: Define the applicable conditions and criteria for Azure ActiveDirectory (Azure AD) conditional access in the workload. Consider common use casessuch as blocking or granting access from specific locations, blocking risky sign-inbehavior, or requiring organization-managed devices for specific applications.Service PrincipalsIM-7: Restrict resource access based on conditionsFeaturesConditional Access for Data PlaneDescription: Data plane supports native use of Azure Key Vault for credential and secretsstore. Learn more.\r\nSupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.For more information, see the Microsoft cloud security benchmark: Privileged access.Description: Service has the concept of a local administrative account. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service. IM-8: Restrict the exposure of credential and secretsFeaturesService Credential and Secrets Support Integration and Storage inAzure Key VaultPrivileged accessPA-1: Separate and limit highly privileged/administrativeusersFeaturesLocal Admin AccountsPA-7: Follow just enough administration (least privilege)principleFeaturesDescription: Azure Role-Based Access Control (Azure RBAC) can be used to managedaccess to service\u0027s data plane actions.\n"
}