{
  "Id": "1415",
  "Title": "\u0022Securing Azure Cognitive Search with Private Endpoints: A Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFormore information about costs, see the pricing page.You can create a private endpoint in the Azure portal, as described in this article.Alternatively, you can use the Management REST API version 2020-03-13, AzurePowerShell, or Azure CLI.Private Endpoints for Azure Cognitive Search allow a client on a virtual network tosecurely access data in a search index over a Private Link.\r\nThe private endpoint uses anIP address from the virtual network address space for your search service. Networktraffic between the client and the search service traverses over the virtual network and aprivate link on the Microsoft backbone network, eliminating exposure from the publicinternet. For a list of other PaaS services that support Private Link, check the availabilitysection in the product documentation.Private endpoints for your search service enable you to:Block all connections on the public endpoint for your search service.Increase security for the virtual network, by enabling you to block exfiltration ofdata from the virtual network.\r\n７ NoteOnce a search service has a private endpoint, portal access to that service must beinitiated from a browser session on a virtual machine inside the virtual network. Seethis step for details.Why use a Private Endpoint for secure access?Securely connect to your search service from on-premises networks that connectto the virtual network using VPN or ExpressRoutes with private-peering.\r\nIn this section, you\u0027ll create a virtual network and subnet to host the VM that will beused to access your search service\u0027s private endpoint.1. From the Azure portal home tab, select Create a resource \u003E Networking \u003E Virtualnetwork.2. In Create virtual network, enter or select the following values:SettingValueSubscriptionSelect your subscription. ResourcegroupSelect Create new, enter a name, such as \u0022myResourceGroup\u0022, then selectOK.NameEnter a name, such as \u0022MyVirtualNetwork\u0022.RegionSelect a region.3. Accept the defaults for the rest of the settings. Select Review \u002B create and thenCreate.In this section, you\u0027ll create a new Azure Cognitive Search service with a PrivateEndpoint.\n"
}