{
  "Id": "571",
  "Title": "\u0022Securing Azure Services: RBAC, Key Vault, and Data Protection\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIM-8: Restrict the exposure of credential and secretsFeaturesService Credential and Secrets Support Integration and Storage inAzure Key VaultPrivileged accessPA-1: Separate and limit highly privileged/administrativeusersFeaturesLocal Admin AccountsPA-7: Follow just enough administration (least privilege)principleFeaturesDescription: Azure Role-Based Access Control (Azure RBAC) can be used to managedaccess to service\u0027s data plane actions.\r\nLearn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: Azure provides a global role-based access control (RBAC)authorization system for all services running on the platform. In Cognitive Search, youcan use Azure roles for:Control plane operations (service administration tasks through Azure ResourceManager).Data plane operations, such as creating, loading, and querying indexes.\r\nReference: Use Azure role-based access controls (Azure RBAC) in Azure Cognitive SearchDescription: Customer Lockbox can be used for Microsoft support access. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: In support scenarios where Microsoft needs to access yourdata, use Customer Lockbox to review, then approve or reject each of Microsoft\u0027s dataaccess requests.\r\nFor more information, see the Microsoft cloud security benchmark: Data protection.Azure RBAC for Data PlanePA-8: Determine access process for cloud providersupportFeaturesCustomer LockboxData protectionDP-1: Discover, classify, and label sensitive dataDescription: Tools (such as Azure Purview or Azure Information Protection) can be usedfor data discovery and classification in the service. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.Description: Service supports DLP solution to monitor sensitive data movement (incustomer\u0027s content). Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.Description: Service supports data in-transit encryption for data plane.\n"
}