{
  "Id": "540",
  "Title": "\u0022Security and Permissions in Azure AI Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUsing keys, anyone with an admin key to your service can read, modify, or delete anyindex in the same service. For protection against accidental or malicious deletion ofindexes, your in-house source control for code assets is the solution for reversing anunwanted index deletion or modification. Azure AI Search has failover within the clusterto ensure availability, but it doesn\u0027t store or execute your proprietary code used tocreate or load indexes.For multitenancy solutions requiring security boundaries at the index level, it\u0027s commonto handle index isolation in the middle tier in your application code.\r\nFor moreinformation about the multitenant use case, see Design patterns for multitenant SaaSapplications and Azure AI Search.User permissions at the document level, also known as row-level security, isn\u0027t nativelysupported in Azure AI Search. If you import data from an external system that providesrow-level security, such as Azure Cosmos DB, those permissions won\u0027t transfer with thedata as its being indexed by Azure AI Search.\r\nIf you require permissioned access over content in search results, there\u0027s a technique forapplying filters that include or exclude documents based on user identity. Thisworkaround adds a string field in the data source that represents a group or useridentity, which you can make filterable in your index. The following table describes twoapproaches for trimming search results of unauthorized content.ApproachDescriptionSecurity trimmingbased on identityDocuments the basic workflow for implementing user identity accesscontrol. It covers adding security identifiers to an index, and thenRestricting access to indexesRestricting access to documentsApproachDescriptionfiltersexplains filtering against that field to trim results of prohibited content.Security trimmingbased on MicrosoftEntra identitiesThis article expands on the previous article, providing steps forretrieving identities from Microsoft Entra ID, one of the free servicesin the Azure cloud platform.\n"
}