{
  "Id": "994",
  "Title": "\u0022Securing Azure AI Search: Connecting to SQL Server on VM\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCopy the connection string to use in the search indexer\u0027s data source connection. Besure to copy the connection string for the public endpoint (port 3342, not port 1433).Restrict inbound access to the endpointGet public endpoint connection stringNext stepsWith configuration out of the way, you can now specify a SQL managed instance as anindexer data source using the basic instructions for setting up an Azure SQL indexer.\r\nIndexer connections to a SQL Serverinstance on an Azure virtual machineArticle•11/15/2023When configuring an Azure SQL indexer to extract content from a database on an Azurevirtual machine, additional steps are required for secure connections.\r\nA connection from Azure AI Search to SQL Server instance on a virtual machine is apublic internet connection. In order for secure connections to succeed, you\u0027ll need tosatisfy the following requirements:Obtain a certificate from a Certificate Authority provider for the fully qualifieddomain name of the SQL Server instance on the virtual machine.Install the certificate on the virtual machine.After you\u0027ve installed the certificate on your VM, you\u0027re ready to complete the followingsteps in this article.Azure AI Search requires an encrypted channel for all indexer requests over a publicinternet connection. This section lists the steps to make this work.1.\r\nCheck the properties of the certificate to verify the subject name is the fullyqualified domain name (FQDN) of the Azure VM.You can use a tool like CertUtils or the Certificates snap-in to view the properties.You can get the FQDN from the VM service blade\u0027s Essentials section, in the PublicIP address/DNS name label field, in the Azure portal. The FQDN is typically formatted as \u003Cyour-VM-name\u003E.\u003Cregion\u003E.cloudapp.azure.com2. Configure SQL Server to use the certificate using the Registry Editor (regedit).７ NoteAlways Encrypted columns are not currently supported by Azure AI Searchindexers.Enable encrypted connectionsAlthough SQL Server Configuration Manager is often used for this task, you can\u0027tuse it for this scenario.\n"
}