{
  "Id": "572",
  "Title": "\u0022Securing Azure Cognitive Search: Encryption and Key Management Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfLearn more.SupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.Description: Service supports DLP solution to monitor sensitive data movement (incustomer\u0027s content). Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityFalseNot ApplicableNot ApplicableConfiguration Guidance: This feature is not supported to secure this service.Description: Service supports data in-transit encryption for data plane.\r\nLearn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueTrueMicrosoftFeaturesSensitive Data Discovery and ClassificationDP-2: Monitor anomalies and threats targeting sensitivedataFeaturesData Leakage/Loss PreventionDP-3: Encrypt sensitive data in transitFeaturesData in Transit EncryptionConfiguration Guidance: No additional configurations are required as this is enabled ona default deployment.Reference: Azure Cognitive Search data in transit encryptionDescription: Data at-rest encryption using platform keys is supported, any customercontent at rest is encrypted with these Microsoft managed keys. Learn more.\r\nSupportedEnabled By DefaultConfiguration ResponsibilityTrueTrueMicrosoftConfiguration Guidance: No additional configurations are required as this is enabled ona default deployment.Reference: Azure Cognitive Search default data encryption using service-managed keysDescription: Data at-rest encryption using customer-managed keys is supported forcustomer content stored by the service. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: If required for regulatory compliance, define the use case andservice scope where encryption using customer-managed keys are needed. Enable andimplement data at rest encryption using customer-managed key for those services. DP-4: Enable data at rest encryption by defaultFeaturesData at Rest Encryption Using Platform KeysDP-5: Use customer-managed key option in data at restencryption when requiredFeaturesData at Rest Encryption Using CMKReference: Configure customer-managed keys for data encryption in Azure CognitiveSearchDescription: The service supports Azure Key Vault integration for any customer keys,secrets, or certificates. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: Use Azure Key Vault to create and control the life cycle of yourencryption keys, including key generation, distribution, and storage.\n"
}