{
  "Id": "544",
  "Title": "\u0022Securing Azure AI Search: Best Practices and Compliance Guidelines\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBecause of the negative performance impact, we recommend that youonly enable this feature on indexes that really require it. For more information, seeConfigure customer-managed encryption keys in Azure AI Search.Reliance on API key-based authentication means that you should have a plan forregenerating the admin key at regular intervals, per Azure security best practices. Thereare a maximum of two admin keys per search service. For more information aboutsecuring and managing API keys, see Create and manage api-keys.Azure AI Search doesn\u0027t log user identities so you can\u0027t refer to logs for informationabout a specific user.\r\nHowever, the service does log create-read-update-deleteoperations, which you might be able to correlate with other logs to understand theagency of specific actions.Customer-managed keys (CMK)Security administrationManage API keysActivity and resource logsUsing alerts and the logging infrastructure in Azure, you can pick up on query volumespikes or other actions that deviate from expected workloads. For more informationabout setting up logs, see Collect and analyze log data and Monitor query requests.Azure AI Search participates in regular audits, and has been certified against manyglobal, regional, and industry-specific standards for both the public cloud and AzureGovernment.\r\nFor the complete list, download the Microsoft Azure ComplianceOfferings whitepaper from the official Audit reports page.For compliance, you can use Azure Policy to implement the high-security best practicesof Microsoft cloud security benchmark. The Microsoft cloud security benchmark is acollection of security recommendations, codified into security controls that map to keyactions you should take to mitigate threats to services and data. There are currently 12security controls, including Network Security, Logging and Monitoring, and DataProtection.Azure Policy is a capability built into Azure that helps you manage compliance formultiple standards, including those of Microsoft cloud security benchmark. For well-known benchmarks, Azure Policy provides built-in definitions that provide both criteriaand an actionable response that addresses noncompliance.For Azure AI Search, there\u0027s currently one built-in definition. It\u0027s for resource logging.You can assign a policy that identifies search services that are missing resource logging,and then turn it on. For more information, see Azure Policy Regulatory Compliancecontrols for Azure AI Search.Watch this fast-paced video for an overview of the security architecture and each featurecategory.Azure security fundamentalsAzure SecurityMicrosoft Defender for CloudCertifications and complianceWatch this videohttps://learn.microsoft.\n"
}