{
  "Id": "564",
  "Title": "\u0022Security Compliance Guidelines for Azure Cognitive Search Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf0Access ControlAC-17(1)Monitoring andControlAzure Cognitive Searchservices should useprivate link1.0.0Audit andAccountabilityAU-6 (4)Central Review andAnalysisResource logs in Searchservices should beenabled5.0.0Audit andAccountabilityAU-6 (5)Integrated Analysisof Audit RecordsResource logs in Searchservices should beenabled5.0.\r\n0Audit andAccountabilityAU-12Audit RecordGenerationResource logs in Searchservices should be5.0.0NIST SP 800-53 Rev. 5ﾉExpand table(Azure portal)(GitHub)DomainControlIDControl titlePolicyPolicyversionenabledAudit andAccountabilityAU-12(1)System-wide andTime-correlatedAudit TrailResource logs in Searchservices should beenabled5.\r\n0.0System andCommunicationsProtectionSC-7BoundaryProtectionAzure Cognitive Searchservice should use a SKUthat supports private link1.0.0System andCommunicationsProtectionSC-7BoundaryProtectionAzure Cognitive Searchservices should disablepublic network access1.0.\r\n0System andCommunicationsProtectionSC-7BoundaryProtectionAzure Cognitive Searchservices should useprivate link1.0.0System andCommunicationsProtectionSC-7 (3)Access PointsAzure Cognitive Searchservice should use a SKUthat supports private link1.0.0System andCommunicationsProtectionSC-7 (3)Access PointsAzure Cognitive Searchservices should disablepublic network access1.0.\r\n0System andCommunicationsProtectionSC-7 (3)Access PointsAzure Cognitive Searchservices should useprivate link1.0.0To review how the available Azure Policy built-ins for all Azure services map to thiscompliance standard, see Azure Policy Regulatory Compliance details for NL BIO CloudTheme. For more information about this compliance standard, see Baseline InformationSecurity Government Cybersecurity - Digital Government (digitaleoverheid.nl).DomainControlIDControl titlePolicyPolicyversionU.07.1 Dataseparation -IsolatedU.07.1Permanent isolation of datais a multi-tenantarchitecture. Patches arerealized in a controlledmanner.Azure CognitiveSearch service shoulduse a SKU thatsupports private link1.\n"
}