{
  "Id": "537",
  "Title": "\u0022Securing Azure AI Search: Internal Traffic and Network Security\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfConfigure same-region connections using either of the following approaches:Trusted service exceptionOutbound trafficException for same-region search and storage servicesResource instance rulesInternal requests are secured and managed by Microsoft. You can\u0027t configure or controlthese connections. If you\u0027re locking down network access, no action on your part isrequired because internal traffic isn\u0027t customer-configurable.Internal traffic consists of:Service-to-service calls for tasks like authentication and authorization throughMicrosoft Entra ID, resource logging sent to Azure Monitor, and private endpointconnections that utilize Azure Private Link.Requests made to Azure AI services APIs for built-in skills.\r\nRequests made to the machine learning models that support semantic ranking.Network security protects resources from unauthorized access or attack by applyingcontrols to network traffic. Azure AI Search supports networking features that can beyour frontline of defense against unauthorized access.A search service is provisioned with a public endpoint that allows access using a publicIP address. To restrict which traffic comes through the public endpoint, create aninbound firewall rule that admits requests from a specific IP address or a range of IPaddresses. All client connections must be made through an allowed IP address, or theconnection is denied.\r\nYou can use the portal to configure firewall access.Internal trafficNetwork securityInbound connection through IP firewallsAlternatively, you can use the management REST APIs. Starting with API version 2020-03-13, with the IpRule parameter, you can restrict access to your service by identifying IPaddresses, individually or in a range, that you want to grant access to your searchservice.\r\nFor more stringent security, you can establish a private endpoint for Azure AI Searchallows a client on a virtual network to securely access data in a search index over aPrivate Link.The private endpoint uses an IP address from the virtual network address space forconnections to your search service. Network traffic between the client and the searchservice traverses over the virtual network and a private link on the Microsoft backbonenetwork, eliminating exposure from the public internet. A virtual network allows forsecure communication among resources, with your on-premises network as well as theInternet.\n"
}