{
  "Id": "569",
  "Title": "\u0022Securing Azure Cognitive Search: Authentication and Access Control Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAccess to data stored in your search service from theapproved sets of machines and services will still require the caller to present a validauthorization token.Reference: Configure an IP firewall for Azure Cognitive SearchFor more information, see the Microsoft cloud security benchmark: Identity management.Disable Public Network AccessIdentity managementIM-1: Use centralized identity and authentication systemFeaturesDescription: Service supports using Azure AD authentication for data plane access.Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueTrueMicrosoftConfiguration Guidance: No additional configurations are required as this is enabled ona default deployment.\r\nDescription: Local authentications methods supported for data plane access, such as alocal username and password. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerFeature notes: Avoid the usage of local authentication methods or accounts, theseshould be disabled wherever possible. Instead use Azure AD to authenticate wherepossible.Configuration Guidance: Cognitive Search uses key-based authentication as its primaryauthentication methodology. For inbound requests to a search service endpoint, such asrequests that create or query an index, API keys are the only generally availableauthentication option you have.\r\nReference: Use API keys for Azure Cognitive Search authenticationDescription: Data plane actions support authentication using managed identities. Learnmore.Azure AD Authentication Required for Data Plane AccessLocal Authentication Methods for Data Plane AccessIM-3: Manage application identities securely andautomaticallyFeaturesManaged IdentitiesSupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: Use Azure managed identities instead of service principalswhen possible, which can authenticate to Azure services and resources that supportAzure Active Directory (Azure AD) authentication. Managed identity credentials are fullymanaged, rotated, and protected by the platform, avoiding hard-coded credentials insource code or configuration files.Reference: Authorize access to a search app using Azure Active DirectoryDescription: Data plane supports authentication using service principals. Learn more.SupportedEnabled By DefaultConfiguration ResponsibilityTrueFalseCustomerConfiguration Guidance: There is no current Microsoft guidance for this featureconfiguration. Please review and determine if your organization wants to configure thissecurity feature.Description: Data plane access can be controlled using Azure AD Conditional AccessPolicies.\n"
}