{
  "Id": "538",
  "Title": "\u0022Securing Network Traffic and Authentication in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNetwork traffic between the client and the searchservice traverses over the virtual network and a private link on the Microsoft backbonenetwork, eliminating exposure from the public internet. A virtual network allows forsecure communication among resources, with your on-premises network as well as theInternet.\r\nWhile this solution is the most secure, using more services is an added cost so be sureyou have a clear understanding of the benefits before diving in. For more informationabout costs, see the pricing page. For more information about how these componentswork together, watch this video. Coverage of the private endpoint option starts at 5:48into the video. For instructions on how to set up the endpoint, see Create a PrivateEndpoint for Azure AI Search.\r\nOnce a request is admitted to the search service, it must still undergo authenticationand authorization that determines whether the request is permitted. Azure AI Searchsupports two approaches:Inbound connection to a private endpoint (networkisolation, no Internet traffic)AuthenticationMicrosoft Entra authentication establishes the caller (and not the request) as theauthenticated identity. An Azure role assignment determines authorization.Key-based authentication is performed on the request (not the calling app or user)through an API key, where the key is a string composed of randomly generatednumbers and letters that prove the request is from a trustworthy source. Keys arerequired on every request. Submission of a valid key is considered proof therequest originates from a trusted entity.You can use both authentication methods, or disable an approach that you don\u0027t wantavailable on your search service.Azure AI Search provides authorization models for service management and contentmanagement.Resource management is authorized through Azure role-based access control (AzureRBAC). Azure RBAC is the authorization system for Azure Resource Manager.In Azure AI Search, Resource Manager is used to create or delete the service, manageAPI keys, scale the service, and configure security.\n"
}