{
  "Id": "1462",
  "Title": "\u0022Secure Access Management for Azure Search Service and Key Vault\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe simplestapproach is to retrieve the key using the managed identity and permissions of yoursearch service. You can use either a system or user-managed identity. Doing so allowsyou to omit the steps for application registration and application secrets, and simplifiesthe encryption key definition.\r\nAlternatively, you can create and register an Azure Active Directory application. Thesearch service will provide the application ID on requests.A managed identity enables your search service to authenticate to Azure Key Vaultwithout storing credentials (ApplicationID or ApplicationSecret) in code. The lifecycle ofthis type of managed identity is tied to the lifecycle of your search service, which can3 - Create a security principalonly have one managed identity. For more information about how managed identitieswork, see What are managed identities for Azure resources.1. Make your search service a trusted service.\r\nConditions that will prevent you from adopting this approach include:You can\u0027t directly grant your search service access permissions to the key vault(for example, if the search service is in a different Active Directory tenant thanthe Azure Key Vault).A single search service is required to host multiple encrypted indexes orsynonym maps, each using a different key from a different key vault, whereeach key vault must use a different identity for authentication. Because asearch service can only have one managed identity, a requirement for multipleidentities will disqualify the simplified approach for your scenario.In this step, you\u0027ll create an access policy in Key Vault. This policy gives the applicationyou registered with Active Directory permission to use your customer-managed key.Access permissions could be revoked at any given time. Once revoked, any searchservice index or synonym map that uses that key vault will become unusable. Restoringkey vault access permissions at a later time will restore index\\synonym map access. Formore information, see Secure access to a key vault.System-managed identity4 - Grant permissions1. Still in the Azure portal, open your key vault Overview page.2. Select the Access policies on the left, and select \u002B Create to start the Create anaccess policy wizard.3.\n"
}