{
  "Id": "66",
  "Title": "\u0022Semantic Hybrid Search: Historic Hotels Near Washington D.C.\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf81514084,            \u0022HotelId\u0022: \u00222\u0022,            \u0022HotelName\u0022: \u0022Twin Dome Hotel\u0022,            \u0022Description\u0022: \u0022The hotel is situated in a  nineteenth century plaza, which has been expanded and renovated to the highest architectural standards to create a modern, functional and first-class hotel in which art and unique historical elements coexist with the most modern comforts.\r\n\u0022,            \u0022Category\u0022: \u0022Boutique\u0022        },        {            \u0022@search.score\u0022: 0.8133763,            \u0022HotelId\u0022: \u00223\u0022,            \u0022HotelName\u0022: \u0022Triple Landscape Hotel\u0022,            \u0022Description\u0022: \u0022The Hotel stands out for its gastronomic excellence under the management of William Dough, who advises on and oversees all of the Hotel’s restaurant services.\r\n\u0022,            \u0022Category\u0022: \u0022Resort and Spa\u0022Here\u0027s the last query in the collection: a hybrid query, with semantic ranking, filtered toshow just those hotels within a 500-kilometer radius of Washington D.C.vectorFilterMode can be set to null, which is equivalent to the default (preFilter fornewer indexes, postFilter for older ones).HTTPResponse is three hotels, filtered by location and faceted by StateProvince, semanticallyranked to promote results that are closest to the search string query (\u0022historic hotel walkto restaurants and shopping\u0022).Now, Old Carabelle Hotel moves into the top spot.\r\nWithout semantic ranking, Nordick\u0027sHotel is number one. With semantic ranking, the machine comprehension models        }    ]Semantic hybrid search with filterPOST https://{{search-service-name}}.search.windows. net/indexes/{{index-name}}/docs/search?api-version=2023-11-01Content-Type: application/jsonapi-key: {{admin-api-key}}{    \u0022count\u0022: true,    \u0022search\u0022: \u0022historic hotel walk to restaurants and shopping\u0022,    \u0022select\u0022: \u0022HotelId, HotelName, Category, Description,Address/City, Address/StateProvince\u0022,    \u0022filter\u0022: \u0022geo.distance(Location, geography\u0027POINT(-77.03241 38.\n"
}