{
  "Id": "1305",
  "Title": "\u0022Semantic Configuration in Azure Search: Field Inputs and Query\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNET.Azure.Search.Documents in the Azure SDK for Python.azure-search-documents in the Azure SDK for Java.@azure/search-documents in the Azure SDK for JavaScript.A semantic configuration is a section in your index that establishes field inputs forsemantic ranking. You can add or update a semantic configuration at any time, norebuild necessary.\r\nIf you create multiple configurations, you can specify a default. Atquery time, specify a semantic configuration on a query request, or leave it blank to usethe default.A semantic configuration has a name and the following properties:PropertyCharacteristicsTitle fieldA short string, ideally under 25 words.\r\nThis field could be the title of a document,name of a product, or a unique identifier. If you don\u0027t have suitable field, leave itblank.ContentfieldsLonger chunks of text in natural language form, subject to maximum token inputlimits on the machine learning models. Common examples include the body of adocument, description of a product, or other free-form text.\r\nKeywordfieldsA list of keywords, such as the tags on a document, or a descriptive term, such asthe category of an item.You can only specify one title field, but you can have as many content and keywordfields as you like. For content and keyword fields, list the fields in priority order becauselower priority fields might get truncated.\r\nAcross all semantic configuration properties, the fields you assign must be:Attributed as searchable and retrievableStrings of type Edm.String, Collection(Edm.String), string subfields ofCollection(Edm.ComplexType)2 - Create a semantic configurationAzure portal1. Sign in to the Azure portal and navigate to a search service that hassemantic ranking enabled. 2. Open an index.3. Select Semantic Configurations and then select Add Semantic Configuration.The New Semantic Configuration page opens with options for selecting a titlefield, content fields, and keyword fields. Make sure to list content fields andkeyword fields in priority order.Select OK to save the changes.Several query capabilities in Azure AI Search bypass relevance scoring or are otherwiseincompatible with semantic ranking. If your query logic includes the following features,you can\u0027t semantically rank your results:A query with search=* or an empty search string, such as pure filter-only query,won\u0027t work because there is nothing to measure semantic relevance against.\n"
}