{
  "Id": "1308",
  "Title": "\u0022Semantic Ranking and Field Specification in Azure Search API\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfCaptions are returned because the \u0022captions\u0022 property is set, with plain text andhighlighted versions. Answers are omitted from the example because one couldn\u0027t bedetermined for this particular query and corpus.5 - Evaluate the responseJSONIf your semantic ranking code is using preview APIs, this section explains how to migrateto stable versions.\r\nGenerally available versions include:2023-11-01 (REST)Azure.Search.Documents (Azure SDK for .NET)Behavior changes:As of July 14, 2023, semantic ranking is language agnostic. It can rerank resultscomposed of multilingual content, with no bias towards a specific language. Inpreview versions, semantic ranking would deprioritize results differing from thelanguage specified by the field analyzer.\r\nIn 2021-04-30-Preview and all later versions, semanticConfiguration (in an indexdefinition) defines which search fields are used in semantic ranking. In the 2020-06-30-Preview REST API, searchFields (in a query request) was used for fieldspecification and prioritization. This approach only worked in 2020-06-30-Previewand is obsolete in all other versions.\r\n\u0022@odata.count\u0022: 35,\u0022@search.answers\u0022: [],\u0022value\u0022: [    {        \u0022@search.score\u0022: 1.8810667,        \u0022@search.rerankerScore\u0022: 1.1446577133610845,        \u0022@search.captions\u0022: [            {                \u0022text\u0022: \u0022Oceanside Resort. Luxury. New Luxury Hotel. Be the first to stay. Bay views from every room, location near the pier, rooftop pool, waterfront dining \u0026 more.\u0022,                \u0022highlights\u0022: \u0022\u003Cstrong\u003EOceanside Resort.\u003C/strong\u003E Luxury. New Luxury Hotel. Be the first to stay.\u003Cstrong\u003E Bay\u003C/strong\u003E views from every room, location near the pier, rooftop pool, waterfront dining \u0026 more.\n"
}