{
  "Id": "444",
  "Title": "\u0022Semantic Ranking and Pricing in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor more information about theresearch and AI investments backing semantic ranking, see How AI from Bing ispowering Azure AI Search (Microsoft Research Blog).The following video provides an overview of the capabilities.Semantic ranking is available on search services at the Basic and higher tiers, subject toregional availability.When you enable semantic ranking, choose a pricing plan for the feature:At lower query volumes (under 1000 monthly), semantic ranking is free.At higher query volumes, choose the standard pricing plan.The Azure AI Search pricing page shows you the billing rate for different currenciesand intervals.Semantic capabilities and limitationshttps://www.youtube-nocookie.\r\ncom/embed/yOf0WfVd_V0Availability and pricingCharges for semantic ranking are levied when query requests includequeryType=semantic and the search string isn\u0027t empty (for example, search=pet friendlyhotels in New York). If your search string is empty (search=*), you aren\u0027t charged, evenif the queryType is set to semantic.\r\nEnable semantic rankingConfigure semantic rankingBlog: Outperforming vector search with hybrid retrieval and ranking capabilitiesSee alsoIndexes in Azure Cognitive SearchArticle•06/29/2023In Azure Cognitive Search, a search index is your searchable content, available to thesearch engine for indexing, full text search, and filtered queries.\r\nAn index is defined by aschema and saved to the search service, with data import following as a second step.This content exists within your search service, apart from your primary data stores, whichis necessary for the millisecond response times expected in modern applications. Exceptfor specific indexing scenarios, the search service will never connect to or query yourlocal data. If you\u0027re creating and managing a search index, this article helps you understand thefollowing:Content (documents and schema)Physical representationBasic operationsPrefer to be hands-on right away? See Create a search index instead.In Cognitive Search, indexes contain search documents. Conceptually, a document is asingle unit of searchable data in your index.\n"
}