{
  "Id": "442",
  "Title": "\u0022Semantic Summarization and Scoring in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSummarization output is a summary string for each document, composed of themost relevant information from each field. Summary strings are sent to the rankerfor scoring, and to machine reading comprehension models for captions andanswers.The maximum length of each generated summary string passed to the semanticranker is 256 tokens.How inputs are collected and summarizedFrom each summary string, the machine reading comprehension models find passagesthat are the most representative.Outputs are:A semantic caption for the document. Each caption is available in a plain textversion and a highlight version, and is frequently fewer than 200 words perdocument.\r\nAn optional semantic answer, assuming you specified the answers parameter, thequery was posed as a question, and a passage is found in the long string thatprovides a likely answer to the question.Captions and answers are always verbatim text from your index. There\u0027s no generative AImodel in this workflow that creates or composes new content.\r\nScoring is done over the caption, and any other content from the summary string thatfills out the 256 token length.1. Captions are evaluated for conceptual and semantic relevance, relative to thequery provided.2. A @search.rerankerScore is assigned to each document based on the semanticrelevance of the document for the given query.\r\nScores range from 4 to 0 (high tolow), where a higher score indicates higher relevance.3. Matches are listed in descending order by score and included in the queryresponse payload. The payload includes answers, plain text and highlightedcaptions, and any fields that you marked as retrievable or specified in a selectclause. Outputs of semantic rankingHow summaries are scored７ NoteBeginning on July 14, 2023, the @search.rerankerScore distribution is changing.The effect on scores can\u0027t be determined except through testing. If you have a hardthreshold dependency on this response property, rerun your tests to understandwhat the new values should be for your threshold.\n"
}