{
  "Id": "77",
  "Title": "\u0022Setting Up Azure AI Search: Endpoint, Deployment, and Permissions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe wizard needs an endpoint, a deployment of text-embedding-ada-002, and eitheran API key or a search service managed identity with Cognitive Services OpenAI UserCheck for spacePrepare sample dataGet connection details for Azure OpenAIpermissions.1. Sign in to the Azure portal with your Azure account, and go to your AzureOpenAI resource.2. Under Keys and management, copy the endpoint.\r\n3. On the same page, copy a key or check Access control to assign role members toyour search service identity.4. Under Model deployments, select Manage deployments to open Azure AI Studio.Copy the deployment name of text-embedding-ada-002.To get started, browse to your Azure AI Search service in the Azure portal and open theImport and vectorize data wizard.\r\n1. Sign in to the Azure portal with your Azure account, and go to your Azure AISearch service.2. On the Overview page, select Import and vectorize data.The next step is to connect to a data source to use for the search index.1. In the Import data wizard on the Connect to your data tab, expand the DataSource dropdown list and select Azure Blob Storage.\r\n2. Specify the Azure subscription, storage account, and container that provides thedata.3. For the connection, either provide a full access connection string that includes akey, or specify a managed identity that has Storage Blob Data Reader permissionson the container.4.\r\nSpecify whether you want deletion detection:Start the wizardConnect to your data5. Select Next: Vectorize and Enrich to continue.In this step, specify the embedding model used to vectorize chunked data.1. Provide the subscription, endpoint, API key, and model deployment name.2. Optionally, you can crack binary images (for example, scanned document files) anduse OCR to recognize text.3. Optionally, you can add semantic ranking to rerank results at the end of queryexecution, promoting the most semantically relevant matches to the top.4. Specify a run time schedule for the indexer.Enrich and vectorize your data5. Select Next: Create and Review to continue.\n"
}