{
  "Id": "90",
  "Title": "\u0022Setting Up Azure Cognitive Search with Sample Data\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFirst, you set up some sample data in Azure Storage. Next, you run the Import datawizard to create an enrichment pipeline that also generates a knowledge store. Theknowledge store contains original source content pulled from the data source (customerreviews of a hotel), plus AI-generated content that includes a sentiment label, keyphrase extraction, and text translation of non-English customer comments.\r\nBefore you begin, have the following prerequisites in place:An Azure account with an active subscription. Create an account for free.Azure Cognitive Search. Create a service or find an existing service in youraccount. You can use a free service for this quickstart.Azure Storage. Create an account or find an existing account. The account typemust be StorageV2 (general purpose V2).Sample data hosted in Azure Storage:Download HotelReviews_Free.csv. This CSV contains 19 pieces of customerfeedback about a single hotel (originates from Kaggle.com). The file is in a repowith other sample data.\r\nIf you don\u0027t want the whole repo, copy the raw contentand paste it into a spreadsheet app on your device.Upload the file to a blob container in Azure Storage.This quickstart also uses Cognitive Services for AI enrichment. Because the workload isso small, Cognitive Services is tapped behind the scenes for free processing for up to 20transactions.\r\nThis means that you can complete this exercise without having to create anextra Cognitive Services resource.PrerequisitesStart the wizard1. Sign in to the Azure portal with your Azure account.2. Find your search service and on the Overview page, select Import data on thecommand bar to create a knowledge store in four steps. Because the data is multiple rows in one CSV file, set the parsing mode to get one searchdocument for each row.1. In Connect to your data, choose Azure Blob Storage.2. For the Name, enter \u0022hotel-reviews-ds\u0022.3. For Data to extract, choose Content and Metadata.4. For Parsing mode, select Delimited text, and then select the First Line ContainsHeader checkbox.\n"
}