{
  "Id": "1353",
  "Title": "\u0022Setting Up Application Insights for Search Traffic Analytics\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSelect an existing Application Insights resource or create one if you don\u0027t have onealready. If you use the Search Traffic Analytics page, you can copy the instrumentationkey your application needs to connect to Application Insights.Once you have an Application Insights resource, you can follow instructions forsupported languages and platforms to register your app. Registration is simply addingthe instrumentation key from Application Insights to your code, which sets up theassociation. You can find the key in the portal, or from the Search Traffic Analytics pagewhen you select an existing resource.\r\nAdd search traffic analytics1 - Set up Application InsightsA shortcut that works for some Visual Studio project types is reflected in the followingsteps. It creates a resource and registers your app in just a few clicks.1. For Visual Studio and ASP.NET development, open your solution and select Project\u003E Add Application Insights Telemetry.2. Click Get Started.3.\r\nRegister your app by providing a Microsoft account, Azure subscription, and anApplication Insights resource (a new resource is the default). Click Register.At this point, your application is set up for application monitoring, which means all pageloads are tracked with default metrics. For more information about the previous steps,see Enable Application Insights server-side telemetry.\r\nThis step is where you instrument your own search application, using the ApplicationInsights resource your created in the step above. There are four steps to this process,starting with creating a telemetry client.Create an object that sends events to Application Insights. You can add instrumentationto your server-side application code or client-side code running in a browser, expressedhere as C# and JavaScript variants (for other languages, see the complete list ofsupported platforms and frameworks. Choose the approach that gives you the desireddepth of information. Server-side telemetry captures metrics at the application layer, for example inapplications running as a web service in the cloud, or as an on-premises app on acorporate network. Server-side telemetry captures search and click events, the positionof a document in results, and query information, but your data collection will be scopedto whatever information is available at that layer.\n"
}