{
  "Id": "324",
  "Title": "\u0022Setting Up Azure Search and Storage: A Step-by-Step Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can use the free search service for this tutorial. A free search service limits youto three indexes, three indexers, and three data sources. This tutorial creates one ofeach. Before starting, make sure you have room on your service to accept the newresources.Download files1 - Create servicesStart with Azure StorageResource group.\r\nSelect an existing one or create a new one, but use thesame group for all services so that you can manage them collectively.Storage account name. If you think you might have multiple resources of thesame type, use the name to disambiguate by type and region, for exampleblobstoragewestus.Location.\r\nIf possible, choose the same location used for Azure AI Search andAzure AI services. A single location voids bandwidth charges.Account Kind. Choose the default, StorageV2 (general purpose v2).4. Select Review \u002B Create to create the service.5. Once it\u0027s created, select Go to the resource to open the Overview page.6. Select Blobs service.7.\r\nSelect \u002B Container to create a container and name it cog-search-demo.8. Select cog-search-demo and then select Upload to open the folder where yousaved the download files. Select all of the non-image files. You should have 14 files.Select OK to upload.9. Before you leave Azure Storage, get a connection string so that you can formulatea connection in Azure AI Search.a.\r\nBrowse back to the Overview page of your storage account (we usedblobstragewestus as an example).b. In the left navigation pane, select Access keys and copy one of the connectionstrings.The connection string is a URL similar to the following example:HTTP10. Save the connection string to Notepad. You\u0027ll need it later when setting up thedata source connection. AI enrichment is backed by Azure AI services, including Language service and Azure AIVision for natural language and image processing. If your objective was to complete anactual prototype or project, you would at this point provision Azure AI services (in thesame region as Azure AI Search) so that you can attach it to indexing operations.\n"
}