{
  "Id": "287",
  "Title": "\u0022Setting Up Azure Cognitive Search and AI Enrichment Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSelect Review \u002B Create to create the service.5. Once it\u0027s created, select Go to the resource to open the Overview page.6. Select Blobs service.7. Select \u002B Container to create a container and name it cog-search-demo.8. Select cog-search-demo and then select Upload to open the folder where yousaved the download files. Select all of the files. Select Upload.9.\r\nBefore you leave Azure Storage, get a connection string so that you can formulatea connection in Azure Cognitive Search.a. Browse back to the Overview page of your storage account (we usedblobstragewestus as an example).b. In the left navigation pane, select Access keys and copy one of the connectionstrings.The connection string is a URL similar to the following example:HTTP10. Save the connection string to Notepad. You\u0027ll need it later when setting up thedata source connection.AI enrichment is backed by Azure AI services, including Language service and Azure AIVision for natural language and image processing.\r\nIf your objective was to complete anactual prototype or project, you would at this point provision Azure AI services (in thesame region as Azure Cognitive Search) so that you can attach it to indexing operations.For this exercise, however, you can skip resource provisioning because Azure CognitiveSearch can connect to Azure AI services behind the scenes and give you 20 freetransactions per indexer run.\r\nSince this tutorial uses 14 transactions, the free allocation issufficient. For larger projects, plan on provisioning Azure AI services at the pay-as-you-go S0 tier. For more information, see Attach Azure AI services.The third component is Azure Cognitive Search, which you can create in the portal orfind an existing search service in your subscription. You can use the Free tier to complete this walkthrough.To interact with your Azure Cognitive Search service you will need the service URL andan access key.1. Sign in to the Azure portal, and in your search service Overview page, get thename of your search service. You can confirm your service name by reviewing theendpoint URL.\n"
}