{
  "Id": "309",
  "Title": "\u0022Setting Up Azure AI Services and Search: A Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe connection string is a URL similar to the following example:HTTP10. Save the connection string to Notepad. You\u0027ll need it later when setting up thedata source connection.AI enrichment is backed by Azure AI services, including Language service and Azure AIVision for natural language and image processing.\r\nIf your objective was to complete anactual prototype or project, you would at this point provision Azure AI services (in thesame region as Azure AI Search) so that you can attach it to a skillset.For this exercise, however, you can skip resource provisioning because Azure AI Searchcan connect to Azure AI services execute 20 transactions per indexer run, free of charge.\r\nSince this tutorial uses 14 transactions, the free allocation is sufficient. For largerprojects, plan on provisioning Azure AI services at the pay-as-you-go S0 tier.The third component is Azure AI Search, which you can create in the portal or find anexisting search service in your subscription.\r\nYou can use the Free tier to complete this walkthrough.To interact with your Azure AI Search service you\u0027ll need the service URL and an accesskey.1. Sign in to the Azure portal, and in your search service Overview page, get thename of your search service. You can confirm your service name by reviewing theendpoint URL.\r\nIf your endpoint URL were https://mydemo.search.windows.net, yourservice name would be mydemo.2. In Settings \u003E Keys, get an admin key for full rights on the service. You can copyeither the primary or secondary key.DefaultEndpointsProtocol=https;AccountName=cogsrchdemostorage;AccountKey=\u003Cyour account key\u003E;EndpointSuffix=core.windows. netAzure AI servicesAzure AI SearchCopy an admin api-key and URL for Azure AI SearchAll HTTP requests to a search service require an API key. A valid key establishes trust, ona per request basis, between the application sending the request and the service thathandles it.1. Start Postman, import the collection, and set up the environment variables.\n"
}