{
  "Id": "1099",
  "Title": "\u0022Setting Up Azure AI Search Service: Key Variables and Prerequisites\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfVariableWhere to get itadmin-keyOn the Keys page of the Azure AI Search service.api-versionLeave as 2020-06-30.datasource-nameLeave as hotel-reviews-ds.indexer-nameLeave as hotel-reviews-ixr.index-nameLeave as hotel-reviews-ix.search-service-nameThe name of the Azure AI Search service. If the URL ishttps://mySearchService.\r\nsearch.windows.net, the value you should enter ismySearchService.skillset-nameLeave as hotel-reviews-ss.storage-account-nameThe Azure storage account name.storage-connection-stringUse the storage account\u0027s connection string from Access Keys or paste in aconnection string that references a managed identity.\r\nVariableWhere to get itstorage-container-nameLeave as hotel-reviews.Knowledge stores are defined in skillsets, which are in turn attached to indexers.Creating a knowledge store requires that you create all of the upstream objects,including an index, data source, skillset, and indexer. Although an index is unrelated to aknowledge store, an indexer requires it for execution, so you create one as an indexerprerequisite.When you create a knowledge store, you issue four HTTP requests:PUT request to create the index: This index contains searchable data returned inquery requests issued to your search service.\r\nPOST request to create the datasource: This data source provides connectioninformation to the indexer. The indexer connects to your Azure Storage account toretrieve the sample data.PUT request to create the skillset: The skillset specifies the enrichments that areapplied to your data. It also specifies the structure of the knowledge store. PUT request to create the indexer: Running the indexer reads the data, applies theskillset, creates the knowledge store in Azure Storage, and saves the results. Youmust run this request last.The variables you set up earlier are used in the headers and URL. The followingscreenshot for the Create Index request shows where these variables appear in therequest.\n"
}