{
  "Id": "248",
  "Title": "\u0022Setting Up Azure SQL Database and Cognitive Search Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis tutorial creates one of each.Before starting, make sure you have room on your service to accept the newresources.Download files1 - Create servicesand resource group for proximity and manageability. In practice, Azure SQL Databasecan be in any region.In this step, create an external data source on Azure SQL Database that an indexer cancrawl. You can use the Azure portal and the hotels.\r\nsql file from the sample download tocreate the dataset in Azure SQL Database. Azure Cognitive Search consumes flattenedrowsets, such as one generated from a view or query. The SQL file in the sample solutioncreates and populates a single table.If you have an existing Azure SQL Database resource, you can add the hotels table to it,starting at step 4.\r\n1. Sign in to the Azure portal.2. Find or create a SQL Database. You can use defaults and the lowest level pricingtier. One advantage to creating a server is that you can specify an administratoruser name and password, necessary for creating and loading tables in a later step.Start with Azure SQL Database3.\r\nSelect Review \u002B create to deploy the new server and database. Wait for the serverand database to deploy. Go to the resource.4. On the navigate pane, select Getting started and then select Configure to allowaccess.5. Under Public access, click Selected networks.6. Under Firewall rules, add your client IPv4 address. This is the portal client.\r\n7. Under Exception, select Allow Azure services and resources to access this server.8. Save your changes and then close the Networking page.9. On the navigation pane, select Query editor (preview) and enter the user nameand password of server admin.You\u0027ll probably get an access denied error. Copy the client IP address from theerror message. Return to the firewall rules page to add a rule that allows accessfrom your client.10. In Query editor, select Open query and navigate to the location of hotels.sql file onyour local computer.11. Select the file and select Open. The script should look similar to the followingscreenshot:12. Select Run to execute the query.\n"
}