{
  "Id": "242",
  "Title": "\u0022Setting Up Azure Resources for Invoice Processing with Python\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfReplace the placeholderswith endpoints and access keys for each resource. No other modifications are required,so run the code when you\u0027re ready.This code imports multiple packages and sets up access to the Azure resources used inthis workflow.Python2 - Set up dependenciesimport osfrom pyspark.sql.\r\nfunctions import udf, trim, split, explode, col, monotonically_increasing_id, litfrom pyspark.sql.types import StringTypefrom synapse.ml.core.spark import FluentAPIcognitive_services_key = \u0022placeholder-cognitive-services-multi-service-key\u0022Paste the following code into the second cell. No modifications are required, so run thecode when you\u0027re ready.\r\nThis code loads a few external files from an Azure storage account that\u0027s used for demopurposes. The files are various invoices, and they\u0027re read into a data frame.PythonPaste the following code into the third cell. No modifications are required, so run thecode when you\u0027re ready.This code loads the AnalyzeInvoices transformer and passes a reference to the dataframe containing the invoices.\r\nIt calls the pre-built invoice model of Azure AI DocumentIntelligence to extract information from the invoices.Pythoncognitive_services_region = \u0022placeholder-cognitive-services-region\u0022search_service = \u0022placeholder-search-service-name\u0022search_key = \u0022placeholder-search-service-api-key\u0022search_index = \u0022placeholder-search-index-name\u00223 - Load data into Sparkdef blob_to_url(blob):    [prefix, postfix] = blob.\r\nsplit(\u0022@\u0022)    container = prefix.split(\u0022/\u0022)[-1]    split_postfix = postfix.split(\u0022/\u0022)    account = split_postfix[0]    filepath = \u0022/\u0022.join(split_postfix[1:])    return \u0022https://{}/{}/{}\u0022.format(account, container, filepath)df2 = (spark. read.format(\u0022binaryFile\u0022)    .load(\u0022wasbs://ignite2021@mmlsparkdemo.blob.core.windows.net/form_subset/*\u0022)    .select(\u0022path\u0022)    .limit(10)    .select(udf(blob_to_url, StringType())(\u0022path\u0022).alias(\u0022url\u0022))    .cache())    display(df2)4 - Add document intelligenceThe output from this step should look similar to the next screenshot.\n"
}