{
  "Id": "839",
  "Title": "\u0022Setting Up Indexer Connection to Azure Storage with Managed Identity\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis behavior allows indexing to continue forJSON blobs that have a different schema (which is a common use case). Becausethere is no validation check, check the mappings carefully for typos so that youaren\u0027t losing documents for the wrong reason.\r\nNext stepsHow to index CSV blobs with a blob indexerTutorial: Search semi-structured data from Azure Blob StorageSet up an indexer connection to AzureStorage using a managed identityArticle•10/11/2023This article explains how to set up an indexer connection to an Azure Storage accountusing a managed identity instead of providing credentials in the connection string.You can use a system-assigned managed identity or a user-assigned managed identity(preview).\r\nManaged identities are Microsoft Entra logins and require Azure roleassignments to access data in Azure Storage.Create a managed identity for your search service.Assign a role in Azure Storage:Choose Storage Blob Data Reader for data read access in Blob Storage andADLS Gen2.Choose Reader and Data for data read access in Table Storage and File Storage.You should be familiar with indexer concepts and configuration.７ NoteIf storage is network-protected and in the same region as your search service, youmust use a system-assigned managed identity and either one of the followingnetwork options: connect as a trusted service, or connect using the resourceinstance rule. Prerequisites TipFor a code example in C#, see Index Data Lake Gen2 using Microsoft Entra IDon GitHub.Create the data sourceCreate the data source and provide either a system-assigned managed identity or auser-assigned managed identity (preview).The REST API, Azure portal, and the .NET SDK support using a system-assignedmanaged identity.When you\u0027re connecting with a system-assigned managed identity, the only change tothe data source definition is the format of the \u0022credentials\u0022 property. You\u0027ll provide aResourceId that has no account key or password.\n"
}