{
  "Id": "326",
  "Title": "\u0022Setting Up Azure AI Search with Python in Visual Studio Code\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfnetAzure AI servicesAzure AI SearchCopy an admin api-key and URL for Azure AI SearchAll requests require an api-key in the header of every request sent to your service. Avalid key establishes trust, on a per request basis, between the application sending therequest and the service that handles it.Use Visual Studio Code with the Python extension to create a new notebook.\r\nPress F1 toopen the command palette and then search for \u0022Create: New Jupyter Notebook\u0022.Alternatively, if you downloaded the notebook from Azure-Search-python-samplesrepo, you can open it in Visual Studio Code.In your notebook, create a new cell and add this script. It loads the libraries used forworking with JSON and formulating HTTP requests.\r\nPythonIn the next cell, define the names for the data source, index, indexer, and skillset. Runthis script to set up the names for this tutorial.\r\nPython2 - Start a notebookimport jsonimport requestsfrom pprint import pprint# Define the names for the data source, skillset, index and indexerdatasource_name = \u0022cogsrch-py-datasource\u0022In a third cell, paste the following script, replacing the placeholders for your searchservice (YOUR-SEARCH-SERVICE-NAME) and admin API key (YOUR-ADMIN-API-KEY),and then run it to set up the search service endpoint.PythonIn Azure AI Search, AI processing occurs during indexing (or data ingestion).\r\nThis part ofthe tutorial creates four objects: data source, index definition, skillset, indexer.A data source object provides the connection string to the Blob container containing thesample data files.In the following script, replace the placeholder YOUR-BLOB-RESOURCE-CONNECTION-STRING with the connection string for the blob you created in the previous step. Replacethe placeholder YOUR-BLOB-CONTAINER-NAME with the name of your container. Then,run the script to create a data source named cogsrch-py-datasource.Pythonskillset_name = \u0022cogsrch-py-skillset\u0022index_name = \u0022cogsrch-py-index\u0022indexer_name = \u0022cogsrch-py-indexer\u0022# Setup the endpointendpoint = \u0027https://\u003CYOUR-SEARCH-SERVICE-NAME\u003E.search.windows.\n"
}