{
  "Id": "849",
  "Title": "\u0022Setting Up Azure SQL Database Indexer Connection with Managed Identity\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022my-target-index\u0022    }TroubleshootingSee alsoIndexing via an Azure Cosmos DB for Apache GremlinSet up an indexer connection to AzureSQL using a managed identityArticle•09/20/2022This article explains how to set up an indexer connection to Azure SQL Database using amanaged identity instead of providing credentials in the connection string.\r\nYou can use a system-assigned managed identity or a user-assigned managed identity(preview). Managed identities are Azure Active Directory logins and require Azure roleassignments to access data in Azure SQL.Create a managed identity for your search service.Assign an Azure admin role on SQL. The identity used on the indexer connectionneeds read permissions. You must be an Azure AD admin with a server in SQLDatabase or SQL Managed Instance to grant read permissions on a database.You should be familiar with indexer concepts and configuration.Follow the below steps to assign the search service or user-assigned managed identitypermission to read the database.1.\r\nConnect to Visual StudioPrerequisites1 - Assign permissions to read the database2. Authenticate with your Azure AD account3. Execute the following commands:Include the brackets around your search service name or user-assigned managedidentity name.\r\nSQLIf you later change the search service identity or user-assigned identity after assigningpermissions, you must remove the role membership and remove the user in the SQLCREATE USER [insert your search service name here or user-assigned managed identity name] FROM EXTERNAL PROVIDER; EXEC sp_addrolemember \u0027db_datareader\u0027, [insert your search service name here or user-assigned managed identity name]; database, then repeat the permission assignment. Removing the role membership anduser can be accomplished by running the following commands:SQLIn this section you\u0027ll, give your Azure Cognitive Search service permission to read datafrom your SQL Server. For detailed steps, see Assign Azure roles using the Azure portal.1. In the Azure portal, navigate to your Azure SQL Server page.2. Select Access control (IAM).\n"
}