{
  "Id": "193",
  "Title": "\u0022Setting Up Azure Search in Visual Studio Code Tutorial\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn Visual Studio Code, open your local folder of the cloned repository. Theremaining tasks are accomplished from Visual Studio Code, unless specified.1. In Visual Studio Code, open the Activity bar, and select the Azure icon.2. Sign in to Azure, if you aren\u0027t already signed in.3. In the Resources section, select Add (\u002B), and then select Create Resource Group.\r\n4. Enter a resource group name, such as cognitive-search-demo-rg.5. Enter a region:For Node.js, select West US 2. This is the recommended region for the AzureFunction programming model (PM) v4 preview.For C# and Python, we recommend the following regions, supported byAzure Static Web Apps as of this writing: West US 2, East US 2, West Europe,Central US, East Asiagit clone https://github.\r\ncom/YOUR-GITHUB-ALIAS/azure-search-python-samplesCreate a resource group for your AzureresourcesUse this resource group for all resources created during this tutorial. A resource groupgives you a logical unit to manage the resources, including deleting them when you\u0027refinished.\r\nCreate a Search Index and load with documentsDeploy your Static Web AppNext steps2 - Create and load Search Index withPythonArticle•07/20/2023Continue to build your search-enabled website by following these steps:Create a search resourceCreate a new indexImport data with Python using the sample script and Azure SDK azure-search-documents.Create a new search resource from the command line using either the Azure CLI orAzure PowerShell. You also retrieve a query key used for read-access to the index, andget the built-in admin key used for adding objects.You must have Azure CLI or Azure PowerShell installed on your device. If you aren\u0027t alocal admin on your device, choose Azure PowerShell and use the Scope parameter torun as the current user.1. In Visual Studio Code, under Terminal, select New Terminal.2. Connect to Azure:Azure CLI3. Before creating a new search service, list the existing services for yoursubscription:Create an Azure Cognitive Search resource７ NoteThis task doesn\u0027t require the Visual Studio Code extensions for Azure CLI and AzurePowerShell.\n"
}