{
  "Id": "135",
  "Title": "\u0022Setting Up and Deploying Azure Search with GitHub Repository\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe sample code includes the following:AppPurposeGitHubRepositoryLocationClientReact app (presentation layer) to display books, withsearch. It calls the Azure Function app./search-website-functions-v4/clientServerAzure .NET Function app (business layer) - calls theAzure AI Search API using .NET SDK/search-website-functions-v4/apiBulkinsert.NET file to create the index and add documents to it.\r\n/search-website-functions-v4/bulk-insertInstall the following for your local development environment..NET 6GitVisual Studio Code and the following extensionsAzure Static Web AppUse the integrated terminal for command line operations.Optional:This tutorial doesn\u0027t run the Azure Function API locally but if you intend to run itlocally, you need to install azure-functions-core-tools.\r\nForking the sample repository is critical to be able to deploy the Static Web App. Theweb apps determine the build actions and deployment content based on your ownGitHub fork location. Code execution in the Static Web App is remote, with Azure StaticWeb Apps reading from the code in your forked sample.\r\n1. On GitHub, fork the sample repository.How is the sample organized?Set up your development environmentFork and clone the search sample with gitComplete the fork process in your web browser with your GitHub account. Thistutorial uses your fork as part of the deployment to an Azure Static Web App.2.\r\nAt a Bash terminal, download your forked sample application to your localcomputer.Replace YOUR-GITHUB-ALIAS with your GitHub alias.Bash3. At the same Bash terminal, go into your forked repository for this website searchexample:Bash4. Use the Visual Studio Code command, code . to open your forked repository. Theremaining tasks are accomplished from Visual Studio Code, unless specified.Bash1. In Visual Studio Code, open the Activity bar, and select the Azure icon.2. Sign in to Azure, if you aren\u0027t already signed in.3. In the Resources section, select Add (\u002B), and then select Create Resource Group.git clone https://github.\n"
}