{
  "Id": "1445",
  "Title": "\u0022Setting Up Shared Private Links for Azure Resources Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHowever, if you already set up a privateendpoint for Azure Storage, you should also set up a shared private link or theconnection is refused on the storage side. Also, if you\u0027re using multiple storage formatsfor various scenarios in search, make sure to create a separate shared private link foreach sub-resource. The Microsoft.\r\nDocumentDB/databaseAccounts resource type is used for indexerconnections to Azure Cosmos DB for NoSQL. The provider name and group ID are case-sensitive. The Microsoft.Web/sites resource type is used for App service and Azure functions. Inthe context of Azure Cognitive Search, an Azure function is the more likely scenario. AnAzure function is commonly used for hosting the logic of a custom skill.\r\nAzure FunctionSupported resource types1234123has Consumption, Premium and Dedicated App Service hosting plans. The App ServiceEnvironment (ASE) and Azure Kubernetes Service (AKS) aren\u0027t supported at this time. See Create a shared private link for a SQL Managed Instance for instructions.Use the Azure portal, Management REST API, the Azure CLI, or Azure PowerShell tocreate a shared private link.\r\nHere are a few tips:Give the private link a meaningful name. In the Azure PaaS resource, a sharedprivate link appears alongside other private endpoints. A name like \u0022shared-private-link-for-search\u0022 can remind you how it\u0027s used.When you complete the steps in this section, you have a shared private link that\u0027sprovisioned in a pending state.\r\nIt takes several minutes to create the link. Once it\u0027screated, the resource owner needs to approve the request before it\u0027s operational.1. Sign in to the Azure portal and find your search service.2. Under Settings on the left navigation pane, select Networking.3. On the Shared Private Access tab, select \u002B Add Shared Private Access. 4. Select either Connect to an Azure resource in my directory or Connect to anAzure resource by resource ID or alias.5. If you select the first option (recommended), the portal helps you pick theappropriate Azure resource and fills in other properties, such as the group IDof the resource and the resource type.\n"
}