{
  "Id": "250",
  "Title": "\u0022Setting Up Azure Cognitive Search and Indexers: Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfnet,1433;Initial Catalog=hotels-db;Persist Security Info=False;User ID={your_username};Password={your_password};MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30; Azure Cognitive SearchGet an admin api-key and URL for Azure Cognitive Search1. Start Visual Studio and open DotNetHowToIndexers.sln.2. In Solution Explorer, open appsettings.json to provide connection information.\r\n3. For SearchServiceEndPoint, if the full URL on the service overview page is\u0022https://my-demo-service.search.windows.net\u0022, then the value to provide is theentire URL.4. For AzureSqlConnectionString, the string format is similar to this: \u0022Server=tcp:{your_dbname}.database.windows.\r\nnet,1433;Initial Catalog=hotels-db;PersistSecurity Info=False;User ID={your_username};Password={your_password};MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;\u0022JSON5. Replace the user password in the SQL connection string to a valid password. Whilethe database and user names will copy over, the password must be enteredmanually.\r\nIndexers require a data source object and an index. Relevant code is in two files:hotel.cs, containing a schema that defines the indexProgram.\r\ncs, containing functions for creating and managing structures in yourserviceThe index schema defines the fields collection, including attributes specifying allowedoperations, such as whether a field is full-text searchable, filterable, or sortable as shown2 - Set up your environment{   \u0022SearchServiceEndPoint\u0022: \u0022\u003Cplaceholder-search-full-url\u003E\u0022,   \u0022SearchServiceAdminApiKey\u0022: \u0022\u003Cplaceholder-admin-key-for-search-service\u003E\u0022,   \u0022AzureSqlConnectionString\u0022: \u0022\u003Cplaceholder-ADO.NET-connection-string\u0022, } 3 - Create the pipelineIn hotel. csin the following field definition for HotelName. A SearchableField is full-text searchableby definition. Other attributes are assigned explicitly.C#A schema can also include other elements, including scoring profiles for boosting asearch score, custom analyzers, and other constructs. However, for our purposes, theschema is sparsely defined, consisting only of fields found in the sample datasets.The main program includes logic for creating an indexer client, an index, a data source,and an indexer. The code checks for and deletes existing resources of the same name,under the assumption that you might run this program multiple times.\n"
}