{
  "Id": "280",
  "Title": "\u0022Setting Up Azure Function Access to Key Vault\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAs part of setup, you\u0027ll also create an access policy that grantsDecryptBlobFile function access to the encryption key in Azure Key Vault.1. Click the Deploy to Azure button found on the DecryptBlobFile landing page,which will open the provided Resource Manager template within the Azure portal.2.\r\nChoose the same subscription where your Azure Key Vault instance exists (thistutorial will not work if you select a different subscription).3. Select an existing resource group or create a new one. A dedicated resource groupmakes cleanup easier later.4. Select Review \u002B create, make sure you agree to the terms, and then select Createto deploy the Azure Function.\r\n７ NoteSkillsets often require attaching an Azure AI multi-service resource. As written, thisskillset has no dependency on Azure AI services and thus no key is required. If youlater add enrichments that invoke built-in skills, remember to update your skillsetaccordingly.1 - Create services and collect credentialsDeploy the custom skill5. Wait for the deployment to finish.You should have an Azure Function app that contains the decryption logic and an AzureStorage resource that will store application data. In the next several steps, you\u0027ll give theapp permissions to access the key vault and collect information that you\u0027ll need for theREST calls.1.\r\nNavigate to your Azure Key Vault service in the portal. Create an access policy inthe Azure Key Vault that grants key access to the custom skill.2. On the left navigation pane, select Access policies, and then select \u002B Create tostart the Create an access policy wizard.Grant permissions in Azure Key Vault3. On the Permissions page under Configure from template, select Azure Data LakeStorage or Azure Storage.4. Select Next.5. On the Principal page, select the Azure Function instance that you deployed. Youcan search for it using the resource prefix that was used to create it in step 2,which has a default prefix value of psdbf-function-app.6. Select Next.7. On Review \u002B create, select Create.\n"
}