{
  "Id": "269",
  "Title": "\u0022Setting Up Azure Blob Storage and AI Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou\u0027ll need this valuefor appsettings.json in a later step. If you didn\u0027t use the suggested database name\u0022hotel-rooms-db\u0022, copy the database name as well.1. Sign in to the Azure portal, navigate to your Azure storage account, select Blobs,and then select \u002B Container.2. Create a blob container named hotel-rooms to store the sample hotel room JSONfiles.\r\nYou can set the Public Access Level to any of its valid values.3. After the container is created, open it and select Upload on the command bar.Navigate to the folder containing the sample files. Select all of them and thenselect Upload.Azure Blob Storage4. Copy the storage account name and a connection string from the Access Keyspage into Notepad.\r\nYou\u0027ll need both values for appsettings.json in a later step.The third component is Azure AI Search, which you can create in the portal or find anexisting search service in your Azure resources.To authenticate to your search service, you\u0027ll need the service URL and an access key.1.\r\nSign in to the Azure portal, and in your search service Overview page, get theURL. An example endpoint might look like https://mydemo.search.windows.net.2. In Settings \u003E Keys, get an admin key for full rights on the service. There are twointerchangeable admin keys, provided for business continuity in case you need toroll one over.\r\nYou can use either the primary or secondary key on requests foradding, modifying, and deleting objects.Azure AI SearchCopy an admin api-key and URL for Azure AI SearchHaving a valid key establishes trust, on a per request basis, between the applicationsending the request and the service that handles it.1. Start Visual Studio and in the Tools menu, select NuGet Package Manager andthen Manage NuGet Packages for Solution....2. In the Browse tab, find and then install Azure.Search.Documents (version 11.0 orlater).3. Search for the Microsoft.Extensions.Configuration andMicrosoft.Extensions.Configuration.Json NuGet packages and install them as well.4.\n"
}