{
  "Id": "1097",
  "Title": "\u0022Setting Up Azure Storage and Postman for Hotel Reviews\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis CSV contains 19 pieces of customerfeedback about a single hotel (originates from Kaggle.com). The file is in a repowith other sample data. If you don\u0027t want the whole repo, copy the raw contentand paste it into a spreadsheet app on your device.2. In Azure portal, on the Azure Storage resource page, use Storage Browser tocreate a blob container named hotel-reviews.\r\n3. Select Upload at the top of the page to load the HotelReviews-Free.csv file youdownloaded from the previous step.During skillset execution, the indexer connects to Azure Storage and creates theknowledge store. The connection information is specified in the \u0022knowledgeStore\u0022section of the skillset.\r\nYou can choose from the following approaches when setting upyour connection:Option 1: Obtain a full access Azure Storage connection string that includes anaccess key:In the Azure Storage portal page, select Access Keys on the left navigation pane.In Access Keys, select Show Keys at the top of the page to unhide the connectionstrings, and then copy the connection string for either key1 or key2.\r\nA full access connection string has the following format:Decide on a connection strategyJSONOption 2: Use your search service\u0027s system managed identity or user-assignedmanaged identity to connect to Azure Storage. Follow the instructions andexamples in Connect using a managed identity.\r\nYou need to set up the managedidentity, assign roles, and assemble a connection string.A connection string for a system managed identity has the following format:JSONOnce you decide on an approach, you\u0027ll provide the connection string as a variable inthe Postman collection, as described in the next step.1. Download the azure-search-postman-samples from GitHub and unzip the file.There are multiple collections in the repo. You use the collection in the knowledge-store folder.2. In Postman, select File \u003E Import to import theKnowledgeStore.postman_collection.json file.3. Select the Collections tab, and then select the ... (ellipsis) button.4. Select Edit.\n"
}