{
  "Id": "257",
  "Title": "\u0022Setting Up Azure AI Search: Key, URL, and Requests\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe next resource is Azure AI Search, which you can create in the portal. You can use theFree tier to complete this walkthrough.As with Azure Blob Storage, take a moment to collect the access key. Further on, whenyou begin structuring requests, you will need to provide the endpoint and admin api-key used to authenticate each request.\r\nREST calls require the service URL and an access key on every request. A search service iscreated with both, so if you added Azure AI Search to your subscription, follow thesesteps to get the necessary information:1. Sign in to the Azure portal, and in your search service Overview page, get theURL. An example endpoint might look like https://mydemo.\r\nsearch.windows.net.Azure AI SearchGet a key and URL2. In Settings \u003E Keys, get an admin key for full rights on the service. There are twointerchangeable admin keys, provided for business continuity in case you need toroll one over. You can use either the primary or secondary key on requests foradding, modifying, and deleting objects.\r\nAll requests require an api-key on every request sent to your service. Having a valid keyestablishes trust, on a per request basis, between the application sending the requestand the service that handles it.Start Postman and set up an HTTP request. If you are unfamiliar with this tool, seeCreate a search index using REST APIs.\r\nThe request methods for every call in this tutorial are POST and GET. You\u0027ll make threeAPI calls to your search service to create a data source, an index, and an indexer. Thedata source includes a pointer to your storage account and your JSON data. Your searchservice makes the connection when loading the data. In Headers, set \u0022Content-type\u0022 to application/json and set api-key to the admin api-key of your Azure AI Search service. Once you set the headers, you can use them forevery request in this exercise.2 - Set up PostmanURIs must specify an api-version and each call should return a 201 Created.\n"
}