{
  "Id": "310",
  "Title": "\u0022Setting Up Azure AI Search with Postman: A Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfnetAzure AI servicesAzure AI SearchCopy an admin api-key and URL for Azure AI SearchAll HTTP requests to a search service require an API key. A valid key establishes trust, ona per request basis, between the application sending the request and the service thathandles it.1. Start Postman, import the collection, and set up the environment variables.\r\nIfyou\u0027re unfamiliar with this tool, see Explore Azure AI Search REST APIs.2. You\u0027ll need to provide a search service name, an admin API key, an index name, aconnection string to your Azure Storage account, and the container name.2 - Set up PostmanThe request methods used in this collection are PUT and GET.\r\nYou\u0027ll use the methods tocreate a data source, a skillset, an index, and an indexer.In Azure AI Search, enrichment occurs during indexing (or data ingestion). This part ofthe walkthrough creates four objects: data source, index definition, skillset, indexer.Call Create Data Source to set the connection string to the Blob container containingthe sample data files.\r\n1. Select the \u0022Create a data source\u0022 request.2. The body of the request is JSON and includes properties of an indexer data sourceobject. The connection string includes credentials for accessing the service.JSON3 - Create the pipelineStep 1: Create a data source{    \u0022description\u0022 : \u0022Demo files to demonstrate Azure AI Search capabilities.\r\n\u0022,    \u0022type\u0022 : \u0022azureblob\u0022,    \u0022credentials\u0022 : {       \u0022connectionString\u0022: \u0022{{azure_storage_connection_string}}\u0022    },  \u0022container\u0022 : {3. Send the request. You should see a status code of 201 confirming success.If you got a 403 or 404 error, check the search admin API key and the Azure Storageconnection string. Call Create Skillset to specify which enrichment steps are applied to your content.1. Select the \u0022Create a skillset\u0022 request.2. The body of the request specifies the following built-in skills:SkillDescriptionOpticalCharacterRecognitionRecognizes text and numbers in image files.\n"
}