{
  "Id": "1127",
  "Title": "\u0022Shaping and Projection in Azure Search: Detailed Examples and Steps\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf the source of a projection is/document/projectionShape/keyPhrases, the key phrases array is projected as asingle object/row. Instead, set the source path to/document/projectionShape/keyPhrases/* to yield a single row or object for each ofthe key phrases.Path syntax errors. Path selectors are case-sensitive and can lead to missing inputwarnings if you don\u0027t use the exact case for the selector.The next step walks you through shaping and projection of output from a rich skillset. Ifyour skillset is complex, the following article provides examples of both shapes andprojections.\r\nNext stepsDetailed example of shapes and projectionsDetailed example of shapes andprojections in a knowledge storeArticle•03/24/2023This article provides a detailed example that supplements high-level concepts andsyntax-based articles by walking you through the shaping and projection steps requiredfor fully expressing the output of a rich skillset in a knowledge store.If your application requirements call for multiple skills and projections, this example cangive you a better idea of how shapes and projections intersect.This example uses Postman app and the Search REST APIs.Clone or download azure-search-postman-samples on GitHub and import theProjections collection to step through this example yourself.\r\nSample documents aren\u0027t included with the Projections collection, but the AI enrichmentdemo data files from the azure-search-sample-data repo contain text and images,and will work with the projections described in this example.Create a blob container in Azure Storage and upload all 14 items.While in Azure Storage, copy a connection string so that you can specify it in thePostman collection. To understand the dependency between shapes and projections, review the followingskillset that creates enriched content. This skillset processes both raw images and text,producing outputs that will be referenced in shapes and projections.Pay close attention to skill outputs (targetNames). Outputs written to the enricheddocument tree are referenced in projections and in shapes (via Shaper skills).\n"
}