{
  "Id": "1120",
  "Title": "\u0022Shaping Methodology and Table Projections in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfComplex shapes are created through a shapingmethodology, either a Shaper skill or an inline shaping definition, but usually a Shaperskill. The fields or elements of the shape determine the fields in containers and tables.Shaper skills are favored because it outputs JSON, where as most skills don\u0027t outputvalid JSON on their own. In many cases, the same data shape created by a Shaper skillcan be used equally by both table and object projections.Given source input requirements, knowing how to shape data becomes a practicalrequirement for projection definition, especially if you\u0027re working with tables.\r\nTable projections are recommended for scenarios that call for data exploration, such asanalysis with Power BI or workloads that consume data frames. The tables section of aprojections array is a list of tables that you want to project.To define a table projection, use the tables array in the projections property.\r\nA tableprojection has three required properties:PropertyDescriptiontableNameDetermines the name of a new table created in Azure Table Storage.generatedKeyNameColumn name for the key that uniquely identifies each row. The value issystem-generated. If you omit this property, a column will be createdautomatically that uses the table name and \u0022key\u0022 as the namingconvention.sourceA path to a node in an enrichment tree.\r\nThe node should be a reference toa complex shape that determines which columns are created in the table.In table projections, \u0022source\u0022 is usually the output of a Shaper skill that defines theshape of the table. Tables have rows and columns, and shaping is the mechanism byDefine a table projectionwhich rows and columns are specified. You can use a Shaper skill or inline shapes. TheShaper skill produces valid JSON, but the source could be the output from any skill, ifvalid JSON.The schema of a table is specified partly by the projection (table name and key), andalso by the source that provides the shape of table (columns).\n"
}