{
  "Id": "978",
  "Title": "\u0022Soft-Delete Technique for Logical Row Deletion in Azure MySQL\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThesolution is to use a soft-delete technique to logically delete rows without removing themfrom the table. Add a column to your table or view and mark rows as deleted using thatcolumn.POST https://[search service name].search.windows.\r\nnet/datasources?api-version=2020-06-30-Preview Content-Type: application/json api-key: [admin key]     {         \u0022name\u0022 : \u0022[Data source name]\u0022,         \u0022type\u0022 : \u0022mysql\u0022,         \u0022credentials\u0022 : { \u0022connectionString\u0022 : \u0022[connection string]\u0022 },         \u0022container\u0022 : { \u0022name\u0022 : \u0022[table or view name]\u0022 },         \u0022dataChangeDetectionPolicy\u0022 : {             \u0022@odata.\r\ntype\u0022 : \u0022#Microsoft.Azure.Search.HighWaterMarkChangeDetectionPolicy\u0022,             \u0022highWaterMarkColumnName\u0022 : \u0022[last_updated column name]\u0022         }     } ） ImportantIf you\u0027re using a view, you must set a high water mark policy in your indexer datasource.If the source table does not have an index on the high water mark column, queriesused by the MySQL indexer might time out.\r\nIn particular, the ORDER BY [High WaterMark Column] clause requires an index to run efficiently when the table containsmany rows.Indexing deleted rowsGiven a column that provides deletion state, an indexer can be configured to removeany search documents for which deletion state is set to true.\r\nThe configurationproperty that supports this behavior is a data deletion detection policy, which isspecified in the data source definition as follows:HTTPThe softDeleteMarkerValue must be a string. For example, if you have an integer columnwhere deleted rows are marked with the value 1, use \u00221\u0022. If you have a BIT columnwhere deleted rows are marked with the Boolean true value, use the string literal Trueor true (the case doesn\u0027t matter). You can now run the indexer, monitor status, or schedule indexer execution. Thefollowing articles apply to indexers that pull content from Azure MySQL:Index large data setsIndexer access to content protected by Azure network security features{     …,     \u0022dataDeletionDetectionPolicy\u0022 : {         \u0022@odata.\n"
}