{
  "Id": "716",
  "Title": "\u0022Strategies for Indexing Large Data Sets in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfsearch.windows.net/indexes/hotels-sample-index/docs/index?api-version=2020-06-30 Content-Type: application/json   api-key: [admin key]  {     \u0022value\u0022: [       {         \u0022@search.action\u0022: \u0022delete\u0022,         \u0022id\u0022: \u00221111\u0022       }     ]   } See alsoIndex large data sets in Azure AI SearchArticle•11/15/2023If your search solution requirements include indexing big data or complex data, thisarticle describes the strategies for accommodating long running processes on Azure AISearch.\r\nThis article assumes familiarity with the two basic approaches for importing data:pushing data into an index, or pulling in data from a supported data source using asearch indexer.\r\nThe strategy you choose will be determined by the indexing approachyou\u0027re already using. If your scenario involves computationally intensive AI enrichment,then your strategy must include indexers, given the skillset dependency on indexers.This article complements Tips for better performance, which offers best practices onindex and query design. A well-designed index that includes only the fields andattributes you need is an important prerequisite for large-scale indexing.\u0022Push\u0022 APIs, such as Add Documents REST API or the IndexDocuments method (AzureSDK for .NET), are the most prevalent form of indexing in Azure AI Search.\r\nFor solutionsthat use a push API, the strategy for long-running indexing will have one or both of thefollowing components:Batching documentsManaging threadsA simple mechanism for indexing a large quantity of data is to submit multipledocuments or records in a single request. As long as the entire payload is under 16 MB,a request can handle up to 1000 documents in a bulk upload operation. These limitsapply whether you\u0027re using the Add Documents REST API or the IndexDocuments７ NoteThe strategies described in this article assume a single large data source. If yoursolution requires indexing from multiple data sources, see Index multiple datasources in Azure AI Search for a recommended approach.\n"
}