{
  "Id": "771",
  "Title": "\u0022Text Tokenization and Normalization in Multilingual Search Engines\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfdictionary_decompounderDictionaryDecompounderTokenFilterDecomposes compoundwords found in manyGermanic languages.OptionswordList (type: string array) -The list of words to matchagainst. The default is anempty list. Required.minWordSize (type: int) -Only words longer than thiswill be processed. Thedefault is 5.minSubwordSize (type: int) -Only subwords longer thanthis will be outputted.\r\nThedefault is 2.maxSubwordSize (type: int) -Only subwords shorter thanthis will be outputted. Thedefault is 15.onlyLongestMatch (type:bool) - Add only the longestmatching subword tooutput. The default is false.edgeNGram_v2EdgeNGramTokenFilterV2Generates n-grams of thegiven size(s) from startingfrom the front or the back ofan input token.\r\n1token_filter_nametoken_filter_type Description and OptionsOptionsminGram (type: int) -Default: 1, maximum: 300.maxGram (type: int) -Default: 2, maximum 300.Must be greater thanminGram.side (type: string) - Specifieswhich side of the input then-gram should be generatedfrom. Allowed values: front,backelisionElisionTokenFilterRemoves elisions.\r\nForexample, l\u0027avion (theplane) is converted to avion(plane).Optionsarticles (type: string array) -A set of articles to remove.The default is an empty list.If there\u0027s no list of articlesset, by default all Frencharticles are removed.german_normalization(type applies only when options areavailable)Normalizes Germancharacters according to theheuristics of the German2snowball algorithm . hindi_normalization(type applies only when options areavailable)Normalizes text in Hindi toremove some differences inspelling variations.indic_normalizationIndicNormalizationTokenFilterNormalizes the Unicoderepresentation of text inIndian languages.keepKeepTokenFilterA token filter that only keepstokens with text contained inspecified list of words.Options1token_filter_nametoken_filter_type Description and OptionskeepWords (type: stringarray) - A list of words tokeep. The default is anempty list. Required.keepWordsCase (type: bool)- If true, lower case all wordsfirst. The default is false.\n"
}