{
  "Id": "1741",
  "Title": "\u0022Text Merge Skill Parameters and Usage Scenarios in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfMicrosoft.Skills.Text.MergeSkillParameters are case-sensitive.ParameternameDescriptioninsertPreTagString to be included before every insertion. The default value is \u0022 \u0022. To omitthe space, set the value to \u0022\u0022.insertPostTagString to be included after every insertion. The default value is \u0022 \u0022. To omit thespace, set the value to \u0022\u0022.Input nameDescriptionitemsToInsertArray of strings to be merged.text(optional) Main text body to be inserted into. If text is not provided, elementsof itemsToInsert will be concatencated.offsets(optional) Array of positions within text where itemsToInsert should beinserted.\r\nIf provided, the number of elements of text must equal the number ofelements of textToInsert. Otherwise all items will be appended at the end oftext.７ NoteThis skill isn\u0027t bound to Azure AI services. It is non-billable and has no Azure AIservices key requirement.@odata.typeSkill parametersSkill inputsOutput nameDescriptionmergedTextThe resulting merged text.\r\nmergedOffsetsArray of positions within mergedText where elements of itemsToInsert wereinserted.A JSON document providing usable input for this skill could be:JSONThis example shows the output of the previous input, assuming that the insertPreTag isset to \u0022 \u0022, and insertPostTag is set to \u0022\u0022.\r\nJSONSkill outputsSample input{  \u0022values\u0022: [    {      \u0022recordId\u0022: \u00221\u0022,      \u0022data\u0022:      {        \u0022text\u0022: \u0022The brown fox jumps over the dog\u0022,        \u0022itemsToInsert\u0022: [\u0022quick\u0022, \u0022lazy\u0022],        \u0022offsets\u0022: [3, 28]      }    }  ]}Sample output{  \u0022values\u0022: [    {      \u0022recordId\u0022: \u00221\u0022,      \u0022data\u0022:      {        \u0022mergedText\u0022: \u0022The quick brown fox jumps over the lazy dog\u0022      }    }A common scenario for using Text Merge is to merge the textual representation ofimages (text from an OCR skill, or the caption of an image) into the content field of adocument.\nThe following example skillset uses the OCR skill to extract text from images embeddedin the document. Next, it creates a merged_text field to contain both original and OCRedtext from each image.\n"
}