{
  "Id": "791",
  "Title": "\u0022Text-Based Indexing with Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfpdf,.docx\u0022 } }. If the source isAzure SQL, you can set a query time out parameter.Field mappings are used to explicitly map source-to-destination fields if there arediscrepancies by name or type between a field in the data source and a field in thesearch index.\r\nIndexer example for text-based indexing{  \u0022name\u0022: (required) String that uniquely identifies the indexer,  \u0022description\u0022: (optional),  \u0022dataSourceName\u0022: (required) String indicating which existing data source to use,  \u0022targetIndexName\u0022: (required) String indicating which existing index to use,  \u0022parameters\u0022: {    \u0022batchSize\u0022:\r\nnull,    \u0022maxFailedItems\u0022: 0,    \u0022maxFailedItemsPerBatch\u0022: 0,    \u0022base64EncodeKeys\u0022: false,    \u0022configuration\u0022: {}  },  \u0022fieldMappings\u0022: (optional) unless field discrepancies need resolution,  \u0022disabled\u0022: null,  \u0022schedule\u0022: null,  \u0022encryptionKey\u0022: null}By default, an indexer runs immediately when you create it on the search service.\r\nIf youdon\u0027t want indexer execution, set \u0022disabled\u0022 to true when creating the indexer.You can also specify a schedule or set an encryption key for supplemental encryption ofthe indexer definition.Indexers also drive AI enrichment. All of the above properties and parameters for apply,but the following extra properties are specific to AI enrichment: \u0022skillSetName\u0022,\u0022cache\u0022, \u0022outputFieldMappings\u0022.\r\nJSONAI enrichment is its own subject area and is out of scope for this article. For moreinformation, start with AI enrichment, Skillsets in Azure Cognitive Search, Create askillset, Map enrichment output fields, and Enable caching for AI enrichment.Indexers work with data sets. When you run an indexer, it connects to your data source,retrieves the data from the container or folder, optionally serializes it into JSON beforepassing it to the search engine for indexing. This section describes the requirements ofincoming data for text-based indexing.\n"
}