{
  "Id": "1777",
  "Title": "\u0022Text Analytics API: Entity Extraction and Language Support\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDefault is falseInput nameDescriptionlanguageCodeOptional. Default is \u0022en\u0022.textThe text to analyze.Skill inputsSkill outputs７ NoteNot all entity categories are supported for all languages. The \u0022Person\u0022, \u0022Location\u0022,and \u0022Organization\u0022 entity category types are supported for the full list oflanguages above. Only de, en, es, fr, and zh-hans support extraction of \u0022Quantity\u0022,\u0022Datetime\u0022, \u0022URL\u0022, and \u0022Email\u0022 types.\r\nFor more information, see Language andregion support for the Text Analytics API.Output nameDescriptionpersonsAn array of strings where each string represents the name of a person.locationsAn array of strings where each string represents a location.organizationsAn array of strings where each string represents an organization.\r\nquantitiesAn array of strings where each string represents a quantity.dateTimesAn array of strings where each string represents a DateTime (as it appears in thetext) value.\r\nurlsAn array of strings where each string represents a URLemailsAn array of strings where each string represents an emailnamedEntitiesAn array of complex types that contains the following fields:categoryvalue (The actual entity name)offset (The location where it was found in the text)confidence (Higher value means it\u0027s more to be a real entity)entitiesAn array of complex types that contains rich information about the entitiesextracted from text, with the following fieldsname (the actual entity name. This represents a \u0022normalized\u0022 form)wikipediaIdwikipediaLanguagewikipediaUrl (a link to Wikipedia page for the entity)bingIdtype (the category of the entity recognized)subType (available only for certain categories, this gives a more granularview of the entity type)matches (a complex collection that contains)text (the raw text for the entity)offset (the location where it was found)length (the length of the raw entity text)JSONSample definition  {    \u0022@odata.\n"
}