{
  "Id": "1723",
  "Title": "\u0022Text Translation Skill in Azure AI Services: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf0,                                    \u0022neutral\u0022: 0.0,                                    \u0022negative\u0022: 1.0                                },                                \u0022offset\u0022: 72,                                \u0022length\u0022: 5,                                \u0022isNegated\u0022: false                            }                        ],                    }                ]            }        }    ]}Warning casesBuilt-in skillsHow to define a skillsetSee alsoText Translation cognitive skillArticle•11/15/2023The Text Translation skill evaluates text and, for each record, returns the text translatedto the specified target language.\r\nThis skill uses the Translator Text API v3.0 available inAzure AI services.This capability is useful if you expect that your documents may not all be in onelanguage, in which case you can normalize the text to a single language before indexingfor search by translating it. It\u0027s also useful for localization use cases, where you may wantto have copies of the same text available in multiple languages.The Translator Text API v3.0 is a non-regional Azure AI service, meaning that your dataisn\u0027t guaranteed to stay in the same region as your Azure AI Search or attached Azure AIservices resource.Microsoft.\r\nSkills.Text.TranslationSkillThe maximum size of a record should be 50,000 characters as measured byString.Length. If you need to break up your data before sending it to the text translationskill, consider using the Text Split skill. If you do use a text split skill, set the page lengthto 5000 for the best performance. ７ NoteThis skill is bound to Azure AI services and requires a billable resource fortransactions that exceed 20 documents per indexer per day. Execution of built-inskills is charged at the existing Azure AI services pay-as-you go price.When using this skill, all documents in the source are processed and billed fortranslation, even if the source and target languages are the same.\n"
}