{
  "Id": "1119",
  "Title": "\u0022Tips and Workflow for Azure Search Projection Definitions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfJSONIf you need more background before getting started, review this check list for tips andworkflow.\u0022knowledgeStore\u0022 : {     \u0022storageConnectionString\u0022: \u0022DefaultEndpointsProtocol=https;AccountName=\u003CAcct Name\u003E;AccountKey=\u003CAcct Key\u003E;\u0022,     \u0022projections\u0022: [       {         \u0022tables\u0022: [ ],         \u0022objects\u0022: [ ],         \u0022files\u0022: [ ]       }     ]  TipWhen developing projections, enable enrichment caching (preview) so that youcan reuse existing enrichments while editing projection definitions.\r\nEnrichmentcaching is a preview feature, so be sure to use the preview REST API (api-version=2020-06-30-preview or later) on the indexer request. Without caching,simple edits to a projection will result in a full reprocess of enriched content.\r\nBycaching the enrichments, you can iterate over projections without incurring anyskillset processing charges.RequirementsAll projections have source and destination properties. The source is always internalcontent from an enrichment tree created during skillset execution. The destination is thename and type of an external object that\u0027s created and populated in Azure Storage.Except for file projections, which only accept binary images, the source must be:Valid JSONA path to a node in the enrichment tree (for example, \u0022source\u0022:\u0022/document/objectprojection\u0022)While a node might resolve to a single field, a more common representation is areference to a complex shape. Complex shapes are created through a shapingmethodology, either a Shaper skill or an inline shaping definition, but usually a Shaperskill. The fields or elements of the shape determine the fields in containers and tables.Shaper skills are favored because it outputs JSON, where as most skills don\u0027t outputvalid JSON on their own. In many cases, the same data shape created by a Shaper skillcan be used equally by both table and object projections.Given source input requirements, knowing how to shape data becomes a practicalrequirement for projection definition, especially if you\u0027re working with tables.\n"
}