{
  "Id": "772",
  "Title": "\u0022Token Filters in Azure Search: Options and Descriptions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfhindi_normalization(type applies only when options areavailable)Normalizes text in Hindi toremove some differences inspelling variations.indic_normalizationIndicNormalizationTokenFilterNormalizes the Unicoderepresentation of text inIndian languages.keepKeepTokenFilterA token filter that only keepstokens with text contained inspecified list of words.Options1token_filter_nametoken_filter_type Description and OptionskeepWords (type: stringarray) - A list of words tokeep. The default is anempty list. Required.keepWordsCase (type: bool)- If true, lower case all wordsfirst. The default is false.\r\nkeyword_markerKeywordMarkerTokenFilterMarks terms as keywords.Optionskeywords (type: string array)- A list of words to mark askeywords. The default is anempty list. Required.ignoreCase (type: bool) - Iftrue, lower case all wordsfirst. The default is false.keyword_repeat(type applies only when options areavailable)Emits each incoming tokentwice once as keyword andonce as non-keyword.\r\nkstem(type applies only when options areavailable)A high-performance kstemfilter for English.lengthLengthTokenFilterRemoves words that are toolong or too short.Optionsmin (type: int) - Theminimum number. Default:0, maximum: 300.max (type: int) - Themaximum number.\r\nDefault:300, maximum: 300.limitMicrosoft.Azure.Search.LimitTokenFilterLimits the number of tokenswhile indexing.OptionsmaxTokenCount (type: int) -1token_filter_nametoken_filter_type Description and OptionsMax number of tokens toproduce. The default is 1.consumeAllTokens (type:bool) - Whether all tokensfrom the input must beconsumed even ifmaxTokenCount is reached. The default is false.lowercase(type applies only when options areavailable)Normalizes token text tolower case.nGram_v2NGramTokenFilterV2Generates n-grams of thegiven size(s).OptionsminGram (type: int) -Default: 1, maximum: 300.maxGram (type: int) -Default: 2, maximum 300.Must be greater thanminGram.\npattern_capturePatternCaptureTokenFilterUses Java regexes to emitmultiple tokens, one foreach capture group in oneor more patterns.Optionspatterns (type: string array) -A list of patterns to matchagainst each token.Required.\n"
}