{
  "Id": "364",
  "Title": "\u0022Top Ten Resorts: Property of the Year in Seattle\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWe have it all, including being named “Property of the Year” and a “Top Ten Resort” by top publications.\u0022,             \u0022Address\u0022: {                 \u0022City\u0022: \u0022Seattle\u0022             }         },         {             \u0022@search.score\u0022: 1,             \u0022HotelName\u0022: \u0022Travel Resort\u0022,             \u0022Description\u0022: \u0022The Best Gaming Resort in the area.\r\nWith elegant rooms \u0026 suites, pool, cabanas, spa, brewery \u0026 world-class gaming.  This is the best place to play, stay \u0026 dine.\u0022,             \u0022Address\u0022: {                 \u0022City\u0022: \u0022Albuquerque\u0022             }         }     ] }  TipThere is a character limit to the JSON response you can enter, so you maywant to simplify the JSON before pasting it.\r\nThe schema and format of theresponse is more important than the values themselves. For example, theDescription field could be simplified to just the first sentence.18. Select Create connector on the top right to save the definition.19. Select Close to close the connector.\r\nWhen the connector is first created, you need to reopen it from the Custom Connectorslist in order to test it. Later, if you make more updates, you can test from within thewizard.You\u0027ll need a query API key for this task. Each time a connection is created, whether for atest run or inclusion in an app, the connector needs the query API key used forconnecting to Azure Cognitive Search.\r\n1. On the far left, select Custom Connectors.2. Find your connector in the list (in this tutorial, is \u0022AzureSearchQuery\u0022).3. Select the connector, expand the actions list, and select View Properties.4. Select Edit on the top right.5. Select 5. Test to open the test page.6. In Test Operation, select \u002B New Connection.7. Enter a query API key. This is an Azure Cognitive Search query for read-only accessto an index. You can find the key in the Azure portal.8. In Operations, select the Test operation button. If you\u0027re successful you should seea 200 status, and in the body of the response you should see JSON that describesthe search results.\n"
}