{
  "Id": "344",
  "Title": "\u0022Troubleshooting Azure Search Skill JSON Editor and Execution Errors\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf7. Switch to Skill JSON Editor.8. At line 16, under \u0022inputs\u0022, change /document/content to /document/merged_content.JSON9. Select Save in the Skill Details pane.10. Select Run in the session\u0027s window menu. This will kick off another execution ofthe skillset using the document.11.\r\nOnce the debug session execution completes, check the Errors/Warnings tab and itwill show that the error for text input is gone, but the other warnings remain. Thenext step is to address the warning about \u0022languageCode\u0022.12. Select the Executions tab and locate the input for \u0022languageCode\u0022.13. Select the \u003C/\u003E symbol to pop open the Expression Evaluator.\r\nNotice theconfirmation that the \u0022languageCode\u0022 property isn\u0027t a valid input. {   \u0022name\u0022: \u0022text\u0022,   \u0022source\u0022: \u0022/document/merged_content\u0022 },There are two ways to research this error. The first is to look at where the input iscoming from - what skill in the hierarchy is supposed to produce this result? TheExecutions tab in the skill details pane should display the source of the input.\r\nIf there isno source, this indicates a field mapping error.1. In the Executions tab, check the INPUTS and find \u0022languageCode\u0022. There is nosource for this input listed.2. Switch the left pane to Enriched Data Structure. Scroll down the list of enrichmentnodes for this document. Notice that there is no \u0022languageCode\u0022 node, but thereis one for \u0022language\u0022. So, there is a typo in the skill settings.3. Still in the Enriched Data Structure, open the Expression Evaluator \u003C/\u003E for the\u0022language\u0022 node and copy the expression /document/language.4. In the right pane, select Skill Settings for the #1 skill and open the ExpressionEvaluator \u003C/\u003E for the input \u0022languageCode\u0022.\n"
}