{
  "Id": "860",
  "Title": "\u0022Troubleshooting Azure Search Connectivity and Access Issues: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfMake sure your source is accessible by trying to connect to it directly and notthrough the search serviceConfigure network security group (NSG) rulesNetwork errorsCheck your source in the Azure portal for any current errors or outagesCheck for any network outages in Azure StatusCheck you are using public DNS for name resolution and not an Azure Private DNSIf your SQL database is on a serverless compute tier, make sure that the database isrunning (and not paused) when the indexer connects to it.\r\nIf the database is paused, the first login from your search service is expected to auto-resume the database, but returning an error stating that the database is unavailable witherror code 40613. After the database is running, retry the login to establish connectivity.When creating a SharePoint indexer, you will go through a step that requires you to signin to your Azure AD app after providing a device code. If you receive a message thatsays \u0022Your sign-in was successful but your admin requires the device requestingaccess to be managed\u0022 the indexer is likely being blocked from accessing the SharePointdocument library due to a Conditional Access policy.\r\nTo update the policy to allow the indexer access to the document library, follow thebelow steps:1. Open the Azure portal and search Azure AD Conditional Access, then selectPolicies on the left menu. If you don\u0027t have access to view this page, you need toeither find someone who has access or get access.2.\r\nDetermine which policy is blocking the SharePoint indexer from accessing thedocument library. The policy that might be blocking the indexer includes the useraccount that you used to authenticate during the indexer creation step in theUsers and groups section. The policy also might have Conditions that:Restrict Windows platforms.Restrict Mobile apps and desktop clients. Have Device state configured to Yes.3. Once you\u0027ve confirmed there is a policy that is blocking the indexer, you next needto make an exemption for the indexer. Retrieve the search service IP address.Azure SQL Database serverless indexing (errorcode 40613)Azure Active Directory Conditional Accesspoliciesa.\n"
}