{
  "Id": "1507",
  "Title": "\u0022Troubleshooting and Contributing with Azure Cognitive Search in .NET\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzureChina    });Troubleshootingtry{    return client.GetDocument\u003CHotel\u003E(\u002212345\u0022);You can also easily enable console logging if you want to dig deeper into the requestsyou\u0027re making against the service.See our troubleshooting guide for details on how to diagnose various failurescenarios.Go further with Azure.Search.Documents and our samplesWatch a demo or deep dive videoRead more about the Azure Cognitive Search serviceSee our Search CONTRIBUTING.md for details on building, testing, and contributingto this library.This project welcomes contributions and suggestions.\r\nMost contributions require you toagree to a Contributor License Agreement (CLA) declaring that you have the right to,and actually do, grant us the rights to use your contribution. For details, visitcla.microsoft.com.This project has adopted the Microsoft Open Source Code of Conduct. For moreinformation see the Code of Conduct FAQ or contact opencode@microsoft.\r\ncom withany additional questions or comments.}catch (RequestFailedException ex) when (ex.Status == 404){    Console.WriteLine(\u0022We couldn\u0027t find the hotel you are looking for!\u0022);    Console.WriteLine(\u0022Please try selecting another.\u0022);    return null;}Next stepsContributingMicrosoft Azure Cognitive Searchmanagement client library for .\r\nNETArticle•12/01/2023The Microsoft Azure Cognitive Search is the only cloud search service with built-in AIcapabilities that enrich all types of information to help you identify and explore relevantcontent at scale.This library supports managing Microsoft Azure Cognitive Search resources.This library follows the new Azure SDK guidelines, and provides many corecapabilities:Install the Microsoft Azure Cognitive Search management library for .NET with NuGet:.NET CLIYou must have an Microsoft Azure subscription.To create an authenticated client and start interacting with Microsoft Azure resources,see the quickstart guide here.- Support MSAL.NET, Azure. Identity is out of box for supporting MSAL.NET.- Support [OpenTelemetry](https://opentelemetry.io/) for distributed tracing.- HTTP pipeline with custom policies.- Better error-handling.- Support uniform telemetry across all languages.Getting startedInstall the packagedotnet add package Azure.ResourceManager.SearchPrerequisitesAuthenticate the ClientKey concepts of the Microsoft Azure SDK for .NET can be found here.Documentation is available to help you learn how to use this package:Quickstart.API References.Authentication.Code samples for using the management library for .NET can be found in the followinglocations.NET Management Library Code SamplesFile an issue via GitHub Issues.\n"
}