{
  "Id": "869",
  "Title": "\u0022Troubleshooting and Best Practices for Azure Cognitive Search Indexers\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf00:01:40Indexer starts00:01:3200:01:41Indexer queries for allchanges between 00:01:02and 00:01:40; retrievesdoc200:01:32Indexer requests for all changes betweencurrent high water mark minus the 30second buffer, and starting timestamp ofcurrent indexer execution.\r\n00:01:42Indexer processes doc2 forthe fourth time00:01:3200:01:43Indexer ends00:01:40Notice this indexer execution started morethan 30 seconds after the last write to thedata source and also processed doc2.\r\nThisis the expected behavior because if allindexer executions before 00:01:35 areeliminated, this becomes the first and onlyexecution to process doc1 and doc2.In practice, this scenario only happens when on-demand indexers are manually invokedwithin minutes of each other, for certain data sources.\r\nIt may result in mismatchednumbers (like the indexer processed 345 documents total according to the indexerexecution stats, but there are 340 documents in the data source and index) orpotentially increased billing if you are running the same skills for the same documentmultiple times. Running an indexer using a schedule is the preferred recommendation.If you have sensitivity labels set on documents, you might not be able to index them. Ifyou\u0027re getting errors, remove the labels prior to indexing.\r\nTroubleshooting common indexer errors and warningsMonitor indexer-based indexingIndexing documents with sensitivity labelsSee alsoTroubleshooting common indexer errorsand warnings in Azure Cognitive SearchArticle•09/29/2023This article provides information and solutions to common errors and warnings youmight encounter during indexing and AI enrichment in Azure Cognitive Search.Indexing stops when the error count exceeds \u0027maxFailedItems\u0027. If you want indexers to ignore these errors (and skip over \u0022failed documents\u0022), considerupdating the maxFailedItems and maxFailedItemsPerBatch as described here.The error information in this article can help you resolve errors, allowing indexing tocontinue.Warnings don\u0027t stop indexing, but they do indicate conditions that could result inunexpected outcomes. Whether you take action or not depends on the data and yourscenario.\n"
}