{
  "Id": "1424",
  "Title": "\u0022Troubleshooting Azure Deployment Failures: Error Messages and Resolutions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDeployment failurereasonDescriptionResolutionDeployment failuresDeployment failurereasonDescriptionResolution\u0022LinkedAuthorizationFailed\u0022The error message states that the client haspermission to create the shared private linkon the search service, but doesn\u0027t havepermission to perform action\u0027privateEndpointConnectionApproval/action\u0027on the linked scope.Re-check the privatelink ID in the requestto make sure there areno errors or omissionsin the URI. If AzureCognitive Search andthe Azure PaaSresource are indifferent subscriptions,and if you\u0027re usingREST or a commandline interface, makesure that the activeAzure account is forthe Azure PaaSresource.\r\nFor RESTclients, make sureyou\u0027re not using anexpired bearer token,and that the token isvalid for the activesubscription.Network resource providernot registered on targetresource\u0027s subscriptionA private endpoint (and associated DNSmappings) is created for the target resource(Storage Account, Azure Cosmos DB, AzureSQL) via the Microsoft.\r\nNetwork resourceprovider (RP). If the subscription that hoststhe target resource (\u0022target subscription\u0022)isn\u0027t registered with Microsoft.Network RP,then the Azure Resource Managerdeployment can fail.You need to registerthis RP in their targetsubscription. You canregister the resourceprovider using theAzure portal,PowerShell, or CLI.\r\nDeployment failurereasonDescriptionResolutionInvalid groupId for thetarget resourceWhen Azure Cosmos DB accounts arecreated, you can specify the API type for thedatabase account. While Azure Cosmos DBoffers several different API types, AzureCognitive Search only supports \u0022Sql\u0022 as thegroupId for shared private link resources. When a shared private link of type \u0022Sql\u0022 iscreated for a privateLinkResourceIdpointing to a non-Sql database account, theAzure Resource Manager deployment willfail because of the groupId mismatch. TheAzure resource ID of an Azure Cosmos DBaccount isn\u0027t sufficient to determine the APItype that is being used. Azure CognitiveSearch tries to create the private endpoint,which is then denied by Azure Cosmos DB.\n"
}