{
  "Id": "1754",
  "Title": "\u0022Troubleshooting AML Online Endpoint and Custom Web API Skill\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfcom/score\u0022,    \u0022context\u0022: \u0022/document\u0022,    \u0022inputs\u0022: [      {        \u0022name\u0022: \u0022shapedText\u0022,        \u0022sourceContext\u0022: \u0022/document\u0022,        \u0022inputs\u0022: [            {              \u0022name\u0022: \u0022content\u0022,              \u0022source\u0022: \u0022/document/content\u0022            }        ]      }JSONJSONIn addition to your AML being unavailable or sending out nonsuccessful status codes,the following are considered erroneous cases:If the AML online endpoint returns a success status code but the responseindicates that it isn\u0027t application/json, then the response is considered invalid andno enrichments are performed.\r\nIf the AML online endpoint returns invalid jsonFor cases when the AML online endpoint is unavailable or returns an HTTP error, afriendly error with any available details about the HTTP error will be added to theindexer execution history.\r\nHow to define a skillset    ],    \u0022outputs\u0022: [      {        \u0022name\u0022: \u0022detected_language_code\u0022      }    ]  }Inline shaping input JSON structure{  \u0022shapedText\u0022: { \u0022content\u0022: \u0022Este es un contrato en Inglés\u0022 }}Inline shaping sample output JSON structure{    \u0022detected_language_code\u0022: \u0022es\u0022}Error casesSee alsoAML online endpoint troubleshootingCustom Web API skill in an AzureCognitive Search enrichment pipelineArticle•08/23/2022The Custom Web API skill allows you to extend AI enrichment by calling out to a WebAPI endpoint providing custom operations. Similar to built-in skills, a Custom Web APIskill has inputs and outputs. Depending on the inputs, your Web API receives a JSONpayload when the indexer runs, and outputs a JSON payload as a response, along with asuccess status code. The response is expected to have the outputs specified by yourcustom skill. Any other response is considered an error and no enrichments areperformed.The structure of the JSON payload is described further down in this document.Microsoft.Skills.Custom.WebApiSkillParameters are case-sensitive.\n"
}