{
  "Id": "1425",
  "Title": "\u0022Troubleshooting Azure Resource Manager Deployment for Private Links\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhen a shared private link of type \u0022Sql\u0022 iscreated for a privateLinkResourceIdpointing to a non-Sql database account, theAzure Resource Manager deployment willfail because of the groupId mismatch. TheAzure resource ID of an Azure Cosmos DBaccount isn\u0027t sufficient to determine the APItype that is being used. Azure CognitiveSearch tries to create the private endpoint,which is then denied by Azure Cosmos DB.\r\nYou should ensure thattheprivateLinkResourceIdof the specified AzureCosmos DB resource isfor a database accountof \u0022Sql\u0022 API typeTarget resource not foundExistence of the target resource specified inprivateLinkResourceId is checked onlyduring the commencement of the AzureResource Manager deployment. If the targetresource is no longer available, then thedeployment will fail.You should ensure thatthe target resource ispresent in thespecified subscriptionand resource groupand isn\u0027t moved ordeleted.Transient/other errorsThe Azure Resource Manager deploymentcan fail if there\u0027s an infrastructure outage orbecause of other unexpected reasons.\r\nThisshould be rare and usually indicates atransient state.Retry creating thisresource at a latertime. If the problempersists, reach out toAzure Support.A private endpoint is created to the target Azure resource as specified in the sharedprivate link creation request. This is one of the final steps in the asynchronous AzureResource Manager deployment operation, but Azure Cognitive Search needs to link theprivate endpoint\u0027s private IP address as part of its network configuration. Once this linkis done, the provisioningState of the shared private link resource will go to a terminalsuccess state Succeeded. Customers should only approve or deny(or in general modifythe configuration of the backing private endpoint) after the state has transitioned toSucceeded. Modifying the private endpoint in any way before this could result in anIssues approving the backing private endpointincomplete deployment operation and can cause the shared private link resource to endup (either immediately, or usually within a few hours) in a Failed state.Shared private links and private endpoints are used when search service Public NetworkAccess is Disabled. Typically, changing network connectivity should succeed in a fewminutes after the request has been accepted.\n"
}