{
  "Id": "343",
  "Title": "\u0022Troubleshooting Missing Input Issues in Azure Search PDF\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIfpossible, start by solving input issues first before moving on to output issues.In the Errors/Warnings tab, there are two missing inputs for an operation labeledEntityRecognitionSkill.#1. The detail of the first error explains that a required input for\u0027text\u0027 is missing.\r\nThe second indicates a problem with an input value\u0022/document/languageCode\u0022.1. In AI Enrichments \u003E Skill Graph, select the skill labeled #1 to display its details inthe right pane.2. Select the Executions tab and locate the input for \u0022text\u0022.3. Select the \u003C/\u003E symbol to pop open the Expression Evaluator.\r\nThe displayed resultfor this input doesn’t look like a text input. It looks like a series of new linecharacters \\n \\n\\n\\n\\n instead of text. The lack of text means that no entities canbe identified, so either this document fails to meet the prerequisites of the skill, orthere is another input that should be used instead.4.\r\nSwitch the left pane to Enriched Data Structure and scroll down the list ofenrichment nodes for this document. Notice the \\n \\n\\n\\n\\n for \u0022content\u0022 has nooriginating source, but another value for \u0022merged_content\u0022 has OCR output.Although there is no indication, the content of this PDF appears to be a JPEG file,as evidenced by the extracted and processed text in \u0022merged_content\u0022.\r\nFix missing skill input values5. In the right pane, select Executions for the #1 skill and open the ExpressionEvaluator \u003C/\u003E for the input \u0022text\u0022.6. Change the expression from /document/content to /document/merged_content, andthen select Evaluate. Notice that the content is now a chunk of text, and thusactionable for entity recognition. 7. Switch to Skill JSON Editor.8. At line 16, under \u0022inputs\u0022, change /document/content to /document/merged_content.JSON9. Select Save in the Skill Details pane.10. Select Run in the session\u0027s window menu. This will kick off another execution ofthe skillset using the document.11.\n"
}