{
  "Id": "172",
  "Title": "\u0022Troubleshooting Azure Static Web App Deployment: Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThese steps are performed after the resource is created and aredocumented in this article.Enter the path ofyour buildoutput...buildThis is the path, from your static web app, to your generated files.If you get an error about an incorrect region, make sure the resource group andstatic web app resource are in one of the supported regions listed in the errorresponse.7.\r\nWhen the static web app is created, a GitHub workflow YML file is also createdlocally and on GitHub in your fork. This workflow executes in your fork, buildingand deploying the static web app and functions.Check the status of static web app deployment using any of these approaches:Select Open Actions in GitHub from the Notifications.\r\nThis opens a browserwindow pointed to your forked repo.Select the Actions tab in your forked repository. You should see a list of allworkflows on your fork.Select the Azure: Activity Log in Visual Code. You should see a messagesimilar to the following screenshot.8. Currently, the YML file is created with erroneous path syntax for the Azure functioncode.\r\nUse this workaround to correct the syntax. You can perform this step as soonas the YML file is created. A new workflow will launch as soon as you push theupdates:a. In Visual Studio Code explorer, open the ./.github/workflows/ directory.b. Open the YML file.c. Scroll to the api-location path (on or near line 31).d.\r\nChange the path syntax to use a forward slash (only api_location needsediting, other locations are here for context):ymlapp_location: \u0022search-website-functions-v4/client\u0022 # App source code pathapi_location: \u0022search-website-functions-v4/api\u0022 # Api source code path - optionaloutput_location: \u0022build\u0022 # Built app content directory - optionale. Save the file.f. Open an integrated terminal and issue the following GitHub commands to sendthe updated YML to your fork:BashWait until the workflow execution completes before continuing. This may take aminute or two to finish.1. In Visual Studio Code, open a new terminal window.2.\n"
}