{
  "Id": "854",
  "Title": "\u0022Troubleshooting Azure SQL Indexer with Managed Identity Setup\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure SQL indexerTroubleshootingSee alsoSet up an indexer connection to AzureSQL Managed Instance using amanaged identityArticle•10/19/2023This article describes how to set up an Azure Cognitive Search indexer connection toSQL Managed Instance using a managed identity instead of providing credentials in theconnection string.\r\nYou can use a system-assigned managed identity or a user-assigned managed identity(preview). Managed identities are Microsoft Entra logins and require Azure roleassignments to access data in SQL Managed Instance.Before learning more about this feature, it\u0027s recommended that you understand what anindexer is and how to set up an indexer for your data source.\r\nMore information can befound at the following links:Indexer overviewSQL Managed Instance indexerCreate a managed identity for your search service.Microsoft Entra admin role on SQL Managed Instance:To assign read permissions on SQL Managed Instance, you must be an AzureGlobal Admin with a SQL Managed Instance. See Configure and manage MicrosoftEntra authentication with SQL Managed Instance and follow the steps to provisiona Microsoft Entra admin (SQL Managed Instance).Configure a public endpoint and network security group in SQL Managed Instanceto allow connections from Azure Cognitive Search.\r\nConnecting through a SharedPrivate Link when using a managed identity isn\u0027t currently supported.Follow these steps to assign the search service system managed identity permission toread the SQL Managed database.Prerequisites1 - Assign permissions to read the database1. Connect to your SQL Managed Instance through SQL Server Management Studio(SSMS) by using one of the following methods:Configure a point-to-site connection from on-premisesConfigure an Azure VM2. Authenticate with your Microsoft Entra account.3. From the left pane, locate the SQL database you are using as data source forindexing and right-click it. Select New Query.4. In the T-SQL window, copy the following commands and include the bracketsaround your search service name. Click on Execute.SQLIf you later change the search service system identity after assigning permissions, youmust remove the role membership and remove the user in the SQL database, thenrepeat the permission assignment.\n"
}