{
  "Id": "1031",
  "Title": "\u0022Troubleshooting and Debugging AI Enrichment Pipelines in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou\u0027ll work through this list, make your changes, and then return to the list toverify whether issues are resolved.To view the messages, select a skill in AI Enrichment \u003E Skill Graph and then selectErrors/Warnings in the details pane.As a best practice, resolve problems with inputs before moving on to outputs.\r\nTo prove whether a modification resolves an error, follow these steps:1. Select Save in the skill details pane to preserve your changes.2. Select Run in the session window to invoke skillset execution using the modifieddefinition.3. Return to Errors/Warnings to see if the count is reduced. The list won\u0027t berefreshed until you open the tab.\r\nAI enrichment pipelines extract or infer information and structure from sourcedocuments, creating an enriched document in the process. An enriched document isfirst created during document cracking and populated with a root node (/document),plus nodes for any content that is lifted directly from the data source, such as metadataand the document key.\r\nMore nodes are created by skills during skill execution, whereeach skill output adds a new node to the enrichment tree.Enriched documents are internal, but a debug session gives you access to the contentproduced during skill execution. To view the content or output of each skill, follow thesesteps:1.\r\nStart with the default views: AI enrichment \u003E Skill Graph, with the graph type setto Dependency Graph.2. Select a skill.Start with errors and warningsView content of enrichment nodes3. In the details pane to the right, select Executions, select an OUTPUT, and thenopen the Expression Evaluator (\u003C/\u003E) to view the expression and its result.4. Alternatively, open AI enrichment \u003E Enriched Data Structure to scroll down the listof nodes. The list includes potential and actual nodes, with a column for output,and another column that indicates the upstream object used to produce theoutput.Edit skill definitionsIf the field mappings are correct, check individual skills for configuration and content. Ifa skill fails to produce output, it might be missing a property or parameter, which can bedetermined through error and validation messages.Other issues, such as an invalid context or input expression, can be harder to resolvebecause the error will tell you what is wrong, but not how to fix it.\n"
}