{
  "Id": "146",
  "Title": "\u0022Troubleshooting Azure Search Integration for Static Web Apps\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThereshould be only 1 action and it should have static web app settings for theTroubleshootingapp_location, api_location, and output_location. If the action didn\u0027t deploysuccessfully, dive into the action logs and look for the last failure.Does the client (front-end) application work?You should be able to get to your web app and it should successfully display.\r\nIf thedeployment succeeded but the website doesn\u0027t display, this may be an issue withhow the static web app is configured for rebuilding the app, once it is on Azure.Does the API (serverless back-end) application work?You should be able to interact with the client app, searching for books andfiltering.\r\nIf the form doesn\u0027t return any values, open the browser\u0027s developer tools,and determine if the HTTP calls to the API were successful. If the calls weren\u0027tsuccessful, the most likely reason if the static web app configurations for the APIendpoint name and Search query key are incorrect.To clean up the resources created in this tutorial, delete the resource group.\r\n1. In Visual Studio Code, open the Activity bar, and select the Azure icon.2. In the Side bar, right-click on your Azure subscription under the Resource Groupsarea and find the resource group you created for this tutorial.3. Right-click the resource group name then select Delete. This deletes both theSearch and Static Web Apps resources.\r\n4. If you no longer want the GitHub fork of the sample, remember to delete that onGitHub. Go to your fork\u0027s Settings then delete the fork.Understand Search integration for the search-enabled websiteClean up resourcesNext steps4 - Explore the .NET search codeArticle•11/15/2023In the previous lessons, you added search to a Static Web App. This lesson highlights theessential steps that establish integration. If you\u0027re looking for a cheat sheet on how tointegrate search into your web app, this article explains what you need to know.The application is available:SampleDemo website - aka.ms/azs-good-booksThe Function app uses the Azure SDK for Azure AI Search:NuGet: Azure.Search.DocumentsReference Documentation: Client LibraryThe Function app authenticates through the SDK to the cloud-based Azure AI SearchAPI using your resource name, resource key, and index name. The secrets are stored inthe Static Web App settings and pulled in to the Function as environment variables.\n"
}