{
  "Id": "1421",
  "Title": "\u0022Troubleshooting Shared Private Links in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou connected to the VM from the internet and securely communicated to thesearch service using Private Link. To learn more about Private Endpoint, see What isAzure Private Endpoint?.Clean up resourcesNext stepsTroubleshoot issues with Shared PrivateLinks in Azure Cognitive SearchArticle•03/14/2023A shared private link allows Azure Cognitive Search to make secure outboundconnections over a private endpoint when accessing customer resources in a virtualnetwork. This article can help you resolve errors that might occur.Creating a shared private link is search service control plane operation. You can create ashared private link using either the portal or a Management REST API.\r\nDuringprovisioning, the state of the request is \u0022Updating\u0022. After the operation completessuccessfully, status is \u0022Succeeded\u0022. A private endpoint to the resource, along with anyDNS zones and mappings, is created. This endpoint is used exclusively by your searchservice instance and is managed through Azure Cognitive Search.\r\nSome common errors that occur during the creation phase are listed below.Unsupported SKU: Shared private links are supported on the Basic tier and above.For indexers with skillsets, the minimum tier is Standard 2 (S2).Invalid name: Naming rules for a shared private link are:Length should be between 1 to 60 charactersAlphanumeric charactersNames can include underscore _, period .\r\n, and hyphen - as long as it\u0027s notthe first character in the nameRequest validation failuresInvalid group ID: Group IDs are case-sensitive and must be one of the values fromthe table below: Azure resourceGroup IDFirst available API versionAzure Storage - Blob (or) ADLS Gen 2blob2020-08-01Azure Storage - Tablestable2020-08-01Azure Cosmos DB for NoSQLSql2020-08-01Azure SQL DatabasesqlServer2020-08-01Azure Database for MySQL (preview)mysqlServer2020-08-01-PreviewAzure Key Vaultvault2020-08-01Azure Functions (preview)sites2020-08-01-PreviewResources marked with \u0022(preview)\u0022 must be created using a preview version of theManagement REST API versions.\n"
}