{
  "Id": "341",
  "Title": "\u0022Troubleshooting Azure Search: Debugging Skillset and Indexer Issues\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThese fields should have been populated through the skillset\u0027s Entity Recognition skill,used to detect organizations and locations anywhere within the blob\u0027s content. In thenext exercise, you\u0027ll debug the skillset to determine what went wrong.Another way to investigate errors and warnings is through the Azure portal.1. Open the Indexers tab and select clinical-trials-idxr.\r\nNotice that while the indexer job succeeded overall, there were warnings.Check results in the portal2. Select Success to view the warnings (if there were mostly errors, the detail linkwould be Failed). You\u0027ll see a long list of every warning emitted by the indexer.1. From the search service left-navigation pane, under Search management, selectDebug sessions.2.\r\nSelect \u002B Add Debug Session.3. Give the session a name.4. Connect the session to your storage account. Create a container named \u0022debugsessions\u0022. You can use this container repeatedly to store all of your debug sessiondata.5. If you configured a trusted connection between search and storage, select theuser-managed identity or system identity for the connection.\r\nOtherwise, use thedefault (None).6. In Indexer template, provide the indexer name. The indexer has references to thedata source, the skillset, and index.7. Accept the default document choice for the first document in the collection. Adebug session only works with a single document. You can choose whichdocument to debug, or just use the first one.\r\n8. Save the session. Saving the session will kick off the enrichment pipeline as definedby the skillset for the selected document.Start your debug session9. When the debug session has finished initializing, the session defaults to the AIEnrichments tab, highlighting the Skill Graph. The Skill Graph provides a visualhierarchy of the skillset and its order of execution sequentially and in parallel.Find issues with the skillsetAny issues reported by the indexer can be found in the adjacent Errors/Warnings tab.Notice that the Errors/Warnings tab will provide a much smaller list than the onedisplayed earlier because this list is only detailing the errors for a single document. Likethe list displayed by the indexer, you can click on a warning message and see the detailsof this warning.Select Errors/Warnings to review the notifications. You should see four:\u0022Could not execute skill because one or more skill inputs were invalid.\n"
}