{
  "Id": "1032",
  "Title": "\u0022Troubleshooting and Configuring Azure AI Search Skill Definitions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAlternatively, open AI enrichment \u003E Enriched Data Structure to scroll down the listof nodes. The list includes potential and actual nodes, with a column for output,and another column that indicates the upstream object used to produce theoutput.Edit skill definitionsIf the field mappings are correct, check individual skills for configuration and content. Ifa skill fails to produce output, it might be missing a property or parameter, which can bedetermined through error and validation messages.Other issues, such as an invalid context or input expression, can be harder to resolvebecause the error will tell you what is wrong, but not how to fix it.\r\nFor help with contextand input syntax, see Reference annotations in an Azure AI Search skillset. For help withindividual messages, see Troubleshooting common indexer errors and warnings.The following steps show you how to get information about a skill.1. In AI enrichment \u003E Skill Graph, select a skill. The Skill Details pane opens to theright.2. Edit a skill definition using either approach:Skill Settings if you prefer a visual editorSkill JSON Editor to edit the JSON document directly3. Check the path syntax for referencing nodes in an enrichment tree. Following aresome of the most common input paths:/document/content for chunks of text.\r\nThis node is populated from the blob\u0027scontent property./document/merged_content for chunks of text in skillets that include TextMerge skill./document/normalized_images/* for text that is recognized or inferred fromimages.If skills produce output but the search index is empty, check the field mappings. Fieldmappings specify how content moves out of the pipeline and into a search index. 1. Start with the default views: AI enrichment \u003E Skill Graph, with the graph type setto Dependency Graph.2. Select Field Mappings near the top. You should find at least the document key thatuniquely identifies and associates each search document in the search index withits source document in the data source.\nIf you\u0027re importing raw content straight from the data source, bypassingenrichment, you should find those fields in Field Mappings.Check field mappings3. Select Output Field Mappings at the bottom of the graph. Here you\u0027ll findmappings from skill outputs to target fields in the search index.\n"
}