{
  "Id": "864",
  "Title": "\u0022Troubleshooting Document Indexing Issues in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOccasionally, a document thatexists in data source fails to appear in a search index. This unexpected result can occurdue to the following reasons:The document was updated after the indexer was run. If your indexer is on aschedule, it eventually reruns and picks up the document.The indexer timed out before the document could be ingested. There aremaximum processing time limits after which no documents are processed. You cancheck indexer status in the portal or by calling Get Indexer Status (REST API).Field mappings or AI enrichment have changed the document and its articulationin the search index is different from what you expect.\r\nChange tracking values are erroneous or prerequisites are missing. If your highwatermark value is a date set to a future time, then any documents that have adate less than this are skipped by the indexer. You can understand your indexer\u0027schange tracking state using the \u0027initialTrackingState\u0027 and \u0027finalTrackingState\u0027 fieldsin the indexer status. Indexers for Azure SQL and MySQL must have an index onthe high water mark column of the source table, or queries used by the indexermay time out.The blob indexer finds and extracts text from blobs in a container. Some problems withextracting text include:The document only contains scanned images.\r\nPDF blobs that have non-textcontent, such as scanned images (JPGs), don\u0027t produce results in a standard blobindexing pipeline. If you have image content with text elements, you can use OCRor image analysis to find and extract the text.The blob indexer is configured to only index metadata. To extract content, the blobindexer must be configured to extract both content and metadata:HTTP TipIf documents are missing, check the query you are using to make sure it isn\u0027texcluding the document in question. To query for a specific document, use theLookup Document REST API.Missing content from Blob StorageAzure Cognitive Search has an implicit dependency on Azure Cosmos DB indexing.\n"
}