{
  "Id": "874",
  "Title": "\u0022Troubleshooting Azure Search: Handling Unexpected Connectivity and Skill Errors\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOccasionally there areunexpected connectivity issues.Try running the documentthrough your indexer again later.Potential productbugAn unexpected error occurred.This indicates an unknown classof failure and may indicate aproduct bug. File a supportticket to get help.A skill hasencountered anerror duringexecution(From Merge Skill) One or more offsetvalues were invalid and couldn\u0027t beparsed.\r\nItems were inserted at the endof the textUse the information in the errormessage to fix the issue. Thiskind of failure requires action toresolve.The skill execution failed because the call to the Web API failed. Typically, this class offailure occurs when custom skills are used, in which case you need to debug yourcustom code to resolve the issue. If instead the failure is from a built-in skill, refer to theerror message for help with fixing the issue.While debugging this issue, be sure to pay attention to any skill input warnings for thisskill. Your Web API endpoint may be failing because the indexer is passing it unexpectedinput.\r\nwhile applying mapping function \u0027abc\u0027Error: Could not execute skillError: Could not execute skill because theWeb API request failedThe skill execution failed because the call to the Web API returned an invalid response.Typically, this class of failure occurs when custom skills are used, in which case you needto debug your custom code to resolve the issue.\r\nIf instead the failure is from a built-inskill, file a support ticket to get assistance.If your data source has a field with a different data type than the field you\u0027re trying tomap in your index, you may encounter this error. Check your data source field datatypes and make sure they\u0027re mapped correctly to your index data types. There are two cases under which you may encounter this error message, each of whichshould be treated differently. Follow the instructions below depending on what skillreturned this error for you.Many of the built-in cognitive skills, such as language detection, entity recognition, orOCR, are backed by an Azure AI services API endpoint.\n"
}