{
  "Id": "875",
  "Title": "\u0022Troubleshooting Azure AI Services: Handling Timeout and Error Messages\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThere are two cases under which you may encounter this error message, each of whichshould be treated differently. Follow the instructions below depending on what skillreturned this error for you.Many of the built-in cognitive skills, such as language detection, entity recognition, orOCR, are backed by an Azure AI services API endpoint.\r\nSometimes there are transientissues with these endpoints and a request will time out. For transient issues, there\u0027s noremedy except to wait and try again. As a mitigation, consider setting your indexer torun on a schedule. Scheduled indexing picks up where it left off. Assuming transientissues are resolved, indexing and cognitive skill processing should be able to continueon the next scheduled run.\r\nIf you continue to see this error on the same document for a built-in cognitive skill, file asupport ticket to get assistance, as this isn\u0027t expected.Error: Could not execute skill because WebAPI skill response is invalidError: Type of value has a mismatch withcolumn type. Couldn\u0027t store in \u0027xyz\u0027 column.\r\nExpected type is \u0027abc\u0027Error: Skill did not execute within the timelimitBuilt-in Azure AI services skillsCustom skillsIf you encounter a timeout error with a custom skill, there are a couple of things you cantry. First, review your custom skill and ensure that it\u0027s not getting stuck in an infiniteloop and that it\u0027s returning a result consistently. Once you have confirmed that a resultis returned, check the duration of execution. If you didn\u0027t explicitly set a timeout valueon your custom skill definition, then the default timeout is 30 seconds. If 30 secondsisn\u0027t long enough for your skill to execute, you may specify a higher timeout value onyour custom skill definition. Here\u0027s an example of a custom skill definition where thetimeout is set to 90 seconds:JSONThe maximum value that you can set for the timeout parameter is 230 seconds.\n"
}