{
  "Id": "1451",
  "Title": "\u0022Troubleshooting Private Endpoints in Azure AI Search and SQL\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022   }\u0022name\u0022: \u0022indexer\u0022,\u0022dataSourceName\u0022: \u0022my-blob-ds\u0022,\u0022targetIndexName\u0022: \u0022my-index\u0022,\u0022parameters\u0022: {   \u0022configuration\u0022: {       \u0022executionEnvironment\u0022: \u0022private\u0022       }   },\u0022fieldMappings\u0022: []}Troubleshootingused a private environment of its own accord. A search service moves processingout of the standard environment if the system is under load.\r\nIf you get an error when creating a shared private link, check service limits to verifythat you\u0027re under the quota for your tier.Learn more about private endpoints and other secure connection methods:Troubleshoot issues with shared private link resourcesWhat are private endpoints?DNS configurations needed for private endpointsIndexer access to content protected by Azure network security featuresNext stepsCreate a shared private link for a SQLmanaged instance from Azure AI SearchArticle•11/15/2023This article explains how to configure an indexer in Azure AI Search for a privateconnection to a SQL managed instance that runs within a virtual network.\r\nOn a private connection to a managed instance, the fully qualified domain name (FQDN)of the instance must include the DNS Zone. Currently, only the Azure AI SearchManagement REST API provides a resourceRegion parameter for accepting the DNSzone specification.Although you can call the Management REST API directly, it\u0027s easier to use the Azure CLIaz rest module to send Management REST API calls from a command line.\r\nThis articleuses the Azure CLI with REST to set up the private link.Azure CLIAzure AI Search, Basic or higher. If you\u0027re using AI enrichment and skillsets, useStandard 2 (S2) or higher. See Service limits for details.Azure SQL Managed Instance, configured to run in a virtual network. You should have a minimum of Contributor permissions on both Azure AI Searchand SQL Managed Instance.Azure SQL Managed Instance connection string. Managed identity is not currentlysupported with shared private link. Your connection string must include a username and password.７ NoteThis article refers to Azure portal for obtaining properties and confirming steps.However, when creating the shared private link for SQL Managed Instance, makesure you\u0027re using the REST API. Although the Networking tab listsMicrosoft.Sql/managedInstances as an option, the portal doesn\u0027t currently supportthe extended URL format used by SQL Managed Instance.\n"
}