{
  "Id": "881",
  "Title": "\u0022Troubleshooting Azure Storage and Cognitive Skills in Indexing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis is expected to be a transient failure withAzure Storage and thus should be resolvedby rerunning the indexer. If you encounterthis error consistently, file a support ticketso it can be investigated further.Could not update row\u0027projectionRow\u0027 intable \u0027tableName\u0027The server is busy.This is expected to be a transient failure withAzure Storage and thus should be resolvedby rerunning the indexer. If you encounterthis error consistently, file a support ticketso it can be investigated further.Error: Could not process document withinindexer max run timeError: Could not project documentSkill execution failed because the call to Azure AI services was throttled.\r\nTypically, thisclass of failure occurs when too many skills are executing in parallel. If you\u0027re using theMicrosoft.Search.Documents client library to run the indexer, you can use theSearchIndexingBufferedSender to get automatic retry on failed steps. Otherwise, youcan reset and rerun the indexer.\r\nAn input to the skill was missing, it has the wrong type, or otherwise, invalid. You mightsee the following information:Could not execute skillSkill executed but may have unexpected resultsCognitive skills have required inputs and optional inputs. For example, the Key phraseextraction skill has two required inputs text, languageCode, and no optional inputs.\r\nCustom skill inputs are all considered optional inputs.If necessary inputs are missing or if the input isn\u0027t the right type, the skill gets skippedand generates a warning. Skipped skills don\u0027t generate outputs. If downstream skillsconsume the outputs of the skipped skill, they may generate other warnings. If an optional input is missing, the skill still runs but may produce unexpected outputdue to the missing input.In both cases, this warning may be expected due to the shape of your data. For example,if you have a document containing information about people with the fields firstName,middleName, and lastName, you may have some documents that don\u0027t have an entry formiddleName.\n"
}