{
  "Id": "1521",
  "Title": "\u0022Troubleshooting and Authentication in Azure Cognitive Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfgetDocument(Hotel.class);        System.out.printf(\u0022This is hotelId %s, and this is hotel name %s.%n\u0022, hotel.getId(), hotel.getName());    });Authenticate in a National Cloud// Create a SearchClient that will authenticate through AAD in the China national cloud.SearchClient searchClient = new SearchClientBuilder()    .endpoint(ENDPOINT)    .indexName(INDEX_NAME)    .\r\ncredential(new DefaultAzureCredentialBuilder()        .authorityHost(AzureAuthorityHosts.AZURE_CHINA)        .build())    .audience(SearchAudience.AZURE_CHINA)    .buildClient();TroubleshootingGeneralAny Search API operation that fails will throw an HttpResponseException with helpfulStatus codes. Many of these errors are recoverable.JavaYou can also easily enable console logging if you want to dig deeper into the requestsyou\u0027re making against the service.Azure SDKs for Java provide a consistent logging story to help aid in troubleshootingapplication errors and expedite their resolution.\r\nThe logs produced will capture the flowof an application before reaching the terminal state to help locate the root issue. Viewthe logging wiki for guidance about enabling logging.By default, a Netty based HTTP client will be used. The HTTP clients wiki providesmore information on configuring or changing the HTTP client.Samples are explained in detail here.\r\nWatch a demo or deep dive videoRead more about the Azure Cognitive Search serviceThis project welcomes contributions and suggestions. Most contributions require you toagree to a Contributor License Agreement (CLA) declaring that you have the right to,Handling Search Error Responsetry {    Iterable\u003CSearchResult\u003E results = SEARCH_CLIENT. search(\u0022hotel\u0022);} catch (HttpResponseException ex) {    // The exception contains the HTTP status code and the detailed message    // returned from the search service    HttpResponse response = ex.getResponse();    System.out.println(\u0022Status Code: \u0022 \u002B response.getStatusCode());    System.out.println(\u0022Message: \u0022 \u002B ex.\n"
}