{
  "Id": "345",
  "Title": "\u0022Troubleshooting and Debugging Azure Search Skillset: Step-by-Step Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNotice that there is no \u0022languageCode\u0022 node, but thereis one for \u0022language\u0022. So, there is a typo in the skill settings.3. Still in the Enriched Data Structure, open the Expression Evaluator \u003C/\u003E for the\u0022language\u0022 node and copy the expression /document/language.4. In the right pane, select Skill Settings for the #1 skill and open the ExpressionEvaluator \u003C/\u003E for the input \u0022languageCode\u0022.\r\n5. Paste the new value, /document/language into the Expression box and clickEvaluate. It should display the correct input \u0022en\u0022.6. Select Save.7. Select Run.After the debug session execution completes, check the Errors/Warnings tab and it willshow that all of the input warnings are gone.\r\nThere now remain just the two warningsabout output fields for organizations and locations.The messages say to check the \u0027outputFieldMappings\u0027 property of your indexer, so letsstart there.1. Go to Skill Graph and select Output Field Mappings. The mappings are actuallycorrect, but normally you would check the index definition to ensure that fieldsexist for \u0022locations\u0022 and \u0022organizations\u0022.\r\n2. If there is no problem with the index, the next step is to check skill outputs. Asbefore, select the Enriched Data Structure, and scroll the nodes to find \u0022locations\u0022and \u0022organizations\u0022. Notice that the parent is \u0022content\u0022 instead of\u0022merged_content\u0022. The context is wrong.\r\nFix missing skill output values3. Switch back to Skill Graph and select the entity recognition skill.4. Navigate the Skill Settings to find \u0022context.\u00225. Double-click the setting for \u0022context\u0022 and edit it to read\u0027/document/merged_content\u0027.6. Select Save.7. Select Run.All of the errors have been resolved. When the debug session was initiated, the search service created a copy of the skillset.This was done to protect the original skillset on your search service. Now that you havefinished debugging your skillset, the fixes can be committed (overwrite the originalskillset).Alternatively, if you aren\u0027t ready to commit changes, you can save the debug sessionand reopen it later.\n"
}