{
  "Id": "872",
  "Title": "\u0022Troubleshooting Azure Search: Handling Transient Connectivity and Indexing Issues\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTransient issuesA transport-level error has occurred whenreceiving results from the server.(provider: TCP Provider, error: 0 - Anexisting connection was forcibly closed bythe remote hostOccasionally there areunexpected connectivityissues. Try running thedocument through yourindexer again later.Indexer with a Blob data source was unable to extract the content or metadata from thedocument (for example, a PDF file). This can happen due to:ReasonDetails/ExampleResolutionBlob is over thesize limitDocument is \u0027150441598\u0027 bytes, whichexceeds the maximum size \u0027134217728\u0027bytes for document extraction for yourcurrent service tier.\r\nBlob indexing errorsBlob hasunsupportedcontent typeDocument has unsupported content type\u0027image/png\u0027Blob indexing errorsBlob is encryptedDocument could not be processed - itmay be encrypted or password protected.You can skip the blob with blobsettings.Transient issuesError processing blob: The request wasaborted: The request was canceled.Document timed out during processing.Occasionally there areunexpected connectivity issues.Try running the documentthrough your indexer again later.Error: Could not extract content or metadatafrom your documentIndexer read the document from the data source, but there was an issue converting thedocument content into the specified field mapping schema.\r\nThis can happen due to:ReasonDetails/ExampleResolutionThedocumentkey ismissingDocument key cannot be missingor emptyEnsure all documents have valid documentkeys. The document key is determined bysetting the \u0027key\u0027 property as part of the indexdefinition. Indexers emit this error when theproperty flagged as the \u0027key\u0027 can\u0027t be foundon a particular document.Thedocumentkey isinvalidInvalid document key. Keys canonly contain letters, digits,underscore (_), dash (-), orequal sign (=).Ensure all documents have valid documentkeys. Review Indexing Blob Storage for moredetails. If you are using the blob indexer, andyour document key is themetadata_storage_path field, make sure thatthe indexer defintion has a base64Encodemapping function with parameters equal tonull, instead of the path in plain text.Thedocumentkey isinvalidDocument key cannot be longerthan 1024 charactersModify the document key to meet thevalidation requirements.\n"
}