{
  "Id": "885",
  "Title": "\u0022Troubleshooting Azure Search: Language Detection Skill and Input Limits\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfConditionalSkill\u0022,    \u0022context\u0022: \u0022/document\u0022,    \u0022inputs\u0022: [        { \u0022name\u0022: \u0022condition\u0022, \u0022source\u0022: \u0022= $(/document/language) == \u0027de\u0027 || Here are some references for the currently supported languages for each of the skillsthat may produce this error message:\r\nEntityRecognitionSkill supported languagesEntityLinkingSkill supported languagesKeyPhraseExtractionSkill supported languagesLanguageDetectionSkill supported languagesPIIDetectionSkill supported languagesSentimentSkill supported languagesTranslator supported languagesText SplitSkill supported languages: da, de, en, es, fi, fr, it, ko, ptCognitive skills limit the length of text that can be analyzed at one time.\r\nIf the text inputexceeds the limit, the text is truncated before it\u0027s enriched.\r\nThe skill executes, but notover all of your data.In the example LanguageDetectionSkill below, the \u0027text\u0027 input field might trigger thiswarning if the input is over the character limit. Input limits can be found in the skillsreference documentation.JSONIf you want to ensure that all text is analyzed, consider using the Split skill.\r\n$(/document/language) == \u0027en\u0027 || $(/document/language) == \u0027es\u0027 || $(/document/language) == \u0027fr\u0027 || $(/document/language) == \u0027it\u0027\u0022 },        { \u0022name\u0022: \u0022whenTrue\u0022, \u0022source\u0022: \u0022/document/content\u0022 },        { \u0022name\u0022: \u0022whenFalse\u0022, \u0022source\u0022: \u0022= null\u0022 }    ],    \u0022outputs\u0022: [ { \u0022name\u0022: \u0022output\u0022, \u0022targetName\u0022: \u0022supportedByEntityRecognitionSkill\u0022 } ]}Warning: Skill input was truncated {    \u0022@odata. type\u0022: \u0022#Microsoft.Skills.Text.LanguageDetectionSkill\u0022,    \u0022inputs\u0022: [      {        \u0022name\u0022: \u0022text\u0022,        \u0022source\u0022: \u0022/document/text\u0022      }    ],    \u0022outputs\u0022: [...]  }The indexer ran the skill in the skillset, but the response from the Web API requestindicates there are warnings. Review the warnings to understand how your data isimpacted and whether further action is required.This warning only occurs for Azure Cosmos DB data sources.\n"
}