{
  "Id": "342",
  "Title": "\u0022Troubleshooting Skill Graph: Identifying and Resolving Execution Issues\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe Skill Graph provides a visualhierarchy of the skillset and its order of execution sequentially and in parallel.Find issues with the skillsetAny issues reported by the indexer can be found in the adjacent Errors/Warnings tab.Notice that the Errors/Warnings tab will provide a much smaller list than the onedisplayed earlier because this list is only detailing the errors for a single document. Likethe list displayed by the indexer, you can click on a warning message and see the detailsof this warning.Select Errors/Warnings to review the notifications. You should see four:\u0022Could not execute skill because one or more skill inputs were invalid.\r\nRequiredskill input is missing. Name: \u0027text\u0027, Source: \u0027/document/content\u0027.\u0022\u0022Could not map output field \u0027locations\u0027 to search index. Check the\u0027outputFieldMappings\u0027 property of your indexer. Missing value\u0027/document/merged_content/locations\u0027.\u0022\u0022Could not map output field \u0027organizations\u0027 to search index. Check the\u0027outputFieldMappings\u0027 property of your indexer.\r\nMissing value\u0027/document/merged_content/organizations\u0027.\u0022\u0022Skill executed but may have unexpected results because one or more skill inputswere invalid. Optional skill input is missing. Name: \u0027languageCode\u0027, Source:\u0027/document/languageCode\u0027. Expression language parsing issues: Missing value\u0027/document/languageCode\u0027.\r\n\u0022Many skills have a \u0022languageCode\u0022 parameter. By inspecting the operation, you can seethat this language code input is missing from the EntityRecognitionSkill.#1, which isthe same Entity Recognition skill that is having trouble with \u0027locations\u0027 and\u0027organizations\u0027 output.Because all four notifications are about this skill, your next step is to debug this skill. Ifpossible, start by solving input issues first before moving on to output issues.In the Errors/Warnings tab, there are two missing inputs for an operation labeledEntityRecognitionSkill.#1. The detail of the first error explains that a required input for\u0027text\u0027 is missing.\nThe second indicates a problem with an input value\u0022/document/languageCode\u0022.1. In AI Enrichments \u003E Skill Graph, select the skill labeled #1 to display its details inthe right pane.2. Select the Executions tab and locate the input for \u0022text\u0022.3. Select the \u003C/\u003E symbol to pop open the Expression Evaluator.\n"
}