{
  "Id": "877",
  "Title": "\u0022Troubleshooting Large Document Indexing in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022output\u0022          }        ]      }Error: Could not \u0027MergeOrUpload\u0027 | \u0027Delete\u0027document to the search indexReasonDetails/ExampleResolutionA field contains a term thatis too largeA term in your document is largerthan the 32-KB limitYou can avoid thisrestriction by ensuringthe field isn\u0027t configuredas filterable, facetable, orsortable.\r\nDocument is too large to beindexedA document is larger than themaximum api request sizeHow to index large datasetsDocument contains toomany objects in collectionA collection in your documentexceeds the maximum elementsacross all complex collections limit.The document with key \u00271000052\u0027 has\u00274303\u0027 objects in collections (JSONarrays).\r\nAt most \u00273000\u0027 objects areallowed to be in collections acrossthe entire document. Remove objectsfrom collections and try indexingthe document again.We recommend reducingthe size of the complexcollection in thedocument to below thelimit and avoid highstorage utilization.Trouble connecting to thetarget index (that persistsafter retries) because theservice is under other load,such as querying orindexing.\r\nFailed to establish connection toupdate index. Search service is underheavy load.Scale up your searchserviceSearch service is beingpatched for service update,or is in the middle of atopology reconfiguration.Failed to establish connection toupdate index. Search service iscurrently down/Search service isundergoing a transition.Configure service with atleast 3 replicas for 99. 9%availability per SLAdocumentationFailure in the underlyingcompute/networkingresource (rare)Failed to establish connection toupdate index. An unknown failureoccurred.Configure indexers to runon a schedule to pick upfrom a failed state.An indexing request madeto the target index wasn\u0027tacknowledged within atimeout period due tonetwork issues.\nCould not establish connection to thesearch index in a timely manner.Configure indexers to runon a schedule to pick upfrom a failed state.Additionally, try loweringthe indexer batch size ifthis error conditionpersists.\n"
}