{
  "Id": "1224",
  "Title": "\u0022Troubleshooting Collection Filter Errors in Lambda Expressions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA lambda expression is a sub-filter that is applied toeach element of a collection.Not every feature of filter expressions is available inside a lambda expression. Whichfeatures are available differs depending on the data type of the collection field that youwant to filter. This can result in an error if you try to use a feature in a lambda expressionthat isn\u0027t supported in that context. If you\u0027re encountering such errors while trying towrite a complex filter over collection fields, this article will help you troubleshoot theproblem.\r\nThe following table lists errors that you might encounter when trying to execute acollection filter. These errors happen when you use a feature of filter expressions thatisn\u0027t supported inside a lambda expression. Each error gives some guidance on how youcan rewrite your filter to avoid the error. The table also includes a link to the relevantsection of this article that provides more information on how to avoid that error.Error messageSituationDetailsThe function \u0027ismatch\u0027 has no parametersbound to the range variable \u0027s\u0027. Onlybound field references are supportedinside lambda expressions (\u0027any\u0027 or \u0027all\u0027).\r\nHowever, you can change your filter sothat the \u0027ismatch\u0027 function is outside thelambda expression and try again.Using search.ismatch orsearch.ismatchscoring inside alambda expressionRules forfilteringcomplexcollectionsInvalid lambda expression. Found a testfor equality or inequality where theopposite was expected in a lambdaexpression that iterates over a field oftype Collection(Edm. String). For \u0027any\u0027, useexpressions of the form \u0027x eq y\u0027 or\u0027search.in(...)\u0027. For \u0027all\u0027, use expressions ofthe form \u0027x ne y\u0027, \u0027not (x eq y)\u0027, or \u0027notsearch.in(...)\u0027.Filtering on a field of typeCollection(Edm.String)Rules forfiltering stringcollectionsCommon collection filter errorsError messageSituationDetailsInvalid lambda expression.\n"
}