{
  "Id": "1342",
  "Title": "\u0022Understanding and Monitoring Throttled Search Queries in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDepending on your client, a throttled request can be indicated in these ways:A service returns an error \u0022You are sending too many requests. Please try againlater.\u0022A service returns a 503 error code indicating the service is currently unavailable.If you are using the portal (for example, Search Explorer), the query is droppedsilently and you will need to click Search again.\r\nTo confirm throttled queries, use Throttled search queries metric. You can exploremetrics in the portal or create an alert metric as described in this article. For queries thatwere dropped within the sampling interval, use Total to get the percentage of queriesthat did not execute.Aggregation TypeThrottlingAveragePercentage of queries dropped within the interval.CountThe number of metrics emitted to the log within the one-minute interval.Throttled queriesAggregation TypeThrottlingMaximumPercentage of queries dropped within the interval.MinimumPercentage of queries dropped within the interval.TotalPercentage of queries dropped within the interval.\r\nFor Throttled Search Queries Percentage, minimum, maximum, average and total, allhave the same value: the percentage of search queries that were throttled, from thetotal number of search queries during one minute.In the following screenshot, the first number is the count (or number of metrics sent tothe log). Additional aggregations, which appear at the top or when hovering over themetric, include average, maximum, and total.\r\nIn this sample, no requests were dropped.For a quick look at the current numbers, the Monitoring tab on the service Overviewpage shows three metrics (Search latency, Search queries per second (per search unit),Throttled Search Queries Percentage) over fixed intervals measured in hours, days, andweeks, with the option of changing the aggregation type. For deeper exploration, open metrics explorer from the Monitoring menu so that youcan layer, zoom in, and visualize data to explore trends or anomalies. Learn more aboutmetrics explorer by completing this tutorial on creating a metrics chart.1. Under the Monitoring section, select Metrics to open the metrics explorer with thescope set to your search service.2. Under Metric, choose one from the dropdown list and review the list of availableaggregations for a preferred type. The aggregation defines how the collectedvalues will be sampled over each time interval.Explore metrics in the portal3.\n"
}