{
  "Id": "1667",
  "Title": "\u0022Understanding the Expression Language for Enriched Document Paths\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIt\u0027s a fulldescription of the expression language used to construct paths to nodes in an enricheddocument.Azure Cognitive Search skills can use and enrich the data coming from the data sourceand from the output of other skills. The data working set that represents the currentstate of the indexer work for the current document starts from the raw data comingfrom the data source and is progressively enriched with each skill iteration\u0027s output data.That data is internally organized in a tree-like structure that can be queried to be usedas skill inputs or to be added to the index.\r\nThe nodes in the tree can be simple valuessuch as strings and numbers, arrays, or complex objects and even binary files. Evensimple values can be enriched with additional structured information. For example, astring can be annotated with additional information that is stored beneath it in theenrichment tree. The expressions used to query that internal structure use a rich syntaxthat is detailed in this article. The enriched data structure can be inspected from debugsessions. Expressions querying the structure can also be tested from debug sessions.Throughout the article, we\u0027ll use the following enriched data as an example.\r\nThis data istypical of the kind of structure you would get when enriching a document using askillset with OCR, key phrase extraction, text translation, language detection, entityrecognition skills and a custom tokenizer skill.PathValuedocument merged_content\u0022Study of BMN 110 in Pediatric Patients\u0022...  keyphrases   [0]\u0022Study of BMN\u0022   [1]\u0022Syndrome\u0022   [2]\u0022Pediatric Patients\u0022   . ..  locationsPathValue   [0]\u0022IVA\u0022  translated_text\u0022Étude de BMN 110 chez les patients pédiatriques\u0022...  entities   [0]    category\u0022Organization\u0022    subcategorynull    confidenceScore0.\n"
}