{
  "Id": "1041",
  "Title": "\u0022Understanding Output Field Mappings in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAn output field mapping is defined in an indexer and has the followingelements:JSONIn contrast with a fieldMappings definition that maps a path between two physical datastructures, an outputFieldMappings definition maps in-memory data to fields in a searchindex.Output field mappings are required if your indexer has an attached skillset that createsnew information, such as text translation or key phrase extraction. During indexerexecution, AI-generated information exists in memory only. To persist this information ina search index, you\u0027ll need to tell the indexer where to send the data.\r\nOutput field mappings can also be used to retrieve specific nodes in a sourcedocument\u0027s complex type. For example, you might want just \u0022FullName/LastName\u0022 in amulti-part \u0022FullName\u0022 property. When you don\u0027t need the full complex structure, youcan flatten individual nodes in a nested data structures, and then use an output fieldmapping to send the output to a string collection in your search index.\r\nOutput field mappings apply to:In-memory content that\u0027s created by skills or extracted by an indexer. The sourcefield is a node in an enriched document tree.\u0022outputFieldMappings\u0022: [   {     \u0022sourceFieldName\u0022: \u0022document/path-to-a-node-in-an-enriched-document\u0022,     \u0022targetFieldName\u0022: \u0022some-search-field-in-an-index\u0022,     \u0022mappingFunction\u0022: null   } ], Search indexes. If you\u0027re populating a knowledge store, use projections for datapath configuration.Output field mappings are applied after skillset execution or after document cracking ifthere\u0027s no associated skillset.Output field mappings are added to the outputFieldMappings array in an indexerdefinition, typically placed after the fieldMappings array. An output field mappingconsists of three parts.JSONPropertyDescriptionsourceFieldNameRequired. Specifies a path to enriched content. An example might be/document/content. See Reference annotations in an Azure Cognitive Searchskillset for path syntax and examples.targetFieldNameOptional.\n"
}