{
  "Id": "470",
  "Title": "\u0022Understanding Analyzers in Azure Cognitive Search: Configuration and Usage\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor fields of this configuration, analysis occurs during indexing when tokens are created,and then again during query execution when queries are parsed and the engine scansfor matching tokens. A match is more likely to occur when the same analyzer is used forboth indexing and queries, but you can set the analyzer for each workloadindependently, depending on your requirements.\r\nQuery types that are not full text search, such as filters or fuzzy search, don\u0027t go throughthe analysis phase on the query side. Instead, the parser sends those strings directly tothe search engine, using the pattern that you provide as the basis for the match.Typically, these query forms require whole-string tokens to make pattern matchingwork.\r\nTo ensure whole term tokens are preserved during indexing, you might needcustom analyzers. For more information about when and why query terms are analyzed,see Full text search in Azure Cognitive Search.For more background on lexical analysis, listen to the following video clip for a briefexplanation.\r\nIn Azure Cognitive Search, an analyzer is automatically invoked on all string fieldsmarked as searchable.https://www.youtube-nocookie.com/embed/Y_X6USgvB1g?version=3\u0026start=132\u0026end=189Default analyzerBy default, Azure Cognitive Search uses the Apache Lucene Standard analyzer (standardlucene), which breaks text into elements following the \u0022Unicode Text Segmentation\u0022rules. The standard analyzer converts all characters to their lower case form. Bothindexed documents and search terms go through the analysis during indexing andquery processing.You can override the default on a field-by-field basis. Alternative analyzers can be alanguage analyzer for linguistic processing, a custom analyzer, or a built-in analyzerfrom the list of available analyzers.The following list describes which analyzers are available in Azure Cognitive Search.CategoryDescriptionStandardLucene analyzerDefault. No specification or configuration is required. This general-purposeanalyzer performs well for many languages and scenarios.Built-inanalyzersConsumed as-is and referenced by name.\n"
}