{
  "Id": "1572",
  "Title": "\u0022Understanding Data Types and Indexing in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStringIf using geography data types, onlygeography instances of type POINTwith SRID 4326 (which is the default)are supported. If using strings, onlyGeoJSON points in the followingformat are supported: {\u0022type\u0022:\u0022Point\u0022, \u0022coordinates\u0022: [long, lat]}time, timespanvarbinaryimagexmlgeometryCLR typesN/ANot supported.\r\nJSON data typeAllowed target index field typesboolEdm.Boolean, Edm.StringIntegral numbersEdm.Int32, Edm.Int64, Edm.StringFloating-point numbersEdm.Double, Edm.StringstringEdm.Stringarrays of primitive types, forexample [ \u0022a\u0022, \u0022b\u0022, \u0022c\u0022 ]Collection(Edm.String)Strings that look like datesEdm.\r\nDateTimeOffset, Edm.StringJSON Data Types to Azure AI Search Data TypesJSON data typeAllowed target index field typesGeoJSON point objectsEdm.GeographyPointGeoJSON points are JSON objects in the following format:{\u0022type\u0022 : \u0022Point\u0022, \u0022coordinates\u0022: [long, lat]}JSON objectsEdm.\r\nComplexTypeAzure AI Search maps JSON objects to corresponding complextype schemasCreate Data SourceCreate IndexerSupported data typesIndexer operationsAzure AI Search REST APIsSee alsoStopwords reference (Microsoftanalyzers)Article•05/17/2022When text is indexed into Azure Cognitive Search, it\u0027s processed by analyzers so it canbe efficiently stored in a search index. During this lexical analysis process, languageanalyzers will remove stopwords specific to that language. Stopwords are non-essentialwords such as \u0022the\u0022 or \u0022an\u0022 that can be removed without compromising the lexicalintegrity of your content. Stopword removal applies to all supported Lucene and Microsoft analyzers used inAzure Cognitive Search.This article lists the stopwords used by the Microsoft analyzer for each language.For the stopword list for Lucene analyzers, see the Apache Lucene source code onGitHub.\n"
}