{
  "Id": "667",
  "Title": "\u0022Understanding Azure Cognitive Search Client Library Version 11\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSearch\u003CMountain\u003E(\u0022Rainier\u0022);Inside v11Each version of an Azure Cognitive Search client library targets a corresponding versionof the REST API. The REST API is considered foundational to the service, with individualSDKs wrapping a version of the REST API. As a .NET developer, it can be helpful toreview the more verbose REST API documentation for more in depth coverage ofspecific objects or operations.\r\nVersion 11 targets the 2020-06-30 search servicespecification.Version 11.0 fully supports the following objects and operations:Index creation and managementSynonym map creation and managementIndexer creation and managementIndexer data source creation and managementSkillset creation and managementAll query types and syntaxVersion 11.\r\n1 additions (change log details):FieldBuilder (added in 11.1)Serializer property (added in 11.1) to support custom serializationVersion 11.2 additions (change log details):EncryptionKey property added indexers, data sources, and skillsetsIndexingParameters.IndexingParametersConfiguration property supportGeospatial types are natively supported in FieldBuilder. SearchFilter can encodegeometric types from Microsoft.Spatial without an explicit assembly dependency.You can also continue to explicitly declare a dependency on Microsoft. Spatial.Examples of this technique are available for System.Text.Json andNewtonsoft.Json.Version 11.3 additions (change log details):KnowledgeStoreAdded support for Azure.Core.GeoJson types in SearchDocument, SearchFilter andFieldBuilder.Added EventSource based logging. Event source name is Azure-Search-Documents. Current set of events are focused on tuning batch sizes forSearchIndexingBufferedSender.Added CustomEntityLookupSkill and DocumentExtractionSkill. AddedDefaultCountryHint in LanguageDetectionSkill.Quickstarts, tutorials, and C# samples have been updated to use theAzure.Search.Documents package.\n"
}