{
  "Id": "585",
  "Title": "\u0022Understanding Feature Availability and Tradeoffs in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe primarytradeoff is higher query latency, which you should validate for your specific applicationrequirements.You can find out more about the various tiers on the pricing page, in the Service limits in Azure AISearch article, and on the portal page when you\u0027re provisioning a service.Most features are available on all tiers, including the free tier.\r\nIn a few cases, the tier determines theavailability of a feature. The following table describes the constraints.FeatureLimitationsindexersIndexers aren\u0027t available on S3 HD. Indexers have more limitations on the free tier.AI enrichmentRuns on the Free tier but not recommended.Managed or trustedidentities for outbound(indexer) accessNot available on the Free tier.\r\nCustomer-managedencryption keysNot available on the Free tier.IP firewall accessNot available on the Free tier.Private endpoint(integration with AzurePrivate Link)For inbound connections to a search service, not available on the Free tier. Foroutbound connections by indexers to other Azure resources, not available on Free orS3 HD.\r\nFor indexers that use skillsets, not available on Free, Basic, S1, or S3 HD.Availability ZonesNot available on the Free or Basic tier.Semantic rankingNot available on the Free tier.Resource-intensive features might not work well unless you give it sufficient capacity. For example, AIenrichment has long-running skills that time out on a Free service unless the dataset is small.\r\nFeature availability by tierUpper limitsTiers determine the maximum storage of the service itself, as well as the maximum number of indexes,indexers, data sources, skillsets, and synonym maps that you can create. For a full break out of all limits,see Service limits in Azure AI Search. Tier pricing includes details about per-partition storage that ranges from 2 GB for Basic, up to 2 TB forStorage Optimized (L2) tiers. Other hardware characteristics, such as speed of operations, latency, andtransfer rates, aren\u0027t published, but tiers that are designed for specific solution architectures are built onhardware that has the features to support those scenarios.\n"
}