{
  "Id": "576",
  "Title": "\u0022Understanding Azure Search: Service Tiers and Usage Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can also use Azure PowerShell, Azure CLI, the Management REST API, anAzure Resource Manager service template, or a Bicep file.The following service properties are fixed for the lifetime of the service. Because they\u0027refixed, consider the usage implications as you fill in each property:Service name becomes part of the URL endpoint (review tips for helpful servicenames).\r\nTier (Free, Basic, Standard, and so forth) determines the underlying physicalhardware and billing. Some features are tier-constrained.Before you startService region can determine the availability of certain scenarios. If you need highavailability or AI enrichment, you\u0027ll need to create the resource in a region thatprovides the feature.\r\nTo try search for free, open a free Azure account and then create your search serviceby choosing the Free tier. You can have one free search service per Azure subscription.Free search services are intended for short-term evaluation of the product for non-production applications. If you decide you would like to continue using the service for aproduction application, create a new search service on a billable tier.Alternatively, you can use free credits to try out paid Azure services, which means youcan create your search service at Basic or above to get more capacity. Your credit card isnever charged unless you explicitly change your settings and ask to be charged. Anotherapproach is to activate Azure credits in a Visual Studio subscription. A Visual Studiosubscription gives you credits every month you can use for paid Azure services.Paid (or billable) search occurs when you choose a billable tier (Basic or above) whencreating the resource on a billable Azure subscription.1. Sign in to the Azure portal.2. Click the plus sign (\u0022\u002B Create Resource\u0022) in the top-left corner.3. Use the search bar to find \u0022Azure AI Search\u0022.If you\u0027ve more than one subscription, choose one for your search service.\n"
}