{
  "Id": "1598",
  "Title": "\u0022Understanding Field Paths and Expressions in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf$orderby expressions are applied as a post-processing step over a result set tosort the documents that are returned.$select expressions determine which document fields are included in the result set.The syntax of these expressions is distinct from the simple or full query syntax used inthe search parameter, although there\u0027s some overlap in the syntax for referencing fields.\r\nThe following EBNF (Extended Backus-Naur Form) defines the grammar of field paths.７ NoteTerminology in Azure AI Search differs from the OData standard in a few ways.What we call a field in Azure AI Search is called a property in OData, and similarlyfor field path versus property path.\r\nAn index containing documents in Azure AISearch is referred to more generally in OData as an entity set containing entities.The Azure AI Search terminology is used throughout this reference.Field pathsAn interactive syntax diagram is also available:A field path is composed of one or more identifiers separated by slashes. Each identifieris a sequence of characters that must start with an ASCII letter or underscore, andcontain only ASCII letters, digits, or underscores. The letters can be upper- or lower-case.An identifier can refer either to the name of a field, or to a range variable in the contextof a collection expression (any or all) in a filter.\r\nA range variable is like a loop variablethat represents the current element of the collection. For complex collections, thatvariable represents an object, which is why you can use field paths to refer to subfieldsof the variable. This is analogous to dot notation in many programming languages. Examples of field paths are shown in the following table:Field pathDescriptionHotelNameRefers to a top-level field of the indexAddress/CityRefers to the City subfield of a complex field in the index; Address isof type Edm.ComplexType in this exampleRooms/TypeRefers to the Type subfield of a complex collection field in the index;Rooms is of type Collection(Edm.\n"
}