{
  "Id": "390",
  "Title": "\u0022Understanding Relevance Scores in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfscore\u0022: 0.25610128,      \u0022id\u0022: \u00221\u0022,      \u0022title\u0022: \u0022Hotel Atman\u0022,      \u0022description\u0022: \u0022Spacious rooms, ocean view, walking distance to the beach.\u0022    },    {      \u0022@search.score\u0022: 0.08951007,      \u0022id\u0022: \u00223\u0022,      \u0022title\u0022: \u0022Playa Hotel\u0022,      \u0022description\u0022: \u0022Comfortable, air-conditioned rooms with ocean view.\u0022    },    {      \u0022@search.\r\nscore\u0022: 0.05967338,Document 1 matched the query best because both the term spacious and the requiredphrase ocean view occur in the description field. The next two documents match onlythe phrase ocean view. It might be surprising that the relevance score for document 2and 3 is different even though they matched the query in the same way.\r\nIt\u0027s because thescoring formula has more components than just TF/IDF. In this case, document 3 wasassigned a slightly higher score because its description is shorter. Learn about Lucene\u0027sPractical Scoring Formula to understand how field length and other factors caninfluence the relevance score.Some query types (wildcard, prefix, regex) always contribute a constant score to theoverall document score. This allows matches found through query expansion to beincluded in the results, but without affecting the ranking.An example illustrates why this matters.\r\nWildcard searches, including prefix searches, areambiguous by definition because the input is a partial string with potential matches on avery large number of disparate terms (consider an input of \u0022tour*\u0022, with matches foundon “tours”, “tourettes”, and “tourmaline”). Given the nature of these results, there\u0027s noway to reasonably infer which terms are more valuable than others. For this reason, weignore term frequencies when scoring results in queries of types wildcard, prefix andregex. In a multi-part search request that includes partial and complete terms, resultsfrom the partial input are incorporated with a constant score to avoid bias towardspotentially unexpected matches.There are two ways to tune relevance scores in Azure Cognitive Search:1.\n"
}