{
  "Id": "26",
  "Title": "\u0022Understanding Azure AI Search: Features, Security, and Performance Optimization\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfGiven the nature of these results, there\u0027s no wayto reasonably infer which terms are more valuable than others. For this reason, termfrequencies are ignored when scoring results in queries of types wildcard, prefix, andregex. Search results based on a partial input are given a constant score to avoid biastowards potentially unexpected matches.Why are my wildcard searches slow?Can I search across multiple indexes?Why is the search score a constant 1.0 for everymatch?SecurityIt stores your data wherever your service is deployed. Azure AI Search doesn\u0027t storecustomer data outside of the deployment region.\r\nYes, if you use the built-in skills based on Azure AI services, the indexer sends requeststo Azure AI services over the internal network. If you add a custom skill, the indexersends content to the URI provided in the custom skill over the public network.Not exactly. Typically, users who are authorized to run your application are alsoauthorized to see all search results.\r\nAzure AI Search doesn\u0027t have built-in support forrow-level or document-level permissions, but you can implement security filters as aworkaround.Yes, you can use role-based authorization for data plane operations over content.You can use the Azure portal on a network-protected search service if you create anetwork exception that allows client and portal access.\r\nFor more information, seeconnect through an IP firewall or connect through a private endpoint.If your question isn\u0027t answered here, you can refer to the following sources for morequestions and answers. Where does Azure AI Search store customerdata?Does Azure AI Search send customer data toother services for processing?Can I control access to search results based onuser identity?Can I control access to operations based on useridentity?Can I use the Azure portal to view and managesearch content if the search service is behind anIP firewall or a private endpoint?Next stepsStack Overflow: Azure AI SearchHow full text search works in Azure AI SearchWhat is Azure AI Search?Quickstart: Full text search using theAzure SDKsArticle•06/11/2023Learn how to use the Azure.\n"
}