{
  "Id": "437",
  "Title": "\u0022Understanding RRF Ranking and Scoring in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHow RRF ranking works3. Combine scores. For each document, the engine sums the reciprocal rank scoresobtained from each search system, producing a combined score for eachdocument. 4. The engine ranks documents based on combined scores and sorts them. Theresulting list is the fused ranking.\r\nOnly fields marked as searchable in the index, or searchFields in the query, are usedfor scoring. Only fields marked as retrievable, or fields specified in select in the query,are returned in search results, along with their search score.RRF is used anytime there\u0027s more than one query execution.\r\nThe following examplesillustrate query patterns where parallel query execution occurs:A full text query, plus one vector query (simple hybrid scenario), equals two queryexecutions.A full text query, plus one vector query targeting two vector fields, equals threequery executions.A full text query, plus two vector queries targeting five vector fields, equals 11query executionsWhenever results are ranked, @search.\r\nscore property contains the value used to orderthe results. Scores are generated by ranking algorithms that vary for each method. Eachalgorithm has its own range and magnitude.The following chart identifies the scoring property returned on each match, algorithm,and range of scores for each relevance ranking algorithm.\r\nSearchmethodParameterScoring algorithmRangefull-textsearch@search.scoreBM25 algorithmNo upper limit.vectorsearch@search.scoreHNSW algorithm,using the similaritymetric specified inthe HNSWconfiguration.0.333 - 1.00 (Cosine), 0 to 1 forEuclidean and DotProduct.Parallel query executionScores in a hybrid search resultsSearchmethodParameterScoring algorithmRangehybridsearch@search. scoreRRF algorithmUpper limit is bounded by thenumber of queries being fused, witheach query contributing a maximumof approximately 1 to the RRF score.For example, merging three querieswould produce higher RRF scoresthan if only two search results aremerged.semanticranking@search.rerankerScoreSemantic ranking0.00 - 4.00Semantic ranking doesn\u0027t participate in RRF. Its score (@search.\n"
}