{
  "Id": "610",
  "Title": "\u0022Understanding Azure Cognitive Search Service: Replicas, Partitions, and Costs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfA Basic service can have exactly one partition and up to three replicas, for a maximumlimit of three SUs. The only adjustable resource is replicas. You need a minimum of tworeplicas for high availability on queries.All Standard and Storage Optimized search services can assume the followingcombinations of replicas and partitions, subject to the 36-SU limit allowed for thesetiers.\r\n1 partition2 partitions3 partitions4 partitions6 partitions12 partitions1 replica1 SU2 SU3 SU4 SU6 SU12 SU2 replicas2 SU4 SU6 SU8 SU12 SU24 SUErrors during scalingPartition and replica combinations1 partition2 partitions3\r\npartitions4 partitions6 partitions12 partitions3 replicas3 SU6 SU9 SU12 SU18 SU36 SU4 replicas4 SU8 SU12 SU16 SU24 SUN/A5 replicas5 SU10 SU15 SU20 SU30 SUN/A6 replicas6 SU12 SU18 SU24 SU36 SUN/A12 replicas12 SU24 SU36 SUN/AN/AN/ASUs,\r\npricing, and capacity are explained in detail on the Azure website.\r\nFor moreinformation, see Pricing Details.７ NoteThe number of replicas and partitions divides evenly into 12 (specifically, 1, 2, 3, 4,6, 12). Azure Cognitive Search pre-divides each index into 12 shards so that it canbe spread in equal portions across all partitions. For example, if your service hasthree partitions and you create an index, each partition will contain four shards ofthe index. How Azure Cognitive Search shards an index is an implementation detail,subject to change in future releases. Although the number is 12 today, youshouldn\u0027t expect that number to always be 12 in the future.Next stepsManage costsPlan and manage costs of an Azure AISearch serviceArticle•11/15/2023This article explains the billing model and billable events of Azure AI Search, andprovides direction for managing the costs.As a first step, estimate your baseline costs by using the Azure pricing calculator.Alternatively, estimated costs and tier comparisons can also be found in the Select apricing tier page when creating a service.\n"
}