{
  "Id": "1633",
  "Title": "\u0022Understanding Logical Operators and Null Fields in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHowever, Boolean fields can be null, so you needto be aware of how the and, or, and not operators behave in the presence of null. Thisis summarized in the following table, where b is a field of type Edm.Boolean:ExpressionResult when b is nullbfalsenot btrueb eq truefalseb eq falsefalseb eq nulltrueb ne truetrueb ne falsetrueb ne nullfalse） ImportantThere are some situations where not all kinds of sub-expression can be used withand/or, particularly inside lambda expressions. See OData collection operators inAzure AI Search for details.\r\nLogical operators and nullExpressionResult when b is nullb and truefalseb and falsefalseb or truetrueb or falsefalseWhen a Boolean field b appears by itself in a filter expression, it behaves as if it hadbeen written b eq true, so if b is null, the expression evaluates to false. Similarly, notb behaves like not (b eq true), so it evaluates to true.\r\nIn this way, null fields behavethe same as false. This is consistent with how they behave when combined with otherexpressions using and and or, as shown in the table above. Despite this, a directcomparison to false (b eq false) will still evaluate to false. In other words, null isnot equal to false, even though it behaves like it in Boolean expressions.\r\nMatch documents where the rating field is between 3 and 5, inclusive:odata-filter-exprMatch documents where all elements of the ratings field are less than 3 or greater than5:odata-filter-exprMatch documents where the location field is within the given polygon, and thedocument does not contain the term \u0022public\u0022. odata-filter-exprExamples    rating ge 3 and rating le 5    ratings/all(r: r lt 3 or r gt 5)    geo.intersects(location, geography\u0027POLYGON((-122.031577 47.578581, -122.031577 47.678581, -122.131577 47.678581, -122.031577 47.578581))\u0027) and not search.\n"
}