{
  "Id": "1289",
  "Title": "\u0022Understanding Scoring Profiles in Azure AI Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfScoring profiles are defined in a search index and invoked on non-vector fields in queryrequests. You can create multiple profiles and then modify query logic to choose whichone is used.A scoring profile is named object defined in an index schema. A profile can becomposed of weighted fields, functions, and parameters.The following definition shows a simple profile named \u0022geo\u0022.\r\nThis example boostsresults that have the search term in the hotelName field. It also uses the distancefunction to favor results that are within 10 kilometers of the current location. If someonesearches on the term \u0027inn\u0027, and \u0027inn\u0027 happens to be part of the hotel name, documentsthat include hotels with \u0027inn\u0027 within a 10 KM radius of the current location will appearhigher in the search results.\r\nJSON７ NoteUnfamiliar with relevance concepts? The following video segment on YouTubefast-forwards to how scoring profiles work in Azure AI Search. You can also visitRelevance and scoring in Azure AI Search for more background.\r\nScoring profile definition\u0022scoringProfiles\u0022: [  {      \u0022name\u0022:\u0022geo\u0022,    \u0022text\u0022: {        \u0022weights\u0022: {          \u0022hotelName\u0022: 5      }                              To use this scoring profile, your query is formulated to specify scoringProfile parameterin the request. If you\u0027re using the REST API, queries are specified through GET and POSTrequests.\r\nIn the following example, \u0022currentLocation\u0022 has a delimiter of a single dash(-). It\u0027s followed by longitude and latitude coordinates, where longitude is a negativevalue.HTTPNotice the syntax differences when using POST. In POST, \u0022scoringParameters\u0022 is pluraland it\u0027s an array.HTTPThis query searches on the term \u0022inn\u0022 and passes in the current location. Notice that thisquery includes other parameters, such as scoringParameter. Query parameters, including\u0022scoringParameter\u0022, are described in Search Documents (REST API).See the Extended example to review a more detailed example of a scoring profile.\n"
}