{
  "Id": "553",
  "Title": "\u0022Understanding Azure Policy Compliance and Regulatory Standards Mapping\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHowever, there often isn\u0027t aone-to-one or complete match between a control and one or more policies. Assuch, Compliant in Azure Policy refers only to the policies themselves. This doesn\u0027tensure that you\u0027re fully compliant with all requirements of a control. In addition, thecompliance standard includes controls that aren\u0027t addressed by any Azure Policydefinitions at this time. Therefore, compliance in Azure Policy is only a partial viewof your overall compliance status. The associations between controls and AzurePolicy Regulatory Compliance definitions for these compliance standards canchange over time.\r\nTo review how the available Azure Policy built-ins for all Azure services map to thiscompliance standard, see Azure Policy Regulatory Compliance - CIS Microsoft AzureFoundations Benchmark 1.3.0. For more information about this compliance standard,see CIS Microsoft Azure Foundations Benchmark.DomainControlIDControl titlePolicyPolicyversion5 Logging andMonitoring5.3Ensure that Diagnostic Logsare enabled for all serviceswhich support it.Resource logs in Searchservices should beenabled5.0.0To review how the available Azure Policy built-ins for all Azure services map to thiscompliance standard, see Azure Policy Regulatory Compliance details for CIS v1.\r\n4.0. Formore information about this compliance standard, see CIS Microsoft Azure FoundationsBenchmark.DomainControlIDControl titlePolicyPolicyversion5 Logging andMonitoring5.3Ensure that Diagnostic LogsAre Enabled for All Servicesthat Support it.Resource logs in Searchservices should beenabled5.0.0To review how the available Azure Policy built-ins for all Azure services map to thiscompliance standard, see Azure Policy Regulatory Compliance details for CIS v2.0.0. ForCIS Microsoft Azure Foundations Benchmark1.3.0ﾉExpand table(Azure portal)(GitHub)CIS Microsoft Azure Foundations Benchmark1. 4.0ﾉExpand table(Azure portal)(GitHub)CIS Microsoft Azure Foundations Benchmark2.0.0more information about this compliance standard, see CIS Microsoft Azure FoundationsBenchmark.DomainControlIDControl titlePolicyPolicyversion55.4Ensure that Azure MonitorResource Logging is Enabled forAll Services that Support itResource logs in Searchservices should beenabled5.0.0To review how the available Azure Policy built-ins for all Azure services map to thiscompliance standard, see Azure Policy Regulatory Compliance - FedRAMP High. Formore information about this compliance standard, see FedRAMP High.\n"
}