{
  "Id": "1642",
  "Title": "\u0022Understanding Query Syntax in Azure AI Search REST API\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfismatch\u0027(\u0027scoring\u0027)?\u0027(\u0027 search_is_match_parameters \u0027)\u0027search_is_match_parameters ::=    string_literal(\u0027,\u0027 string_literal(\u0027,\u0027 query_type \u0027,\u0027 search_mode)?)?query_type ::= \u0022\u0027full\u0027\u0022 | \u0022\u0027simple\u0027\u0022search_mode ::= \u0022\u0027any\u0027\u0022 | \u0022\u0027all\u0027\u0022Syntax diagramFilters in Azure AI SearchSearch Documents (Azure AI Search REST API)Lucene query syntaxSimple query syntax in Azure AI SearchOData syntax diagram for Azure AI SearchSee alsoSimple query syntax in Azure CognitiveSearchArticle•12/19/2022Azure Cognitive Search implements two Lucene-based query languages: Simple QueryParser and the Lucene Query Parser.\r\nThe simple parser is more flexible and willattempt to interpret a request even if it\u0027s not perfectly composed.\r\nBecause it\u0027s flexible,it\u0027s the default for queries in Azure Cognitive Search.Query syntax for either parser applies to query expressions passed in the \u0022search\u0022parameter of a Search Documents (REST API) request, not to be confused with theOData syntax used for the \u0022$filter\u0022 and \u0022$orderby\u0022 expressions in the same request.OData parameters have different syntax and rules for constructing queries, escapingstrings, and so on.Although the simple parser is based on the Apache Lucene Simple Query Parser class,its implementation in Cognitive Search excludes fuzzy search. If you need fuzzy search,consider the alternative full Lucene query syntax instead.\r\nThis example shows a simple query, distinguished by \u0022queryType\u0022: \u0022simple\u0022 and validsyntax. Although query type is set below, it\u0027s the default and can be omitted unlessyou\u0027re reverting from an alternative type. The following example is a search overindependent terms, with a requirement that all matching documents include \u0022pool\u0022. HTTPThe \u0022searchMode\u0022 parameter is relevant in this example. Whenever boolean operatorsare on the query, you should generally set \u0022searchMode=all\u0022 to ensure that all of thecriteria is matched. Otherwise, you can use the default \u0022searchMode=any\u0022 that favorsrecall over precision.Example (simple syntax)POST https://{{service-name}}.search.windows.\n"
}