{
  "Id": "600",
  "Title": "\u0022Understanding Sharding and Replication in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIt shows an example of how a single index is spanned across four searchunits in a service with two replicas and two partitions. Each of the four search unitsstores only half of the shards of the index. The search units in the left column store thefirst half of the shards, comprising the first partition, while those in the right columnstore the second half of the shards, comprising the second partition.\r\nSince there are tworeplicas, there are two copies of each index shard. The search units in the top row storeone copy, comprising the first replica, while those in the bottom row store another copy,comprising the second replica.The diagram above is only one example.\r\nMany combinations of partitions and replicasare possible, up to a maximum of 36 total search units.In Cognitive Search, shard management is an implementation detail andnonconfigurable, but knowing that an index is sharded helps to understand theoccasional anomalies in ranking and autocomplete behaviors:Ranking anomalies: Search scores are computed at the shard level first, and thenaggregated up into a single result set.\r\nDepending on the characteristics of shardcontent, matches from one shard might be ranked higher than matches in anotherone. If you notice counter intuitive rankings in search results, it\u0027s most likely due tothe effects of sharding, especially if indexes are small. You can avoid these rankinganomalies by choosing to compute scores globally across the entire index, butdoing so will incur a performance penalty.Autocomplete anomalies: Autocomplete queries, where matches are made on thefirst several characters of a partially entered term, accept a fuzzy parameter thatforgives small deviations in spelling. For autocomplete, fuzzy matching isconstrained to terms within the current shard. For example, if a shard contains\u0022Microsoft\u0022 and a partial term of \u0022micor\u0022 is entered, the search engine will matchon \u0022Microsoft\u0022 in that shard, but not in other shards that hold the remaining partsof the index.\n"
}