{
  "Id": "499",
  "Title": "\u0022Understanding Incremental Enrichment and Skillset Concepts in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNext stepsIncremental enrichment is a powerful feature that extends change tracking to skillsetsand AI enrichment. Incremental enrichment enables reuse of existing processed contentas you iterate over skillset design. As a next step, enable caching on your indexers.Enable caching for incremental enrichmentSkillset concepts in Azure Cognitive SearchArticle•08/08/2023This article is for developers who need a deeper understanding of skillset concepts and composition,and assumes familiarity with the high-level concepts of AI enrichment.A skillset is a reusable resource in Azure Cognitive Search that\u0027s attached to an indexer.\r\nIt containsone or more skills that call built-in AI or external custom processing over documents retrieved froman external data source.The following diagram illustrates the basic data flow of skillset execution.From the onset of skillset processing to its conclusion, skills read from and write to an enricheddocument. Initially, an enriched document is just the raw content extracted from a data source(articulated as the \u0022/document\u0022 root node). With each skill execution, the enriched document gainsstructure and substance as skill writes its output as nodes in the graph.After skillset execution is done, the output of an enriched document finds its way into an indexthrough output field mappings.\r\nAny raw content that you want transferred intact, from source to anindex, is defined through field mappings.To configure enrichment, you\u0027ll specify settings in a skillset and indexer.A skillset is an array of one or more skills that perform an enrichment, such as translating text or OCRon an image file. Skills can be the built-in skills from Microsoft, or custom skills for processing logicthat you host externally. A skillset produces enriched documents that are either consumed duringindexing or projected to a knowledge store.Skillset definitionSkills have a context, inputs, and outputs:Context refers to the scope of the operation, which could be once per document or once foreach item in a collection.\n"
}