{
  "Id": "1284",
  "Title": "\u0022Understanding Full Text Search in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOutputThe point of this expanded example is to illustrate the clarity that hit highlighting canbring to ambiguous results. In all cases, the same document is returned. Had you reliedon document IDs to verify a match, you might have missed the shift from \u0022special\u0022 to\u0022SQL\u0022.How full text search works in Azure Cognitive Search (query parsing architecture)Search explorerHow to query in .\r\nNETsearch=scial~\u0026highlight=Description \u0022@search.highlights\u0022: {     \u0022Description\u0022: [         \u0022Test queries with \u003Cem\u003Especial\u003C/em\u003E characters, plus strings for MSFT, SQL and Java.\u0022     ] search=scal~\u0026highlight=Description         \u0022@search.score\u0022: 0.4232868,         \u0022@search.highlights\u0022: {             \u0022Description\u0022: [                 \u0022Mix of special characters, plus strings for MSFT, \u003Cem\u003ESQL\u003C/em\u003E, 2019, Linux, Java.\r\n\u0022            ] See alsoHow to query in RESTConfigure BM25 relevance scoringArticle•11/15/2023In this article, learn how to configure the BM25 relevance scoring algorithm used byAzure AI Search for full text search queries. It also explains how to enable BM25 on oldersearch services.\r\nBM25 applies to:Queries that use the search parameter for full text search, on text fields having asearchable attribution.Scoring is scoped to searchFields, or to all searchable fields if searchFields isnull.The search engine uses BM25 to calculate a @searchScore for each match in a givenquery. Matching documents are ranked by their search score, with the top resultsreturned in the query response. It\u0027s possible to get some score variation in results, evenfrom the same query executing over the same search index, but usually these variationsare small and don\u0027t change the overall ranking of results.BM25 has defaults for weighting term frequency and document length.\n"
}