{
  "Id": "471",
  "Title": "\u0022Understanding and Configuring Analyzers in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe standard analyzer converts all characters to their lower case form. Bothindexed documents and search terms go through the analysis during indexing andquery processing.You can override the default on a field-by-field basis. Alternative analyzers can be alanguage analyzer for linguistic processing, a custom analyzer, or a built-in analyzerfrom the list of available analyzers.The following list describes which analyzers are available in Azure Cognitive Search.CategoryDescriptionStandardLucene analyzerDefault. No specification or configuration is required. This general-purposeanalyzer performs well for many languages and scenarios.Built-inanalyzersConsumed as-is and referenced by name.\r\nThere are two types: language andlanguage-agnostic.Specialized (language-agnostic) analyzers are used when text inputs requirespecialized processing or minimal processing. Examples of analyzers in thiscategory include Asciifolding, Keyword, Pattern, Simple, Stop, Whitespace.Language analyzers are used when you need rich linguistic support forindividual languages. Azure Cognitive Search supports 35 Lucene languageanalyzers and 50 Microsoft natural language processing analyzers.CustomanalyzersRefers to a user-defined configuration of a combination of existing elements,consisting of one tokenizer (required) and optional filters (char or token).\r\nA few built-in analyzers, such as Pattern or Stop, support a limited set of configurationoptions. To set these options, create a custom analyzer, consisting of the built-inanalyzer and one of the alternative options documented in Built-in analyzers. As withany custom configuration, provide your new configuration with a name, such asmyPatternAnalyzer to distinguish it from the Lucene Pattern analyzer. Setting an analyzer is optional. As a general rule, try using the default standard Luceneanalyzer first to see how it performs. If queries fail to return the expected results,switching to a different analyzer is often the right solution.Types of analyzersSpecifying analyzers1.\n"
}