{
  "Id": "1219",
  "Title": "\u0022Understanding Limitations of Collection Filters in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor information on what the rules for collection filters are, including examples, seeTroubleshooting OData collection filters in Azure AI Search.There are three underlying reasons why not all filter features are supported for all typesof collections:1. Only certain operators are supported for certain data types. For example, it doesn\u0027tmake sense to compare the Boolean values true and false using lt, gt, and soon.2. Azure AI Search doesn\u0027t support correlated search on fields of typeCollection(Edm.ComplexType).3. Azure AI Search uses inverted indexes to execute filters over all types of data,including collections.\r\nThe first reason is just a consequence of how the OData language and EDM type systemare defined. The last two are explained in more detail in the rest of this article.Why collection filters are limitedWhen applying multiple filter criteria over a collection of complex objects, the criteriaare correlated since they apply to each object in the collection. For example, thefollowing filter will return hotels that have at least one deluxe room with a rate less than100:odata-filter-exprIf filtering was uncorrelated, the above filter might return hotels where one room isdeluxe and a different room has a base rate less than 100.\r\nThat wouldn\u0027t make sense,since both clauses of the lambda expression apply to the same range variable, namelyroom. This is why such filters are correlated.However, for full-text search, there\u0027s no way to refer to a specific range variable. If youuse fielded search to issue a full Lucene query like this one:odata-filter-expryou may get hotels back where one room is deluxe, and a different room mentions \u0022cityview\u0022 in the description. For example, the document below with Id of 1 would matchthe query:JSONCorrelated versus uncorrelated search    Rooms/any(room: room/Type eq \u0027Deluxe Room\u0027 and room/BaseRate lt 100)    Rooms/Type:deluxe AND Rooms/Description:\u0022city view\u0022{  \u0022value\u0022: [    {      \u0022Id\u0022: \u00221\u0022,      \u0022Rooms\u0022: [        { \u0022Type\u0022: \u0022deluxe\u0022, \u0022Description\u0022: \u0022Large garden view suite\u0022 },        { \u0022Type\u0022:\n"
}