{
  "Id": "1628",
  "Title": "\u0022Understanding Azure AI Search Geo-Spatial Functions: EBNF and Syntax\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe following EBNF (Extended Backus-Naur Form) defines the grammar of thegeo.distance and geo.intersects functions, as well as the geo-spatial values on whichthey operate:７ NoteWhen using geo.distance in the $orderby parameter, the field you pass to thefunction must contain only a single geo-point. In other words, it must be of typeEdm.GeographyPoint and not Collection(Edm.\r\nGeographyPoint). It is not possible tosort on collection fields in Azure AI Search.Syntaxgeo_distance_call ::=    \u0027geo.distance(\u0027 variable \u0027,\u0027 geo_point \u0027)\u0027    | \u0027geo.distance(\u0027 geo_point \u0027,\u0027 variable \u0027)\u0027geo_point ::= \u0022geography\u0027POINT(\u0022 lon_lat \u0022)\u0027\u0022lon_lat ::= float_literal \u0027 \u0027 float_literalAn interactive syntax diagram is also available:The geo.\r\ndistance function takes two parameters of type Edm.GeographyPoint andreturns an Edm.Double value that is the distance between them in kilometers. This differsfrom other services that support OData geo-spatial operations, which typically returndistances in meters.One of the parameters to geo.\r\ndistance must be a geography point constant, and theother must be a field path (or a range variable in the case of a filter iterating over a fieldof type Collection(Edm.GeographyPoint)). The order of these parameters doesn\u0027t matter.The geography point constant is of the form geography\u0027POINT(\u003Clongitude\u003E\u003Clatitude\u003E)\u0027, where the longitude and latitude are numeric constants.\r\ngeo_intersects_call ::=    \u0027geo.intersects(\u0027 variable \u0027,\u0027 geo_polygon \u0027)\u0027/* You need at least four points to form a polygon, where the first andlast points are the same. */geo_polygon ::=    \u0022geography\u0027POLYGON((\u0022 lon_lat \u0027,\u0027 lon_lat \u0027,\u0027 lon_lat \u0027,\u0027 lon_lat_list \u0022))\u0027\u0022lon_lat_list ::= lon_lat(\u0027,\u0027 lon_lat)*OData syntax diagram for Azure AI Search７ NoteSee OData expression syntax reference for Azure AI Search for the completeEBNF.geo.distance７ NoteWhen using geo.distance in a filter, you must compare the distance returned bythe function with a constant using lt, le, gt, or ge.\n"
}