{
  "Id": "98",
  "Title": "\u0022Understanding Azure AI Search: Querying and Managing Search Results\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfResults are returned as verbose JSON documents so that you can view documentconstruction and content, in entirety. The $select parameter in a query expressioncan limit which fields are returned.Search results are composed of all fields marked as Retrievable in the index. Toview field attributes in the portal, select realestate-us-sample in the Indexes list onthe search overview page, and then open the Fields tab.\r\nKeyword search, similar to what you might enter in a commercial web browser, areuseful for testing an end-user experience. For example, assuming the built-in realestate sample index, you could enter \u0022Seattle apartments lake washington\u0022, andthen you can use Ctrl-F to find terms within the search results.\r\nQuery and filter expressions are articulated in a syntax implemented by Azure AISearch. The default is a simple syntax, but you can optionally use full Lucene formore powerful queries. Filter expressions are articulated in an OData syntax.When you\u0027re working in your own subscription, it\u0027s a good idea at the end of a projectto identify whether you still need the resources you created.\r\nResources left running cancost you money. You can delete resources individually or delete the resource group todelete the entire set of resources.TakeawaysClean up resourcesYou can find and manage resources in the portal, using the All resources or Resourcegroups link in the left-navigation pane.\r\nIf you\u0027re using a free service, remember that you\u0027re limited to three indexes, indexers,and data sources. You can delete individual items in the portal to stay under the limit.To learn more about query structures and syntax, use Postman or an equivalent tool tocreate query expressions that use more parts of the API. The Search REST API isespecially helpful for learning and exploration.Next stepsCreate a basic query in PostmanQuickstart: Create an Azure AI Searchindex using REST APIsArticle•11/15/2023This article explains how to formulate requests interactively using the Azure AI SearchREST APIs and a REST client for sending and receiving requests.\n"
}