{
  "Id": "503",
  "Title": "\u0022Understanding Azure Search Enrichment Tree and Output Field Mappings\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf[                {                    \u0022name\u0022: \u0022sentiment\u0022,                    \u0022targetName\u0022: \u0022sentiment\u0022                },                {                    \u0022name\u0022: \u0022confidenceScores\u0022,                    \u0022targetName\u0022: \u0022confidenceScores\u0022                },                {                    \u0022name\u0022: \u0022sentences\u0022,                    \u0022targetName\u0022: \u0022sentences\u0022                }            ]        }      .\r\n. .\r\n]}Enrichment treeData Source\\Parsing ModeDefaultJSON, JSON Lines \u0026 CSV……Azure SQL/document/{column1}/document/{column2}…N/AAzure Cosmos DB/document/{key1}/document/{key2}…N/AAs skills execute, output is added to the enrichment tree as new nodes. If skill execution is over theentire document, nodes are added at the first level under the root.Nodes can be used as inputs for downstream skills.\r\nFor example, skills that create content, such astranslated strings, could become input for skills that recognize entities or extract key phrases.Although you can visualize and work with an enrichment tree through the Debug Sessions visualeditor, it\u0027s mostly an internal structure.Enrichments are immutable: once created, nodes can\u0027t be edited. As your skillsets get more complex,so will your enrichment tree, but not all nodes in the enrichment tree need to make it to the index orthe knowledge store. You can selectively persist just a subset of the enrichment outputs so that you\u0027re only keeping whatyou intend to use. The output field mappings in your indexer definition will determine what contentactually gets ingested in the search index. Likewise, if you\u0027re creating a knowledge store, you canmap outputs into shapes that are assigned to projections.７ NoteThe enrichment tree format enables the enrichment pipeline to attach metadata to evenprimitive data types. The metadata won\u0027t be a valid JSON object, but can be projected into avalid JSON format in projection definitions in a knowledge store. For more information, seeShaper skill.\n"
}