{
  "Id": "1025",
  "Title": "\u0022Understanding Azure Search Skill Outputs and Source Configuration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0022source\u0022: \u0022/document/content\u0022For blobs, the source is usually the blob\u0027s contentproperty.\u0022source\u0022: \u0022/document/some-named-field\u0022For text-based skills, such as entity recognition orkey phrase extraction, the origin should be a fieldthat contains sufficient text to be analyzed, such asa \u0022description\u0022 or \u0022summary\u0022.\r\n\u0022source\u0022:\u0022/document/normalized_images/*\u0022For image content, the source is image that\u0027s beennormalized during document cracking.If the skill iterates over an array, both context and input source should include /* in thecorrect positions.Each skill is designed to emit specific kinds of output, which are referenced by name inthe skillset. A skill output has a \u0022name\u0022 and an optional \u0022targetName\u0022.\r\nSkill reference documentation for each skill describes the outputs it can produce. Thefollowing example is from the Entity Recognition skill:JSONDefine outputs\u0022outputs\u0022: [    {        \u0022name\u0022: \u0022persons\u0022,         \u0022targetName\u0022: \u0022people\u0022    },    {        \u0022name\u0022: \u0022organizations\u0022,         \u0022targetName\u0022: \u0022orgs\u0022    },    {        \u0022name\u0022: \u0022locations\u0022,         \u0022targetName\u0022: \u0022places\u0022Skills can have multiple outputs.\r\nThe \u0022name\u0022 identifies a specific output. Forexample, for Entity Recognition, output can be \u0022persons\u0022, \u0022locations\u0022,\u0022organizations\u0022, among others.\u0022targetName\u0022 specifies the name you would like this node to have in the enricheddocument. This is useful if skill outputs have the same name. If you have multipleskills that return the same output, use the \u0022targetName\u0022 for name disambiguationin enrichment node paths. If the target name is unspecified, the name property isused for both.Some situations call for referencing each element of an array separately. For example,suppose you want to pass each element of \u0022/document/orgs\u0022 separately to another skill.\n"
}