{
  "Id": "1660",
  "Title": "\u0022Understanding Query Limits and Syntax in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can use parentheses to create subqueries, including operators within theparenthetical statement. For example, motel\u002B(wifi|luxury) searches for documentscontaining the motel term and either wifi or luxury (or both).Field grouping is similar but scopes the grouping to a single field. For example,hotelAmenities:(gym\u002B(wifi|pool)) searches the field hotelAmenities for gym and wifi,or gym and pool.\r\nAzure Cognitive Search imposes limits on query size and composition becauseunbounded queries can destabilize your search service. There are limits on query sizeand composition (the number of clauses). Limits also exist for the length of prefix searchand for the complexity of regex search and wildcard search.\r\nIf your applicationgenerates search queries programmatically, we recommend designing it in such a waythat it doesn\u0027t generate queries of unbounded size.For more information on query limits, see API request limits.Query examples for simple searchQuery examples for full Lucene searchSearch DocumentsOData expression syntax for filters and sortingSimple query syntax in Azure Cognitive SearchPrecedence (grouping)Query size limitsSee alsomoreLikeThis (preview) in AzureCognitive SearchArticle•09/16/2022moreLikeThis=[key] is a query parameter in the Search Documents API that findsdocuments similar to the document specified by the document key. When a searchrequest is made with moreLikeThis, a query is generated with search terms extractedfrom the given document that describe that document best. The generated query isthen used to make the search request. The moreLikeThis parameter can\u0027t be used withthe search parameter, search=[string].By default, the contents of all top-level searchable fields are considered. If you want tospecify particular fields instead, you can use the searchFields parameter.The moreLikeThis parameter isn\u0027t supported for complex types and the presence ofcomplex types will impact your query logic.\n"
}