{
  "Id": "1690",
  "Title": "\u0022Understanding Azure AI Vision: Image Analysis Skill Documentation\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf98,             \u0022text\u0022: \u0022Jean Martin\u0022           },           {             \u0022category\u0022: \u0022Email\u0022,             \u0022subcategory\u0022: null,             \u0022length\u0022: 19,             \u0022offset\u0022: 71,             \u0022confidenceScore\u0022: 0.8,             \u0022text\u0022: \u0022contact@contoso.com\u0022           }         ],       }     }   ] } Warning casesSee alsoImage Analysis cognitive skillArticle•07/18/2023The Image Analysis skill extracts a rich set of visual features based on the imagecontent. For example, you can generate a caption from an image, generate tags, oridentify celebrities and landmarks.\r\nThis article is the reference documentation for theImage Analysis skill. See Extract text and information from images for usageinstructions.This skill uses the machine learning models provided by Azure AI Vision in Azure AIservices. Image Analysis works on images that meet the following requirements:The image must be presented in JPEG, PNG, GIF or BMP formatThe file size of the image must be less than 4 megabytes (MB)The dimensions of the image must be greater than 50 x 50 pixelsMicrosoft.Skills.Vision.ImageAnalysisSkillParameters are case-sensitive.\r\nParameter nameDescriptiondefaultLanguageCodeA string indicating the language to return. The service returns recognitionresults in a specified language. If this parameter isn\u0027t specified, the defaultvalue is \u0022en\u0022.Supported languages include all of the generally available languages ofAzure AI Vision.７ NoteThis skill is bound to Azure AI services and requires a billable resource fortransactions that exceed 20 documents per indexer per day. Execution of built-inskills is charged at the existing Azure AI services pay-as-you go price.In addition, image extraction is billable by Azure Cognitive Search.@odata. typeSkill parametersParameter nameDescriptionvisualFeaturesAn array of strings indicating the visual feature types to return. Valid visualfeature types include:adult - detects if the image is pornographic (depicts nudity or a sexact), gory (depicts extreme violence or blood) or suggestive (alsoknown as racy content).brands - detects various brands within an image, including theapproximate location.categories - categorizes image content according to a taxonomydefined by Azure AI services.description - describes the image content with a complete sentencein supported languages.faces - detects if faces are present.\n"
}