{
  "Id": "1719",
  "Title": "\u0022Understanding Sentiment Analysis with Azure AI Services\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBuilt-in skillsHow to define a skillsetErrors and warningsSee alsoSentiment cognitive skill (v3)Article•07/18/2023The Sentiment skill (v3) evaluates unstructured text and for each record, providessentiment labels (such as \u0022negative\u0022, \u0022neutral\u0022 and \u0022positive\u0022) based on the highestconfidence score found by the service at a sentence and document-level.\r\nThis skill usesthe machine learning models provided by version 3 of Language Service in Azure AIservices. It also exposes opinion mining capabilities, which provides more granularinformation about the opinions related to attributes of products or services in text.Microsoft.Skills.Text.V3.SentimentSkillThe maximum size of a record should be 5000 characters as measured by String.\r\nLength.If you need to break up your data before sending it to the sentiment skill, use the TextSplit skill.Parameters are case-sensitive.Parameter NameDescriptiondefaultLanguageCode(optional) The language code to apply to documents that don\u0027t specifylanguage explicitly.See the full list of supported languages.modelVersion(optional) Specifies the version of the model to use when callingsentiment analysis. It will default to the most recent version when notspecified. We recommend you do not specify this value unless it\u0027snecessary.７ NoteThis skill is bound to Azure AI services and requires a billable resource fortransactions that exceed 20 documents per indexer per day.\r\nExecution of built-inskills is charged at the existing Azure AI services pay-as-you go price.@odata.typeData limitsSkill parametersParameter NameDescriptionincludeOpinionMiningIf set to true, enables the opinion mining feature, which allows aspect-based sentiment analysis to be included in your output results. Defaultsto false. Input NameDescriptiontextThe text to be analyzed.languageCode(optional) A string indicating the language of the records. If this parameter is notspecified, the default value is \u0022en\u0022.See the full list of supported languages.Output NameDescriptionsentimentA string value that represents the sentiment label of the entire analyzed text(either positive, neutral or negative).\n"
}