{
  "Id": "812",
  "Title": "\u0022Understanding Field Mapping and Functions in Azure Search REST APIs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfREST APIsPUT https://[service name].search.windows.net/indexers/myindexer?api-version=[api-version] Content-Type: application/json api-key: [admin key] {     \u0022dataSourceName\u0022 : \u0022mydatasource\u0022,     \u0022targetIndexName\u0022 : \u0022myindex\u0022,     \u0022fieldMappings\u0022 : [ { \u0022sourceFieldName\u0022 : \u0022_city\u0022, \u0022targetFieldName\u0022 : \u0022city\u0022 } ] } different index fields that will be analyzed or attributed differently in the index.\r\nJSONA field mapping function transforms the contents of a field before it\u0027s stored in theindex. The following mapping functions are currently supported:base64Encodebase64DecodeextractTokenAtPositionjsonArrayToStringCollectionurlEncodeurlDecodePerforms URL-safe Base64 encoding of the input string. Assumes that the input is UTF-8encoded.Only URL-safe characters can appear in an Azure Cognitive Search document key (sothat you can address the document using the Lookup API).\r\nIf the source field for yourkey contains URL-unsafe characters, such as - and \\, use the base64Encode function toconvert it at indexing time.The following example specifies the base64Encode function on\u0022metadata_storage_name\u0022 to handle unsupported characters.\r\nHTTP\u0022fieldMappings\u0022 : [     { \u0022sourceFieldName\u0022 : \u0022text\u0022, \u0022targetFieldName\u0022 : \u0022textStandardEnglishAnalyzer\u0022 },     { \u0022sourceFieldName\u0022 : \u0022text\u0022, \u0022targetFieldName\u0022 : \u0022textSoundexAnalyzer\u0022 } ] Mapping functions and examplesbase64Encode functionExample: Base-encoding a document keyPUT /indexers?api-version=2020-06-30 { A document key (both before and after conversion) can\u0027t be longer than 1,024characters. When you retrieve the encoded key at search time, use the base64Decodefunction to get the original key value, and use that to retrieve the source document.There are times when you need to use an encoded version of a field like\u0022metadata_storage_path\u0022 as the key, but also need an unencoded version for full textsearch.\n"
}