{
  "Id": "1651",
  "Title": "\u0022Understanding Search Operators and Escaping Special Characters in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhenplaced at the end of a term, ~ invokes fuzzy search.Within a term, such as business~analyst, the character isn\u0027t evaluated as an operator. Inthis case, assuming the query is a term or phrase query, full text search with lexicalanalysis strips out the ~ and breaks the term business~analyst in two: business ORanalyst.\r\nThe example above is the tilde (~), but the same principle applies to every operator.In order to use any of the search operators as part of the search text, escape thecharacter by prefixing it with a single backslash (\\). For example, for a wildcard searchon https://, where :// is part of the query string, you would specifysearch=https\\:\\/\\/*.\r\nSimilarly, an escaped phone number pattern might look like this\\\u002B1 \\(800\\) 642\\-7676.Special characters that require escaping include the following:\u002B - \u0026 | ! ( ) { } [ ] ^ \u0022 ~ * ? : \\ /Operator evaluation in contextEscaping special characters７ NoteAlthough escaping keeps tokens together, lexical analysis during indexing maystrip them out.\r\nFor example, the standard Lucene analyzer will break words onhyphens, whitespace, and other characters. If you require special characters in thequery string, you might need an analyzer that preserves them in the index. Somechoices include Microsoft natural language analyzers, which preserves hyphenatedwords, or a custom analyzer for more complex patterns.\r\nFor more information, seePartial terms, patterns, and special characters.Encoding unsafe and reserved characters in URLsEnsure all unsafe and reserved characters are encoded in a URL. For example, # is anunsafe character because it\u0027s a fragment/anchor identifier in a URL. The character mustbe encoded to %23 if used in a URL. \u0026 and = are examples of reserved characters asthey delimit parameters and specify values in Azure Cognitive Search. See RFC1738:Uniform Resource Locators (URL) for more details.Unsafe characters are \u0022 \u0060 \u003C \u003E # % { } | \\ ^ ~ [ ]. Reserved characters are ; / ? : @= \u002B \u0026.You can embed Boolean operators in a query string to improve the precision of a match.\n"
}