{
  "Id": "1563",
  "Title": "\u0022Understanding Metric Dimensions and Resource Logs in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor reference, see a list of all platform metrics supported in Azure Monitor.Dimensions of a metric are name/value pairs that carry additional data to describe themetric value. Azure AI Search has the following dimensions associated with its metricsthat capture a count of documents or skills that were executed (\u0022Document processedcount\u0022 and \u0022Skill execution invocation count\u0022).DimensionNameDescriptionDataSourceNameA named data source connection used during indexer execution. Valid valuesare one of the supported data source types.FailedIndicates whether the instance failed.IndexerNameName of an indexer.IndexNameName of an index.\r\nSkillsetNameName of a skillset used during indexer execution.SkillNameName of a skill within a skillset.SkillTypeThe @odata.type of the skill.For more information on what metric dimensions are, see Multi-dimensional metrics.Resource logs are platform logs that provide insight into operations that wereperformed within an Azure resource. Resource logs are generated by the search serviceautomatically, but are not collected by default. You must create a diagnostic setting tosend resource logs to a Log Analytics workspace to use with Azure Monitor Logs, AzureEvent Hubs to forward outside of Azure, or to Azure Storage for archiving.\r\nMetric dimensionsResource logsThis section identifies the type (or category) of resource logs you can collect for Azure AISearch:Resource logs are grouped by type (or category). Azure AI Search generatesresource logs under the Operations category.For reference, see a list of all resource logs category types supported in Azure Monitor. Azure Monitor Logs is a feature of Azure Monitor that collects and organizes log andperformance data from monitored resources. If you configured a diagnostic setting forLog Analytics, you can query the Azure Monitor Logs tables for the resource logsgenerated by Azure AI Search.This section refers to all of the Azure Monitor Logs Kusto tables relevant to Azure AISearch and available for query by Log Analytics and Metrics Explorer in the Azure portal.\n"
}