{
  "Id": "530",
  "Title": "\u0022Understanding Index Projections in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThis means that if you perform chunking of an input text and then perform enrichmentson each chunk, the result in the index when mapped via outputFieldMappings is anarray of the generated enrichments. With index projections, you define a context atwhich to map each chunk of enriched data to its own search document. This allows youto apply a one-to-many mapping of a document\u0027s enriched data to the search index.\r\nIndex projections are defined inside a skillset definition, and are primarily defined as anarray of selectors, where each selector corresponds to a different target index on thesearch service. Each selector requires the following parameters as part of its definition:targetIndexName: The name of the index on the search service that the indexprojection data index into.\r\n） ImportantIndex projections are in public preview under supplemental terms of use. It\u0027savailable through the Azure portal, 2023-10-01-Preview REST APIs, Azure portal,and beta client libraries that have been updated to include the feature.Index projections definitionparentKeyFieldName: The name of the field in the target index that contains thevalue of the key for the parent document.sourceContext: The enrichment annotation that defines the granularity at which tomap data into individual search documents. For more information, see Skill contextand input annotation language.mappings: An array of mappings of enriched data to fields in the search index. Eachmapping consists of:name: The name of the field in the search index that the data should be indexedinto,source: The enrichment annotation path that the data should be pulled from.Each mapping can also recursively define data with an optional sourceContext andinputs field, similar to the knowledge store or Shaper Skill. These parameters allow youto shape data to be indexed into fields of type Edm.ComplexType in the search index.The index defined in the targetIndexName parameter has the following requirements:Must already have been created on the search service before the skillset containingthe index projections definition is created.\n"
}