{
  "Id": "1562",
  "Title": "\u0022Understanding Azure AI Search Monitoring and Metrics Reference\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfReview the Azure Policy definition structure.Review Understanding policy effects.(Azure portal)(GitHub)Next stepsAzure AI Search monitoring datareferenceArticle•11/15/2023This article provides a reference of log and metric data collected to analyze theperformance and availability of Azure AI Search.\r\nSee Monitoring Azure AI Search for anoverview.This section lists the platform metrics collected for Azure AI Search(Microsoft.Search/searchServices).Metric IDUnitDescriptionDocumentsProcessedCountCountTotal of the number of documentssuccessfully processed in an indexingoperation (either by an indexer or bypushing documents directly).SearchLatencySecondsAverage search latency for queries thatexecute on the search service.SearchQueriesPerSecondCountPerSecondAverage of the search queries per second(QPS) for the search service. It\u0027s commonfor queries to execute in milliseconds, soonly queries that measure as seconds willappear in a metric like QPS.\r\nThe minimum is the lowest value forsearch queries per second that wasregistered during that minute. The sameapplies to the maximum value. Average isthe aggregate across the entire minute.For example, within one minute, youmight have a pattern like this: onesecond of high load that is the maximumfor SearchQueriesPerSecond, followed by58 seconds of average load, and finallyone second with only one query, which isthe minimum.\r\nSkillExecutionCountCountTotal number of skill executionsprocessed during an indexer operation.MetricsMetric IDUnitDescriptionThrottledSearchQueriesPercentagePercentAverage percentage of the search queriesthat were throttled from the total numberof search queries that executed during aone-minute interval. For reference, see a list of all platform metrics supported in Azure Monitor.Dimensions of a metric are name/value pairs that carry additional data to describe themetric value. Azure AI Search has the following dimensions associated with its metricsthat capture a count of documents or skills that were executed (\u0022Document processedcount\u0022 and \u0022Skill execution invocation count\u0022).DimensionNameDescriptionDataSourceNameA named data source connection used during indexer execution. Valid valuesare one of the supported data source types.FailedIndicates whether the instance failed.IndexerNameName of an indexer.IndexNameName of an index.\n"
}