{
  "Id": "1117",
  "Title": "\u0022Understanding Inline Shaping and Object Projections in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe \u0022Keyphrases\u0022 node, which contains a collection ofstrings, is itself a child of the page text. However, because projections require a JSONobject and the page is a primitive (string), the \u0022sourceContext\u0022 is used to wrap the keyphrase into an object with a named property. This technique enables even primitives tobe projected independently.You can generate a new shape using the Shaper skill or use inline shaping of the objectprojection. While the tables example demonstrated the approach of creating a shapeand slicing, this example demonstrates the use of inline shaping.\r\nInline shaping is the ability to create a new shape in the definition of the inputs to aprojection. Inline shaping creates an anonymous object that is identical to what aShaper skill would produce (in this case, projectionShape). Inline shaping is useful ifyou\u0027re defining a shape that you don\u0027t plan to reuse.The projections property is an array. This example adds a new projection instance to thearray, where the knowledgeStore definition contains inline projections. When usinginline projections, you can omit the Shaper skill.\r\nJSONInline shape for object projections\u0022knowledgeStore\u0022 : {     \u0022storageConnectionString\u0022: \u0022DefaultEndpointsProtocol=https;AccountName=\u003CAcct Name\u003E;AccountKey=\u003CAcct Key\u003E; \u0022,     \u0022projections\u0022: [             {             \u0022tables\u0022: [ ],             \u0022objects\u0022: [                 {                     \u0022storageContainer\u0022: \u0022sampleobject\u0022,                     \u0022source\u0022: null,                     \u0022generatedKeyName\u0022: \u0022myobject\u0022,                     \u0022sourceContext\u0022: \u0022/document\u0022,                     \u0022inputs\u0022: [                         {                             \u0022name\u0022: \u0022metadata_storage_name\u0022,                             \u0022source\u0022: \u0022/document/metadata_storage_name\u0022                         },                         {                             \u0022name\u0022: \u0022metadata_storage_path\u0022,                             \u0022source\u0022: \u0022/document/metadata_storage_path\u0022                         },                         { This article describes the concepts and principles of projection shapes.\n"
}