{
  "Id": "612",
  "Title": "\u0022Understanding Azure AI Search Billing and Premium Features\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfMeters associated with premiumfeatures are listed in the following table.Understand the billing modelHow you\u0027re charged for Azure AI SearchMeterUnitImage extraction(AI enrichment) Per 1000 images. See the pricing page.Custom EntityLookup skill (AIenrichment) Per 1000 text records.\r\nSee the pricing pageBuilt-in skills (AIenrichment) Number of transactions, billed at the same rate as if you had performed thetask by calling Azure AI services directly. You can process 20 documents perindexer per day for free. Larger or more frequent workloads require a multi-resource Azure AI services key.\r\nSemantic ranking Number of queries of \u0022queryType=semantic\u0022, billed at a progressive rate.See the pricing page.Shared private linkBilled for bandwidth as long as the shared private link exists and is used. Applies only if you use or enable the feature. In an indexer configuration, \u0022imageAction\u0022 is the parameter that triggers imageextraction.\r\nIf \u0022imageAction\u0022 is set to \u0022none\u0022 (the default), you won\u0027t be charged forimage extraction. Costs are incurred when \u0022imageAction\u0022 parameter is set and youinclude OCR, Image Analysis, or Document Extraction in a skillset.There is no meter on the number of queries, query responses, or documents ingested,although service limits do apply at each tier.\r\nData traffic might also incur networking costs. See the Bandwidth pricing.Several premium features such as knowledge store, Debug Sessions, and enrichmentcache have a dependency on Azure Storage. The meters for Azure Storage apply in thiscase, and the associated storage costs of using these features will be included in theAzure Storage bill. Customer-managed keys provide double encryption of sensitive content. This featurerequires a billable Azure Key Vault).Skillsets can include billable built-in skills, non-billable built-in utility skills, and customskills. Non-billable utility skills include Conditional, Shaper, Text Merge, Text Split.\n"
}