{
  "Id": "1024",
  "Title": "\u0022Understanding Context and Inputs in Azure Search Enrichment\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027re splitting a large contentfield into pages or sentences, the context should be overeach component part.\u0022context\u0022:\u0022/document/normalized_images/*\u0022For image content, inputs and outputs are one per imagein the parent document.Context also determines where outputs are produced in the enrichment tree. Forexample, the Entity Recognition skill returns a property called \u0022organizations\u0022, capturedas orgs.\r\nIf the context is \u0022/document\u0022, then an \u0022organizations\u0022 node is added as a childof \u0022/document\u0022. If you then wanted to reference this node in downstream skills, the pathwould be \u0022/document/orgs\u0022.Skills read from and write to an enriched document. Skill inputs specify the origin of theincoming data.\r\nIt\u0027s often the root node of the enriched document. For blobs, a typicalskill input is the document\u0027s content property.Skill reference documentation for each skill describes the inputs it can consume. Eachinput has a \u0022name\u0022 that identifies a specific input, and a \u0022source\u0022 that specifies thelocation fo the data in the enriched document.\r\nThe following example is from the EntityRecognition skill:JSONSkills can have multiple inputs. The \u0022name\u0022 is the specific input. For EntityRecognition, the specific inputs are \u0022text\u0022 and \u0022languageCode\u0022.Define inputs\u0022inputs\u0022: [    {        \u0022name\u0022: \u0022text\u0022,         \u0022source\u0022: \u0022/document/content\u0022    },    {        \u0022name\u0022: \u0022languageCode\u0022,         \u0022source\u0022: \u0022/document/language\u0022    }]The \u0022source\u0022 property specifies which field or row provides the content to beprocessed.\r\nFor text-based skills, the source is a field in the document or row thatprovides text. For image-based skills, the node providing the input is normalizedimages.Source exampleDescription\u0022source\u0022: \u0022/document\u0022For a tabular data set, a document corresponds to arow. \u0022source\u0022: \u0022/document/content\u0022For blobs, the source is usually the blob\u0027s contentproperty.\u0022source\u0022: \u0022/document/some-named-field\u0022For text-based skills, such as entity recognition orkey phrase extraction, the origin should be a fieldthat contains sufficient text to be analyzed, such asa \u0022description\u0022 or \u0022summary\u0022.\n"
}