{
  "Id": "1653",
  "Title": "\u0022Understanding and Using Negation in Azure Search Queries\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn full syntax, queries with negation cannot be combined with a wildcard. Forexample, the queries -luxury * is not allowed.In full syntax, queries with a single negation are not allowed. For example, thequery -luxury is not allowed.In full syntax, negations will behave as if they are always ANDed onto the queryregardless of the search mode.\r\nFor example, the full syntax query wifi -luxury in full syntax only fetchesdocuments that contain the term wifi, and then applies the negation -luxuryto those documents.If you want to use negations to search over all documents in the index, simplesyntax with the any search mode is recommended.\r\nIf you want to use negations to search over a subset of documents in the index, fullsyntax or the simple syntax with the all search mode are recommended.QueryTypeSearchModeExampleQueryBehaviorSimpleanywifi -luxuryReturns all documents in the index. Documents with the term\u0022wifi\u0022 or documents missing the term \u0022luxury\u0022 are rankedhigher than other documents.\r\nThe query is expanded to wifiOR -luxury OR *.Simpleallwifi -luxuryReturns only documents in the index that contain the term\u0022wifi\u0022 and don\u0027t contain the term \u0022luxury\u0022. The query isexpanded to wifi AND -luxury AND *.Fullanywifi -luxuryReturns only documents in the index that contain the term\u0022wifi\u0022, and then documents that contain the term \u0022luxury\u0022 areremoved from the results. Fullallwifi -luxuryReturns only documents in the index that contain the term\u0022wifi\u0022, and then documents that contain the term \u0022luxury\u0022 areremoved from the results.You can define a fielded search operation with the fieldName:searchExpression syntax,where the search expression can be a single word or a phrase, or a more complexexpression in parentheses, optionally with Boolean operators.\n"
}