{
  "Id": "383",
  "Title": "\u0022Understanding the Impact of SearchMode on Query Parsing in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe example request in this article uses the FullLucene query language. \u0022search\u0022: \u0022Spacious, air-condition* \u002B\\\u0022Ocean view\\\u0022\u0022, Supported parsers: Simple and Full LuceneAnother search request parameter that affects parsing is the \u0022searchMode\u0022 parameter. Itcontrols the default operator for Boolean queries: any (default) or all.When \u0022searchMode=any\u0022, which is the default, the space delimiter between spaciousand air-condition is OR (||), making the sample query text equivalent to:Explicit operators, such as \u002B in \u002B\u0022Ocean view\u0022, are unambiguous in boolean queryconstruction (the term must match).\r\nLess obvious is how to interpret the remainingterms: spacious and air-condition. Should the search engine find matches on ocean viewand spacious and air-condition? Or should it find ocean view plus either one of theremaining terms?By default (\u0022searchMode=any\u0022), the search engine assumes the broader interpretation.\r\nEither field should be matched, reflecting \u0022or\u0022 semantics. The initial query tree illustratedpreviously, with the two \u0022should\u0022 operations, shows the default.Suppose that we now set \u0022searchMode=all\u0022. In this case, the space is interpreted as an\u0022and\u0022 operation. Each of the remaining terms must both be present in the document toqualify as a match.\r\nThe resulting sample query would be interpreted as follows:A modified query tree for this query would be as follows, where a matching document isthe intersection of all three subqueries:Impact of searchMode on the parserSpacious,||air-condition*\u002B\u0022Ocean view\u0022 \u002BSpacious,\u002Bair-condition*\u002B\u0022Ocean view\u0022７ NoteChoosing \u0022searchMode=any\u0022 over \u0022searchMode=all\u0022 is a decision best arrived at byrunning representative queries. Users who are likely to include operators (commonLexical analyzers process term queries and phrase queries after the query tree isstructured. An analyzer accepts the text inputs given to it by the parser, processes thetext, and then sends back tokenized terms to be incorporated into the query tree.\n"
}