{
  "Id": "1625",
  "Title": "\u0022Understanding Azure AI Search: Functions and Parameters Explained\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfsearchModeEdm.String\u0027any\u0027 or \u0027all\u0027, defaults to \u0027any\u0027. Indicates whether any or all ofthe search terms in the search parameter must be matched inorder to count the document as a match. When using the LuceneBoolean operators in the search parameter, they will takeprecedence over this parameter.All the above parameters are equivalent to the corresponding search requestparameters in the Search API.The search.ismatch function returns a value of type Edm.Boolean, which allows you tocompose it with other filter sub-expressions using the Boolean logical operators.See OData expression syntax reference for Azure AI Search for the completeEBNF.search.\r\nismatch７ NoteAzure AI Search does not support using search.ismatch or search.ismatchscoringinside lambda expressions. This means it is not possible to write filters overThe search.ismatchscoring function, like the search.ismatch function, returns true fordocuments that match the full-text search query passed as a parameter.\r\nThe differencebetween them is that the relevance score of documents matching thesearch.ismatchscoring query will contribute to the overall document score, while in thecase of search.ismatch, the document score won\u0027t be changed. The following overloadsof this function are available with parameters identical to those of search.ismatch:search.ismatchscoring(search)search.\r\nismatchscoring(search, searchFields)search.ismatchscoring(search, searchFields, queryType, searchMode)Both the search.ismatch and search.ismatchscoring functions can be used in the samefilter expression.Find documents with the word \u0022waterfront\u0022. This filter query is identical to a searchrequest with search=waterfront. odata-filter-exprFind documents with the word \u0022hostel\u0022 and rating greater or equal to 4, or documentswith the word \u0022motel\u0022 and rating equal to 5. Note, this request could not be expressedwithout the search.ismatchscoring function.odata-filter-exprcollections of objects that can correlate full-text search matches with strict filtermatches on the same object.\n"
}