{
  "Id": "1149",
  "Title": "\u0022Understanding Query Requests and Field Attributes in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you\u0027re familiar with query types and composition, you might remember that theparameters on a query request depend on field attributes in an index. For example, onlyfields marked as searchable and retrievable can be used in queries and search results.When setting the search, filter, and orderby parameters in your request, you shouldcheck attributes to avoid unexpected results.\r\nIn the portal screenshot below of the hotels sample index, only the last two fields\u0022LastRenovationDate\u0022 and \u0022Rating\u0022 are sortable, a requirement for use in an\u0022$orderby\u0022 only clause.Effect of field attributes on queriesFor field attribute definitions, see Create Index (REST API).\r\nDuring indexing, the search engine uses a text analyzer on strings to maximize thepotential for finding a match at query time. At a minimum, strings are lower-cased, butdepending on the analyzer, might also undergo lemmatization and stop word removal.Larger strings or compound words are typically broken up by whitespace, hyphens, ordashes, and indexed as separate tokens.\r\nThe point to take away here\u0027s that what you think your index contains, and what\u0027sactually in it, can be different. If queries don\u0027t return expected results, you can inspectthe tokens created by the analyzer through the Analyze Text (REST API). For moreinformation about tokenization and the impact on queries, see Partial term search andpatterns with special characters.Now that you have a better understanding of how query requests work, try thefollowing quickstarts for hands-on experience. Search explorerQuickstart: Full text search using the Azure SDKsEffect of tokens on queriesNext stepsCreate a vector query in Azure AI SearchArticle•11/15/2023In Azure AI Search, if you added vector fields to a search index, this article explains howto:Code samples in the azure-search-vector repository demonstrate end-to-endworkflows that include schema definition, vectorization, indexing, and queries.\n"
}