{
  "Id": "1652",
  "Title": "\u0022Understanding Reserved and Unsafe Characters in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf\u0026 and = are examples of reserved characters asthey delimit parameters and specify values in Azure Cognitive Search. See RFC1738:Uniform Resource Locators (URL) for more details.Unsafe characters are \u0022 \u0060 \u003C \u003E # % { } | \\ ^ ~ [ ]. Reserved characters are ; / ? : @= \u002B \u0026.You can embed Boolean operators in a query string to improve the precision of a match.\r\nThe full syntax supports text operators in addition to character operators. Always specifytext boolean operators (AND, OR, NOT) in all caps.TextoperatorCharacterExampleUsageAND\u002Bwifi ANDluxurySpecifies terms that a match must contain. In the example,the query engine looks for documents containing bothwifi and luxury.\r\nThe plus character (\u002B) can also be useddirectly in front of a term to make it required. For example,\u002Bwifi \u002Bluxury stipulates that both terms must appearsomewhere in the field of a single document.OR(none) wifi ORluxuryFinds a match when either term is found. In the example,the query engine returns match on documents containingeither wifi or luxury or both.\r\nBecause OR is the defaultconjunction operator, you could also leave it out, such thatwifi luxury is the equivalent of wifi OR luxury.NOT!, -wifi –luxuryReturns a match on documents that exclude the term. Forexample, wifi –luxury searches for documents that havethe wifi term but not luxury. The | character isn\u0027t supported for OR operations.\r\nBoolean operators11NOT Boolean operator） ImportantThe NOT operator (NOT, !, or -) behaves differently in full syntax than it does insimple syntax.In simple syntax, queries with negation always have a wildcard automaticallyadded. For example, the query -luxury is automatically expanded to -luxury *. In full syntax, queries with negation cannot be combined with a wildcard. Forexample, the queries -luxury * is not allowed.In full syntax, queries with a single negation are not allowed. For example, thequery -luxury is not allowed.In full syntax, negations will behave as if they are always ANDed onto the queryregardless of the search mode.\n"
}