{
  "Id": "1624",
  "Title": "\u0022Understanding and Implementing Azure AI Search.ismatch Function\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfismatch and search.ismatchscoring functions are only supported infilters in the Search API. They are not supported in the Suggest or AutocompleteAPIs.Syntaxsearch_is_match_call ::=    \u0027search.ismatch\u0027(\u0027scoring\u0027)?\u0027(\u0027 search_is_match_parameters \u0027)\u0027search_is_match_parameters ::=    string_literal(\u0027,\u0027 string_literal(\u0027,\u0027 query_type \u0027,\u0027 search_mode)?)?query_type ::= \u0022\u0027full\u0027\u0022 | \u0022\u0027simple\u0027\u0022search_mode ::= \u0022\u0027any\u0027\u0022 | \u0022\u0027all\u0027\u0022OData syntax diagram for Azure AI Search７ NoteThe search.\r\nismatch function evaluates a full-text search query as a part of a filterexpression. The documents that match the search query will be returned in the resultset. The following overloads of this function are available:search.\r\nismatch(search)search.ismatch(search, searchFields)search.ismatch(search, searchFields, queryType, searchMode)The parameters are defined in the following table:ParameternameTypeDescriptionsearchEdm.StringThe search query (in either simple or full Lucene query syntax).searchFieldsEdm.\r\nStringComma-separated list of searchable fields to search in; defaults toall searchable fields in the index. When using fielded search in thesearch parameter, the field specifiers in the Lucene query overrideany fields specified in this parameter.queryTypeEdm.String\u0027simple\u0027 or \u0027full\u0027; defaults to \u0027simple\u0027. Specifies what querylanguage was used in the search parameter. searchModeEdm.String\u0027any\u0027 or \u0027all\u0027, defaults to \u0027any\u0027. Indicates whether any or all ofthe search terms in the search parameter must be matched inorder to count the document as a match. When using the LuceneBoolean operators in the search parameter, they will takeprecedence over this parameter.All the above parameters are equivalent to the corresponding search requestparameters in the Search API.The search.ismatch function returns a value of type Edm.Boolean, which allows you tocompose it with other filter sub-expressions using the Boolean logical operators.See OData expression syntax reference for Azure AI Search for the completeEBNF.search.\n"
}