{
  "Id": "1611",
  "Title": "\u0022Understanding OData Filters and Sorting in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfodata-filter-expr    $filter=search.ismatchscoring(\u0027waterfront\u0027)    $filter=search.ismatchscoring(\u0027hostel\u0027) and rating ge 4 or search.ismatchscoring(\u0027motel\u0027) and rating eq 5    $filter=not search.ismatch(\u0027luxury\u0027)    $filter=search.\r\nismatchscoring(\u0027\u0022ocean view\u0022\u0027, \u0027Description,HotelName\u0027) or Rating eq 5    $filter=search.ismatch(\u0027\u0022hotel airport\u0022~5\u0027, \u0027Description\u0027, \u0027full\u0027, Find documents that have a word that starts with the letters \u0022lux\u0022 in the Descriptionfield. This query uses prefix search in combination with search.ismatch.\r\nodata-filter-exprFilters in Azure AI SearchOData expression language overview for Azure AI SearchOData expression syntax reference for Azure AI SearchSearch Documents (Azure AI Search REST API)\u0027any\u0027) and not Rooms/any(room: room/SmokingAllowed)    $filter=search.ismatch(\u0027lux*\u0027, \u0027Description\u0027)Next stepsOData $orderby syntax in Azure AISearchArticle•11/15/2023In Azure AI Search, the $orderby parameter specifies a custom sort order for searchresults.\r\nThis article describes the OData syntax of $orderby and provides examples.Field path construction and constants are described in the OData language overview inAzure AI Search. For more information about sorting behaviors, see Ordering results.The $orderby parameter accepts a comma-separated list of up to 32 order-by clauses.\r\nThe syntax of an order-by clause is described by the following EBNF (Extended Backus-Naur Form):An interactive syntax diagram is also available:Each clause has sort criteria, optionally followed by a sort direction (asc for ascendingor desc for descending). If you don\u0027t specify a direction, the default is ascending. Ifthere are null values in the field, null values appear first if the sort is asc and last if thesort is desc.The sort criteria can either be the path of a sortable field or a call to either thegeo.distance or the search.score functions.Syntaxorder_by_clause ::= (field_path | sortable_function) (\u0027asc\u0027 | \u0027desc\u0027)?sortable_function ::= geo_distance_call | \u0027search.\n"
}