{
  "Id": "1256",
  "Title": "\u0022Understanding Cloud Formation and Atmospheric Processes\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfanswers\u0022: [        {            \u0022key\u0022: \u00224123\u0022,            \u0022text\u0022: \u0022Sunlight heats the land all day, warming that moist air and causing it to rise high into the   atmosphere until it cools and condenses into water droplets. Clouds generally form where air is ascending (over land in this case),   but not where it is descending (over the river).\r\n\u0022,            \u0022highlights\u0022: \u0022Sunlight heats the land all day, warming that moist air and causing it to rise high into the   atmosphere until it cools and condenses into water droplets. Clouds generally form\u003Cem\u003E where air is ascending\u003C/em\u003E (over land in this case),   but not where it is\u003Cem\u003E descending\u003C/em\u003E (over the river).\r\n\u0022,            \u0022score\u0022: 0.94639826        }    ],    \u0022value\u0022: [        {            \u0022@search.score\u0022: 0.5479723,When designing a search results page that includes answers, be sure to handle caseswhere answers aren\u0027t found.Within @search.answers:\u0022key\u0022 is the document key or ID of the match.\r\nGiven a document key, you can useLookup Document API to retrieve any or all parts of the search document toinclude on the search page or a detail page.\u0022text\u0022 and \u0022highlights\u0022 provide identical content, in both plain text and withhighlights.By default, highlights are styled as \u003Cem\u003E, which you can override using the existinghighlightPreTag and highlightPostTag parameters. As noted elsewhere, thesubstance of an answer is verbatim content from a search document. The            \u0022@search.rerankerScore\u0022: 1.0321671911515296,            \u0022@search.captions\u0022: [                {                    \u0022text\u0022: \u0022Like all clouds, it forms when the air reaches its dew point—the temperature at which an air mass is cool enough for its water vapor to condense into liquid droplets.\n"
}