{
  "Id": "1644",
  "Title": "\u0022Understanding Query Execution and Tokenization in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDepending on your search client, you might need to escape the quotation marks ina phrase search. For example, in Postman in a POST request, a phrase search on\u0022Roach Motel\u0022 in the request body would be specified as \u0022\\\u0022Roach Motel\\\u0022\u0022.\r\nBy default, all strings passed in the \u0022search\u0022 parameter undergo lexical analysis. Makesure you understand the tokenization behavior of the analyzer you\u0027re using. Often, whenquery results are unexpected, the reason can be traced to how terms are tokenized atquery time. You can test tokenization on specific strings to confirm the output.Any text input with one or more terms is considered a valid starting point for queryexecution. Azure Cognitive Search will match documents containing any or all of theterms, including any variations found during analysis of the text.\r\nAs straightforward as this sounds, there\u0027s one aspect of query execution in AzureCognitive Search that might produce unexpected results, increasing rather thandecreasing search results as more terms and operators are added to the input string.Whether this expansion actually occurs depends on the inclusion of a NOT operator,combined with a \u0022searchMode\u0022 parameter setting that determines how NOT isinterpreted in terms of AND or OR behaviors.\r\nFor more information, see the NOToperator under Boolean operators.Keyword search on terms and phrasesYou can embed Boolean operators in a query string to improve the precision of a match.In the simple syntax, boolean operators are character-based. Text operators, such as theword AND, aren\u0027t supported.\r\nCharacterExampleUsage\u002Bpool \u002BoceanAn AND operation. For example, pool \u002B ocean stipulates that adocument must contain both terms.|pool |oceanAn OR operation finds a match when either term is found. In theexample, the query engine will return match on documents containingeither pool or ocean or both. Because OR is the default conjunctionoperator, you could also leave it out, such that pool ocean is theequivalent of pool | ocean.-pool –oceanA NOT operation returns matches on documents that exclude the term.The searchMode parameter on a query request controls whether a termwith the NOT operator is ANDed or ORed with other terms in the query(assuming there\u0027s no boolean operators on the other terms).\n"
}