{
  "Id": "1486",
  "Title": "\u0022Understanding Microsoft\u0027s Transparency Notes and Azure AI Search Capabilities\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfName));}Step 3: Handle the resultsNext stepsTransparency note: Azure AI SearchArticle•11/14/2023An AI system includes not only the technology, but also the people who will use it, thepeople who will be affected by it, and the environment in which it is deployed. Creatinga system that is fit for its intended purpose requires an understanding of how thetechnology works, what its capabilities and limitations are, and how to achieve the bestperformance.\r\nMicrosoft\u0027s Transparency Notes are intended to help you understand howour AI technology works, the choices system owners can make that influence systemperformance and behavior, and the importance of thinking about the whole system,including the technology, the people, and the environment.\r\nYou can use TransparencyNotes when developing or deploying your own system, or share them with the peoplewho will use or be affected by your system.Microsoft\u0027s Transparency Notes are part of a broader effort at Microsoft to put our AIPrinciples into practice. To find out more, see the Microsoft AI principles.Azure AI Search gives developers tools, APIs, and SDKs for building a rich searchexperience over private, heterogeneous content in web, mobile, and enterpriseapplications. Search is foundational to any application that surfaces data to users.Common scenarios include catalog or document search, online retail stores, or dataexploration over proprietary content. Searchable data can be in the form of text or vectors and ingested as-is from a datasource or enriched by using AI to improve the overall search experience. Developers canconvert data to vectors by using external machine learning models they call, andindexers can optionally include skill sets that support a powerful suite of dataenrichment capabilities by using several Azure AI Language services, such as NamedEntity Recognition (NER) and personally identifiable information (PII) detection, andAzure AI Vision services, including optical character recognition (OCR) and imageanalysis.\n"
}