{
  "Id": "1036",
  "Title": "\u0022Understanding Enriched Documents and Annotations in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfBefore reviewing the syntax, let\u0027s revisit a few important concepts to better understandthe examples provided later in this article.TermDescription\u0022enricheddocument\u0022An enriched document is an internal structure that collects skill output as it\u0027screated and it holds all annotations related to a document.\r\nThink of an enricheddocument as a tree of annotations. Generally, an annotation created from aprevious annotation becomes its child.Enriched documents only exist for the duration of skillset execution. Once contentis mapped to the search index, the enriched document is no longer needed.Although you don\u0027t interact with enriched documents directly, it\u0027s useful to have amental model of the documents when creating a skillset.\u0022annotation\u0022Within an enriched document, a node that is created and populated by a skill, suchas \u0022text\u0022 and \u0022layoutText\u0022 in the OCR skill, is called an annotation.\r\nAn enricheddocument is populated with both annotations and unchanged field values ormetadata copied from the source.\u0022context\u0022The scope of enrichment, which is either the entire document, a portion of adocument, or if you\u0027re working with images, the extracted images from adocument. By default, the enrichment context is at the \u0022/document\u0022 level, scopedto individual documents contained in the data source. When a skill runs, theoutputs of that skill become properties of the defined context.Paths are specified in the \u0022context\u0022 and \u0022source\u0022 properties of a skillset, and in theoutput field mappings in an indexer.All paths start with /document.\r\nAn enriched document is created in the \u0022documentcracking\u0022 stage of indexer execution, when the indexer opens a document or reads in arow from the data source. Initially, the only node in an enriched document is the rootnode (/document), and it\u0027s the node from which all other enrichments occur. The following list includes several common examples:Background conceptsPaths for different scenarios/document is the root node and indicates an entire blob in Azure Storage, or a rowin a SQL table./document/{key} is the syntax for a document or item in an Azure Cosmos DBcollection, where {key} is the actual key, such as /document/HotelId in theprevious example.\n"
}