{
  "Id": "1238",
  "Title": "\u0022Understanding and Implementing Custom Normalizers in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPredefined and custom normalizers1(1)Normalizers referencePredefined normalizersNameDescription and OptionsNameDescription and OptionsstandardLowercases the text followed by asciifolding.lowercaseTransforms characters to lowercase.uppercaseTransforms characters to uppercase.asciifoldingTransforms characters that aren\u0027t in the Basic Latin Unicode block to their ASCIIequivalent, if one exists.\r\nFor example, changing à to a.elisionRemoves elision from beginning of the tokens.Normalizers support two character filters that are identical to their counterparts incustom analyzer character filters:mappingpattern_replaceThe list below shows the token filters supported for normalizers and is a subset of theoverall token filters used in custom analyzers.\r\narabic_normalizationasciifoldingcjk_widthelisiongerman_normalizationhindi_normalizationindic_normalizationpersian_normalizationscandinavian_normalizationscandinavian_foldingsorani_normalizationlowercaseuppercaseSupported char filtersSupported token filtersAdd custom normalizersCustom normalizers are defined within the index schema.\r\nThe definition includes aname, a type, one or more character filters and token filters. The character filters andtoken filters are the building blocks for a custom normalizer and responsible for theprocessing of the text. These filters are applied from left to right.The token_filter_name_1 is the name of token filter, and char_filter_name_1 andchar_filter_name_2 are the names of char filters (see supported token filters andsupported char filterstables below for valid values).JSONCustom normalizers can be added during index creation or later by updating an existingone. Adding a custom normalizer to an existing index requires the\u0022allowIndexDowntime\u0022 flag to be specified in Update Index and will cause the index tobe unavailable for a few seconds.\u0022normalizers\u0022:(optional)[    {       \u0022name\u0022:\u0022name of normalizer\u0022,       \u0022@odata.type\u0022:\u0022#Microsoft.Azure.Search.\n"
}