{
  "Id": "1604",
  "Title": "\u0022Understanding OData Syntax for Azure AI Search Filters\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe $filter parameter is a Boolean expression that is composed of simplersubexpressions. These subexpressions are combined using logical operators such asBuilding expressions from field paths andconstantsfilter_expression ::= boolean_expressionorder_by_expression ::= order_by_clause(\u0027,\u0027 order_by_clause)*select_expression ::= \u0027*\u0027 | field_path(\u0027,\u0027 field_path)*OData syntax diagram for Azure AI Search７ NoteSee OData expression syntax reference for Azure AI Search for the completeEBNF.Next stepsand, or, and not, comparison operators such as eq, lt, gt, and so on, and collectionoperators such as any and all.\r\nThe $filter, $orderby, and $select parameters are explored in more detail in thefollowing articles:OData $filter syntax in Azure AI SearchOData $orderby syntax in Azure AI SearchOData $select syntax in Azure AI SearchOData $filter syntax in Azure AI SearchArticle•11/15/2023In Azure AI Search, the $filter parameter specifies inclusion or exclusion criteria forreturning matches in search results.\r\nThis article describes the OData syntax of $filter andprovides examples.Field path construction and constants are described in the OData language overview inAzure AI Search. For more information about filter scenarios, see Filters in Azure AISearch.\r\nA filter in the OData language is a Boolean expression, which in turn can be one ofseveral types of expression, as shown by the following EBNF (Extended Backus-NaurForm):An interactive syntax diagram is also available:The types of Boolean expressions include:Syntaxboolean_expression ::=    collection_filter_expression    | logical_expression    | comparison_expression    | boolean_literal    | boolean_function_call    | \u0027(\u0027 boolean_expression \u0027)\u0027    | variable/* This can be a range variable in the case of a lambda, or a field path. */variable ::= identifier | field_pathOData syntax diagram for Azure AI Search７ NoteSee OData expression syntax reference for Azure AI Search for the completeEBNF.Collection filter expressions using any or all. These apply filter criteria tocollection fields.\n"
}