{
  "Id": "1727",
  "Title": "\u0022Understanding Azure Cognitive Search Conditional Skill: Built-in Skills and Usage\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf your text is empty, a warning will beproduced. If your text is larger than 50,000 characters, only the first 50,000 characterswill be translated, and a warning will be issued.Built-in skillsHow to define a skillsetErrors and warningsSee alsoConditional cognitive skillArticle•11/29/2021The Conditional skill enables Azure Cognitive Search scenarios that require a Booleanoperation to determine the data to assign to an output.\r\nThese scenarios include filtering,assigning a default value, and merging data based on a condition.The following pseudocode demonstrates what the conditional skill accomplishes:Microsoft.Skills.Util.ConditionalSkillThis skill is special because its inputs are evaluated fields.\r\nThe following items are valid values of an expression:Annotation paths (paths in expressions must be delimited by \u0022$(\u0022 and \u0022)\u0022)  Examples:Literals (strings, numbers, true, false, null)  Examples:if (condition)      { output = whenTrue }  else      { output = whenFalse }  ７ NoteThis skill isn\u0027t bound to Cognitive Services. It is non-billable and has no CognitiveServices key requirement.\r\n@odata.typeEvaluated fields    \u0022= $(/document)\u0022     \u0022= $(/document/content)\u0022 Expressions that use comparison operators (==, !=, \u003E=, \u003E, \u003C=, \u003C)  Examples:Expressions that use Boolean operators (\u0026\u0026, ||, !, ^)  Examples:Expressions that use numeric operators (\u002B, -, *, /, %)  Examples:Because the conditional skill supports evaluation, you can use it in minor-transformationscenarios. For example, see skill definition 4.Inputs are case-sensitive.InputDescription   \u0022= \u0027this is a string\u0027\u0022   // string (note the single quotation marks)    \u0022= 34\u0022                   // number    \u0022= true\u0022                 // Boolean    \u0022= null\u0022                 // null value     \u0022= $(/document/language) == \u0027en\u0027\u0022     \u0022= $(/document/sentiment) \u003E= 0.\n"
}