{
  "Id": "1691",
  "Title": "\u0022Understanding Azure Search: Visual Feature and Domain-Specific Details\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdftypeSkill parametersParameter nameDescriptionvisualFeaturesAn array of strings indicating the visual feature types to return. Valid visualfeature types include:adult - detects if the image is pornographic (depicts nudity or a sexact), gory (depicts extreme violence or blood) or suggestive (alsoknown as racy content).brands - detects various brands within an image, including theapproximate location.categories - categorizes image content according to a taxonomydefined by Azure AI services.description - describes the image content with a complete sentencein supported languages.faces - detects if faces are present.\r\nIf present, generates coordinates,gender and age.objects - detects various objects within an image, including theapproximate location.tags - tags the image with a detailed list of words related to theimage content.Names of visual features are case-sensitive. Both color and imageTypevisual features have been deprecated, but you can access this functionalitythrough a custom skill. Refer to the Azure AI Vision Image Analysisdocumentation on which visual features are supported with eachdefaultLanguageCode.detailsAn array of strings indicating which domain-specific details to return.\r\nValidvisual feature types include:celebrities - identifies celebrities if detected in the image.landmarks - identifies landmarks if detected in the image.InputnameDescriptionimageComplex Type. Currently only works with \u0022/document/normalized_images\u0022 field,produced by the Azure Blob indexer when imageAction is set to a value other thannone.\r\nSkill inputsSkill outputsOutputnameDescriptionadultOutput is a single adult object of a complex type, consisting of boolean fields(isAdultContent, isGoryContent, isRacyContent) and double type scores(adultScore, goreScore, racyScore).brandsOutput is an array of brand objects, where the object is a complex type consistingof name (string) and a confidence score (double). It also returns a rectangle withfour bounding box coordinates (x, y, w, h, in pixels) indicating placement insidethe image. For the rectangle, x and y are the top left. Bottom left is x, y\u002Bh. Topright is x\u002Bw, y. Bottom right is x\u002Bw, y\u002Bh.\n"
}