{
  "Id": "870",
  "Title": "\u0022Understanding and Resolving Indexer Errors and Warnings in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf you want indexers to ignore these errors (and skip over \u0022failed documents\u0022), considerupdating the maxFailedItems and maxFailedItemsPerBatch as described here.The error information in this article can help you resolve errors, allowing indexing tocontinue.Warnings don\u0027t stop indexing, but they do indicate conditions that could result inunexpected outcomes. Whether you take action or not depends on the data and yourscenario.\r\nBeginning with API version 2019-05-06, item-level Indexer errors and warnings arestructured to provide increased clarity around causes and next steps. They contain thefollowing properties:PropertyDescriptionExampleKeyThe documentID of thedocumentimpacted bythe error orwarning.https://\u003Cstorageaccount\u003E.blob.core.windows.\r\nnet/jfk-1k/docid-32112954.pdfNameThe operationnamedescribingwhere the errorDocumentExtraction.azureblob.myBlobContainerNameEnrichment.WebApiSkill.mySkillNameProjection.SearchIndex.OutputFieldMapping.myOutputFieldName７ NoteEach failed document along with its document key (when available) will show up asan error in the indexer execution status.\r\nYou can utilize the index api to manuallyupload the documents at a later point if you have set the indexer to toleratefailures.PropertyDescriptionExampleor warningoccurred. This isgenerated bythe followingstructure:[category].[subcategory].[resourceType].[resourceName]Projection.SearchIndex.MergeOrUpload.myIndexNameProjection.KnowledgeStore.Table.\r\nmyTableNameMessageA high-leveldescription ofthe error orwarning.Could not execute skill because the Web Api request failed.DetailsAny additionaldetails, whichmay be helpfulto diagnose theissue, such asthe WebApiresponse ifexecuting acustom skillfailed.link-cryptonyms-list - Error processing the request record: System.ArgumentNullException: Value cannot be null. Parameter name: source atSystem.Linq.Enumerable.All[TSource](IEnumerable 1 source,Func 2 predicate) atMicrosoft.CognitiveSearch.WebApiSkills.JfkWebApiSkills....rest of stack trace...DocumentationLinkA link torelevantdocumentationwith detailedinformation todebug andresolve theissue. This linkwill often pointto one of thebelow sectionson this page.\n"
}