{
  "Id": "480",
  "Title": "\u0022Understanding Indexers in Azure Cognitive Search: Behavior and Configuration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe article uses examples to explain behaviors that might seemcounter-intuitive on the surface.To learn more about analyzers, see the following articles:Add a language analyzerAdd a custom analyzerCreate a search indexCreate a multi-language indexNext stepsIndexers in Azure Cognitive SearchArticle•10/05/2023An indexer in Azure Cognitive Search is a crawler that extracts searchable content fromcloud data sources and populates a search index using field-to-field mappings betweensource data and a search index.\r\nThis approach is sometimes referred to as a \u0027pull model\u0027because the search service pulls data in without you having to write any code that addsdata to an index.\r\nIndexers also drive the AI enrichment capabilities of Cognitive Search,integrating external processing of content en route to an index.Indexers are cloud-only, with individual indexers for supported data sources. Whenconfiguring an indexer, you\u0027ll specify a data source (origin) and a search index(destination). Several sources, such as Azure Blob Storage, have more configurationproperties specific to that content type.You can run indexers on demand or on a recurring data refresh schedule that runs asoften as every five minutes. More frequent updates require a \u0027push model\u0027 thatsimultaneously updates data in both Azure Cognitive Search and your external datasource. You can use an indexer as the sole means for data ingestion, or in combination withother techniques. The following table summarizes the main scenarios.ScenarioStrategySingle datasourceThis pattern is the simplest: one data source is the sole content provider for asearch index. Most supported data sources provide some form of changedetection so that subsequent indexer runs pick up the difference when contentis added or updated in the source.Multiple datasourcesAn indexer specification can have only one data source, but the search indexitself can accept content from multiple sources, where each indexer run bringsnew content from a different data provider.\n"
}