{
  "Id": "1255",
  "Title": "\u0022Understanding Semantic Answers: REST Query and Configuration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfWhat is a semantic answer?Formulate a REST query for \u0022answers\u0022{    \u0022search\u0022: \u0022how do clouds form\u0022,    \u0022queryType\u0022: \u0022semantic\u0022,    \u0022queryLanguage\u0022: \u0022en-us\u0022,    \u0022semanticConfiguration\u0022: \u0022my-semantic-config\u0022,    \u0022answers\u0022: \u0022extractive|count-3\u0022,    \u0022captions\u0022: \u0022extractive|highlight-true\u0022,    \u0022count\u0022: \u0022true\u0022}A \u0022semanticConfiguration\u0022 determines which string fields provide tokens to theextraction model.\r\nThe same fields that produce captions also produce answers. SeeCreate a semantic configuration for details.For \u0022answers\u0022, parameter construction is \u0022answers\u0022: \u0022extractive\u0022, where thedefault number of answers returned is one. You can increase the number ofanswers by adding a count as shown in the above example, up to a maximum of10.\r\nWhether you need more than one answer depends on the user experience ofyour app, and how you want to render results.Answers are provided in the \u0022@search.answers\u0022 array, which appears first in the queryresponse. Each answer in the array includes:Document keyText or content of the answer, in plain text or with formattingConfidence scoreIf an answer is indeterminate, the response shows up as \u0022@search.\r\nanswers\u0022: []. Theanswers array is followed by the value array, which is the standard response in asemantic query.Given the query \u0022how do clouds form\u0022, the following example illustrates an answer:JSONUnpack an \u0022answer\u0022 from the response{    \u0022@search. answers\u0022: [        {            \u0022key\u0022: \u00224123\u0022,            \u0022text\u0022: \u0022Sunlight heats the land all day, warming that moist air and causing it to rise high into the   atmosphere until it cools and condenses into water droplets. Clouds generally form where air is ascending (over land in this case),   but not where it is descending (over the river).\n"
}