{
  "Id": "443",
  "Title": "\u0022Understanding Semantic Ranking in Azure AI Search: Capabilities and Limitations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOutputs of semantic rankingHow summaries are scored７ NoteBeginning on July 14, 2023, the @search.rerankerScore distribution is changing.The effect on scores can\u0027t be determined except through testing. If you have a hardthreshold dependency on this response property, rerun your tests to understandwhat the new values should be for your threshold.\r\nSemantic ranking is a newer technology so it\u0027s important to set expectations about whatit can and can\u0027t do. What it can do:Promote matches that are semantically closer to the intent of original query.Find strings to use as captions and answers. Captions and answers are returned inthe response and can be rendered on a search results page.What semantic ranking can\u0027t do is rerun the query over the entire corpus to findsemantically relevant results. Semantic ranking reranks the existing result set, consistingof the top 50 results as scored by the default ranking algorithm. Furthermore, semanticranking can\u0027t create new information or strings.\r\nCaptions and answers are extractedverbatim from your content so if the results don\u0027t include answer-like text, the languagemodels won\u0027t produce one.Although semantic ranking isn\u0027t beneficial in every scenario, certain content can benefitsignificantly from its capabilities. The language models in semantic ranking work best onsearchable content that is information-rich and structured as prose. A knowledge base,online documentation, or documents that contain descriptive content see the mostgains from semantic ranking capabilities.The underlying technology is from Bing and Microsoft Research, and integrated into theAzure AI Search infrastructure as an add-on feature. For more information about theresearch and AI investments backing semantic ranking, see How AI from Bing ispowering Azure AI Search (Microsoft Research Blog).The following video provides an overview of the capabilities.Semantic ranking is available on search services at the Basic and higher tiers, subject toregional availability.When you enable semantic ranking, choose a pricing plan for the feature:At lower query volumes (under 1000 monthly), semantic ranking is free.At higher query volumes, choose the standard pricing plan.The Azure AI Search pricing page shows you the billing rate for different currenciesand intervals.Semantic capabilities and limitationshttps://www.youtube-nocookie.\n"
}