{
  "Id": "450",
  "Title": "\u0022Understanding Index Structure and Size in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfPhysical structure and sizenecessary for verbatim character matches. Suggesters are implemented at the field level,so choose only those fields that are reasonable for type-ahead.The following screenshot illustrates index storage patterns resulting from variouscombinations of attributes.\r\nThe index is based on the real estate sample index, whichyou can create easily using the Import data wizard and built-in sample data. Althoughthe index schemas aren\u0027t shown, you can infer the attributes based on the index name.For example, realestate-searchable index has the \u0022searchable\u0022 attribute selected andnothing else, realestate-retrievable index has the \u0022retrievable\u0022 attribute selected andnothing else, and so forth.\r\nAlthough these index variants are somewhat artificial, we can refer to them for broadcomparisons of how attributes affect storage:\u0022retrievable\u0022 has no effect on index size.\u0022filterable\u0022, \u0022sortable\u0022, \u0022facetable\u0022 consume more storage.\r\nsuggester has a large potential for increasing index size, but not as much as thescreenshot would indicate (all fields that could be made suggester-aware wereselected, which isn\u0027t a likely scenario in most indexes).Also not reflected in the above table is the effect of analyzers.\r\nIf you\u0027re using theedgeNgram tokenizer to store verbatim sequences of characters (a, ab, abc, abcd), thesize of the index will be larger than if you used a standard analyzer.Example demonstrating the storage implications ofattributes and suggestersBasic operations and interactionNow that you have a better idea of what an index is, this section introduces index runtime operations, including connecting to and securing a single index. In Cognitive Search, you\u0027ll work with one index at a time, where all index-relatedoperations target a single index. There\u0027s no concept of related indexes or the joining ofindependent indexes for either indexing or querying.An index is continuously available, with no ability to pause or take it offline. Because it\u0027sdesigned for continuous operation, any updates to its content, or additions to the indexitself, happen in real time.\n"
}