{
  "Id": "447",
  "Title": "\u0022Understanding Field Definitions and Attributes in Azure Search Indexing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf.. ],   \u0022charFilters\u0022:(optional)[ ... ],   \u0022tokenizers\u0022:(optional)[ ... ],   \u0022tokenFilters\u0022:(optional)[ ... ],   \u0022defaultScoringProfile\u0022: (optional) \u0022...\u0022,   \u0022corsOptions\u0022: (optional) { },   \u0022encryptionKey\u0022:(optional){ }   } } Field definitionsIf incoming data is hierarchical in nature, you can represent it within an index as acomplex type, used to represent nested structures.\r\nThe built-in sample data set, Hotels,illustrates complex types using an Address (contains multiple subfields) that has a one-to-one relationship with each hotel, and a Rooms complex collection, where multiplerooms are associated with each hotel.\r\nField attributes determine how a field is used, such as whether it\u0027s used in full textsearch, faceted navigation, sort operations, and so forth.String fields are often marked as \u0022searchable\u0022 and \u0022retrievable\u0022. Fields used to narrowsearch results include \u0022sortable\u0022, \u0022filterable\u0022, and \u0022facetable\u0022.AttributeDescription\u0022searchable\u0022Full-text searchable, subject to lexical analysis such as word-breaking duringindexing. If you set a searchable field to a value like \u0022sunny day\u0022, internally it\u0027s splitinto the individual tokens \u0022sunny\u0022 and \u0022day\u0022.\r\nFor details, see How full text searchworks.\u0022filterable\u0022Referenced in $filter queries. Filterable fields of type Edm.String orCollection(Edm.String) don\u0027t undergo word-breaking, so comparisons are forexact matches only. For example, if you set such a field f to \u0022sunny day\u0022, $filter=feq \u0027sunny\u0027 finds no matches, but $filter=f eq \u0027sunny day\u0027 will. \u0022sortable\u0022By default the system sorts results by score, but you can configure sort based onfields in the documents. Fields of type Collection(Edm.String) can\u0027t be \u0022sortable\u0022.\u0022facetable\u0022Typically used in a presentation of search results that includes a hit count bycategory (for example, hotels in a specific city).\n"
}