{
  "Id": "1600",
  "Title": "\u0022Understanding Field Paths in Azure AI Search REST APIs\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn othercontexts, such as $orderby, $select, or in fielded search in the full Lucene syntax, a fieldpath refers to the field itself. This difference has some consequences for how you usefield paths in filters.Consider the field path Address/City. In a filter, this refers to a single city for the currentdocument, like \u0022San Francisco\u0022.\r\nIn contrast, Rooms/Type refers to the Type subfield formany rooms (like \u0022standard\u0022 for the first room, \u0022deluxe\u0022 for the second room, and soon). Since Rooms/Type doesn\u0027t refer to a single instance of the subfield Type, it can\u0027t beused directly in a filter.\r\nInstead, to filter on room type, you would use a lambdaexpression with a range variable, like this:ODataIn this example, the range variable room appears in the room/Type field path. That way,room/Type refers to the type of the current room in the current document. This is asingle instance of the Type subfield, so it can be used directly in the filter.Field paths are used in many parameters of the Azure AI Search REST APIs.\r\nThe followingtable lists all the places where they can be used, plus any restrictions on their usage:APIParameter nameRestrictionsCreate or Update Indexsuggesters/sourceFieldsNoneCreate or Update IndexscoringProfiles/text/weightsCan only refer to searchablefieldsCreate or Update IndexscoringProfiles/functions/fieldNameCan only refer to filterablefieldsSearchsearch when queryType is fullCan only refer to searchablefieldsRooms/any(room: room/Type eq \u0027deluxe\u0027)Using field pathsAPIParameter nameRestrictionsSearchfacetCan only refer to facetablefieldsSearchhighlightCan only refer to searchablefieldsSearchsearchFieldsCan only refer to searchablefieldsSuggest andAutocompletesearchFieldsCan only refer to fields thatare part of a suggesterSearch, Suggest, andAutocomplete$filterCan only refer to filterablefieldsSearch and Suggest$orderbyCan only refer to sortablefieldsSearch, Suggest, andLookup$selectCan only refer to retrievablefieldsConstants in OData are literal values of a given Entity Data Model (EDM) type.\n"
}