{
  "Id": "422",
  "Title": "\u0022Understanding BM25 Relevance Scoring in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSimple query examplesLucene syntax query examples for building advanced queriesHow full text search works in Azure AI SearchgitNext stepsRelevance scoring for full text search(BM25)Article•10/09/2023This article explains the BM25 relevance scoring algorithm used to compute searchscores for full text search. BM25 relevance is exclusive to full text search. Filter queries,autocomplete and suggested queries, wildcard search or fuzzy search queries aren\u0027tscored or ranked for relevance.Azure Cognitive Search provides the following scoring algorithms for full text search:AlgorithmUsageRangeBM25SimilarityFixed algorithm on all search services created after July 2020.\r\nYou can configure this algorithm, but you can\u0027t switch to anolder one (classic).Unbounded.ClassicSimilarityPresent on older search services. You can opt-in for BM25and choose an algorithm on a per-index basis.0 \u003C 1.\r\n00Both BM25 and Classic are TF-IDF-like retrieval functions that use the term frequency(TF) and the inverse document frequency (IDF) as variables to calculate relevance scoresfor each document-query pair, which is then used for ranking results. While conceptuallysimilar to classic, BM25 is rooted in probabilistic information retrieval that producesmore intuitive matches, as measured by user research. BM25 offers advanced customization options, such as allowing the user to decide howthe relevance score scales with the term frequency of matched terms. For moreinformation, see Configure the scoring algorithm.Scoring algorithms used in full text search７ NoteIf you\u0027re using a search service that was created before July 2020, the scoringalgorithm is most likely the previous default, ClassicSimilarity, which you canupgrade on a per-index basis. See Enable BM25 scoring on older services fordetails.The following video segment fast-forwards to an explanation of the generally availableranking algorithms used in Azure Cognitive Search.\n"
}