{
  "Id": "1022",
  "Title": "\u0022Understanding Azure Search: Skills and Execution Environment\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor this reason, most skills either create text from images (OCR text,captions, tags), or analyze existing text to create new information (entities, key phrases,sentiment).\r\nSkills that operate independently are processed in parallel. Skills that dependon each other specify the output of one skill (such as key phrases) as the input ofsecond skill (such as text translation). The search service determines the order of skillexecution and the execution environment.All skills have a type, context, inputs, and outputs. A skill might optionally have a nameand description. The following example shows two unrelated built-in skills so that youcan compare the basic structure.JSON\u0022skills\u0022:[  {    \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Text.V3.\r\nEntityRecognitionSkill\u0022,    \u0022name\u0022: \u0022#1\u0022,    \u0022description\u0022: \u0022This skill detects organizations in the source content\u0022,    \u0022context\u0022: \u0022/document\u0022,    \u0022categories\u0022: [ \u0022Organization\u0022 ],    \u0022inputs\u0022: [      {        \u0022name\u0022: \u0022text\u0022,        \u0022source\u0022: \u0022/document/content\u0022      }    ],    \u0022outputs\u0022: [      {        \u0022name\u0022: \u0022organizations\u0022,        \u0022targetName\u0022: \u0022orgs\u0022      }    ]  },  {      \u0022name\u0022: \u0022#2\u0022,      \u0022description\u0022: \u0022This skill detects corporate logos in the source files\u0022,      \u0022@odata.\r\ntype\u0022: \u0022#Microsoft.Skills.Vision.\r\nImageAnalysisSkill\u0022,      \u0022context\u0022: \u0022/document/normalized_images/*\u0022,      \u0022visualFeatures\u0022: [          \u0022brands\u0022      ],      \u0022inputs\u0022: [          {              \u0022name\u0022: \u0022image\u0022,              \u0022source\u0022: \u0022/document/normalized_images/*\u0022          }      ],      \u0022outputs\u0022: [          {Each skill is unique in terms of its input values and the parameters that it takes. Skillreference documentation describes all of the parameters and properties of a given skill.Although there are differences, most skills share a common set and are similarlypatterned.Each skill has a context property that determines the level at which operations takeplace. If the \u0022context\u0022 property isn\u0027t explicitly set, the default is \u0022/document\u0022, where thecontext is the whole document (the skill is called once per document).\n"
}