{
  "Id": "424",
  "Title": "\u0022Understanding Azure Search Scoring and Ranking Algorithms\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfRun the query again, and you might see items shift position, especially if you\u0027re usingthe free service or a billable service with multiple replicas. Given two items with anidentical score, there\u0027s no guarantee that one appears first.To break the tie among repeating scores, you can add an $orderby clause to first orderby score, then order by another sortable field (for example, $orderby=search.score()desc,Rating desc).\r\nFor more information, see $orderby.Only fields marked as searchable in the index, or searchFields in the query, are usedfor scoring. Only fields marked as retrievable, or fields specified in select in the query,are returned in search results, along with their search score.https://www.youtube-nocookie.com/embed/Y_X6USgvB1g?version=3\u0026start=322\u0026end=643How BM25 ranking works７ NoteA @search.\r\nscore = 1 indicates an un-scored or un-ranked result set. The score isuniform across all results. Un-scored results occur when the query form is fuzzysearch, wildcard or regex queries, or an empty search (search=*, sometimes pairedwith filters, where the filter is the primary means for returning a match).\r\nWhenever results are ranked, @search.score property contains the value used to orderthe results.The following table identifies the scoring property returned on each match, algorithm,and range.SearchmethodParameterScoring algorithmRangefull textsearch@search.scoreBM25 algorithm, using the parameters specifiedin the index.Unbounded. Search scores convey general sense of relevance, reflecting the strength of matchrelative to other documents in the same result set. But scores aren\u0027t always consistentfrom one query to the next, so as you work with queries, you might notice smalldiscrepancies in how search documents are ordered. There are several explanations forwhy this might occur.\nCauseDescriptionDatavolatilityIndex content varies as you add, modify, or delete documents. Term frequencies willchange as index updates are processed over time, affecting the search scores ofmatching documents.MultiplereplicasFor services using multiple replicas, queries are issued against each replica in parallel.\n"
}