{
  "Id": "500",
  "Title": "\u0022Understanding Azure Search Skillsets and Custom Skills\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSkills can be the built-in skills from Microsoft, or custom skills for processing logicthat you host externally. A skillset produces enriched documents that are either consumed duringindexing or projected to a knowledge store.Skillset definitionSkills have a context, inputs, and outputs:Context refers to the scope of the operation, which could be once per document or once foreach item in a collection.\r\nInputs originate from nodes in an enriched document, where a \u0022source\u0022 and \u0022name\u0022 identify agiven node.Output is sent back to the enriched document as a new node. Values are the node \u0022name\u0022 andnode content. If a node name is duplicated, you can set a target name for disambiguation.\r\nEach skill has a context, which can be the entire document (/document) or a node lower in the tree(/document/countries/*). A context determines:The number of times the skill executes, over a single value (once per field, per document), or forcontext values of type collection, where adding an /* results in skill invocation, once for eachinstance in the collection.\r\nOutput declaration, or where in the enrichment tree the skill outputs are added. Outputs arealways added to the tree as children of the context node.Shape of the inputs. For multi-level collections, setting the context to the parent collection willaffect the shape of the input for the skill. For example if you have an enrichment tree with a listof countries/regions, each enriched with a list of states containing a list of ZIP codes, how youset the context will determine how the input is interpreted. Skill contextContextInputShape ofInputSkillInvocation/document/countries/*/document/countries/*/states/*/zipcodes/*A list of all ZIPcodes in thecountry/regionOnce percountry/region/document/countries/*/states/*/document/countries/*/states/*/zipcodes/*A list of ZIPcodes in thestateOnce percombinationofcountry/regionand stateSkills can execute independently and in parallel, or sequentially if you feed the output of one skill intoanother skill.\n"
}