{
  "Id": "1710",
  "Title": "\u0022Understanding Azure AI Vision OCR Skill: Usage and Parameters\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf{              \u0022languageCode\u0022: \u0022es\u0022,              \u0022languageName\u0022: \u0022Spanish\u0022,              \u0022score\u0022: 1,            }      },      {        \u0022recordId\u0022: \u00223\u0022,        \u0022data\u0022:            {              \u0022languageCode\u0022: \u0022fr\u0022,              \u0022languageName\u0022: \u0022French\u0022,              \u0022score\u0022: 1,            }      }    ]}See alsoOCR cognitive skillArticle•07/18/2023The Optical character recognition (OCR) skill recognizes printed and handwritten text inimage files.\r\nThis article is the reference documentation for the OCR skill. See Extract textfrom images for usage instructions.An OCR skill uses the machine learning models provided by Azure AI Vision API v3.2in Azure AI services. The OCR skill maps to the following functionality:For the languages listed under Azure AI Vision language support, the Read API isused.For Greek and Serbian Cyrillic, the legacy OCR API is used.The OCR skill extracts text from image files. Supported file formats include:.JPEG.JPG.PNG.BMP.TIFFParameters are case-sensitive.Parameter nameDescriptiondetectOrientationDetects image orientation. Valid values are true or false.\r\nThis parameter only applies if the legacy OCR API is used.defaultLanguageCodeLanguage code of the input text. Supported languages include all of thegenerally available languages of Azure AI Vision. You can also specify unk(Unknown).７ NoteThis skill is bound to Azure AI services and requires a billable resource fortransactions that exceed 20 documents per indexer per day. Execution of built-inskills is charged at the existing Azure AI services pay-as-you go price.In addition, image extraction is billable by Azure Cognitive Search.Skill parametersParameter nameDescriptionIf the language code is unspecified or null, the language is set to English. Ifthe language is explicitly set to unk, all languages found are auto-detected and returned.lineEndingThe value to use as a line separator. Possible values: \u0022Space\u0022,\u0022CarriageReturn\u0022, \u0022LineFeed\u0022. The default is \u0022Space\u0022.In previous versions, there was a parameter called \u0022textExtractionAlgorithm\u0022 to specifyextraction of \u0022printed\u0022 or \u0022handwritten\u0022 text. This parameter is deprecated because thecurrent Read API algorithm extracts both types of text at once. If your skill includes thisparameter, you don\u0027t need to remove it, but it won\u0027t be used during skill execution.InputnameDescriptionimageComplex Type.\n"
}