{
  "Id": "1133",
  "Title": "\u0022Understanding Projection Definitions and Table Relationships in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn the tables projection below, threetables are defined by setting the tableName, source and generatedKeyName properties.All three of these tables will be related through generated keys and by the sharedparent /document/projectionShape.JSONYou can check projection definitions by following these steps:1. Set the knowledge store\u0027s storageConnectionString property to a valid V2 generalpurpose storage account connection string.2. Update the skillset by issuing the PUT request.\r\nProjecting to tables\u0022knowledgeStore\u0022 : {     \u0022storageConnectionString\u0022: \u0022DefaultEndpointsProtocol=https;AccountName=\u003CAcct Name\u003E;AccountKey=\u003CAcct Key\u003E;\r\n\u0022,     \u0022projections\u0022: [         {             \u0022tables\u0022: [                 {                     \u0022tableName\u0022: \u0022tblDocument\u0022,                     \u0022generatedKeyName\u0022: \u0022Documentid\u0022,                     \u0022source\u0022: \u0022/document/projectionShape\u0022                 },                 {                     \u0022tableName\u0022: \u0022tblKeyPhrases\u0022,                     \u0022generatedKeyName\u0022: \u0022KeyPhraseid\u0022,                     \u0022source\u0022:\r\n\u0022/document/projectionShape/keyPhrases/*\u0022                 },                 {                     \u0022tableName\u0022: \u0022tblEntities\u0022,                     \u0022generatedKeyName\u0022: \u0022Entityid\u0022,                     \u0022source\u0022: \u0022/document/projectionShape/Entities/*\u0022                 }             ],             \u0022objects\u0022: [],             \u0022files\u0022: []         }     ] } Test your work3.\r\nAfter updating the skillset, run the indexer.You now have a working projection with three tables. Importing these tables into PowerBI should result in Power BI discovering the relationships.Before moving on to the next example, let\u0027s revisit aspects of the table projection tounderstand the mechanics of slicing and relating data.Slicing is a technique that subdivides a whole consolidated shape into constituent parts. The outcome consists of separate but related tables that you can work with individually.In the example, projectionShape is the consolidated shape (or enrichment node). In theprojection definition, projectionShape is sliced into additional tables, which enables youto pull out parts of the shape, keyPhrases and Entities. In Power BI, this is useful asmultiple entities and keyPhrases are associated with each document, and you\u0027ll getmore insights if you can see entities and keyPhrases as categorized data.\n"
}