{
  "Id": "678",
  "Title": "\u0022Understanding Changes in Azure Search API Versions and Upgrades\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfOrdered results for null values have changed in this version, with null valuesappearing first if the sort is asc and last if the sort is desc. If you wrote code to        0.1183      ],      \u0022fields\u0022: \u0022contentVector\u0022,      \u0022k\u0022: 5    }  ],  \u0022vectorFilterMode\u0022: \u0022preFilter\u0022,  \u0022select\u0022: \u0022title, content, category\u0022}Upgrade to 2020-06-30Breaking changeBehavior changeshandle how null values are sorted, be aware of this change.\r\nVersion 2019-05-06 is the previous generally available release of the REST API. Featuresthat became generally available in this API version include:Autocomplete is a typeahead feature that completes a partially specified terminput.Complex types provides native support for structured object data in search index.JsonLines parsing modes, part of Azure Blob indexing, creates one searchdocument per JSON entity that is separated by a newline.AI enrichment provides indexing that uses the AI enrichment engines of Azure AIservices.\r\nExisting code written against earlier API versions will break on api-version=2019-05-06and later if code contains the following functionality:If you\u0027re using an Azure Cosmos DB indexer, you must change \u0022type\u0022: \u0022documentdb\u0022 to\u0022type\u0022: \u0022cosmosdb\u0022.The error structure for indexer execution previously had a status element. This elementwas removed because it wasn\u0027t providing useful information.\r\nFrom API versions 2019-05-06 and 2019-05-06-Preview onwards, the data source API nolonger returns connection strings in the response of any REST operation. In previous APIversions, for data sources created using POST, Azure AI Search returned 201 followed bythe OData response, which contained the connection string in plain text. Upgrade to 2019-05-06Breaking changesIndexer for Azure Cosmos DB - datasource is now \u0022type\u0022:\u0022cosmosdb\u0022Indexer execution result errors no longer have statusIndexer data source API no longer returns connection stringsNamed Entity Recognition cognitive skill is now discontinuedIf you called the Name Entity Recognition skill in your code, the call fails. Replacementfunctionality is Entity Recognition Skill (V3).\n"
}