{
  "Id": "1312",
  "Title": "\u0022Understanding and Addressing Throttling in Azure Search Service\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThrottling behaviorsA simple fix to most throttling issues is to throw more resources at the search service(typically replicas for query-based throttling, or partitions for indexing-based throttling).However, increasing replicas or partitions adds cost, which is why it\u0027s important to knowthe reason why throttling is occurring at all. Investigating the conditions that causethrottling will be explained in the next several sections.\r\nBelow is an example of a Kusto query that can identify the breakdown of HTTPresponses from the search service that has been under load. Over a 7-day period, therendered bar chart shows that a relatively large percentage of the search queries werethrottled, in comparison to the number of successful (200) responses.\r\nKustoExamining throttling over a specific time period can help you identify the times wherethrottling might occur more frequently. In the below example, a time series chart is usedto show the number of throttled queries that occurred over a specified time frame. Inthis case, the throttled queries correlated with the times in with the performancebenchmarking was performed.\r\nKustoAzureDiagnostics| where TimeGenerated \u003E ago(7d)| summarize count() by resultSignature_d | render barchart let [\u0027_startTime\u0027]=datetime(\u00272021-02-25T20:45:07Z\u0027);let [\u0027_endTime\u0027]=datetime(\u00272021-03-03T20:45:07Z\u0027);let intervalsize = 1m; AzureDiagnostics | where TimeGenerated \u003E ago(7d)In some cases, it can be useful to test individual queries to see how they\u0027re performing. To do this, it\u0027s important to be able to see how long the search service takes to completethe work, as well as how long it takes to make the round-trip request from the client andback to the client. The diagnostics logs could be used to look up individual operations,but it might be easier to do this all from a client tool, such as Postman.\n"
}