{
  "Id": "1564",
  "Title": "\u0022Understanding Azure Monitor Logs for Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure Monitor Logs is a feature of Azure Monitor that collects and organizes log andperformance data from monitored resources. If you configured a diagnostic setting forLog Analytics, you can query the Azure Monitor Logs tables for the resource logsgenerated by Azure AI Search.This section refers to all of the Azure Monitor Logs Kusto tables relevant to Azure AISearch and available for query by Log Analytics and Metrics Explorer in the Azure portal.\r\nTableDescriptionAzureActivityEntries from the Azure Activity log that provide insight into control planeoperations. Tasks invoked on the control plane, such as adding or removingreplicas and partitions, will be represented through a \u0022Get Admin Key\u0022 activity.AzureDiagnosticsLogged query and indexing operations.AzureMetricsMetric data emitted by Azure AI Search that measures health andperformance.For a reference of all Azure Monitor Logs / Log Analytics tables, see the Azure MonitorLog Table Reference.Azure AI Search uses the Azure Diagnostics table to collect resource logs related toqueries and indexing on your search service.\r\nQueries against this table in Log Analytics can include the common properties, thesearch-specific properties, and the search-specific operations listed in the schemareference section.For examples of Kusto queries useful for Azure AI Search, see Monitoring Azure AISearch and Analyze performance in Azure AI Search.Azure Monitor Logs tablesDiagnostics tablesThe following table lists common operations related to Azure AI Search that may becreated in the Azure Activity log.OperationDescriptionGet Admin KeyAny operation that requires administrative rights will be logged as a \u0022GetAdmin Key\u0022 operation.Get Query KeyAny read-only operation against the documents collection of an index. Regenerate AdminKeyA request to regenerate either the primary or secondary admin API key.Common entries include references to API keys - generic informational notifications likeGet Admin Key and Get Query keys. These activities indicate requests that were madeusing the admin key (create or delete objects) or query key, but do not show the requestitself. For information of this grain, you must configure resource logging.Alternatively, you might gain some insight through change history. In Azure portal,select the activity to open the detail page and then select \u0022Change history\u0022 forinformation about the underlying operation.\n"
}