{
  "Id": "524",
  "Title": "\u0022Understanding Projections in Azure Search: A Comprehensive Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe following example illustrates the placement of projections under knowledgeStore,and the basic construction. The name, type, and content source make up a projectiondefinition.\r\nJSONProjection definition\u0022knowledgeStore\u0022 : {     \u0022storageConnectionString\u0022: \u0022DefaultEndpointsProtocol=https;AccountName=\u003CAcct Name\u003E;AccountKey=\u003CAcct Key\u003E;\r\n\u0022,     \u0022projections\u0022: [       {         \u0022tables\u0022: [           { \u0022tableName\u0022: \u0022ks-museums-main\u0022, \u0022generatedKeyName\u0022: \u0022ID\u0022, \u0022source\u0022: \u0022/document/tableprojection\u0022 },           { \u0022tableName\u0022: \u0022ks-museumEntities\u0022, \u0022generatedKeyName\u0022: \u0022ID\u0022,\u0022source\u0022: \u0022/document/tableprojection/Entities/*\u0022 }         ],         \u0022objects\u0022:\r\n[           { \u0022storageContainer\u0022: \u0022ks-museums\u0022, \u0022generatedKeyName\u0022: \u0022ID\u0022, \u0022source\u0022: \u0022/document/objectprojection\u0022 }         ],         \u0022files\u0022: [ ] Projections are an array of complex collections, which means that you can specifymultiple sets of each type.\r\nIt\u0027s common to use just one projection group, but you mightuse multiple if storage requirements include supporting different tools and scenarios.For example, you might use one group for design and debug of a skillset, while asecond set collects output used for an online app, with a third for data scienceworkloads.The same skillset output is used to populate all groups under projections. The followingexample shows two. JSONProjection groups have the following key characteristics of mutual exclusivity andrelatedness.PrincipleDescriptionMutualexclusivityEach group is fully isolated from other groups to support different data shapingscenarios. For example, if you are testing different table structures andcombinations, you would put each set in a different projection group for ABtesting. Each group obtains data from the same source (enrichment tree) but is fullyisolated from the table-object-file combination of any peer projection groups.\n"
}