{
  "Id": "13",
  "Title": "\u0022Understanding Azure AI Search: Features and Capabilities Overview\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure Search (March 2015) The original name.Service update announcements for Azure AI Search can be found on the Azure website.Semantic search was renamed to semantic ranking in November 2023 to better describethe feature, which provides L2 ranking of an existing result set.Service updatesFeature renameFeatures of Azure AI SearchArticle•11/15/2023Azure AI Search provides information retrieval and uses optional AI integration toextract more text and structure content.The following table summarizes features by category. For more information about howAzure AI Search compares with other search technologies, see Compare search options.\r\nThere\u0027s feature parity in all Azure public, private, and sovereign clouds, but somefeatures aren\u0027t supported in specific regions. For more information, see productavailability by region.Category                           FeaturesData sourcesSearch indexes can accept text from any source, provided it\u0027ssubmitted as a JSON document.Indexers are a feature that automates data import from supporteddata sources to extract searchable content in primary data stores.Indexers handle JSON serialization for you and most support someform of change and deletion detection. You can connect to avariety of data sources, including Azure SQL Database, AzureCosmos DB, or Azure Blob storage.\r\nHierarchical and nested datastructuresComplex types and collections allow you to model virtually anytype of JSON structure within a search index. One-to-many andmany-to-many cardinality can be expressed natively throughcollections, complex types, and collections of complex types.Linguistic analysisAnalyzers are components used for text processing duringindexing and search operations. By default, you can use thegeneral-purpose Standard Lucene analyzer, or override the defaultwith a language analyzer, a custom analyzer that you configure, oranother predefined analyzer that produces tokens in the formatyou require.Language analyzers from Lucene or Microsoft are used to７ NoteLooking for preview features? See the preview features list.\n"
}