{
  "Id": "1203",
  "Title": "\u0022Understanding Full Text Search in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHow full text search works in Azure AI SearchSearch Documents REST APISimple query syntaxLucene query syntaxNext steps# Geo-filter returning documents within 5 kilometers of Redmond, Washington state# Use $count=true to get a number of hits returned by the query# Use $select to trim results, showing values for named fields only# Use search=* for an empty query string. The filter is the sole inputsearch=*\u0026$count=true\u0026$select=description,city,postCode\u0026$filter=geo.distance(location,geography\u0027POINT(-122.121513 47.\r\n673988)\u0027) le 5# Numeric filters use comparison like greater than (gt), less than (lt), not equal (ne)# Include \u0022and\u0022 to filter on multiple fields (baths and bed)# Full text search is on John Leclerc, matching on John or Leclercsearch=John Leclerc\u0026$count=true\u0026$select=source,\r\ncity,postCode,baths,beds\u0026$filter=baths gt 3 and beds gt 4# Text filters can also use comparison operators# Wrap text in single or double quotes and use the correct case# Full text search is on John Leclerc,\r\nmatching on John or Leclercsearch=John Leclerc\u0026$count=true\u0026$select=source,city,postCode,baths,beds\u0026$filter=city gt \u0027Seattle\u0027See alsoSupported data typesFilters in vector queriesArticle•11/15/2023You can set a vector filter modes on a vector query to specify whether you want filteringbefore or after query execution. Filters are set on and iterate over string and numericfields attributed as filterable in the index, but the effects of filtering determine whatthe vector query executes over: the searchable space, or the documents in the searchresults.This article describes each filter mode and provides guidance on when to use each one.Prefiltering applies filters before query execution, reducing the search surface area overwhich the vector search algorithm looks for similar content.\n"
}