{
  "Id": "382",
  "Title": "\u0022Understanding Query Parsing in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf227659)\u0027)\u0022,     \u0022queryType\u0022: \u0022full\u0022 }Stage 1: Query parsingThe query parser separates operators (such as * and \u002B in the example) from searchterms, and deconstructs the search query into subqueries of a supported type:\r\nterm query for standalone terms (like spacious)phrase query for quoted terms (like ocean view)prefix query for terms followed by a prefix operator * (like air-condition)For a full list of supported query types, see Lucene query syntaxOperators associated with a subquery determine whether the query \u0022must be\u0022 or\u0022should be\u0022 satisfied in order for a document to be considered a match.\r\nFor example,\u002B\u0022Ocean view\u0022 is \u0022must\u0022 due to the \u002B operator.The query parser restructures the subqueries into a query tree (an internal structurerepresenting the query) it passes on to the search engine. In the first stage of queryparsing, the query tree looks like this.Azure Cognitive Search exposes two different query languages, simple (default) andfull.\r\nBy setting the queryType parameter with your search request, you tell the queryparser which query language you choose so that it knows how to interpret the operatorsand syntax.The Simple query language is intuitive and robust, often suitable to interpret userinput as-is without client-side processing. It supports query operators familiar fromweb search engines.\r\nThe Full Lucene query language, which you get by setting queryType=full, extendsthe default Simple query language by adding support for more operators andquery types like wildcard, fuzzy, regex, and field-scoped queries. For example, aregular expression sent in Simple query syntax would be interpreted as a querystring and not an expression. The example request in this article uses the FullLucene query language. \u0022search\u0022: \u0022Spacious, air-condition* \u002B\\\u0022Ocean view\\\u0022\u0022, Supported parsers: Simple and Full LuceneAnother search request parameter that affects parsing is the \u0022searchMode\u0022 parameter. Itcontrols the default operator for Boolean queries: any (default) or all.When \u0022searchMode=any\u0022, which is the default, the space delimiter between spaciousand air-condition is OR (||), making the sample query text equivalent to:Explicit operators, such as \u002B in \u002B\u0022Ocean view\u0022, are unambiguous in boolean queryconstruction (the term must match).\n"
}