{
  "Id": "526",
  "Title": "\u0022Understanding Projections and Data Shapes in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe source parameter is the third component of a projection definition. Becauseprojections store data from an AI enrichment pipeline, the source of a projection isalways the output of a skill. As such, output might be a single field (for example, a fieldof translated text), but often it\u0027s a reference to a data shape.Data shapes come from your skillset. Among all of the built-in skills provided inCognitive Search, there is a utility skill called the Shaper skill that\u0027s used to create datashapes. You can include Shaper skills (as many as you need) to support the projectionsin the knowledge store.\r\nShapes are frequently used with table projections, where the shape not only specifieswhich rows go into the table, but also which columns are created (you can also pass ashape to an object projection).Shapes can be complex and it\u0027s out of scope to discuss them in depth here, but thefollowing example briefly illustrates a basic shape.\r\nThe output of the Shaper skill isspecified as the source of a table projection. Within the table projection itself will becolumns for \u0022metadata-storage_path\u0022, \u0022reviews_text\u0022, \u0022reviews_title\u0022, and so forth, asspecified in the shape.JSONProjection \u0022source\u0022{     \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Util.\r\nShaperSkill\u0022,     \u0022name\u0022: \u0022ShaperForTables\u0022,     \u0022description\u0022: null,     \u0022context\u0022: \u0022/document\u0022,     \u0022inputs\u0022: [         {             \u0022name\u0022: \u0022metadata_storage_path\u0022,             \u0022source\u0022: \u0022/document/metadata_storage_path\u0022,             \u0022sourceContext\u0022: null,             \u0022inputs\u0022: []         },         {           \u0022name\u0022: \u0022reviews_text\u0022, Projections have a lifecycle that is tied to the source data in your data source. As sourcedata is updated and reindexed, projections are updated with the results of theenrichments, ensuring your projections are eventually consistent with the data in yourdata source. However, projections are also independently stored in Azure Storage.\nTheywill not be deleted when the indexer or the search service itself is deleted.After the indexer is run, connect to projections and consume the data in other apps andworkloads.Use Azure portal to verify object creation and content in Azure Storage.Use Power BI for data exploration. This tool works best when the data is in AzureTable Storage.\n"
}