{
  "Id": "1202",
  "Title": "\u0022Understanding and Implementing Azure AI Search Filter Fundamentals\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfismatchscoring) when you want multiplesearch-filter combinations in one request. You canalso use it for a contains filter to filter on a partialstring within a larger string.$filter=fieldoperator stringA user-definedexpression composed offields, operators, andvalues.Use this when you want to find exact matchesbetween a string field and a string value.\r\nNumeric fields aren\u0027t searchable in the context of full text search. Only strings aresubject to full text search. For example, if you enter 99.99 as a search term, you won\u0027tget back items priced at $99.99. Instead, you would see items that have the number 99in string fields of the document.\r\nThus, if you have numeric data, the assumption is thatyou\u0027ll use them for filters, including ranges, facets, groups, and so forth.Text filter fundamentalsApproaches for filtering on textNumeric filter fundamentalsDocuments that contain numeric fields (price, size, SKU, ID) provide those values insearch results if the field is marked retrievable.\r\nThe point here\u0027s that full text searchitself isn\u0027t applicable to numeric field types.First, try Search explorer in the portal to submit queries with $filter parameters. Thereal-estate-sample index provides interesting results for the following filtered querieswhen you paste them into the search bar:HTTPTo work with more examples, see OData Filter Expression Syntax \u003E Examples. How full text search works in Azure AI SearchSearch Documents REST APISimple query syntaxLucene query syntaxNext steps# Geo-filter returning documents within 5 kilometers of Redmond, Washington state# Use $count=true to get a number of hits returned by the query# Use $select to trim results, showing values for named fields only# Use search=* for an empty query string. The filter is the sole inputsearch=*\u0026$count=true\u0026$select=description,city,postCode\u0026$filter=geo.distance(location,geography\u0027POINT(-122.121513 47.\n"
}