{
  "Id": "523",
  "Title": "\u0022Understanding Projections in Azure Cognitive Search Knowledge Store\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfDeletionsNext stepsCreate a knowledge store using Postman and RESTKnowledge store \u0022projections\u0022 in AzureCognitive SearchArticle•11/15/2022Projections are the physical tables, objects, and files in a knowledge store that acceptcontent from a Cognitive Search AI enrichment pipeline. If you\u0027re creating a knowledgestore, defining and shaping projections is most of the work.This article introduces projection concepts and workflow so that you have somebackground before you start coding.Projections are defined in Cognitive Search skillsets, but the end results are the table,object, and image file projections in Azure Storage.\r\nA knowledge store is a logical construction that\u0027s physically expressed as a loosecollection of tables, JSON objects, or binary image files in Azure Storage.ProjectionStorageUsageTypes of projections and usageProjectionStorageUsageTablesAzureTableStorageUsed for data that\u0027s best represented as rows and columns, or wheneveryou need granular representations of your data (for example, as dataframes). Table projections allow you to define a schematized shape, usinga Shaper skill or use inline shaping to specify columns and rows. You canorganize content into multiple tables based on familiar normalizationprinciples.\r\nTables that are in the same group are automatically related.ObjectsAzureBlobStorageUsed when you need the full JSON representation of your data andenrichments in one JSON document. As with table projections, only validJSON objects can be projected as objects, and shaping can help you dothat.FilesAzureBlobStorageUsed when you need to save normalized, binary image files.Projections are specified under the \u0022knowledgeStore\u0022 property of a skillset. Projectiondefinitions are used during indexer invocation to create and load objects in AzureStorage with enriched content. If you are unfamiliar with these concepts, start with AIenrichment for an introduction. The following example illustrates the placement of projections under knowledgeStore,and the basic construction. The name, type, and content source make up a projectiondefinition.\nJSONProjection definition\u0022knowledgeStore\u0022 : {     \u0022storageConnectionString\u0022: \u0022DefaultEndpointsProtocol=https;AccountName=\u003CAcct Name\u003E;AccountKey=\u003CAcct Key\u003E;\n"
}