{
  "Id": "815",
  "Title": "\u0022Understanding Base64 Encoding and Decoding in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfJSON\u0022fieldMappings\u0022: [   {     \u0022sourceFieldName\u0022: \u0022metadata_storage_path\u0022,     \u0022targetFieldName\u0022: \u0022metadata_storage_path\u0022   },   {     \u0022sourceFieldName\u0022: \u0022metadata_storage_path\u0022,     \u0022targetFieldName\u0022: \u0022index_key\u0022,     \u0022mappingFunction\u0022: {        \u0022name\u0022:\r\n\u0022base64Encode\u0022     }   } ] base64Decode functionExample - decode blob metadata or URLs\u0022fieldMappings\u0022 : [   {     \u0022sourceFieldName\u0022 : \u0022Base64EncodedMetadata\u0022,     \u0022targetFieldName\u0022 : \u0022SearchableMetadata\u0022,     \u0022mappingFunction\u0022 : {  If you don\u0027t include a parameters property, it defaults to the value{\u0022useHttpServerUtilityUrlTokenEncode\u0022 : true}.\r\nAzure Cognitive Search supports two different Base64 encodings. You should use thesame parameters when encoding and decoding the same field. For more information,see base64 encoding options to decide which parameters to use.\r\nAzure Cognitive Search supports URL-safe base64 encoding and normal base64encoding. A string that is base64 encoded during indexing should be decoded later withthe same encoding options, or else the result won\u0027t match the original.If the useHttpServerUtilityUrlTokenEncode or useHttpServerUtilityUrlTokenDecodeparameters for encoding and decoding respectively are set to true, then base64Encodebehaves like HttpServerUtility.\r\nUrlTokenEncode and base64Decode behaves likeHttpServerUtility.UrlTokenDecode.The .NET libraries in Azure Cognitive Search assume the full .NET Framework, whichprovides built-in encoding. The useHttpServerUtilityUrlTokenEncode anduseHttpServerUtilityUrlTokenDecode options apply this built-in functionality. If you\u0027reusing .NET Core or another framework, we recommend setting those options to falseand calling your framework\u0027s encoding and decoding functions directly.The following table compares different base64 encodings of the string 00\u003E00?00. Todetermine the required processing (if any) for your base64 functions, apply your libraryencode function on the string 00\u003E00?00 and compare the output with the expectedoutput MDA-MDA_MDA.\n"
}