{
  "Id": "586",
  "Title": "\u0022Understanding Azure AI Search Tier Pricing and Billing Model\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTier pricing includes details about per-partition storage that ranges from 2 GB for Basic, up to 2 TB forStorage Optimized (L2) tiers. Other hardware characteristics, such as speed of operations, latency, andtransfer rates, aren\u0027t published, but tiers that are designed for specific solution architectures are built onhardware that has the features to support those scenarios.\r\nFor more information about partitions, seeEstimate and manage capacity and Reliability in Azure AI Search.Tiers have different billing rates, with higher rates for tiers that run on more expensive hardware orprovide more expensive features. The per-tier billing rate can be found in the Azure pricing pages forAzure AI Search.\r\nOnce you create a service, the billing rate becomes both a fixed cost of running the service around theclock, and an incremental cost if you choose to add more capacity.Search services are allocated computing resources in the form of partitions (for storage), and replicas(instances of the query engine). Initially, a service is created with one of each, and the billing rate isinclusive of both resources. However, if you scale capacity, the costs go up or down in increments of thebillable rate.The following example provides an illustration. Assume a hypothetical billing rate of100 is what you can expect to pay at the end of the month.\r\nHowever, if you add two more replicas toachieve high availability, the monthly bill increases to 100 for the first replica-partition pair,followed by $200 for the two replicas).This billing model is based on the concept of applying the billing rate to the number search units (SU)used by a search service. All services are initially provisioned at one SU, but you can increase the SUs byadding either partitions or replicas to handle larger workloads. For more information, see How toestimate costs of a search service.There is no built-in support to upgrade or downgrade tiers. If you want to switch to a different tier, theapproach is:Create a new search service at the new tier.\nDeploy your search content onto the new service. Follow this checklist to make sure you have all ofthe content.Delete the old search service once you\u0027re sure it\u0027s no longer needed.Partition size and speedBilling rates100permonth.\n"
}