{
  "Id": "1292",
  "Title": "\u0022Understanding and Implementing Scoring Profiles in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHow scores are computedWhen to add scoring logicSteps for adding a scoring profile4. Specify boosting criteria. A single profile can contain weighted fields, functions, orboth.You should work iteratively, using a data set that will help you prove or disprove theefficacy of a given profile.\r\nScoring profiles can be defined in Azure portal as shown in the following screenshot, orprogrammatically through REST APIs or in Azure SDKs, such as the ScoringProfile classin the Azure SDK for .NET.Use weighted fields when field context is important and queries are full text search.\r\nForexample, if a query includes the term \u0022airport\u0022, you might want \u0022airport\u0022 in theDescription field to have more weight than in the HotelName.Weighted fields are composed of a searchable field and a positive number that is usedas a multiplier. If the original field score of HotelName is 3, the boosted score for thatfield becomes 6, contributing to a higher overall score for the parent document itself.\r\nJSONUsing weighted fields\u0022scoringProfiles\u0022: [      {        \u0022name\u0022: \u0022boostKeywords\u0022,        \u0022text\u0022: {          \u0022weights\u0022: {            \u0022HotelName\u0022: 2,            \u0022Description\u0022: 5         }        }      }]Use functions when simple relative weights are insufficient or don\u0027t apply, as is the caseof distance and freshness, which are calculations over numeric data.\r\nYou can specifymultiple functions per scoring profile. For more information about the EDM data typesused in Azure AI Search, see Supported data types.FunctionDescription\u0022freshness\u0022Boosts by values in a datetime field (Edm.DateTimeOffset). This function has a\u0022boostingDuration\u0022 attribute so that you can specify a value representing atimespan over which boosting occurs.\u0022magnitude\u0022Boosts based on how high or low a numeric value is. Scenarios that call for thisfunction include boosting by profit margin, highest price, lowest price, or a countof downloads. This function can only be used with Edm.\n"
}