{
  "Id": "584",
  "Title": "\u0022Understanding Azure Search Tiers and Configurations for Your Projects\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfStandard and Storage Optimized areavailable with several configurations and capacities. The following screenshot from Azure portal showsthe available tiers, minus pricing (which you can find in the portal and on the pricing page).Free creates a limited search service for smaller projects, like running tutorials and code samples.Internally, system resources are shared among multiple subscribers. You can\u0027t scale a free service or runsignificant workloads. You can only have one free search service per Azure subscription.The most commonly used billable tiers include the following:Basic has just one partition but with the ability to meet SLA with its support for three replicas.\r\n７ NoteLooking for information about \u0022Azure SKUs\u0022? Start with Azure pricing and then scroll down forlinks to per-service pricing pages.Tier descriptionsStandard (S1, S2, S3) is the default. It gives you more flexibility in scaling for workloads. You canscale both partitions and replicas.\r\nWith dedicated resources under your control, you can deploylarger projects, optimize performance, and increase capacity.Some tiers are designed for certain types of work:Standard 3 High Density (S3 HD) is a hosting mode for S3, where the underlying hardware isoptimized for a large number of smaller indexes and is intended for multitenancy scenarios.\r\nS3 HDhas the same per-unit charge as S3, but the hardware is optimized for fast file reads on a largenumber of smaller indexes.Storage Optimized (L1, L2) tiers offer larger storage capacity at a lower price per TB than theStandard tiers. These tiers are designed for large indexes that don\u0027t change very often. The primarytradeoff is higher query latency, which you should validate for your specific applicationrequirements.You can find out more about the various tiers on the pricing page, in the Service limits in Azure AISearch article, and on the portal page when you\u0027re provisioning a service.Most features are available on all tiers, including the free tier.\n"
}