{
  "Id": "670",
  "Title": "\u0022Upgrading to Azure.Search Version 11: Key Changes and Considerations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe naming differences section is a place to start butyou can also review the change log.Uri endpoint = new Uri(Environment.GetEnvironmentVariable(\u0022SEARCH_ENDPOINT\u0022));AzureKeyCredential credential = new AzureKeyCredential(   Environment.GetEnvironmentVariable(\u0022SEARCH_API_KEY\u0022));SearchIndexClient indexClient = new SearchIndexClient(endpoint, credential);var options = new SearchOptions {    SearchMode = SearchMode.All,    IncludeTotalCount = true }; // Select fields to return in results. options.Select.Add(\u0022HotelName\u0022); options.Select.Add(\u0022Description\u0022); options.Select.Add(\u0022Tags\u0022); options.Select.Add(\u0022Rooms\u0022); options.Select.Add(\u0022Rating\u0022); options.\r\nSelect.Add(\u0022LastRenovationDate\u0022);If you have trouble finding equivalent APIs, we suggest logging an issue onhttps://github.com/MicrosoftDocs/azure-docs/issues so that we can improve thedocumentation or investigate the problem.10. Rebuild the solution. After fixing any build errors or warnings, you can makeadditional changes to your application to take advantage of new functionality.\r\nGiven the sweeping changes to libraries and APIs, an upgrade to version 11 is non-trivialand constitutes a breaking change in the sense that your code will no longer bebackward compatible with version 10 and earlier. For a thorough review of thedifferences, see the change log for Azure.Search.\r\nDocuments.In terms of service version updates, where code changes in version 11 relate to existingfunctionality (and not just a refactoring of the APIs), you\u0027ll find the following behaviorchanges:BM25 ranking algorithm replaces the previous ranking algorithm with newertechnology. New services use this algorithm automatically. For existing services,you must set parameters to use the new algorithm.Ordered results for null values have changed in this version, with null valuesappearing first if the sort is asc and last if the sort is desc. If you wrote code tohandle how null values are sorted, you should review and potentially remove thatcode if it\u0027s no longer necessary.\n"
}