{
  "Id": "1761",
  "Title": "\u0022Upgrading to Microsoft.Skills.Text.V3.EntityRecognitionSkill: Migration Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNamedEntityRecognitionSkill (Named EntityRecognition cognitive skill (v2)), this article helps you upgrade your skillset to use theMicrosoft.Skills.Text.V3.EntityRecognitionSkill which is generally available and introducesnew features.2021-04-30-PreviewMicrosoft.Skills.Text.EntityRecognitionSkillLast available api versionAugust 31, 2024Use Microsoft.\r\nSkills.Text.V3.EntityRecognitionSkill instead. It provides most of thefunctionality of the EntityRecognitionSkill at a higher quality. It also has richerinformation in its complex output fields.To migrate to the Microsoft.Skills.Text.V3.EntityRecognitionSkill, make one or more ofthe following changes to your skill definition.\r\nYou can update the skill definition usingthe Update Skillset API.1. (Required) Change the @odata.type from\u0022#Microsoft.Skills.Text.EntityRecognitionSkill\u0022 to\u0022#Microsoft.Skills.Text.V3.EntityRecognitionSkill\u0022.2. (Optional) The includeTypelessEntities parameter is no longer supported as thenew skill only returns entities with known types, so if your previous skill definitionreferenced it, it should now be removed.\r\n3. (Optional) If you\u0027re making use of the namedEntities output, there are a few minorchanges to the property names.a. value is renamed to textb. confidence is renamed to confidenceScoreIf you need to generate the exact same property names, add a ShaperSkill toreshape the output with the required names.\r\nFor example, this ShaperSkill renamesthe properties to their old values.JSONEnd of supportRecommendations{    \u0022@odata.type\u0022: \u0022#Microsoft.Skills.Util. ShaperSkill\u0022,    \u0022name\u0022: \u0022NamedEntitiesShaper\u0022,    \u0022description\u0022: \u0022NamedEntitiesShaper\u0022,    \u0022context\u0022: \u0022/document/namedEntitiesV3\u0022,    \u0022inputs\u0022: [        {            \u0022name\u0022: \u0022old_format\u0022,            \u0022sourceContext\u0022: \u0022/document/namedEntitiesV3/*\u0022,            \u0022inputs\u0022: [                {                    \u0022name\u0022: \u0022value\u0022,                    \u0022source\u0022: \u0022/document/namedEntitiesV3/*/text\u00224. (Optional) If you\u0027re making use of the entities output to link entities to well-known entities, this feature is now a new skill, theMicrosoft.\n"
}