{
  "Id": "672",
  "Title": "\u0022Upgrade Checklist for Azure AI Search REST API Versions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfVersionsChecklist for upgradeNext stepsIf you encounter problems, the best forum for posting questions is Stack Overflow. Ifyou find a bug, you can file an issue in the Azure .NET SDK GitHub repository. Makesure to label your issue title with search.Upgrade to the latest REST API in AzureAI SearchArticle•11/28/2023Use this article to migrate data plane calls to newer stable versions of the Search RESTAPI.\r\n2023-11-01 is the most recent stable version. Semantic ranking and vector searchsupport are generally available in this version.2023-10-01-preview is the most recent preview version. Integrated data chunkingand vectorization using the Text Split skill and Azure OpenAI Embedding skill areintroduced in this version. There\u0027s no migration guidance for preview API versions,but you can review code samples and walkthroughs for help with new features.Azure AI Search strives for backward compatibility. To upgrade and continue withexisting functionality, you can usually just change the API version number.\r\nConversely,situations calling for change codes include:Your code fails when unrecognized properties are returned in an API response. As abest practice, your application should ignore properties that it doesn\u0027t understand.Your code persists API requests and tries to resend them to the new API version.\r\nFor example, this might happen if your application persists continuation tokensreturned from the Search API (for more information, look for@search.nextPageParameters in the Search API Reference).Your code references an API version that predates 2019-05-06 and is subject toone or more of the breaking changes in that release. The section Upgrade to 2019-05-06 provides more detail. If any of these situations apply to you, change your code to maintain existingfunctionality. Otherwise, no changes should be necessary, although you might want to７ NoteAPI reference docs are now versioned. To get the right content, open a referencepage and then apply the version-specific filter located above the table of contents.\n"
}