{
  "Id": "663",
  "Title": "\u0022Upgrading to Azure.Search.Documents: What You Need to Know\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfAzure.Search to version 11, the newAzure.Search.Documents client library. Version 11 is a fully redesigned client library,released by the Azure SDK development team (previous versions were produced by theAzure Cognitive Search development team).All features from version 10 are implemented in version 11. Key differences include:One package (Azure.\r\nSearch.Documents) instead of fourThree clients instead of two: SearchClient, SearchIndexClient, SearchIndexerClientNaming differences across a range of APIs and small structural differences thatsimplify some tasksThe client library\u0027s Change Log has an itemized list of updates. You can review asummarized version in this article.\r\nAll C# code samples and snippets in the Cognitive Search product documentation havebeen revised to use the new Azure.Search.Documents client library.The benefits of upgrading are summarized as follows:New features are added to Azure.Search.Documents only. The previous version,Microsoft.Azure.Search, is now retired. Updates to deprecated libraries are limitedto high priority bug fixes only.Consistency with other Azure client libraries. Azure.Search.Documents takes adependency on Azure.Core and System.Text.Json, and follows conventionalapproaches for common tasks such as client connections and authorization.Microsoft.Azure.Search is officially retired.\r\nIf you\u0027re using an old version, werecommend upgrading to the next higher version, repeating the process in successionuntil you reach version 11 and Azure.Search.Documents. An incremental upgradestrategy makes it easier to find and fix blocking issues. See Previous version docs forguidance.Why upgrade?Version 11 consolidates and simplifies package management so that there are fewer tomanage.Version 10 and earlierVersion 11Microsoft.Azure.SearchMicrosoft.Azure.Search.ServiceMicrosoft.Azure.Search.DataMicrosoft.Azure.Search.CommonAzure.Search.Documents packageWhere applicable, the following table maps the client libraries between the two versions. Client operationsMicrosoft.Azure.Search (v10)Azure.Search.Documents (v11)Targets the documentscollection of an index(queries and data import)SearchIndexClientSearchClientTargets index-related objects(indexes, analyzers, synonymmapsSearchServiceClientSearchIndexClientTargets indexer-relatedobjects (indexers, datasources, skillsets)SearchServiceClientSearchIndexerClient (new)Besides the client differences (noted previously and thus omitted here), multiple otherAPIs have been renamed and in some cases redesigned.\n"
}