{
  "Id": "669",
  "Title": "\u0022Upgrading to Azure Search SDK 11: Best Practices Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe following example uses the system Uri class toprovide the endpoint and the Environment class to read in the key value:Before upgradingSteps to upgradeusing Azure;using Azure.Search.Documents;using Azure.Search.Documents.Indexes;using Azure.Search.Documents.Indexes.Models;using Azure.Search.Documents.Models;C#5. Add new client references for indexer-related objects.\r\nIf you\u0027re using indexers,datasources, or skillsets, change the client references to SearchIndexerClient. Thisclient is new in version 11 and has no antecedent.6. Revise collections and lists. In the new SDK, all lists are read-only to avoiddownstream issues if the list happens to contain null values. The code change is toadd items to a list.\r\nFor example, instead of assigning strings to a Select property,you would add them as follows:C#Select, Facets, SearchFields, SourceFields, ScoringParameters, and OrderBy are alllists that now need to be reconstructed.7. Update client references for queries and data import. Instances ofSearchIndexClient should be changed to SearchClient.\r\nTo avoid name confusion,make sure you catch all instances before proceeding to the next step.8. Update client references for index, synonym map, and analyzer objects. Instancesof SearchServiceClient should be changed to SearchIndexClient.9. For the remainder of your code, update classes, methods, and properties to usethe APIs of the new library. The naming differences section is a place to start butyou can also review the change log.Uri endpoint = new Uri(Environment.GetEnvironmentVariable(\u0022SEARCH_ENDPOINT\u0022));AzureKeyCredential credential = new AzureKeyCredential(   Environment.GetEnvironmentVariable(\u0022SEARCH_API_KEY\u0022));SearchIndexClient indexClient = new SearchIndexClient(endpoint, credential);var options = new SearchOptions {    SearchMode = SearchMode.All,    IncludeTotalCount = true }; // Select fields to return in results. options.Select.Add(\u0022HotelName\u0022); options.Select.Add(\u0022Description\u0022); options.Select.Add(\u0022Tags\u0022); options.Select.Add(\u0022Rooms\u0022); options.Select.Add(\u0022Rating\u0022); options.\n"
}