{
  "Id": "673",
  "Title": "\u0022Upgrading to Azure Search 2023: Breaking Changes and Migration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIf any of these situations apply to you, change your code to maintain existingfunctionality. Otherwise, no changes should be necessary, although you might want to７ NoteAPI reference docs are now versioned. To get the right content, open a referencepage and then apply the version-specific filter located above the table of contents.\r\nHow to upgradestart using features added in the new version.This version has breaking changes and behavioral differences for semantic ranking andvector search support.Semantic ranking no longer uses queryLanguage. It also requires asemanticConfiguration definition. If you\u0027re migrating from 2020-06-30-preview, asemantic configuration replaces searchFields.\r\nSee Migrate from preview versionfor steps.Vector search support was introduced in Create or Update Index (2023-07-01-preview). If you\u0027re migrating from that version, there are new options and severalbreaking changes. New options include vector filter mode, vector profiles, and anexhaustive K-nearest neighbors algorithm and query-time exhaustive k-NN flag.\r\nBreaking changes include renaming and restructuring the vector configuration inthe index, and vector query syntax.If you added vector support using 2023-10-01-preview, there are no breaking changes,but there\u0027s one behavior difference: the vectorFilterMode default changed frompostfilter to prefilter for filter expressions.\r\nThe default is prefilter for indexes createdafter 2023-10-01. Indexes created before that date only support postfilter, regardless ofhow you set the filter mode.Here are the steps for migrating from 2023-07-01-preview:1. Call Get Index to retrieve the existing definition.2. Modify the vector search configuration. This API introduces the concept of \u0022vectorprofiles\u0022 which bundles together vector-related configurations under one name. ItUpgrade to 2023-11-01 TipAzure portal supports a one-click upgrade path for 2023-07-01-preview indexes.The portal detects 2023-07-01-preview indexes and provides a Migrate button.Before selecting Migrate, select Edit JSON to review the updated schema first.\n"
}