{
  "Id": "818",
  "Title": "\u0022URL Encoding and Decoding Functions for Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfJSONThis function can be used to encode a string so that it is \u0022URL safe\u0022. When used with astring that contains characters that aren\u0027t allowed in a URL, this function will convertthose \u0022unsafe\u0022 characters into character-entity equivalents. This function uses the UTF-8encoding format.\r\nurlEncode function can be used as an alternative to the base64Encode function, if onlyURL unsafe characters are to be converted, while keeping other characters as-is.\r\n{     \u0022sourceFieldName\u0022 : \u0022PersonName\u0022,     \u0022targetFieldName\u0022 : \u0022LastName\u0022,     \u0022mappingFunction\u0022 : { \u0022name\u0022 : \u0022extractTokenAtPosition\u0022, \u0022parameters\u0022 : { \u0022delimiter\u0022 : \u0022 \u0022, \u0022position\u0022 : 1 } }   }] jsonArrayToStringCollection functionExample - populate collection from relational data\u0022fieldMappings\u0022 :\r\n[   {     \u0022sourceFieldName\u0022 : \u0022tags\u0022,      \u0022mappingFunction\u0022 : { \u0022name\u0022 : \u0022jsonArrayToStringCollection\u0022 }   }] urlEncode functionExample - document key lookupSay, the input string is \u003Chello\u003E - then the target field of type (Edm.\r\nString) will bepopulated with the value %3chello%3eWhen you retrieve the encoded key at search time, you can then use the urlDecodefunction to get the original key value, and use that to retrieve the source document.JSONThis function converts a URL-encoded string into a decoded string using UTF-8encoding format.Some Azure storage clients automatically URL-encode blob metadata if it contains non-ASCII characters. However, if you want to make such metadata searchable (as plain text),you can use the urlDecode function to turn the encoded data back into regular stringswhen populating your search index.\r\nJSONThis function converts a string of any length to a fixed-length string. \u0022fieldMappings\u0022 : [   {     \u0022sourceFieldName\u0022 : \u0022SourceKey\u0022,     \u0022targetFieldName\u0022 : \u0022IndexKey\u0022,     \u0022mappingFunction\u0022 : {       \u0022name\u0022 : \u0022urlEncode\u0022     }   }] urlDecode functionExample - decode blob metadata\u0022fieldMappings\u0022 : [  {    \u0022sourceFieldName\u0022 : \u0022UrlEncodedMetadata\u0022,    \u0022targetFieldName\u0022 :\n"
}