{
  "Id": "1179",
  "Title": "\u0022Using Azure Search REST API: Query Examples and Syntax\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfExample queries are articulated using the REST API and POST requests. You can pasteand run them in Postman or another web client.Request headers must have the following values:KeyValueContent-Typeapplication/jsonapi-key\u003Cyour-search-service-api-key\u003E, either query or admin keyURI parameters must include your search service endpoint with the index name, docscollections, search command, and API version, similar to the following example:HTTPRequest body should be formed as valid JSON:７ NoteAn alternative query syntax is Full Lucene, supporting more complex querystructures, such as fuzzy and wildcard search.\r\nFor more information and examples,see Use the full Lucene syntax.Hotels sample indexhttps://{{service-name}}.search.windows.net/indexes/hotels-sample-index/docs/search?api-version=2020-06-30 JSON\u0022search\u0022 set to * is an unspecified query, equivalent to null or empty search. It\u0027snot especially useful, but it\u0027s the simplest search you can do, and it shows allretrievable fields in the index, with all values.\r\n\u0022queryType\u0022 set to \u0022simple\u0022 is the default and can be omitted, but it\u0027s included tofurther reinforce that the query examples in this article are expressed in the simplesyntax.\u0022select\u0022 set to a comma-delimited list of fields is used for search resultcomposition, including just those fields that are useful in the context of searchresults. \u0022count\u0022 returns the number of documents matching the search criteria. On anempty search string, the count is all documents in the index (50 in the hotels-sample-index).Full text search can be any number of standalone terms or quote-enclosed phrases, withor without boolean operators.HTTPA keyword search that\u0027s composed of important terms or phrases tend to work best.String fields undergo text analysis during indexing and querying, dropping nonessentialwords like \u0022the\u0022, \u0022and\u0022, \u0022it\u0022. To see how a query string is tokenized in the index, pass thestring in an Analyze Text call to the index.\n"
}