{
  "Id": "922",
  "Title": "\u0022Using Azure Search REST APIs for Document Indexing Workflow\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIt uses the REST APIs to demonstrate a three-part workflowcommon to all indexers: create a data source, create an index, create an indexer. Dataextraction occurs when you submit the Create Indexer request.Azure Files, Transaction Optimized tier.An SMB file share providing the source content. NFS shares are not supported.Files containing text. If you have binary data, you can include AI enrichment forimage analysis.Read permissions on Azure Storage. A \u0022full access\u0022 connection string includes akey that grants access to the content, but if you\u0027re using Azure roles instead, makesure the search service managed identity has Data and Reader permissions.\r\nUse a REST client, such as Postman app, if you want to formulate REST callssimilar to the ones shown in this article.The Azure Files indexer can extract text from the following document formats:CSV (see Indexing CSV blobs)EML） ImportantAzure Files indexer is currently in public preview under Supplemental Terms ofUse. Use a preview REST API (2020-06-30-preview or later) to create the indexerdata source.\r\nPrerequisitesSupported document formatsEPUBGZHTMLJSON (see Indexing JSON blobs)KML (XML for geographic representations)Microsoft Office formats: DOCX/DOC/DOCM, XLSX/XLS/XLSM, PPTX/PPT/PPTM,MSG (Outlook emails), XML (both 2003 and 2006 WORD XML)Open Document formats:\r\nODT, ODS, ODPPDFPlain text files (see also Indexing plain text)RTFXMLZIPBy default, most files are indexed as a single search document in the index, includingfiles with structured content, such as JSON or CSV, which are indexed as a single chunkof text. A compound or embedded document (such as a ZIP archive, a Word document withembedded Outlook email containing attachments, or an .MSG file with attachments) isalso indexed as a single document. For example, all images extracted from theattachments of an .MSG file will be returned in the normalized_images field. If you haveimages, consider adding AI enrichment to get more search utility from that content.Textual content of a document is extracted into a string field named \u0022content\u0022.\n"
}