{
  "Id": "1260",
  "Title": "\u0022Using Azure Search API: Request Headers, URI Parameters, and Syntax\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can pasteand run them in Postman or another web client.Request headers must have the following values:KeyValueContent-Typeapplication/json７ NoteMany of the specialized query constructions enabled through the full Lucene querysyntax are not text-analyzed, which can be surprising if you expect stemming orlemmatization. Lexical analysis is only performed on complete terms (a term queryor phrase query). Query types with incomplete terms (prefix query, wildcard query,regex query, fuzzy query) are added directly to the query tree, bypassing theanalysis stage. The only transformation performed on partial query terms islowercasing.\r\nHotels sample indexKeyValueapi-key\u003Cyour-search-service-api-key\u003E, either query or admin keyURI parameters must include your search service endpoint with the index name, docscollections, search command, and API version, similar to the following example:HTTPRequest body should be formed as valid JSON:JSON\u0022search\u0022 set to * is an unspecified query, equivalent to null or empty search.\r\nIt\u0027snot especially useful, but it\u0027s the simplest search you can do, and it shows allretrievable fields in the index, with all values.\u0022queryType\u0022 set to \u0022full\u0022 invokes the full Lucene query parser and it\u0027s required forthis syntax.\u0022select\u0022 set to a comma-delimited list of fields is used for search resultcomposition, including just those fields that are useful in the context of searchresults. \u0022count\u0022 returns the number of documents matching the search criteria. On anempty search string, the count is all documents in the index (50 in the hotels-sample-index).Fielded search scope individual, embedded search expressions to a specific field. Thisexample searches for hotel names with the term \u0022hotel\u0022 in them, but not \u0022motel\u0022. Youcan specify multiple fields using AND.https://{{service-name}}.\n"
}