{
  "Id": "95",
  "Title": "\u0022Using Search Explorer: Azure AI Search Quickstart Guide\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNext stepsCreate a knowledge store using REST and PostmanQuickstart: Use Search explorer to runqueries in the Azure portalArticle•11/15/2023In this quickstart, learn how to use Search explorer, a built-in query tool in the Azureportal used for running queries against a search index in Azure AI Search. Use it to test aquery or filter expression, or confirm whether content exists in the index.This quickstart uses an existing index to demonstrate Search explorer.Before you begin, have the following prerequisites in place:An Azure account with an active subscription. Create an account for free.An Azure AI Search service.\r\nCreate a service or find an existing service underyour current subscription. You can use a free service for this quickstart.The realestate-us-sample-index is used for this quickstart. To create the index, usethe Import data wizard, choose the built-in sample data, and step through thewizard using all of the default values.1.\r\nIn the Azure portal, open the search overview page from the dashboard or findyour service.PrerequisitesStart Search explorer2. Open Search explorer from the command bar:Or use the embedded Search explorer tab on an open index:In Search explorer, POST requests are formulated internally using the Search REST API,with responses returned as verbose JSON documents.\r\nFor a first look at content, execute an empty search by clicking Search with no termsprovided. An empty search is useful as a first query because it returns entire documentsso that you can review document composition. On an empty search, there\u0027s no searchscore and documents are returned in arbitrary order (\u0022@search. score\u0022: 1 for alldocuments). By default, 50 documents are returned in a search request.Equivalent syntax for an empty search is * or search=*.HTTPResultsUnspecified querysearch=*Free-form queries, with or without operators, are useful for simulating user-definedqueries sent from a custom app to Azure AI Search.\n"
}