{
  "Id": "931",
  "Title": "\u0022Using REST Client for Azure Search Data Source Configuration\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUse a REST client, such as Postman app, if you want to formulate REST callssimilar to the ones shown in this article.The data source definition specifies the source data to index, credentials, and policies forchange detection. A data source is an independent resource that can be used bymultiple indexers.\r\n1. Create or update a data source to set its definition:HTTPPrerequisitesDefine the data source POST https://[service name].search.windows.net/datasources?api-version=2020-06-30   {      \u0022name\u0022: \u0022my-table-storage-ds\u0022,      \u0022description\u0022: null,      \u0022type\u0022: \u0022azuretable\u0022, 2. Set \u0022type\u0022 to \u0022azuretable\u0022 (required).3. Set \u0022credentials\u0022 to an Azure Storage connection string.\r\nThe next section describesthe supported formats.4. Set \u0022container\u0022 to the name of the table.5. Optionally, set \u0022query\u0022 to a filter on PartitionKey. Setting this property is a bestpractice that improves performance. If \u0022query\u0022 is null, the indexer executes a fulltable scan, which can result in poor performance if the tables are large.\r\nA data source definition can also include soft deletion policies, if you want the indexerto delete a search document when the source document is flagged for deletion.Indexers can connect to a table using the following connections.Full access storage account connection string{ \u0022connectionString\u0022 : \u0022DefaultEndpointsProtocol=https;AccountName=\u003Cyour storageaccount\u003E;AccountKey=\u003Cyour account key\u003E;\u0022 }You can get the connection string from the Storage account page in Azure portal by selectingAccess keys in the left navigation pane. Make sure to select a full connection string and not just akey.Managed identity connection string{ \u0022connectionString\u0022 : \u0022ResourceId=/subscriptions/\u003Cyour subscriptionID\u003E/resourceGroups/\u003Cyour resource groupname\u003E/providers/Microsoft.\nStorage/storageAccounts/\u003Cyour storage account name\u003E/;\u0022 }     \u0022subtype\u0022: null,      \u0022credentials\u0022: {         \u0022connectionString\u0022: \u0022DefaultEndpointsProtocol=https;\n"
}