{
  "Id": "84",
  "Title": "\u0022Utilizing Azure AI Services for Textual Content Indexing\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfYou can run the Import data wizard in the Azure portal to apply skills that create andtransform textual content during indexing. Input is your raw data, usually blobs in AzureStorage. Output is a searchable index containing AI-generated image text, captions, andentities. Generated content is queryable in the portal using Search explorer.To prepare, you create a few resources and upload sample files before running thewizard.Before you begin, have the following prerequisites in place:An Azure account with an active subscription.\r\nCreate an account for free.Azure AI Search. Create a service or find an existing service. You can use a freeservice for this quickstart.Azure Storage account with Blob Storage.In the following steps, set up a blob container in Azure Storage to store heterogeneouscontent files.Prerequisites７ NoteThis quickstart uses Azure AI services for the AI. Because the workload is sosmall, Azure AI services is tapped behind the scenes for free processing for up to 20transactions. You can complete this exercise without having to create an Azure AImulti-service resource.Set up your data1. Download sample data consisting of a small file set of different types.\r\nUnzip thefiles.2. Sign in to the Azure portal with your Azure account.3. Create an Azure Storage account or find an existing account.Choose the same region as Azure AI Search to avoid bandwidth charges.Choose the StorageV2 (general purpose V2).4. In Azure portal, open your Azure Storage page and create a container.\r\nYou can usethe default access level.5. In Container, select Upload to upload the sample files. Notice that you have a widerange of content types, including images and application files that aren\u0027t full textsearchable in their native formats.You\u0027re now ready to move on the Import data wizard.1. Sign in to the Azure portal with your Azure account.2. Find your search service and on the Overview page, select Import data on thecommand bar to create searchable content in four steps.1. In Connect to your data, choose Azure Blob Storage.Run the Import data wizardStep 1: Create a data source2. Choose an existing connection to the storage account and select the container youcreated.\n"
}