{
  "Id": "48",
  "Title": "\u0022Utilizing Textual and Vector Data in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTextual data is used for keyword search, semantic ranking, and capabilities thatdepend on text (filters, facets, and sorting).Vector data (text embeddings) is used for vector search. Currently, Azure AI Searchdoesn\u0027t generate vectors for you. For this quickstart, vector data was generatedseparately and copied into the \u0022Upload Documents\u0022 request and into the queryrequests.\r\nFor vector queries, we used the Generate Embedding request that calls Azure OpenAIand outputs embeddings for a search string. If you want to formulate your own vectorqueries against the sample data, provide your Azure OpenAI connection information inthe Postman collection variables. Your Azure OpenAI service must have a deployment ofan embedding model that\u0027s identical to the one used to generate embeddings in yoursearch corpus.For this quickstart, the following parameters were used:Model name: text-embedding-ada-002Model version: 2API version: 2023-08-01-preview.\r\nIf you\u0027re unfamiliar with Postman, see this quickstart for instructions on how to importcollections and set variables.1. Fork or clone the azure-search-postman-samples repository.2. Start Postman and import the AzureSearchQuickstartVectors 2023-11-01.postman_collection.json collection.3.\r\nRight-click the collection name and select Edit to set the collection\u0027s variables tovalid values for Azure AI Search and Azure OpenAI.７ NoteThis quickstart is for the generally available version of vector search. If you want totry integrated vectorization, currently in public preview, try this quickstart instead.About the sample data and queriesSet up your project4. Select Variables from the list of actions at the top of the page. Into Current value,provide the following values. Required and recommended values are specified.VariableCurrent valueindex-nameindex names are lower-case, no spaces, and can\u0027t start or end withdashessearch-service-namefrom Azure portal, get just the name of the service, not the full URLsearch-api-version2023-11-01search-api-keyprovide an admin keyopenai-api-keyoptional.\n"
}