{
  "Id": "1021",
  "Title": "\u0022Utilizing Azure AI Services for Text Enrichment and Storage\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfSkills can be utilitarian (like splittingtext), transformational (based on AI from Azure AI services), or custom skills thatyou provide. An example of a skills array is provided in the next section.cognitiveServices is used for billable skills that call Azure AI services APIs. Removethis section if you aren\u0027t using billable skills or Custom Entity Lookup. Attach aresource if you are.knowledgeStore (optional) specifies an Azure Storage account and settings forprojecting skillset output into tables, blobs, and files in Azure Storage. Remove thissection if you don\u0027t need it, otherwise specify a knowledge store.\r\nencryptionKey (optional) specifies an Azure Key Vault and customer-managed keysused to encrypt sensitive content (descriptions, connection strings, keys) in askillset definition. Remove this property if you aren\u0027t using customer-managedencryption.Inside the skillset definition, the skills array specifies which skills to execute. Three to fiveskills are common, but you can add as many skills as necessary, subject to service limits.(comments aren\u0027t allowed in JSON itself)\u0022,   \u0022skills\u0022:[          ],   \u0022cognitiveServices\u0022:{      \u0022@odata.type\u0022:\u0022#Microsoft.Azure.Search.\r\nCognitiveServicesByKey\u0022,      \u0022description\u0022:\u0022An Azure AI services resource in the same region as Azure Cognitive Search\u0022,      \u0022key\u0022:\u0022\u003CYour-Cognitive-Services-Multiservice-Key\u003E\u0022   },   \u0022knowledgeStore\u0022:{      \u0022storageConnectionString\u0022:\u0022\u003CYour-Azure-Storage-Connection-String\u003E\u0022,      \u0022projections\u0022:[         {            \u0022tables\u0022:[ ],            \u0022objects\u0022:[ ],            \u0022files\u0022:[ ]         }      ]    },    \u0022encryptionKey\u0022:{ }}Add skillsThe end result of an enrichment pipeline is textual content in either a search index or aknowledge store. For this reason, most skills either create text from images (OCR text,captions, tags), or analyze existing text to create new information (entities, key phrases,sentiment).\n"
}