{
  "Id": "285",
  "Title": "\u0022Utilizing Azure AI and .NET for Blob Search Enrichment\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfNET and AI to generatesearchable content from Azure blobsArticle•09/13/2023If you have unstructured text or images in Azure Blob Storage, an AI enrichment pipelinein Azure Cognitive Search can extract information and create new content for full-textsearch or knowledge mining scenarios.In this C# tutorial, you learn how to:If you don\u0027t have an Azure subscription, open a free account before you begin.This tutorial uses C# and the Azure.Search.\r\nDocuments client library to create a datasource, index, indexer, and skillset.The indexer connects to sample data in a blob container that\u0027s specified in the datasource object, and sends all enriched content to a search index.The skillset is attached to the indexer. It uses built-in skills from Microsoft to find andextract information.\r\nSteps in the pipeline include Optical Character Recognition (OCR)on images, language detection on text, key phrase extraction, and entity recognition(organizations). New information created by the pipeline is stored in new fields in anindex. Once the index is populated, you can use the fields in queries, facets, and filters.Visual StudioAzure.Search.Documents 11.\r\nx NuGet packageAzure StorageAzure Cognitive SearchSample dataSet up a development environment.＂Define a pipeline that uses OCR, language detection, entity recognition, and keyphrase extraction.＂Execute the pipeline to invoke transformations, and to create and load a searchindex.＂Explore results using full text search and a rich query syntax.\r\n＂OverviewPrerequisitesThe sample data consists of 14 files of mixed content type that you will upload to AzureBlob Storage in a later step.1. Get the files from azure-search-sample-data/ai-enrichment-mixed-media/ andcopy them to your local computer.2. Next, get the source code for this tutorial. Source code is in the tutorial-ai-enrichment/v11 folder in the azure-search-dotnet-samples repository.This tutorial uses Azure Cognitive Search for indexing and queries, Azure AI services onthe backend for AI enrichment, and Azure Blob Storage to provide the data. This tutorialstays under the free allocation of 20 transactions per indexer per day on Azure AIservices, so the only services you need to create are search and storage.\n"
}