{
  "Id": "99",
  "Title": "\u0022Utilizing Azure AI Search REST API with Postman\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfThe Search REST API isespecially helpful for learning and exploration.Next stepsCreate a basic query in PostmanQuickstart: Create an Azure AI Searchindex using REST APIsArticle•11/15/2023This article explains how to formulate requests interactively using the Azure AI SearchREST APIs and a REST client for sending and receiving requests.\r\nThe article uses the Postman app. You can download and import a Postman collectionif you prefer to use predefined requests.If you don\u0027t have an Azure subscription, create a free account before you begin.Postman app, used for sending requests to Azure AI Search.Create an Azure AI Search service or find an existing service under your currentsubscription.\r\nYou can use a free service for this quickstart.REST calls require the service URL and an access key on every request. A search service iscreated with both, so if you added Azure AI Search to your subscription, follow thesesteps to get the necessary information:1. Sign in to the Azure portal, and in your search service Overview page, get theURL.\r\nAn example endpoint might look like https://mydemo.search.windows.net.2. In Settings \u003E Keys, get an admin key for full rights on the service. There are twointerchangeable admin keys, provided for business continuity in case you need toroll one over. You can use either the primary or secondary key on requests foradding, modifying, and deleting objects.\r\nPrerequisitesCopy a key and URLAll requests require an api-key on every request sent to your service. Having a valid keyestablishes trust, on a per request basis, between the application sending the requestand the service that handles it.Connection information is specified in the URI endpoint. Collection variables are used torepresent the search service name and API keys. A typical URI in this quickstart looks likethis:HTTPNotice the HTTPS prefix, the name of the service (variable, the name of an object (in thiscase, the name of an index in the indexes collection), and the api-version. The api-version is a required.\n"
}