{
  "Id": "240",
  "Title": "\u0022Utilizing Azure Cognitive Search and SynapseML for AI Enrichment\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn this exercise, you\u0027ll use theAzureSearchWriter APIs for analysis and AI enrichment.Although Azure Cognitive Search has native AI enrichment, this tutorial shows you howto access AI capabilities outside of Cognitive Search. By using SynapseML instead ofindexers or skills, you\u0027re not subject to data limits or other constraints associated withthose objects.\r\nYou\u0027ll need the synapseml library and several Azure resources. If possible, use the samesubscription and region for your Azure resources and put everything into one resourcegroup for simple cleanup later. The following links are for portal installs. The sampledata is imported from a public site.\r\nSynapseML package Load various forms (invoices) into a data frame in an Apache Spark session＂Analyze them to determine their features＂Assemble the resulting output into a tabular data structure＂Write the output to a search index hosted in Azure Cognitive Search＂Explore and query over the content you created＂ TipWatch a short video of this demo at https://www.\r\nyoutube.com/watch?v=iXnBLwp7f88. The video expands on this tutorial with more steps and visuals.Prerequisites1Azure Cognitive Search (any tier) Azure AI services (any tier) Azure Databricks (any tier)  This link resolves to a tutorial for loading the package. You can use the free search tier to index the sample data, but choose a higher tier ifyour data volumes are large.\r\nFor non-free tiers, you\u0027ll need to provide the search API keyin the Set up dependencies step further on. This tutorial uses Azure AI Document Intelligence and Azure AI Translator. In theinstructions that follow, you\u0027ll provide a multi-service key and the region, and it will workfor both services. In this tutorial, Azure Databricks provides the Spark computing platform and theinstructions in the link will tell you how to set up the workspace. For this tutorial, weused the portal steps in \u0022Create a workspace\u0022.In this section, you\u0027ll create a cluster, install the synapseml library, and create a notebookto run the code.\n"
}