{
  "Id": "1144",
  "Title": "\u0022Utilizing Power BI and Azure AI Search for Full-Text Queries\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfFor a demonstration of using Power BI with a knowledge store, watch the followingvideo.Video introductionhttps://www.youtube-nocookie.com/embed/XWzLBP8iWqg?version=3Next stepsTables in Power BI reports and dashboardsCreate a full-text query in Azure AISearchArticle•11/16/2023If you\u0027re building a query for full text search, this article provides steps for setting up therequest.\r\nIt also introduces a query structure, and explains how field attributes andlinguistic analyzers can impact query outcomes.A search index with string fields attributed as searchable.Read permissions on the search index. For read access, include a query API key onthe request, or give the caller Search Index Data Reader permissions.\r\nIn Azure AI Search, a query is a read-only request against the docs collection of a singlesearch index, with parameters that both inform query execution and shape the responsecoming back.A full text query is specified in a search parameter and consists of terms, quote-enclosed phrases, and operators. Other parameters add more definition to the request.The following Search POST REST API call illustrates a query request using theaforementioned parameters.HTTPPrerequisitesExample of a full text query requestPOST https://[service name].search.windows. net/indexes/hotels-sample-index/docs/search?api-version=2023-11-01{    \u0022search\u0022: \u0022NY \u002Bview\u0022,    \u0022queryType\u0022: \u0022simple\u0022,    \u0022searchMode\u0022: \u0022all\u0022,    \u0022searchFields\u0022: \u0022HotelName, Description, Address/City, Address/StateProvince, Tags\u0022,    \u0022select\u0022: \u0022HotelName, Description, Address/City, Address/StateProvince, Tags\u0022,    \u0022top\u0022: \u002210\u0022,    \u0022count\u0022: \u0022true\u0022}Key points:search provides the match criteria, usually whole terms or phrases, with or withoutoperators.\n"
}