{
  "Id": "1638",
  "Title": "\u0022Utilizing search.score for Sorting in Azure AI Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfEven when youdo use $orderby, the relevance score is used to break ties by default. However,sometimes it\u0027s useful to use the relevance score as an initial sort criteria, and some othercriteria as the tie-breaker. The example in this article demonstrates using thesearch.score function for sorting.\r\nThe syntax for search.score in $orderby is search.score(). The function search.scoredoesn\u0027t take any parameters. It can be used with the asc or desc sort-order specifier,just like any other clause in the $orderby parameter. It can appear anywhere in the listof sort criteria.Sort hotels in descending order by search.score and rating, and then in ascendingorder by distance from the given coordinates so that between two hotels with identicalratings, the closest one is listed first:odata-filter-expr７ NoteThe relevance score is computed by the relevance ranking algorithm, and the rangevaries depending on which algorithm you use.\r\nFor more information, see Relevanceand scoring in Azure AI Search.SyntaxExample    search.score() desc,rating desc,geo.distance(location, geography\u0027POINT(-122.131577 47.\r\n678581)\u0027) ascNext stepsOData expression language overview for Azure AI SearchOData expression syntax reference for Azure AI SearchSearch Documents (Azure AI Search REST API)OData expression syntax reference forAzure AI SearchArticle•11/15/2023Azure AI Search uses OData expressions as parameters throughout the API. Mostcommonly, OData expressions are used for the $orderby and $filter parameters.These expressions can be complex, containing multiple clauses, functions, andoperators. However, even simple OData expressions like property paths are used inmany parts of the Azure AI Search REST API. For example, path expressions are used torefer to subfields of complex fields everywhere in the API, such as when listing subfieldsin a suggester, a scoring function, the $select parameter, or even fielded search inLucene queries.\n"
}