{
  "Id": "490",
  "Title": "\u0022Utilizing Azure Storage for Custom Skillset Output Management\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUse-cases for custom skillsStoring outputData storeRequiredLocationDescriptionknowledgestoreOptionalAzureStorageUsed for downstream apps like knowledge mining or datascience. A knowledge store is defined within a skillset. Itsdefinition determines whether your enriched documentsare projected as tables or objects (files or blobs) in AzureStorage.enrichmentcacheOptionalAzureStorageUsed for caching enrichments for reuse in subsequentskillset executions.\r\nThe cache stores imported,unprocessed content (cracked documents). It also storesthe enriched documents created during skillset execution.Caching is helpful if you\u0027re using image analysis or OCR,and you want to avoid the time and expense ofreprocessing image files.Indexes and knowledge stores are fully independent of each other. While you mustattach an index to satisfy indexer requirements, if your sole objective is a knowledgestore, you can ignore the index after it\u0027s populated.After you\u0027ve defined and loaded a search index or a knowledge store, you can exploreits data.Run queries to access the enriched content generated by the pipeline.\r\nThe index is likeany other you might create for Azure AI Search: you can supplement text analysis withcustom analyzers, invoke fuzzy search queries, add filters, or experiment with scoringprofiles to tune search relevance.In Azure Storage, a knowledge store can assume the following forms: a blob containerof JSON documents, a blob container of image objects, or tables in Table Storage. Youcan use Storage Explorer, Power BI, or any app that connects to Azure Storage to accessyour content.A blob container captures enriched documents in their entirety, which is useful ifyou\u0027re creating a feed into other processes. Exploring contentQuery a search indexUse data exploration tools on a knowledge storeA table is useful if you need slices of enriched documents, or if you want to includeor exclude specific parts of the output. For analysis in Power BI, tables are therecommended data source for data exploration and visualization in Power BI.Enrichment is available in regions that have Azure AI services.\n"
}