{
  "Id": "1623",
  "Title": "\u0022Utilizing OData Expressions for Hotel Room Filtering in Azure\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdftextMatch documents for hotels where at least one room has type \u0022Deluxe Room\u0022, wherethe string of the Rooms/Type field matches the filter exactly:textFilters in Azure AI SearchOData expression language overview for Azure AI SearchOData expression syntax reference for Azure AI SearchSearch Documents (Azure AI Search REST API)Rating ge 3 and Rating le 5geo.\r\ndistance(Location, geography\u0027POINT(-122.031577 47.578581)\u0027) lt 2.0LastRenovationDate ge 2015-01-01T00:00:00.000ZDetails/Sku ne nullRooms/any(room: room/Type eq \u0027Deluxe Room\u0027)Next stepsOData full-text search functions inAzure AI Search - search.ismatch andsearch.ismatchscoringArticle•11/15/2023Azure AI Search supports full-text search in the context of OData filter expressions viathe search.\r\nismatch and search.ismatchscoring functions. These functions allow you tocombine full-text search with strict Boolean filtering in ways that are not possible just byusing the top-level search parameter of the Search API.The following EBNF (Extended Backus-Naur Form) defines the grammar of thesearch.ismatch and search.ismatchscoring functions:An interactive syntax diagram is also available:７ NoteThe search. ismatch and search.ismatchscoring functions are only supported infilters in the Search API. They are not supported in the Suggest or AutocompleteAPIs.Syntaxsearch_is_match_call ::=    \u0027search.ismatch\u0027(\u0027scoring\u0027)?\u0027(\u0027 search_is_match_parameters \u0027)\u0027search_is_match_parameters ::=    string_literal(\u0027,\u0027 string_literal(\u0027,\u0027 query_type \u0027,\u0027 search_mode)?)?query_type ::= \u0022\u0027full\u0027\u0022 | \u0022\u0027simple\u0027\u0022search_mode ::= \u0022\u0027any\u0027\u0022 | \u0022\u0027all\u0027\u0022OData syntax diagram for Azure AI Search７ NoteThe search.\n"
}