{
  "Id": "1196",
  "Title": "\u0022Utilizing Language Libraries in Azure AI Search: Best Practices\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfTo recap how language libraries are used in Azure AI Search:Language analyzers can be invoked during indexing and query execution, and areeither Apache Lucene (for example, \u0022de.lucene\u0022) or Microsoft (\u0022de.microsoft).Language lexicons invoked during spell check are specified using one of thelanguage codes in the supported language table.\r\nIn a query request, the value assigned to queryLanguage applies to speller.While content in a search index can be composed in multiple languages, the query inputis most likely in one. The search engine doesn\u0027t check for compatibility ofqueryLanguage, language analyzer, and the language in which content is composed, sobe sure to scope queries accordingly to avoid producing incorrect results.Create a basic queryUse full Lucene query syntaxUse simple query syntax７ NoteLanguage consistency across various property values is only a concern if you areusing language analyzers.\r\nIf you are using language-agnostic analyzers (such askeyword, simple, standard, stop, whitespace, or standardasciifolding.lucene), thenthe queryLanguage value can be whatever you want.Next stepsFilters in text queriesArticle•10/31/2023A filter provides value-based criteria for including or excluding content before queryexecution.\r\nFor example, including or excluding documents based on dates, locations, orlanguage. Filters are specified on individual fields. A field definition must be attributedas \u0022filterable\u0022 if you want to use it in filter expressions.A filter is specified using OData filter expression syntax. In contrast with full text search,a filter succeeds only if the match is exact.\r\nFilters are foundational to several search experiences, including \u0022find near me\u0022geospatial search, faceted navigation, and security filters that show only thosedocuments a user is allowed to see. If you implement any one of these experiences, afilter is required. It\u0027s the filter attached to the search query that provides the geolocationcoordinates, the facet category selected by the user, or the security ID of the requestor.Common scenarios include:Slice search results based on content in the index. Given a schema with hotellocation, categories, and amenities, you might create a filter to explicitly match oncriteria (in Seattle, on the water, with a view).\n"
}