{
  "Id": "1662",
  "Title": "\u0022Utilizing Azure Cognitive Search REST APIs for Hotel Recommendations\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfExamplesSimple queryIn this example, the request searches for hotels similar to the one with HotelId 29.Rather than using HTTP GET, you can also invoke MoreLikeThis using HTTP POST:HTTPMoreLikeThis can be combined with other common query parameters like $filter. Forinstance, the query can be restricted to only hotels whose category is \u0027Budget\u0027 andwhere the rating is higher than 3.5:HTTPThe $top selector can be used to limit how many results should be returned in aMoreLikeThis query. Also, fields can be selected with $select.\r\nHere the top three hotelsare selected along with their ID, Name, and Rating:HTTPGET /indexes/hotels-sample-index/docs?moreLikeThis=29\u0026searchFields=Description\u0026api-version=2020-06-30-Preview POST /indexes/hotels-sample-index/docs/search?\r\napi-version=2020-06-30-Preview     {       \u0022moreLikeThis\u0022: \u002229\u0022,       \u0022searchFields\u0022: \u0022Description\u0022     } Apply filtersGET /indexes/hotels-sample-index/docs?moreLikeThis=20\u0026searchFields=Description\u0026$filter=(Category eq \u0027Budget\u0027 and Rating gt 3.\r\n5)\u0026api-version=2020-06-30-Preview Select fields and limit resultsGET /indexes/hotels-sample-index/docs?moreLikeThis=20\u0026searchFields=Description\u0026$filter=(Category eq \u0027Budget\u0027 and Rating gt 3.5)\u0026$top=3\u0026$select=HotelId,HotelName,Rating\u0026api-version=2020-06-30-Preview Next stepsYou can use any web testing tool to experiment with this feature. We recommend usingPostman for this exercise.Explore Azure Cognitive Search REST APIs using PostmanSkills for extra processing duringindexing (Azure AI Search)Article•11/15/2023This article describes the skills provided with Azure AI Search that you can include in askillset to access external processing.A skill provides an atomic operation that transforms content in some way. Often, it\u0027s anoperation that recognizes or extracts text, but it can also be a utility skill that reshapesthe enrichments that are already created. Typically, the output is text-based so that itcan be used in full text search or vectors used in vector search.\n"
}