{
  "Id": "1151",
  "Title": "\u0022Utilizing Vectorization in Azure Search: Best Practices and Tips\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfUpdate your query toprovide a text string to the vectorizer.All results are returned in plain text, including vectors in fields marked as retrievable.Because numeric vectors aren\u0027t useful in search results, choose other fields in the indexas a proxy for the vector match.\r\nFor example, if an index has \u0022descriptionVector\u0022 andQuery vector fields＂Filter a vector query＂Query multiple vector fields at once＂Query with integrated vectorization (preview)＂PrerequisitesTips\u0022descriptionText\u0022 fields, the query can match on \u0022descriptionVector\u0022 but the searchresult can show \u0022descriptionText\u0022. Use the select parameter to specify only human-readable fields in the results.\r\nIf you aren\u0027t sure whether your search index already has vector fields, look for:A non-empty vectorSearch property containing algorithms and other vector-related configurations embedded in the index schema.In the fields collection, look for fields of type Collection(Edm.Single) with adimensions attribute, and a vectorSearch section in the index.You can also send an empty query (search=*) against the index. If the vector field is\u0022retrievable\u0022, the response includes a vector field consisting of an array of floating pointvalues.This section applies to the generally available version of vector search (2023-11-01). To query a vector field, the query itself must be a vector. To convert a text query stringprovided by a user into a vector representation, your application must call anembedding library or API endpoint that provides this capability. Use the sameembedding that you used to generate embeddings in the source documents.You can find multiple instances of query string conversion in the azure-search-vectorrepository for each of the Azure SDKs.Here\u0027s a REST API example of a query string submitted to a deployment of an AzureOpenAI model:HTTPCheck your index for vector fieldsConvert query input into a vectorPOST https://{{openai-service-name}}.openai.azure.\n"
}