{
  "Id": "363",
  "Title": "\u0022Utilizing Search Explorer for Power Apps Schema Detection\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfIn Search Explorer, you should enter the sameparameters:   - {name: search, in: query, required: false, type: string, default: \u0027*\u0027}   - {name: $select, in: query, required: false, type: string, default: \u0027HotelName,Description,Address/City\u0027}   - {name: api-version, in: query, required:\r\ntrue, type: string, default: \u00272020-06-30\u0027,     x-ms-visibility: internal}   - {name: Content-Type, in: header, required: false, type: string} query as you did for the request, but add $top=2 to constrain results to just twodocuments: search=*\u0026$select=HotelName,Description,Address/City\u0026$top=2.\r\nPower Apps only needs a few results to detect the schema. You can copy thefollowing response into the wizard now, assuming you\u0027re using the hotels-sample-index.JSON17. Select Import to add the default response.{     \u0022@odata.context\u0022: \u0022https://mydemo.search.windows.net/indexes(\u0027hotels-sample-index\u0027)/$metadata#docs(*)\u0022,     \u0022value\u0022: [         {             \u0022@search.\r\nscore\u0022: 1,             \u0022HotelName\u0022: \u0022Arcadia Resort \u0026 Restaurant\u0022,             \u0022Description\u0022: \u0022The largest year-round resort in the area offering more of everything for your vacation – at the best value!  What can you enjoy while at the resort, aside from the mile-long sandy beaches of the lake? Check out our activities sure to excite both young and young-at-heart guests. We have it all, including being named “Property of the Year” and a “Top Ten Resort” by top publications.\u0022,             \u0022Address\u0022: {                 \u0022City\u0022: \u0022Seattle\u0022             }         },         {             \u0022@search.score\u0022: 1,             \u0022HotelName\u0022: \u0022Travel Resort\u0022,             \u0022Description\u0022: \u0022The Best Gaming Resort in the area.\n"
}