{
  "Id": "884",
  "Title": "\u0022Validating and Handling Language Inputs in Azure Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfVerify thatthedocumentsfrom thedata sourceprovide therequiredinputs.ReasonDetails/ExampleResolutionSkilllanguagecodeinput isinvalidSkill input languageCode has the following language codes X,Y,Z, at leastone of which is invalid.See moredetailsbelow.One or more of the values passed into the optional languageCode input of a downstreamskill isn\u0027t supported.\r\nThis can occur if you\u0027re passing the output of theLanguageDetectionSkill to subsequent skills, and the output consists of more languagesthan are supported in those downstream skills.Note that you may also get a warning similar to this one if an invalid countryHint inputgets passed to the LanguageDetectionSkill.\r\nIf that happens, validate that the field you\u0027reusing from your data source for that input contains valid ISO 3166-1 alpha-2 two lettercountry codes. If some are valid and some are invalid, continue with the followingguidance but replace languageCode with countryHint and defaultLanguageCode withdefaultCountryHint to match your use case.\r\nIf you know that your data set is all in one language, you should remove theLanguageDetectionSkill and the languageCode skill input and use thedefaultLanguageCode skill parameter for that skill instead, assuming the language issupported for that skill.\r\nIf you know that your data set contains multiple languages and thus you need theLanguageDetectionSkill and languageCode input, consider adding a ConditionalSkill tofilter out the text with languages that are not supported before passing in the text to thedownstream skill. Here\u0027s an example of what this might look like for theEntityRecognitionSkill:JSONWarning: Skill input \u0027languageCode\u0027 has thefollowing language codes \u0027X,Y,Z\u0027, at least oneof which is invalid.{    \u0022@odata.type\u0022: \u0022#Microsoft.\r\nSkills.Util. ConditionalSkill\u0022,    \u0022context\u0022: \u0022/document\u0022,    \u0022inputs\u0022: [        { \u0022name\u0022: \u0022condition\u0022, \u0022source\u0022: \u0022= $(/document/language) == \u0027de\u0027 || Here are some references for the currently supported languages for each of the skillsthat may produce this error message:\n"
}