{
  "Id": "63",
  "Title": "\u0022Valley Adventures: B\u0026B Packages and Nearby Attractions\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfHiking? Wine Tasting? Exploring the caverns?  It\u0027s all nearby and we have specially priced packages to help make our B\u0026B your home base for fun while visiting the valley.\u0022        },        {            \u0022@search.score\u0022: 0.03128054738044739,            \u0022HotelName\u0022: \u0022Triple Landscape Hotel\u0022,            \u0022Description\u0022: \u0022The Hotel stands out for its gastronomic excellence under the management of William Dough, who advises on and oversees all of the Hotel’s restaurant services.\u0022        },        {            \u0022@search.score\u0022: 0.\r\n03100961446762085,            \u0022HotelName\u0022: \u0022Twin Dome Hotel\u0022,            \u0022Description\u0022: \u0022The hotel is situated in a  nineteenth century plaza, which has been expanded and renovated to the highest architectural standards to create a modern, functional and first-class hotel in which art and unique historical elements coexist with the most modern comforts.\u0022        },        {            \u0022@search.\r\nscore\u0022: 0.03077651560306549,Because RRF merges results, it helps to review the inputs. The following results are fromjust the full text query. Top two results are Sublime Cliff Hotel and History Lion Resort,with Sublime Cliff Hotel having a much stronger BM25 relevance score.HTTPIn the vector-only query using HNSW for finding matches, Sublime Cliff Hotel drops toposition four.\r\nBut Historic Lion, which was second in full text search and third in vectorsearch, doesn\u0027t experience the same range of fluctuation and thus appears as a topmatch in a homogenized result set.HTTP            \u0022HotelName\u0022: \u0022Secret Point Hotel\u0022,            \u0022Description\u0022: \u0022The hotel is ideally located on the main commercial artery of the city in the heart of New York.\u0022        }    ]}        {            \u0022@search. score\u0022: 2.2626662,            \u0022HotelName\u0022: \u0022Sublime Cliff Hotel\u0022,            \u0022Description\u0022: \u0022Sublime Cliff Hotel is located in the heart of the historic center of Sublime in an extremely vibrant and lively area within short walking distance to the sites and landmarks of the city and is surrounded by the extraordinary beauty of churches, buildings, shops and monuments.\n"
}