{
  "Id": "1615",
  "Title": "\u0022Working with Azure AI Search: Filtering Collection Fields\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfInclude the Type and BaseRate subfields of each object in the Rooms collection:odata-filter-exprAn example result might look like this:JSONExamples    $select=HotelId, HotelName, Rating, Address/City{  \u0022HotelId\u0022: \u00221\u0022,  \u0022HotelName\u0022: \u0022Secret Point Motel\u0022,  \u0022Rating\u0022: 4,  \u0022Address\u0022: {    \u0022City\u0022: \u0022New York\u0022  }}    $select=HotelName, Address, Rooms/Type, Rooms/BaseRate{  \u0022HotelName\u0022: \u0022Secret Point Motel\u0022,  \u0022Rating\u0022:\r\n4,  \u0022Address\u0022: {    \u0022StreetAddress\u0022: \u0022677 5th Ave\u0022,    \u0022City\u0022: \u0022New York\u0022,    \u0022StateProvince\u0022: \u0022NY\u0022,    \u0022Country\u0022: \u0022USA\u0022,    \u0022PostalCode\u0022: \u002210022\u0022  },How to work with search results in Azure AI SearchOData expression language overview for Azure AI SearchOData expression syntax reference for Azure AI SearchSearch Documents (Azure AI Search REST API)  \u0022Rooms\u0022: [    {      \u0022Type\u0022: \u0022Budget Room\u0022,      \u0022BaseRate\u0022: 9.\r\n69    },    {      \u0022Type\u0022: \u0022Budget Room\u0022,      \u0022BaseRate\u0022: 8.09    }  ]}Next stepsOData collection operators in Azure AISearch - any and allArticle•11/15/2023When writing an OData filter expression to use with Azure AI Search, it\u0027s often useful tofilter on collection fields. You can achieve this using the any and all operators.The following EBNF (Extended Backus-Naur Form) defines the grammar of an ODataexpression that uses any or all.An interactive syntax diagram is also available:There are three forms of expression that filter collections. The first two iterate over a collection field, applying a predicate given in the formof a lambda expression to each element of the collection.An expression using all returns true if the predicate is true for every elementof the collection.An expression using any returns true if the predicate is true for at least oneelement of the collection.The third form of collection filter uses any without a lambda expression to testwhether a collection field is empty.\n"
}