{
  "Id": "473",
  "Title": "\u0022Working with Analyzers in Azure Cognitive Search\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdfmicrosoft\u0022,   \u0022indexAnalyzer\u0022: null,   \u0022searchAnalyzer\u0022: null },  \u0022fields\u0022: [ {   \u0022name\u0022: \u0022ProductGroup\u0022,   \u0022type\u0022: \u0022Edm.String\u0022,   \u0022retrievable\u0022: true,   \u0022searchable\u0022: true,   \u0022analyzer\u0022: null,   \u0022indexAnalyzer\u0022: \u0022keyword\u0022,   \u0022searchAnalyzer\u0022: \u0022standard\u0022 },When to add analyzersThe best time to add and assign analyzers is during active development, when droppingand recreating indexes is routine.\r\nBecause analyzers are used to tokenize terms, you should assign an analyzer when thefield is created. In fact, assigning an analyzer or indexAnalyzer to a field that has alreadybeen physically created isn\u0027t allowed (although you can change the searchAnalyzerproperty at any time with no impact to the index).To change the analyzer of an existing field, you\u0027ll have to drop and recreate the entireindex (you can\u0027t rebuild individual fields). For indexes in production, you can defer arebuild by creating a new field with the new analyzer assignment, and start using it inplace of the old one.\r\nUse Update Index to incorporate the new field andmergeOrUpload to populate it. Later, as part of planned index servicing, you can cleanup the index to remove obsolete fields.To add a new field to an existing index, call Update Index to add the field, andmergeOrUpload to populate it.\r\nTo add a custom analyzer to an existing index, pass the \u0022allowIndexDowntime\u0022 flag inUpdate Index if you want to avoid this error:\u0022Index update not allowed because it would cause downtime. In order to add newanalyzers, tokenizers, token filters, or character filters to an existing index,set the \u0027allowIndexDowntime\u0027 query parameter to \u0027true\u0027 in the index update request. Note that this operation will put your index offline for at least a few seconds,causing your indexing and query requests to fail. Performance and writeavailability of the index can be impaired for several minutes after the index isupdated, or longer for very large indexes.\u0022This section offers advice on how to work with analyzers.Azure Cognitive Search lets you specify different analyzers for indexing and searchthrough the \u0022indexAnalyzer\u0022 and \u0022searchAnalyzer\u0022 field properties. If unspecified, theanalyzer set with the analyzer property is used for both indexing and searching.\n"
}