{
  "Id": "320",
  "Title": "\u0022Working with Azure AI Search: Query Syntax and Filters\u0022",
  "Text": "C:\\Users\\adamh\\Downloads\\azure-search.pdf1. Select and then send the \u0022Check indexer status\u0022 request.2. Review the response to learn whether the indexer is running, or to view error andwarning information.Warnings are common in some scenarios and do not always indicate a problem. Forexample, if a blob container includes image files, and the pipeline doesn\u0027t handleimages, you\u0027ll get a warning stating that images were not processed.In this sample, there is a PNG file that contains no text. All five of the text-based skills(language detection, entity recognition of locations, organizations, people, and keyphrase extraction) fail to execute on this file.\r\nThe resulting notification shows up inexecution history.Now that you\u0027ve created an index that contains AI-generated content, call SearchDocuments to run some queries to see the results.Recall that we started with blob content, where the entire document is packaged into asingle content field. You can search this field and find matches to your queries.1. Open the \u0022Search\u0022 request and run it to get your first look at index content. Thisrequest is an empty search (\u0022search=*\u0022) so it will return content for each of the 14documents.\r\nThe $select parameter constrains results to the file name, the languagename, and one of the recognized entities.HTTP2. Revise the previous query to search for \u0022creating boundaryless opportunities\u0022. Thisphrase was obtained through OCR of an embedded image file in a PDF document.\r\nInclude \u0022highlight\u0022 to apply formatting on matching terms in densely populatedfields.HTTP5 - Search GET /indexes//{{index_name}}/docs?search=*\u0026$select=metadata_storage_name,language,organizations\u0026$count=true\u0026api-version=2020-06-303. For the next query, apply a filter. Recall that the language field and all entity fieldsare filterable. HTTPThese queries illustrate a few of the ways you can work with query syntax and filters onnew fields created by Azure AI Search. For more query examples, see Examples in SearchDocuments REST API, Simple syntax query examples, and Full Lucene query examples.During early stages of development, iteration over the design is common. You will mostlikely delete and rebuild the same objects frequently.If you use the portal for deletion, and delete the indexer first, the portal will prompt youto delete the associated objects.\n"
}